[
{
"subject": "Rajasthan History",
"topic": "1857 ki Kranti: Rajasthan mein Shuruat, Kendra aur Parinaam",
"question_en": "Which of the following was the main reason for the outbreak of the 1857 Revolt in Rajasthan?",
"question_hi": "1857 की क्रांति के फैलने का मुख्य कारण राजस्थान में क्या था?",
"A_en": "Introduction of the Enfield rifle", "A_hi": "एनफील्ड राइफल की शुरुआत",
"B_en": "Economic exploitation by the British", "B_hi": "ब्रिटिश द्वारा आर्थिक शोषण",
"C_en": "Social and cultural changes", "C_hi": "सामाजिक और सांस्कृतिक परिवर्तन",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The introduction of the Enfield rifle, economic exploitation by the British, and social and cultural changes were all factors that contributed to the outbreak of the 1857 Revolt in Rajasthan.",
"explanation_hi": "एनफील्ड राइफल की शुरुआत, ब्रिटिश द्वारा आर्थिक शोषण और सामाजिक और सांस्कृतिक परिवर्तन सभी कारक थे जिन्होंने राजस्थान में 1857 की क्रांति के फैलने में योगदान दिया।"
},
{
"subject": "Rajasthan History",
"topic": "1857 ki Kranti: Rajasthan mein Shuruat, Kendra aur Parinaam",
"question_en": "Who was the leader of the 1857 Revolt in Jhansi, which is now part of Rajasthan?",
"question_hi": "झांसी में 1857 की क्रांति का नेता कौन था, जो अब राजस्थान का हिस्सा है?",
"A_en": "Rani Lakshmibai", "A_hi": "रानी लक्ष्मीबाई",
"B_en": "Tantia Tope", "B_hi": "तांत्या टोपे",
"C_en": "Nana Saheb", "C_hi": "नाना साहब",
"D_en": "Mangal Pandey", "D_hi": "मंगल पांडे",
"answer": "A",
"explanation_en": "Rani Lakshmibai was the leader of the 1857 Revolt in Jhansi, which is now part of Rajasthan.",
"explanation_hi": "रानी लक्ष्मीबाई झांसी में 1857 की क्रांति की नेता थीं, जो अब राजस्थान का हिस्सा है।"
},
{
"subject": "Rajasthan History",
"topic": "1857 ki Kranti: Rajasthan mein Shuruat, Kendra aur Parinaam",
"question_en": "What was the outcome of the 1857 Revolt in Rajasthan?",
"question_hi": "राजस्थान में 1857 की क्रांति का परिणाम क्या था?",
"A_en": "The British were defeated and the Indian rulers were restored to power", "A_hi": "ब्रिटिश पराजित हुए और भारतीय शासकों को फिर से सत्ता में बहाल किया गया",
"B_en": "The British emerged victorious and the Indian rulers were deposed", "B_hi": "ब्रिटिश विजयी हुए और भारतीय शासकों को पदच्युत कर दिया गया",
"C_en": "The revolt was crushed and the British continued to rule India", "C_hi": "विद्रोह को कुचल दिया गया और ब्रिटिश ने भारत पर शासन जारी रखा",
"D_en": "The revolt led to the establishment of an independent Indian state", "D_hi": "विद्रोह के परिणामस्वरूप एक स्वतंत्र भारतीय राज्य की स्थापना हुई",
"answer": "C",
"explanation_en": "The 1857 Revolt in Rajasthan was ultimately crushed by the British, and they continued to rule India.",
"explanation_hi": "राजस्थान में 1857 की क्रांति को अंततः ब्रिटिश द्वारा कुचल दिया गया था, और उन्होंने भारत पर शासन जारी रखा।"
},
{
"subject": "Rajasthan History",
"topic": "1857 ki Kranti: Rajasthan mein Shuruat, Kendra aur Parinaam",
"question_en": "Which of the following kingdoms in Rajasthan actively participated in the 1857 Revolt?",
"question_hi": "राजस्थान में कौन से राज्य 1857 की क्रांति में सक्रिय रूप से भाग लिया?",
"A_en": "Jodhpur", "A_hi": "जोधपुर",
"B_en": "Jaipur", "B_hi": "जयपुर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Kota", "D_hi": "कोटा",
"answer": "A",
"explanation_en": "The kingdom of Jodhpur actively participated in the 1857 Revolt.",
"explanation_hi": "जोधपुर राज्य 1857 की क्रांति में सक्रिय रूप से भाग लिया था।"
},
{
"subject": "Rajasthan History",
"topic": "1857 ki Kranti: Rajasthan mein Shuruat, Kendra aur Parinaam",
"question_en": "What was the role of the Rajput princes in the 1857 Revolt in Rajasthan?",
"question_hi": "राजस्थान में 1857 की क्रांति में राजपूत राजाओं की भूमिका क्या थी?",
"A_en": "They actively supported the British", "A_hi": "वे ब्रिटिश का सक्रिय रूप से समर्थन करते थे",
"B_en": "They remained neutral", "B_hi": "वे तटस्थ रहे",
"C_en": "They actively participated in the revolt", "C_hi": "वे विद्रोह में सक्रिय रूप से भाग लिया",
"D_en": "They were divided in their support", "D_hi": "वे अपने समर्थन में विभाजित थे",
"answer": "D",
"explanation_en": "The Rajput princes in Rajasthan were divided in their support for the 1857 Revolt, with some actively participating and others remaining neutral or supporting the British.",
"explanation_hi": "राजस्थान में राजपूत राजाओं 1857 की क्रांति के लिए अपने समर्थन में विभाजित थे, जिनमें से कुछ सक्रिय रूप से भाग लिया और दूसरों ने तटस्थ या ब्रिटिश का समर्थन किया।"
},
{
"subject": "Rajasthan History",
"topic": "1857 ki Kranti: Rajasthan mein Shuruat, Kendra aur Parinaam",
"question_en": "What was the impact of the 1857 Revolt on the princely states of Rajasthan?",
"question_hi": "1857 की क्रांति का राजस्थान के रियासतों पर क्या प्रभाव पड़ा?",
"A_en": "The princely states were annexed by the British", "A_hi": "रियासतों को ब्रिटिश द्वारा कब्जे में ले लिया गया",
"B_en": "The princely states were granted independence", "B_hi": "रियासतों को स्वतंत्रता दी गई",
"C_en": "The princely states were allowed to maintain their autonomy", "C_hi": "रियासतों को अपनी स्वायत्तता बनाए रखने की अनुमति दी गई",
"D_en": "The princely states were forced to sign treaties with the British", "D_hi": "रियासतों को ब्रिटिश के साथ संधि पर हस्ताक्षर करने के लिए मजबूर किया गया",
"answer": "C",
"explanation_en": "The 1857 Revolt led to the princely states of Rajasthan being allowed to maintain their autonomy, but under British paramountcy.",
"explanation_hi": "1857 की क्रांति के परिणामस्वरूप राजस्थान की रियासतों को अपनी स्वायत्तता बनाए रखने की अनुमति दी गई, लेकिन ब्रिटिश सर्वोच्चता के तहत।"
},
{
"subject": "Rajasthan History",
"topic": "1857 ki Kranti: Rajasthan mein Shuruat, Kendra aur Parinaam",
"question_en": "Which of the following was a major consequence of the 1857 Revolt in Rajasthan?",
"question_hi": "राजस्थान में 1857 की क्रांति का एक प्रमुख परिणाम क्या था?",
"A_en": "The establishment of a new system of administration", "A_hi": "एक नई प्रशासनिक व्यवस्था की स्थापना",
"B_en": "The introduction of new economic policies", "B_hi": "नई आर्थिक नीतियों की शुरुआत",
"C_en": "The reorganization of the Indian Army", "C_hi": "भारतीय सेना का पुनर्गठन",
"D_en": "The execution of several Indian leaders", "D_hi": "कई भारतीय नेताओं को फांसी दी गई",
"answer": "D",
"explanation_en": "The 1857 Revolt in Rajasthan led to the execution of several Indian leaders who had participated in the revolt.",
"explanation_hi": "राजस्थान में 1857 की क्रांति के परिणामस्वरूप कई भारतीय नेताओं को फांसी दी गई जिन्होंने विद्रोह में भाग लिया था।"
},
{
"subject": "Rajasthan History",
"topic": "1857 ki Kranti: Rajasthan mein Shuruat, Kendra aur Parinaam",
"question_en": "What was the significance of the 1857 Revolt in Rajasthan?",
"question_hi": "राजस्थान में 1857 की क्रांति का क्या महत्व था?",
"A_en": "It marked the beginning of the Indian independence movement", "A_hi": "यह भारतीय स्वतंत्रता आंदोलन की शुरुआत का प्रतीक था",
"B_en": "It led to the establishment of British rule in India", "B_hi": "इसके परिणामस्वरूप भारत में ब्रिटिश शासन की स्थापना हुई",
"C_en": "It resulted in the modernization of the Indian Army", "C_hi": "इसके परिणामस्वरूप भारतीय सेना का आधुनिकीकरण हुआ",
"D_en": "It had no significant impact on Indian history", "D_hi": "इसका भारतीय इतिहास पर कोई महत्वपूर्ण प्रभाव नहीं पड़ा",
"answer": "A",
"explanation_en": "The 1857 Revolt in Rajasthan marked the beginning of the Indian independence movement, as it was the first major uprising against British rule in India.",
"explanation_hi": "राजस्थान में 1857 की क्रांति ने भारतीय स्वतंत्रता आंदोलन की शुरुआत का प्रतीक था, क्योंकि यह भारत में ब्रिटिश शासन के खिलाफ पहला बड़ा विद्रोह था।"
},
{
"subject": "Rajasthan History",
"topic": "1857 ki Kranti: Rajasthan mein Shuruat, Kendra aur Parinaam",
"question_en": "Who was the leader of the 1857 Revolt in Rajasthan?",
"question_hi": "राजस्थान में 1857 की क्रांति का नेता कौन था?",
"A_en": "Maharana Pratap", "A_hi": "महाराणा प्रताप",
"B_en": "Rani Lakshmibai", "B_hi": "रानी लक्ष्मीबाई",
"C_en": "Tantia Tope", "C_hi": "तांत्या टोपे",
"D_en": "Kunwar Singh", "D_hi": "कुंवर सिंह",
"answer": "C",
"explanation_en": "Tantia Tope was one of the main leaders of the 1857 Revolt in Rajasthan.",
"explanation_hi": "तांत्या टोपे राजस्थान में 1857 की क्रांति के मुख्य नेताओं में से एक थे।"
},
{
"subject": "Rajasthan History",
"topic": "1857 ki Kranti: Rajasthan mein Shuruat, Kendra aur Parinaam",
"question_en": "What was the role of the British East India Company in the 1857 Revolt in Rajasthan?",
"question_hi": "राजस्थान में 1857 की क्रांति में ब्रिटिश ईस्ट इंडिया कंपनी की भूमिका क्या थी?",
"A_en": "The company supported the Indian rebels", "A_hi": "कंपनी ने भारतीय विद्रोहियों का समर्थन किया",
"B_en": "The company remained neutral", "B_hi": "कंपनी तटस्थ रही",
"C_en": "The company suppressed the revolt", "C_hi": "कंपनी ने विद्रोह को दबा दिया",
"D_en": "The company was not involved in the revolt", "D_hi": "कंपनी विद्रोह में शामिल नहीं थी",
"answer": "C",
"explanation_en": "The British East India Company played a significant role in suppressing the 1857 Revolt in Rajasthan.",
"explanation_hi": "ब्रिटिश ईस्ट इंडिया कंपनी ने राजस्थान में 1857 की क्रांति को दबाने में एक महत्वपूर्ण भूमिका निभाई।"
}
]