[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which was the capital of Rajasthan during the Mewar dynasty?",
"question_hi": "मेवार विभाग के समय राजस्थान के राजधानी क्या था ?",
"A_en": "Amber", "A_hi": "अमरेड",
"B_en": "Udaipur", "B_hi": "उदयपुर",
"C_en": "Jodhpur", "C_hi": "जोधपुर",
"D_en": "Jaisalmer", "D_hi": "जयसालमर",
"answer": "B",
"explanation_en": "Udaipur was the capital of Rajasthan during the Mewar dynasty. The Mewar dynasty ruled over the region from the 11th century until 1949 when Udaipur was replaced by Jaipur as the capital.",
"explanation_hi": "मेवार विभाग के समय राजस्थान के राजधानी क्या था ?",
"A_en": "Amber", "A_hi": "अमरेड",
"B_en": "Udaipur", "B_hi": "उदयपुर",
"C_en": "Jodhpur", "C_hi": "जोधपुर",
"D_en": "Jaisalmer", "D_hi": "जयसालमर",
"answer": "B",
"explanation_en": "Udaipur was the capital of Rajasthan during the Mewar Dynasty. The Mewar Dynasty ruled over the region from the 11th century till 1949 when Udaipur was replaced by Jaipur as the capital.",
"explanation_hi": "मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समवेद के समय मेवार समय मेवार समय मेवार समय मेवार समय मेवार समय मेवार समेवार समय मेवार समय मेवार समय मेवार समेवार समय मेवार समेवार समेवार समेवार समेवार समेवार समेवार समय मेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार समेवार सम