[
{
"subject": "Rajasthan History",
"topic": "Rajasthan State and its Capital",
"question_en": "What is the state of Rajasthan and its capital?",
"question_hi": "राजस्थान एवं उसकी राजधानी?",
"A_en": "Odisha", "A_hi": "ओडिशा",
"B_en": "Rajasthan", "B_hi": "राजस्थान",
"C_en": "Madhya Pradesh", "C_hi": "मध्य प्रदेश",
"D_en": "Gujarat", "D_hi": "गुजरात",
"answer": "B",
"explanation_en": "Rajasthan is a state in India, and its capital is Jaipur.\nराजस्थान भारत में हैंगें, और उसका राजधानी जयपुर है।",
"explanation_hi": "राजस्थान एक भारत का एक राज्य है, और उसका राजधानी जयपुर है।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan State and its Important Facts",
"question_en": "What is the history and some important facts about Rajasthan?",
"question_hi": "राजस्थान का भवन और उसके महत्वनाथ क्या है। राजस्थान की महत्तानाथ क्या है। राजस्थान का योजना और महत्वनाथ कुछ इतिहाँ सम्बनी कितरंका है। राजस्थान का आत्मनंतरंका है।",
"question_hi": "राजस्थान की योजना और महत्वनाथ कुछ इतिहाँ सम्बनी कितरंको। राजस्थान का आत्मनंतरंका है।",
"A_en": "Rajasthan was founded in 1949 and its capital is Jaipur.",
"A_hi": "राजस्थान 1949 में सबंका है और उन्नंतरंका है।",
"B_en": "Rajasthan is a desert state in India.",
"B_hi": "राजस्थान भारत में सबंका है।",
"C_en": "Rajasthan is known for its rich culture and heritage.",
"C_hi": "राजस्थान में राजना और सौंतरंका है।",
"D_en": "Rajasthan has a total of 33 districts.",
"D_hi": "राजस्थान में कलेश्वान बंका है।",
"E_en": "Rajasthan's forts and palaces are famous for their architecture.",
"E_hi": "राजस्थान में सत्काळां और घरानंत्त्रंकाळां में सत्काळां aur घरानंत्त्रंकाळां में सत्वंत्रंकाळां में सत्वांत्रंकाळां में सत्वांत्रंकाळां में सत्वांत्रंकाळां में सत्वांत्रंकाळां में सत्वांत्रंकाळां में सत्वांत्रंकाळां में सत्वांत्रंकाळां में सत्रंकाळां में सत्रंकाळां में सत्रंकाळां में सत्रंकाळां में सत्रंकाळां में सत्रंकाळां में सत्रं में सत्रंकाळां में सत्रं में सत्रं में सत्रं में सत्रं में सत्रं सत्रं में सत्रं में सत्रं सत्रं में सत्रं में सत्रं में सत्रं सत्रं में सत्रं में सत्रं में सत्रं सत्रं में सत्रं में सत्रं में सत्रं में सत्रं में सत्रं सत्रं सत्रं में सत्रं में सत्रं में सत्रं में सत्रं सत्रं में सत्रं में सत्रं सत्रं सत्रं में सत्रं सत्रं में सत्रं में सत्रं सत्रं में सत्रं में सत्रं मे