[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built by Raja Rai Singh?",
"question_hi": "राजस्थान में राजा राय सिंह ने कौन सा मंगल बनाया है?",
"A_en": "Amber Fort", "A_hi": "अमेरिका फोट",
"B_en": "Meena Bazaar", "B_hi": "मेना बाजार",
"C_en": "Hawa Mahal", "C_hi": "हवा महाल",
"D_en": "Lalgarh Palace", "D_hi": "लालगढ़ पाली",
"answer": "D",
"explanation_en": "Lalgarh Palace was built by Raja Rai Singh. Raja Rai Singh was a general of Rajput ruler Maharaja Man Singh I and constructed this palace in the 17th century.",
"explanation_hi": "राजा राय सिंह ने लालगढ़ पाली बनाई। राजा राय सिंह एक Rajput माहाराय सिंह की एक सदर मैं सिंह ने बना।",
"question_en": "Which fort was built by Raja Rai Singh, a general of Maharaja Man Singh I? ",
"question_hi": "राजा राय सिंह की एक सदर मैं सिंह ने बना।",
"explanation_en": "Raja Rai Singh, a general of Maharaja Man Singh I, is known for building the Lalgarh Fort in the 17th century.",
"explanation_hi": "राजा राय सिंह एक सदर मैं सिंह ने बना।",
"question_en": "Who built Lalgarh Fort and when was it built?",
"question_hi": "जब लगर्हा पुलिस्तान के विभागी राय सिंह ने बना और उसके बनाने के वर्षों के मध्यम पर विभागी राय सिंह ने बना और उसके बनाने के वर्षों के मध्यम पर विभागी राय सिंह ने बना और उसके बनाने के वर्षों के मध्यम पर विभागी राय सिंह ने बना और उसके बनाने के वर्षों के मध्यम पर विभागी राय सिंह ने बना और उसके बनाने के वर्षों के मध्यम पर विभागी राय सिंह ने बना और उसके बनाने के वर्षों के मध्यम पर विभागी राय सिंह ने बना और उसके बनाने के वर्षों के मध्यम पर विभागी राय सिंह ने बना और उसके बनाने के वर्षों के मध्य पर विभागी राय सिंह ने बना और उसके बनाने के वर्षों के मध्य पर विभागय राय सिंह ने बनाने वर्षों के बनाने बने वर्षोों के बनाने बनने वर्षों के बने बने बने वर्षों बने बने बने बने बने वर्षोे बने बनने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने