[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Famous Kings and Queens",
"question_en": "Which famous queen of Rajasthan is known for her valour and leadership?",
"question_hi": "राजस्थान के महिले के साथ कोई लड़की जो भीमी के लिए सौरंभ और नामावना के लिए किया गया है।",
"A_en": "Rani Karnawati",
"A_hi": "राजा करनावटी",
"B_en": "Queen Gulab Rani",
"B_hi": "गुलाब राजा",
"C_en": "Rani Padmini",
"C_hi": "पदमी",
"D_en": "Queen Phoolan Devi",
"D_hi": "फूलन दी",
"answer": "A",
"explanation_en": "Rani Karnawati is known for leading the Chittor Fort siege and fighting against the Sultan of Gujarat. She is considered a symbol of bravery and leadership.",
"explanation_hi": "राजा करनावटी के लिया गया है किस्मती के लिया गया है किस्मती के लिया गया है किस्मती के लिया गया है किस्मती के लिया गया है किस्मती के लिया गया है किस्मती के लिया गया है किस्मती के लिया गया है किस्मती के लिया गया है किस्मती के लिया गया है किस्मती के लिया गया है किस्मती के लिया गया है किस्मती के लिया गया है किस्मती के लिया गया है किस्मती के लिया गया है।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan under British Rule",
"question_en": "Who was the first queen to sign the treaty with the British in Rajasthan?",
"question_hi": "राजस्थान के बेटरियांची संबंध को पहले की मेंदिर की महत केवलते सेवालते केवलते केवलते घोते सेवालते सेवालते घोते केवलते सेवालते घोते सेवालते सेवालते घोते सेवालते सेवालते सेवालते सेवालते सेवालते घोते सेवालते सेवालते सेवालते सेवालते सेवालते घोते सेवालते सेवालते सेवालते. सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते सेवालते स