<think>
Okay, let's start by understanding the user's request. They want 10 high-quality MCQs on Rajasthan History, specifically for exams like LDC, CET, RAS, SSC, and Railway. The questions need to be in both Hindi and English, following a strict JSON format. Each question should have options in both languages, an answer, and explanations.

First, I'll need to recall key topics in Rajasthan History. Topics could include ancient kingdoms, medieval history, Mughal influence, Rajput history, notable rulers, significant events, and historical sites. Since the difficulty level is for Rajasthan exams, the questions should be factual but not too obscure, testing knowledge of important aspects.

For each question, I need to ensure that the correct answer is clear and the options are plausible but incorrect. The explanations should be concise and explain why the correct answer is right. I'll also need to translate the questions and options accurately between Hindi and English, maintaining the same meaning.

Let me start brainstorming the first question. Maybe about the oldest known ruler of Rajasthan. The answer could be Rao Jodha, founder of Jodhpur. Then, options could include other Rajput rulers. Next, perhaps a question about the capital of the Maurya Empire in Rajasthan. Wait, Maurya Empire's capital was Pataliputra, but Rajasthan's ancient capital could be about Matsya Kingdom. Maybe Matsya was an ancient kingdom in Rajasthan, with Viratanagar as its capital.

Third question could be about the founder of Jaipur, which is Sawai Jai Singh II. The options might include other rulers. Then, the question about the historical name of Udaipur, which was Bhavani Khetra. Another question about the ruler who founded Chittorgarh Fort, which is Rana Hamir. 

Next, the question about the ruler associated with the construction of the Dilwara Temples in Mount Abu. That would be Kumarapala. Another question about the historical name of Bikaner, which was Khyber. The Mughal ruler who married a Rajput princess, like Akbar marrying Harka Devi. 

Then, the ruler known as "Rana Pratap Singh" and his significance in the Battle of Haldighati. Lastly, the ancient name of Pushkar, which is Brahma Pushkara. 

I need to check each fact for accuracy. For example, Rao Jodha is indeed the founder of Jodhpur. Sawai Jai Singh II founded Jaipur. Chittorgarh Fort's founder is Rana Hamir. Kumarapala is associated with Dilwara Temples. Bikaner's historical name is Khyber. Akbar married Harka Devi. Rana Pratap's significance is well-known. Pushkar's ancient name is Brahma Pushkar. 

Each explanation needs to be clear and link the answer to the correct historical context. Also, ensuring that the options are in both languages correctly. For example, "Dilwara Temples" in English becomes "डिलवाड़ा मंदिर" in Hindi. 

Once all the questions are drafted, I'll structure them into the required JSON format, making sure each field is correctly filled. Double-checking the answer letters (A, B, C, D) to avoid any mix-up. Finally, ensuring that the JSON syntax is correct without any extra text or formatting.
</think>

[
  {
    "subject": "Rajasthan History",
    "topic": "Ancient Rajasthan",
    "question_en": "Who was the founder of the city of Jodhpur?",
    "question_hi": "जोधपुर शहर के स्थापक कौन थे?",
    "A_en": "Rao Jodha", "A_hi": "राव जोधा",
    "B_en": "Raja Man Singh", "B_hi": "राजा मान सिंह",
    "C_en": "Raja Sawai Jai Singh", "C_hi": "राजा सवाई जय सिंह",
    "D_en": "Rana Sanga", "D_hi": "राणा संगा",
    "answer": "A",
    "explanation_en": "Rao Jodha established Jodhpur in 1459 CE and is considered the founder of the city.",
    "explanation_hi": "राव जोधा ने 1459 ई. में जोधपुर की स्थापना की और उन्हें शहर के स्थापक के रूप में जाना जाता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Medieval Rajasthan",
    "question_en": "Which ancient kingdom was located in present-day Rajasthan?",
    "question_hi": "वर्तमान राजस्थान में स्थित प्राचीन राज्य कौन-सा था?",
    "A_en": "Mewar", "A_hi": "मेवाड़",
    "B_en": "Matsya", "B_hi": "माट्स्य",
    "C_en": "Avanti", "C_hi": "अवंति",
    "D_en": "Vatsa", "D_hi": "वत्स",
    "answer": "B",
    "explanation_en": "The Matsya Kingdom was an ancient kingdom located in the region of present-day Rajasthan.",
    "explanation_hi": "माट्स्य राज्य प्राचीन काल में वर्तमान राजस्थान के क्षेत्र में स्थित था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Rajput Rulers",
    "question_en": "Who founded the city of Jaipur?",
    "question_hi": "जयपुर शहर के स्थापक कौन थे?",
    "A_en": "Raja Man Singh", "A_hi": "राजा मान सिंह",
    "B_en": "Raja Sawai Jai Singh II", "B_hi": "राजा सवाई जय सिंह द्वितीय",
    "C_en": "Rana Sanga", "C_hi": "राणा संगा",
    "D_en": "Rao Jodha", "D_hi": "राव जोधा",
    "answer": "B",
    "explanation_en": "Raja Sawai Jai Singh II founded Jaipur in 1727 CE as a planned city.",
    "explanation_hi": "राजा सवाई जय सिंह द्वितीय ने 1727 ई. में जयपुर की स्थापना योजनाबद्ध शहर के रूप में की।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Historical Sites",
    "question_en": "What was the ancient name of Udaipur?",
    "question_hi": "उदयपुर का प्राचीन नाम क्या था?",
    "A_en": "Chittorgarh", "A_hi": "चित्तौड़गढ़",
    "B_en": "Bhavani Khetra", "B_hi": "भवानी खेत्र",
    "C_en": "Jaisalmer", "C_hi": "जैसलमेर",
    "D_en": "Mandore", "D_hi": "मांडौर",
    "answer": "B",
    "explanation_en": "Udaipur is historically known as Bhavani Khetra, named after the goddess Bhavani.",
    "explanation_hi": "उदयपुर को प्राचीन काल में भवानी खेत्र के रूप में जाना जाता था, जोकि भगवानी देवी के नाम पर रखा गया था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Rajput Clans",
    "question_en": "Which ruler founded the Chittorgarh Fort?",
    "question_hi": "चित्तौड़गढ़ किला किस शासक द्वारा स्थापित किया गया था?",
    "A_en": "Rana Hamir", "A_hi": "राणा हमीर",
    "B_en": "Rana Sanga", "B_hi": "राणा संगा",
    "C_en": "Rao Jodha", "C_hi": "राव जोधा",
    "D_en": "Raja Man Singh", "D_hi": "राजा मान सिंह",
    "answer": "A",
    "explanation_en": "Rana Hamir, the ruler of Mewar, founded the Chittorgarh Fort in the 14th century.",
    "explanation_hi": "मेवाड़ के शासक राणा हमीर ने 14वीं शताब्दी में चित्तौड़गढ़ किला की स्थापना की।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Historical Figures",
    "question_en": "Which historical figure is associated with the construction of the Dilwara Temples in Mount Abu?",
    "question_hi": "माउंट आबू में डिलवाड़ा मंदिरों के निर्माण से कौन-सा ऐतिहासिक व्यक्ति जुड़ा हुआ है?",
    "A_en": "Kumarapala", "A_hi": "कुमारपाल",
    "B_en": "Rana Sanga", "B_hi": "राणा संगा",
    "C_en": "Raja Man Singh", "C_hi": "राजा मान सिंह",
    "D_en": "Rao Jodha", "D_hi": "राव जोधा",
    "answer": "A",
    "explanation_en": "Kumarapala, a Chaulukya king, is credited with rebuilding the Dilwara Temples in the 12th century.",
    "explanation_hi": "चौलुक्य राजा कुमारपाल ने 12वीं शताब्दी में डिलवाड़ा मंदिरों की पुनर्निर्माण के लिए जाना जाता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Rajput Marriages",
    "question_en": "What was the historical name of Bikaner?",
    "question_hi": "बीकानेर का ऐतिहासिक नाम क्या था?",
    "A_en": "Khyber", "A_hi": "खैबर",
    "B_en": "Mandore", "B_hi": "मांडौर",
    "C_en": "Jaisalmer", "C_hi": "जैसलमेर",
    "D_en": "Chittorgarh", "D_hi": "चित्तौड़गढ़",
    "answer": "A",
    "explanation_en": "Bikaner was historically known as Khyber, named after its founder Rao Bika."
    "explanation_hi": "बीकानेर को ऐतिहासिक रूप से खैबर के रूप में जाना जाता था, जिसे उसके स्थापक राव बीके के नाम पर रखा गया था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mughal Relations",
    "question_en": "Which Mughal ruler married a Rajput princess from Rajasthan?",
    "question_hi": "राजस्थान के एक राजपूत राजकुमारी के साथ कौन-सा मुगल शासक विवाह करता है?",
    "A_en": "Akbar", "A_hi": "अकबर",
    "B_en": "Humayun", "B_hi": "हुमायूँ",
    "C_en": "Shah Jahan", "C_hi": "शाहजहाँ",
    "D_en": "Jahangir", "D_hi": "जहाँगीर",
    "answer": "A",
    "explanation_en": "Emperor Akbar married Harka Devi, a Rajput princess from Bikaner, to strengthen Mughal-Rajput relations.",
    "explanation_hi": "मुगल बादशाह अकबर ने बीकानेर की राजपूत राजकुमारी हर्का देवी के साथ विवाह करके मुगल-राजपूत संबंधों को मजबूत किया।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Battle of Haldighati",
    "question_en": "Which ruler is known as 'Rana Pratap Singh' and is associated with the Battle of Haldighati?",
    "question_hi": "राणा प्रताप सिंह के रूप में जाने जाने वाले शासक और हल्दीघाटी के युद्ध से जुड़े व्यक्ति कौन थे?",
    "A_en": "Rana Sanga", "A_hi": "राणा संगा",
    "B_en": "Rana Pratap", "B_hi": "राणा प्रताप",
    "C_en": "Rao Jodha", "C_hi": "राव जोधा",
    "D_en": "Raja Man Singh", "D_hi": "राजा मान सिंह",
    "answer": "B",
    "explanation_en": "Rana Pratap is the most famous ruler of Mewar, known for his resistance against the Mughals in the Battle of Haldighati (1576).",
    "explanation_hi": "राणा प्रताप मेवाड़ के शासक हैं, जिन्हें हल्दीघाटी के युद्ध (1576) में मुगलों के खिलाफ प्रतिरोध के लिए जाना जाता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Ancient Temples",
    "question_en": "What was the ancient name of Pushkar?",
    "question_hi": "पुष्कर का प्राचीन नाम क्या था?",
    "A_en": "Brahma Pushkar", "A_hi": "ब्रह्मा पुष्कर",
    "B_en": "Chandrabhaga", "B_hi": "चंद्रभागा",
    "C_en": "Kushasthali", "C_hi": "कुशास्थलि",
    "D_en": "Avanti", "D_hi": "अवंति",
    "answer": "A",
    "explanation_en": "Pushkar is historically known as Brahma Pushkar, named after the Hindu god Brahma."
    "explanation_hi": "पुष्कर को प्राचीन काल में ब्रह्मा पुष्कर के रूप में जाना जाता था, जो हिंदू देवता ब्रह्मा के नाम पर रखा गया है।"
  }
]