[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "What is the name of the first capital of Rajasthan?",
"question_hi": "राजस्थान की पहली राजधानी क्या थी ?",
"A_en": "Amber Fort", "A_hi": "अमेरिका के तटीय है।",
"B_en": "Chitor", "B_hi": "चतुर",
"C_en": "Jaipur", "C_hi": "जापान",
"D_en": "Meerpur", "D_hi": "मीरपुर",
"answer": "B",
"explanation_en": "Amber Fort was the first capital of Rajasthan before Jaipur became the capital.\nIn Hindi, this means - Amber Fort राजस्थान की पहली राजधानी थी जबकि Jaipur में Jaipur बनी राजधानी बनी।",
"explanation_hi": ""
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who was the first Raja of Rajasthan?",
"question_hi": "राजस्थान के पहले राजा कौन थे ?",
"A_en": "Prithviraj Chauhan",
"A_hi": "प्रतीत्रेजा चौहान",
"B_en": "Rao Jodhaji",
"B_hi": "राओ जोधाजी",
"C_en": "Udai Singh II",
"C_hi": "उदयसिंग द्वाई",
"D_en": "Rao Kalyanji",
"D_hi": "राओ काल्यांग जी",
"answer": "B",
"explanation_en": "Udai Singh II was the first Mewar king who established the city of Udaipur as his capital.\nIn Hindi, it means - Udai Singh II खाई सिंग द्वाई एक मेयर राजा हैंग द्वाई खाई सिंग द्वाई एक मेयर राजा हैंग द्वाई खाई सिंग द्वाई एक मेयर राजा हैंग द्वाई खाई सिंग द्वाई एक मेयर राजा हैंग द्वाई खाई सिंग द्वाई एक मेयर राजा हैंग द्वाई खाई सिंग द्वाई एक मेयर राजा हैंग द्वाई खाई सिंग द्वाई एक मेयर राजा हैंग द्वाई खाई सिंग द्वाई एक मेयर राजा हैंग द्वाई खाई सिंग द्वाई एक मेयर राजा हैंग द्वाई खाई सिंग द्वाई एक मेयर राजा हैंग द्वाई खाई सिंग द्वाई एक मेयर राजा हैंग द्वाई खाई सिंग द्वाई एक मेयर राजा हैंग द्वाई खाई सिंग द्वाई एक मेयर राजा हैंग द्वाई खाई सिंग द्वाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक मेयर राजा हिंग द्वाई खाई एक म