[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which historical fort is located in Jodhpur?",
"question_hi": "जोधपुर में कौन सा अभिज्ञानी कठिनाइयाँ के मौसम में है।",
"A_en": "Meheraz Fort", "A_hi": "मीहराज कठिनाइयाँ",
"B_en": "Rajasthan Rastriya Kshetra Vigyan Kendra", "B_hi": "राजस्थान राष्ट्रीय क्षेत्रीय ज्ञान केंद्र",
"C_en": "Jaipur Rural Knowledge Center", "C_hi": "जैपूर कृष्णा ज्ञान केंद्र",
"D_en": "Jaswant Thada", "D_hi": "जसवैंट थाडा",
"answer": "B",
"explanation_en": "The Rajasthan Rastriya Kshetra Vigyan Kendra is a research and learning center related to the state of Rajasthan, while the other options are historical monuments.",
"explanation_hi": "राजस्थान राष्ट्रीय ज्ञान केंद्र एक राज्ञान केंद्र है, जिसे राजस्थान केंद्र एक भाग है, जिसे अन्याचार्यांकर्मा प्राकृति मैल के समान निवार्थ मानकर्मा प्राकृति मैल समान निवार्थ मानकर्मा प्राकृति मैल समान निवार्थ मानकर्मा प्राकृति मैल समान निवार्थ मानकर्मा प्राकृति मैल समान निवार्थ मानकर्मा प्राकृति मैल समान निवार्थ मानकर्मा प्राकृति मैल समान निवार्थ मानकर्मा प्राकृति मैल समान निवार्थ मानकर्मा प्राकृति मैल समान निवार्थ मानकर्मा प्राकृति मैल समान निवार्थ मानकर्मा प्राकृति मैल समान निवार्थ मानकर्मा प्राकृति मैल समान निवार्थ मानकर्मा प्राकृति मैल समान निवार्थ मानकर्मा प्राकृति मैल समान निवार्थ मानकर्मा प्राकृति मैल समान निवार्थ मान प्राकृति मैल समान निवार्थ मानिवार्थ मान पराकृति मान निवार्थ मान प्राकृति मान पराकृति मान पराकृति मान प्राकृति मान प्राकृति मान पराकृति मान पराकृति मान प्राकृति मान प्राकृति मान पराकृति मान प्राकृति मान प्राकृि मान पराकृति मान प्राकृति मान प्राकृति मान प्राकृि मान प्राकृि मान प्राकृि मान प्राकेि मान प्राकेि मान प्राकेि मान प्राकेि",
"answer": "पराकेि मान प्राकेि मान",
"explanation_en": "The explanation should be in English.",
"explanation_hi": "प्राकेि मान प्राकेि मान प्राकेि मान प्राकेि मान प्राकेि मान प्राकेि",
"explanation_hi": "प्राकेि मान प्राकेि मान प्राकेि मान प्राकेि",
"answer": "प्राकेि मान प्राकेि मान प्राेि मान",
"question_en": "प्राकेि मान प्राकेि मान प्राकेि मान",
"question_hi": "प्राकेि मान प्राकेि मान प्राक