[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Cities and Capitals",
"question_en": "Which city served as the capital of Rajasthan before Jaipur?",
"question_hi": "जो राजस्थान के पहले जापान में राजधानी के लिए एक शहर था।",
"A_en": "Amber", "A_hi": "अमेर",
"B_en": "Jhalawar", "B_hi": "झलावार",
"C_en": "Kota", "C_hi": "कोटा",
"D_en": "Alwar", "D_hi": "अलवार",
"answer": "D",
"explanation_en": "Alwar city served as the capital of Rajasthan before Jaipur. It was the capital from 1727 to 1733 when Jaipur was founded.",
"explanation_hi": "जापान में राजधानी के लिए एक शहर था- अलवार। अलवार 1727 से 1733 तक जापान के लिए राजधानी होते हैं एक शहर था। जापान में राजधानी के लिए थे।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Mughals",
"question_en": "Which Mughal emperor was the last to rule Rajasthan?",
"question_hi": "राजस्थान के मुगाल मांगों को सामूर्ति के अंतर्गण को राजस्थान में सरकार मुगाल मांगों को सामूर्ति के अंतर्गण को राजस्थान में सरकार मुगाल मांगों को इसको चित्तरंग के अंतर्गण को राजस्थान में सरकार मुगाल मांगों को इसको चित्तरंग के अंतर्गण को राजस्थान में सरकार मुगाल मांगों को इसको चित्तरंग के अंतर्गण को राजस्थान में सरकार मुगाल मांगों को इसको चित्तरंग के अंतर्गण को राजस्थान में सरकार मुगाल मांगों को इसको चित्तरंग के अंतर्गण को राजस्थान में सरकार मुगाल मांगों को इसको चित्तरंग के अंतर्गण को राजस्थान में सरकार मुगाल मांगों को इसको चित्तरंग के अंतर्गण को राजस्थान में सरकार मुगाल मांगों को इसको चित्तर्गण को राजस्त्रं सरकार मुगाल मांगं को इसको चित्रं राजस्रं सरकार मुगाल मांगं को इसको चित्रं राजस्रं सरकार मांगाल मांगं को इसको चित्रं राजसरं रार मांगाल मां को इसको चित्रं राजं रार मांगाल मां को इसको चित्रं रार मांगाल मां को इसको चित्रं रारं रार मांगाल मां को इसको चित्रं रार मांगाल मां को इसको इसको रार रार मां रार मां को इसको इसको रार रारं रार मां रारं रार मां चित्रं रार रार मां रार रार रार रार रार रार रार रार रार रार रार रार रार रार रार रार",
"question_en": "Which Mughal emperor ruled Rajasthan before Jodhpur's establishment?",
"question_hi": "जापार रार रार रार रार रार रार रार रार रार रार रार रार",
"A_en": "Aurangaz", "A_hi": "अरार रार रार रार रार रार रार रार रार रार रार रार रार रार",
"B_en": "Yazid