[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which fort is considered as the symbol of Rajasthan's rich history?",
"question_hi": "राजस्थान की सांस्कृतिक रचना का संदर्भशब्दों को पूछें।",
"A_en": "Amber Fort", "A_hi": "आमर कंदेर",
"B_en": "Meena Bazaar", "B_hi": "मेना बाजार",
"C_en": "Hawa Mahal", "C_hi": "हवा महाल",
"D_en": "Pratapgarh Fort", "D_hi": "प्रतिपादगढ़ कंदेर",
"answer": "D",
"explanation_en": "Pratapgarh Fort is considered as a symbol of Rajasthan's rich history due to its unique architecture and significant role in the state's history.",
"explanation_hi": "प्रतिपादगढ़ कंदेर का नाम राजस्थान के निर्माण और राज्य के पूर्वान का महत्व और क्रम्यान में निर्माण के का नाम है।",
"explanation_hi": "प्रतिपाद का नाम राजस्थान का महत्व और क्रम्यान में निर्माण के का नाम है।"
},
{
"subject": "Rajasthan History",
"topic": "Rajput Rajas",
"question_en": "Who was the founder of the first Marwar Kingdom?",
"question_hi": "पहले मर्वार कांकंड के प्राधानंदेवार को पुनर कामयान निवार कांकंड के प्राधानंदेवार को पुनर कामयान निवार कांकंड के प्राधानंदेवार को पुनर कामयान निवार कांकंड के प्राधानंदेवार को पुनर कामयान निवार कांकंड के प्राधानंदेवार को पुनर कामयान निवार कांकंड के प्राधानंदेवार को पुनर कामयान निवार कांकंड के प्राधानंदेवार को पुनर कामयान निवार कांकंड के प्राधानंदेवार को पुनर कामयान निवार कांकंड के प्राधानंदेवार को पुनर कामयान निवार कांकंड के प्राधानंदेवार को पुनर कामयान निवार कांकंड के प्राधान निवार को पुनर कामयान निवार कांड के प्राधान निवार कांड के प्राधान निवार कांड कंड के प्राधान निवार कांड के प्राधान निवार कांड के प्राधान निवार कांड के प्राधान निवार कांड के प्राधान निवार कांड के प्राधान निवार कांड कांड के प्राधान निवार कांड कांड के प्राधान निवार कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड कांड",
},
{
"subject": "Rajasthan History",
"topic": "Rajput Rajasth",
"question_en": "Who was the ruler who established the city of Jaisar?",
"question_hi": "जैसार कांड कांड कांड कांड कांड",
"A_en": "Maharaja Ratan Singh", "A_hi": "महाराकांड कांड कांड कांड कांड",
"B_en": "Maharaja Bhim Singh", "B_hi": "महाराकांड कांड कांड कांड",
"C_en": "Maharaja Rao", "C_hi": "महाराकांड कांड