[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "What is the origin of the name 'Rajasthan'?",
"question_hi": "राजस्थान की नाम का आधार क्या है?",
"A_en": "Rajput empire",
"A_hi": "राजपूत संघ",
"B_en": "Rajasthani culture",
"B_hi": "राजस्थानी कला",
"C_en": "Rajasthani language",
"C_hi": "राजस्थानी भाषा",
"D_en": "Rajasthan geography",
"D_hi": "राजस्थान मैंड़",
"answer": "D",
"explanation_en": "The origin of the name 'Rajasthan' is linked to its geographical location. The term 'Rajasthan' is derived from 'Rajasthan Mand', which means \"Land of Kings\" in Hindi. This name reflects the region's rich history and the presence of several kingdoms and rulers throughout its past.",
"explanation_hi": "राजस्थान की नाम का स्वरूप अर्थ कुल है, जिसमेंट 'Rajasthan Mand' को सीख करें, जिसमेंट की अर्थ इसमेंट \"राजस्थान मन्दे\" का संदेश है, जिसमेंट इसमेंट \"राजस्थान मन्दे\" मेंट के अर्थ है, जिसमेंट \"राजस्थान मन्दे\" का संदेश है, जिसमेंट \"राजस्थान मन्दे\" मेंट का अर्थ है, जिसमेंट \"राजस्थान मन्दे\" मेंट का अर्थ है, जिसमेंट \"राजस्थान मन्दे\" मेंट का अर्थ है, जिसमेंट \"राजस्थान मन्दे\" मेंट का अर्थ है, जिसमेंट \"राजस्थान मन्दे\" मेंट का अर्थ है, जिसमेंट \"राजस्थान मन्दे\" मेंट का अर्थ है, जिसमेंट \"राजस्थान मन्दे\" मेंट का अर्थ है, जिसमेंट \"राजस्थान मन्दे\" मेंट का अर्थ है, जिसमेंट \"राजस्थान मन्दे\" मेंट का अर्थ है, जिसमेंट \"राजस्थान मन्दे\" मेंट का अर्थ है, जिसमेंट \"राजस्थान मन्दे\" मेंट का अर्थ है, जिसमेंट \"राजस्थान मन्दे\" मेंट का अर्थ है, जिसमेंट \"राजस्थान मन्दे\" मेंट का अर्थ हीन मान मन्दे\" मेंट का अर्थ हीन मान मान मन्दे\" मेंट का अर्थ हीन मान मान मेंट का अर्थ हिन मान मान मेंट का अर्थ हीन मान मान मेंट का अर्थ हिन मान मान मंट का अर्थ हिन मान मान मान का अर्थ हिन मान मान मान का अर्थ हिन मान का अर्थ हिन मान का अर्थ हिन मान का अर्थ हिन मान का अर्थ हिन मान का अर्थ हिन मान का अर्थ हिन मान का अर्थ हिन मानیान का अर्थ हिन मान का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ हिन का अर्थ का अर्