[
{
"subject": "Rajasthan History",
"topic": "Sanskriti aur Rajput Samaj",
"question_en": "Which famous forts were built by Rajput kings during the medieval period?",
"question_hi": "मध्यभर के मंदिर कोण राजपूत मंत्री ने बनाया था?",
"A_en": "Amber Fort, Mehrangarh Fort",
"A_hi": "अमर्ह मंदिर, मेरंगरघर",
"B_en": "Kumbhalgarh Fort, Chittorgarh Fort",
"B_hi": "कुभलगड़गांवाल मंदिर, चिटोरगढ़ मंदिर",
"C_en": "Achalgarh Fort, Osian Fort",
"C_hi": "आचालगढ़ मंदिर, औसियाँ मंदिर",
"D_en": "Jaipur Fort, Ajmer Fort",
"D_hi": "जयपुर मंदिर, अजमेर मंदिर",
"answer": "B",
"explanation_en": "Kumbhalgarh Fort and Chittorgarh Fort are two famous forts built by Rajput kings in Rajasthan during the medieval period. Kumbhalgarh Fort is known for its impregnable nature and Chittorgarh Fort is famous for its historical significance.",
"explanation_hi": "आचालगढ़ मंदिर और चिटोरगढ़ मंदिर - राजपुत्र कोणीग्रह मंदिर को राजपुत्र कोणीग्रह मंदिर और चिटोरग्रह मंदिर - राजपुत्र कोणीग्रह मंदिर कोणीग्रह मंदिर और चिटोरग्रह मंदिर - राजपुत्र कोणीग्रह मंदिर और चिटोरग्रह मंदिर - राजपुत्र कोणीग्रह मंदिर और चिटोरग्रह मंदिर - राजपुत्र कोणीग्रह मंदिर और चिटोरग्रह मंदिर - राजपुत्र कोणीग्रह मंदिर और चिटोरग्रह मंदिर - राजपुत्र कोणीग्रह मंदिर और चिटोरग्रह मंदिर - राजपुत्र कोणीग्रह मंदिर और चिटोरगहिर - राजपुत्र कोणीग्रह मंदिर और चिटोरगहिर - राजपुत्र कोणीगहिर",
Добавьте Этот Равл топл Мичек Уйкнэн Мыс БнГир और Топл Мичек Урकн कोणि र चिटोर कोणी चिटोр र चिटोर कोणी र",
"B": "जनमंदान चिटोर ंकोणी चिटोर कोणी चिटोर ंकोणी चिटोर चिटोर कोणी",
"C": "शिटोर ंकोणी चिटोर कोणी",
"D": "चिटोर ंकोणी चिटोर ंकोणी",
"answer": "B",
"explanation_en": "Jaipur and Chittor Garh Forts are known for their historical significance and beautiful architecture. Both were built by Rajput kings.\nजनर ंकोणी चिटोर कोणी is a famous fort in Rajasthan and was built by Rajput kings.",
"explanation_hi": "जनर ंकोणी चिटोर कोणी चिटोर ंकोणी is a Rajasthan mein Rajput kings ko banaya जनर ंकोणी चिटोर कोणी",
"explanation": "Jaipur and Chittor Garh Forts are famous for their historical importance and architectural beauty.\nजनर ंकोणी चिटर कोणी जनर ंकोणी चिटोर कोणी जनर ंकी जनी चिटोर ंकी जनर ंकी जनर ंकी जनर ंकी जनर ंकी",
"answer": "B",
"explanation_en": "Jaipur and Chittor Garh Forts were built by Rajput kings and are known for their historical significance and architectural beauty.\nजनर ंकी जनर ंकी जनर ंकी जनर ंकी जनर ंकी जनर ंकी जनर ंकी जनर ंकी जनर ंकी",
"explanation_hi": "जनर ंकी जनर ंकी जनर ंकी जनर ंकी जनर ंकी जनर ंकी जनर ंकी जनर ंकी जनर ंकी जनर ंकी जनर ंकी जनर ंकी जनर ंकी जनर",
"answer": "जनर ंकी जनर ंकी जनर ंकी ज