[
{
"subject": "Rajasthan History",
"topic": "Ancient Rajasthan",
"question_en": "Which ancient Indian dynasty ruled over the region of present-day Rajasthan?",
"question_hi": "प्राचीन भारतीय राजवंश जिसने वर्तमान राजस्थान के क्षेत्र पर शासन किया?",
"A_en": "Mauryan Empire", "A_hi": "मौर्य साम्राज्य",
"B_en": "Gupta Empire", "B_hi": "गुप्त साम्राज्य",
"C_en": "Rajput Dynasty", "C_hi": "राजपूत वंश",
"D_en": "Mughal Empire", "D_hi": "मुगल साम्राज्य",
"answer": "A",
"explanation_en": "The Mauryan Empire, which was founded by Chandragupta Maurya, ruled over the region of present-day Rajasthan in ancient India.",
"explanation_hi": "मौर्य साम्राज्य, जिसकी स्थापना चंद्रगुप्त मौर्य ने की थी, प्राचीन भारत में वर्तमान राजस्थान के क्षेत्र पर शासन किया था।"
},
{
"subject": "Rajasthan History",
"topic": "Medieval Rajasthan",
"question_en": "Which Rajput king is known for his bravery and resistance against the Mughal Empire?",
"question_hi": "कौन सा राजपूत राजा मुगल साम्राज्य के खिलाफ अपनी वीरता और प्रतिरोध के लिए जाना जाता है?",
"A_en": "Rana Pratap", "A_hi": "राणा प्रताप",
"B_en": "Rana Sanga", "B_hi": "राणा सांगा",
"C_en": "Raja Man Singh", "C_hi": "राजा मान सिंह",
"D_en": "Raja Todarmal", "D_hi": "राजा तोडरमल",
"answer": "A",
"explanation_en": "Rana Pratap, the king of Mewar, is known for his bravery and resistance against the Mughal Empire, particularly in the Battle of Haldighati.",
"explanation_hi": "मेवाड़ के राजा राणा प्रताप मुगल साम्राज्य के खिलाफ अपनी वीरता और प्रतिरोध के लिए जाने जाते हैं, विशेष रूप से हल्दीघाटी की लड़ाई में।"
},
{
"subject": "Rajasthan History",
"topic": "Modern Rajasthan",
"question_en": "Which British officer played a significant role in the formation of the princely state of Rajasthan?",
"question_hi": "कौन सा ब्रिटिश अधिकारी राजस्थान के रियासती राज्य के गठन में महत्वपूर्ण भूमिका निभाई?",
"A_en": "Lord Curzon", "A_hi": "लॉर्ड कर्जन",
"B_en": "Lord Mountbatten", "B_hi": "लॉर्ड माउंटबेटन",
"C_en": "Sir George Abraham Grierson", "C_hi": "सर जॉर्ज अब्राहम ग्रियर्सन",
"D_en": "Sir Henry Lawrence", "D_hi": "सर हेनरी लॉरेंस",
"answer": "A",
"explanation_en": "Lord Curzon, the Viceroy of India, played a significant role in the formation of the princely state of Rajasthan through his policies and reforms.",
"explanation_hi": "भारत के वायसराय लॉर्ड कर्जन ने अपनी नीतियों और सुधारों के माध्यम से राजस्थान के रियासती राज्य के गठन में महत्वपूर्ण भूमिका निभाई।"
},
{
"subject": "Rajasthan History",
"topic": "Ancient Rajasthan",
"question_en": "Which ancient city was the capital of the Matsya Kingdom?",
"question_hi": "कौन सा प्राचीन शहर मात्स्य राज्य की राजधानी थी?",
"A_en": "Viratnagar", "A_hi": "विराटनगर",
"B_en": "Bairat", "B_hi": "बैरात",
"C_en": "Alwar", "C_hi": "अलवर",
"D_en": "Jaipur", "D_hi": "जयपुर",
"answer": "B",
"explanation_en": "Bairat, also known as Viratanagara, was the capital of the Matsya Kingdom, which was one of the sixteen Mahajanapadas in ancient India.",
"explanation_hi": "बैरात, जिसे विराटनगर भी कहा जाता है, मात्स्य राज्य की राजधानी थी, जो प्राचीन भारत में सोलह महाजनपदों में से एक था।"
},
{
"subject": "Rajasthan History",
"topic": "Medieval Rajasthan",
"question_en": "Which Rajput dynasty ruled over the kingdom of Marwar?",
"question_hi": "कौन सा राजपूत वंश मारवाड़ राज्य पर शासन किया?",
"A_en": "Rathore", "A_hi": "राठौर",
"B_en": "Kachwaha", "B_hi": "कचवाहा",
"C_en": "Sisodia", "C_hi": "सिसोदिया",
"D_en": "Bhati", "D_hi": "भाटी",
"answer": "A",
"explanation_en": "The Rathore dynasty, which was founded by Rao Jodha, ruled over the kingdom of Marwar, with its capital in Jodhpur.",
"explanation_hi": "राठौर वंश, जिसकी स्थापना राव जोधा ने की थी, मारवाड़ राज्य पर शासन किया, जिसकी राजधानी जोधपुर में थी।"
},
{
"subject": "Rajasthan History",
"topic": "Modern Rajasthan",
"question_en": "Which movement played a significant role in the integration of the princely states of Rajasthan?",
"question_hi": "कौन सा आंदोलन राजस्थान के रियासती राज्यों के एकीकरण में महत्वपूर्ण भूमिका निभाई?",
"A_en": "Praja Mandal Movement", "A_hi": "प्रजा मंडल आंदोलन",
"B_en": "Congress Movement", "B_hi": "कांग्रेस आंदोलन",
"C_en": "Socialist Movement", "C_hi": "सामाजिक आंदोलन",
"D_en": "Communist Movement", "D_hi": "कम्युनिस्ट आंदोलन",
"answer": "A",
"explanation_en": "The Praja Mandal Movement, which was led by various social and political leaders, played a significant role in the integration of the princely states of Rajasthan.",
"explanation_hi": "प्रजा मंडल आंदोलन, जिसका नेतृत्व विभिन्न सामाजिक और राजनीतिक नेताओं ने किया था, राजस्थान के रियासती राज्यों के एकीकरण में महत्वपूर्ण भूमिका निभाई।"
},
{
"subject": "Rajasthan History",
"topic": "Ancient Rajasthan",
"question_en": "Which ancient trade route passed through the region of present-day Rajasthan?",
"question_hi": "कौन सा प्राचीन व्यापार मार्ग वर्तमान राजस्थान के क्षेत्र से गुजरता था?",
"A_en": "Silk Road", "A_hi": "रेशम मार्ग",
"B_en": "Spice Route", "B_hi": "मसाला मार्ग",
"C_en": "Incense Road", "C_hi": "अगुरु मार्ग",
"D_en": "Dwarf Pass", "D_hi": "बौना दर्रा",
"answer": "A",
"explanation_en": "The Silk Road, which was a major trade route between India and China, passed through the region of present-day Rajasthan.",
"explanation_hi": "रेशम मार्ग, जो भारत और चीन के बीच एक प्रमुख व्यापार मार्ग था, वर्तमान राजस्थान के क्षेत्र से गुजरता था।"
},
{
"subject": "Rajasthan History",
"topic": "Medieval Rajasthan",
"question_en": "Which Rajput king is known for his patronage of art and architecture?",
"question_hi": "कौन सा राजपूत राजा कला और वास्तुकला के संरक्षण के लिए जाना जाता है?",
"A_en": "Rana Kumbha", "A_hi": "राणा कुंभा",
"B_en": "Rana Sanga", "B_hi": "राणा सांगा",
"C_en": "Raja Man Singh", "C_hi": "राजा मान सिंह",
"D_en": "Raja Todarmal", "D_hi": "राजा तोडरमल",
"answer": "A",
"explanation_en": "Rana Kumbha, the king of Mewar, is known for his patronage of art and architecture, particularly in the construction of the Kumbhalgarh Fort.",
"explanation_hi": "मेवाड़ के राजा राणा कुंभा, कला और वास्तुकला के संरक्षण के लिए जाने जाते हैं, विशेष रूप से कुंभलगढ़ किले के निर्माण में।"
},
{
"subject": "Rajasthan History",
"topic": "Modern Rajasthan",
"question_en": "Which organization played a significant role in the integration of the princely states of Rajasthan?",
"question_hi": "कौन सा संगठन राजस्थान के रियासती राज्यों के एकीकरण में महत्वपूर्ण भूमिका निभाई?",
"A_en": "Indian National Congress", "A_hi": "भारतीय राष्ट्रीय कांग्रेस",
"B_en": "Praja Mandal", "B_hi": "प्रजा मंडल",
"C_en": "Rajasthan Union", "C_hi": "राजस्थान संघ",
"D_en": "All India States Peoples Conference", "D_hi": "अखिल भारतीय रियासती प्रजा सम्मेलन",
"answer": "D",
"explanation_en": "The All India States Peoples Conference, which was founded by Jawaharlal Nehru, played a significant role in the integration of the princely states of Rajasthan.",
"explanation_hi": "अखिल भारतीय रियासती प्रजा सम्मेलन, जिसकी स्थापना जवाहरलाल नेहरू ने की थी, राजस्थान के रियासती राज्यों के एकीकरण में महत्वपूर्ण भूमिका निभाई।"
},
{
"subject": "Rajasthan History",
"topic": "Ancient Rajasthan",
"question_en": "Which ancient river is mentioned in the Rigveda as flowing through the region of present-day Rajasthan?",
"question_hi": "कौन सी प्राचीन नदी ऋग्वेद में वर्तमान राजस्थान के क्षेत्र से बहने वाली नदी के रूप में उल्लिखित है?",
"A_en": "Saraswati River", "A_hi": "सरस्वती नदी",
"B_en": "Ganges River", "B_hi": "गंगा नदी",
"C_en": "Yamuna River", "C_hi": "यमुना नदी",
"D_en": "Indus River", "D_hi": "सिंधु नदी",
"answer": "A",
"explanation_en": "The Saraswati River, which is mentioned in the Rigveda, is believed to have flowed through the region of present-day Rajasthan in ancient times.",
"explanation_hi": "सरस्वती नदी, जो ऋग्वेद में उल्लिखित है, प्राचीन काल में वर्तमान राजस्थान के क्षेत्र से बहने वाली नदी मानी जाती है।"
}
]