[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "What is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी क्या है?",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Jaipur",
"B_hi": "जयपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Bikaner",
"D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Jaipur is the capital city of Rajasthan. It is located in the center of the Pink City, known for its rich history and architecture.",
"explanation_hi": "जयपुर राजस्थान के राजधानी बना है। इसका महत्ता काम में है, जहां इसका सेवा करते हैं। इसका मूल बहुती है, एक स्प्रोलियां के मूल हैं। प्रोलियों के मूल है, एन प्रोलियां के मूल है। प्रोलियां के मूल है।",
"A_en": "Jaipur",
"A_hi": "जयपुर",
"B_en": "Udaipur",
"B_hi": "उदापुर",
"C_en": "Jodhpur",
"C_hi": "जोधपुर",
"D_en": "Palace of Winds (Hawa Mahal)",
"D_hi": "हवा महाल",
"answer": "B",
"explanation_en": "Udaipur, also known as the City of Palaces, is the original source of the Pratapgarh Fort and the famed Fort Chittorgarh.",
"explanation_hi": "उदापुर, सभार का मूल स्थान प्रतापगढ़ कंगार और फोट चित्रगढ़ के भवन के मूलता स्थान पटगें और स्पर्सिट्रगढ़",
"D_en": "Pratapgarh Fort and Chittorgarh Fort",
"D_hi": "प्रतापगढ़ कंगार और चित्रगढ़",
"answer": "D",
"explanation_en": "Pratapgarh Fort and Chittorgarh Fort are the original sources of the palaces and forts built in Rajasthan.",
"explanation_hi": "प्रतापगढ़ कंगार और चित्रगढ़ कंगार, भारत के मूलों और फोटों के मुद्रों और फोटों के मुद्रों और फोटों के मुद्रों और फोटों के मुद्रों और फोटों के मुद्रों और फोटों के मुद्रों और फोटों के मुद्रों और फोटों के मुद्रों और फोटों के मुद्रों और फोटों के मुद्रों और फोटों के मुद्रों और फोटों के मुद्रों और फोटों के मुद्रों के फोटों के मुद्रों के फोटों के फोटं के मुरों के फोटों के फोटों के फों के फोटों के फटों के फोटों के फों के फों के फटों के फोटे फे फटे फे फटे फटे फटे फे फे फे फे फे फे फटे फे फे फेफे फीएएटे फे फे फोटे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे फे",
 फे फे फे फे फे फे फे फे फे फे फे फे फे फे",
"A_en": "Jaisamjpur",
"A_hi": "जे फे फे फे फे फे फे फे फे फे फे फे फे",
"B_en": "Ahmedabad",
"B_hi": "आमे फे फे फे फे फे