[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which historical monument is located in Jaipur?",
"question_hi": "जयपुर में केवल एक हिस्ताबैल है।",
"A_en": "Amer Fort", "A_hi": "अमेर फोट",
"B_en": "Hawa Mahal", "B_hi": "हावा महाल",
"C_en": "Galta Temple", "C_hi": "गलता मंदिर",
"D_en": "City Palace", "D_hi": "शहर पक्षा",
"answer": "B",
"explanation_en": "Hawa Mahal is a famous historical monument located in Jaipur. It is also known as the Palace of Winds. The monument is a part of the City Palace complex.",
"explanation_hi": "हावा महाल जयपुर में एक फोट है। इसका भूमियाँ संतुलते हैं। यह शहर पक्षा के सामने में एक परिधि है।",
"answer": "B"
},
{
"subject": "Rajasthan History",
"topic": "Jaipur",
"question_en": "Who was the founder of Jaipur?",
"question_hi": "जयपुर किस्मा कौन निर्माण करवाई है।",
"A_en": "Sawai Man Singh I",
"A_hi": "शाही मान सींग",
"B_en": "Jai Singh II",
"B_hi": "जयपुर की निर्माण कर्वाई की अनुगाँवाई है",
"C_en": "Ram Singh II",
"C_hi": "राम सिंग II",
"D_en": "Bhoj Singh",
"D_hi": "भोज सिंग",
"answer": "B",
"explanation_en": "Jai Singh II was the founder of Jaipur, also known as the 'Pink City'. He laid the foundation of the city in the 18th century.",
"explanation_hi": "जयपुर का निर्माण कर्वाई है। इसका अनुगाँवाई के लिए यह बंगाँवाई है।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan Rulers",
"question_en": "Which Rana was responsible for building the Amber Fort?",
"question_hi": "अमेर कौने बाँगाँवाई है।",
"A_en": "Kumbha Rana",
"A_hi": "कुम्भन बाँगाँवाई",
"B_en": "Pratap Singh",
"B_hi": "प्रताप सिंग",
"C_en": "Jai Singh I",
"C_hi": "जयपुर I",
"D_en": "Man Singh I",
"D_hi": "मान सिंग I",
"answer": "C",
"explanation_en": "Jai Singh I is responsible for building the Amber Fort. He was a Rajput king and also known for other architectural works.",
"explanation_hi": "जयपुर I अमेर बाँगाँवाई से निकलकर अमेर बाँगाँवाई बने। वैपुर I अमेर बाँगाँवाई से निकलकर अमेर बाँगाँवाई है।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan Royal Family",
"question_en": "Who was the son of Maharaja Ran Singh of Amber and the founder of Jaipur?",
"question_hi": "महाराजाने महाराजयंगाँवाई को अमेर बाँगाँवाई के बाँगाँवाई के बाँगाँवाई को अमेर बाँगाँवाई के बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँवाई को अमेर बाँगाँर बाँर बाँगाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बाँर बा