[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous queen of Rajasthan was known for her bravery and strong leadership?",
"question_hi": "राजस्थान के प्रभावी और सरल नेतृत्व के लिए कौन सी राजधानी की प्रथमधिक अंकार जानती थी?",
"A_en": "Rani Karnawati", "A_hi": "राजानंद",
"B_en": "Pratap Singh", "B_hi": "प्रताप सिंह",
"C_en": "Rani Mahendra Pratap", "C_hi": "राजानंद मेहनता",
"D_en": "Rani Padmini", "D_hi": "राजानंद",
"answer": "C",
"explanation_en": "Rani Mahendra Pratap was a famous queen of Rajasthan and known for her bravery and strong leadership. She is often referred to as Rani Mahendra Pratap or Rani Mahendra Patani.",
"explanation_hi": "राजानंद मेहन्ता राजस्थान के फ़िता राजानंद",
},
{
"subject": "Rajasthan History",
"topic": "Famous Kings and Queens",
"question_en": "Which Mughal emperor established the city of Jaipur?",
"question_hi": "जयपुर को कौन स्थान करवाई करवाई होंकों के परिवाद से क्षम घराणी सिंहाँ",
"A_en": "Mohammed Shah", "A_hi": "मोहमदशाह",
"B_en": "Alauddin Khalji", "B_hi": "अलाउद्दी खल्जी",
"C_en": "Mughal Emperor Akbar", "C_hi": "मुगल ओकर",
"D_en": "Aurangzeb", "D_hi": "एरनगजी",
"answer": "C",
"explanation_en": "Akbar, the Mughal Emperor, established the city of Jaipur. He was known for his strategic importance and cultural influence in Rajasthan.",
"explanation_hi": "मुगल ओकर, जापुर को सिंग की सीतावाद सबसीतावाद बॉबी",
},
{
"subject": "Rajasthan Culture",
"topic": "Traditional Dance",
"question_en": "Which traditional dance form is popular in Rajasthan?",
"question_hi": "राजस्तान का सांग कालेन कौममान वाली",
"A_en": "Ghoomar", "A_hi": "गोमार",
"B_en": "Grand Thikana", "B_hi": "ग्रांड थिकाना",
"C_en": "Jaipur Dance", "C_hi": "जापुर डान्स",
"D_en": "Chhori Rangmani", "D_hi": "चोरी रंगमानी",
"answer": "B",
"explanation_en": "Grand Thikana is a traditional dance form popular in Rajasthan. It is a folk dance performed by women as a part of cultural events.",
"explanation_hi": "Grand थिकाना राजस्तान के तथिकांका राजस्तान के तथिकांका राजस्तान के तथिकांका राजस्तान के तथिकांका राजस्तान के तथिकांका राजस्तान के तथिकांका राजस्तान के तथिकांका राजस्तान के तथिकांका राजस्तान के तथिकांका राजस्तान के तथिकांका राजस्तान के तथिकांका राजस्तान के तथिकांका राजस्तान के तथिकांका राजस्तान के तथिकांकांका राजस्तान के तथिकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकांकां