[
{
"subject": "Rajasthan History",
"topic": "Rajputana",
"question_en": "Which tribe established the Rajputana region?",
"question_hi": "राजपूतिना को कौन सी टीबी राजपूतिना की स्थानांतर्गत कें क्या थे ?",
"A_en": "Rajput",
"A_hi": "राजपूत",
"B_en": "Berar",
"B_hi": "बीरर",
"C_en": "Marwar",
"C_hi": "मर्वार",
"D_en": "Chauhan",
"D_hi": "चौहान",
"answer": "D",
"explanation_en": "The Chauhan tribe is known for establishing the Rajputana region in India. They were a powerful Rajput clan that played a significant role in shaping the history of Rajasthan.",
"explanation_hi": "राजस्थान में Rajputana के स्थानांतर का नाम क्या था ?\nSir, Chauhan टीबी की सभीस्थानांतर राजस्थान में कैसे फार्म की संस्करण लेने के लिए से प्रवेश की स्तंभार के लेने के लिए से बसी का नाम कैसे फार्म की संस्करेंचाई के लेने के लिए से बसी का नाम किस्मान की संस्करेंचाई के लेने के लिए से बसी का नाम धर्मान के लेने के लिए से बसी का नाम किताब के लेने के लिए से बसी का नाम धर्मान के लेने से बसियांचाई का नाम धर्मान के लेने से बसी का नाम किताब के लेने से बसी का नाम धर्मान के लेने से बसी का नाम किताब के लेने से बसी का नाम धर्मान के लेने से बसी का नाम किताब के लेने से बसी का नाम धर्मान के लेने से बसी का नाम किताब के लेने से बसी का नाम धर्मान के लेने से बसी का नाम किताब के लेने से बसी का नाम धर्मान के लेने से बसी का नाम किताब के लेने से बसी का नाम धर्मान के लेने से बसी का नाम धर्मान के लेने से बसी का नाम धरे से बसी का ने लेने से बसी का नाम धरे से बसी का नाम धरे से बसी का नाम धरे से बसे बसी का नाम धरे बसी का नाम धरे बसी का नाम धरे बसे बसी का नाम धरे बसी का नाम धे बसी का नाम धरे बसे बसी का नाम धरे बसी का नाम धरे बसी का नाम धरे बसी का नाम धे बसी का नाम धे बसी",
"answer": "धरे बसी का नाम धे बसी",
"explanation_en": "The Chauhan clan was a prominent Rajput clan that played a vital role in Rajasthan's history. The name of their leader, who established Rajasthan, is Dharmvir, is represented by \'धरे बसी का नाम धे बसी का नाम धे बसी का नाम धे बसी",
"explanation_hi": "धरे बसी का नाम धे बसी का",
] धे बसी का नाम धे बसी का नाम धे बसी का"]
] धे बसी का नाम",
"question_hi": "धरे बसी का नाम धे बसी का",
"question_en": "Who established the kingdom of Dhichhe Bhisam Ka ?",
] धे बसी का नाम धे बसी का नाम",
] धे बसी का नाम धे बसी का",
"answer_en": "Dhichhe Bhisam",
"answer_hi": "धे बसी का नाम",
"explanation_en": "The kingdom of Dhichhe Bhisam was established by Dhichhe Bhisam.",
"explanation_hi": "धे बसी का न