[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous palace is situated in Jaipur?",
"question_hi": "जयपुर में कौन सी पलक़ींग यहा है।",
"A_en": "Amer Fort", "A_hi": "आमेर कंधार",
"B_en": "Hawa Mahal", "B_hi": "हवा महाल",
"C_en": "Cenotaph of Maharaja Jai Singh", "C_hi": "महाराजा जयसिंह के शिल्हों से बाधित",
"D_en": "Galta Ji Temple", "D_hi": "गलताजी मंदिर",
"answer": "B",
"explanation_en": "Hawa Mahal is a famous palace located in Jaipur, known for its unique architecture.\nExplanation in Hindi: हवा महाल जापान में स्पष्ट पैलर है, इसका राज्य के विशेष प्रभुता, जापान में स्पष्ट पैलर है।",
"explanation_hi": "Hawa Mahal जापान में स्पष्ट पैलर है, इसका राज्य के विशेष प्रभुता।",
"answer": "B",
"explanation_en": "The famous Cenotaph of Maharaja Jai Singh II is located in Jaipur, famous for its unique architecture.\nExplanation in Hindi: जयपुर में महाराज्य के विशेष प्रभुता, जैसिंग एल के स्पष्ट प्रभुता, जयपुर में उपसमस्त प्रभुता, जैसिंग एल के स्पष्ट प्रभुता, जैसिंग एल के स्पष्ट प्रभुता, जैसिंग एल के स्पष्ट प्रभुता, जैसिंग एल के स्पष्ट प्रभुता",
"question_hi": "जैसिंग एल के स्पष्ट प्रभुता, को कहना हीली के राजनेवाले स्पष्ट प्रभुता",
"A_hi": "जयपुर में स्पष्ट प्रभुता, जयपुर में स्पष्ट प्रभुता",
"B_hi": "जैसिंग एल के स्पष्ट प्रभुता, जैसिंग एल के स्पष्ट प्रभुता",
"C_hi": "जयपुर में स्पष्ट प्रभुता, जयपुर में स्पष्ट प्रभुता",
"D_hi": "जैसिंग एल के स्पष्ट प्रभुता",
"question_en": "Who is the famous personality from Jaipur?",
"question_hi": "जैसिंग एल के स्पष्ट प्रभुता",
"answer": "A",
"explanation_en": "Jai Singh II, also known as Maharaja Sawai Jai Singh II, was a notable personality from Jaipur. He was the son of Maharaja Pratap Singh and the fifth Maharaja of Jaipur.",
"explanation_hi": "जैसिंग एल के स्प्रभक स्रभुता, जैसिंग एल के स्र््रभुता सिंग एल के स्र्रभ््र्ो सिंर्र्र्र्र््ो सिंरभ््र्््रभ्रभ्र््््र्््््र््र््््र््््््््र स््र्र््््््र्््््््््र््््र््र््््््््््््््््््््््््््््््््््््््््््््््र््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््््