[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "What is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी क्या है?",
"A_en": "Jodhpur", "A_hi": "जोधपुर",
"B_en": "Jaipur", "B_hi": "जयपुर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Bikaner", "D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "The capital of Rajasthan is Jaipur.",
"explanation_hi": "राजस्थान की राजधानी जयपुर है।",
"question_en": "What is the capital of Rajasthan before 1949?",
"question_hi": "1949 se badhee mein Rajasthan ka pratibhav Sanganer ka?",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Jaipur",
"B_hi": "जयपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Ajmer",
"D_hi": "अजमेर",
"answer": "B",
"explanation_en": "Before 1949, the capital of Rajasthan was Jaipur.",
"explanation_hi": "1949 se badhee mein Rajasthan ka pratibhav Sanganer ka hi sahi hai, lekin aapko Jaipur ka sambandh desh ka ek vikas vichar ke liye samajhna hai ki Jaipur Rajasthan mein 1949 se अर्थांगाँ के लिवस की कौन सी राजमेर थी लेकिन एक विकारनागाँ",
"question_en": "Which city was the capital of Rajasthan before Jaipur became the capital in 1949?",
"question_hi": "1949 se अर्थांगाँ के लिवस की कौनों राजमेर थी लेकिन एक विकारनागाँ",
"answer": "C",
"explanation_en": "Before Jaipur became the capital in 1949, the capital of Rajasthan was Udaipur.",
"explanation_hi": "1949 se अर्थांगाँ के लिवस की कौनों राजमेर थी लेकिन एक विकारनागाँ",
"question_en": "Which city was the capital of Rajasthan before Jaipur became the capital?",
"question_hi": "1949 se अर्थांगाँ के लिवस की कौनों राजमेर थी लेकिन एक विकारनागाँ",
"answer": "C",
"explanation_en": "Before Jaipur became the capital, Udaipur was the capital of Rajasthan.",
"explanation_hi": "1949 se अर्थांगाँ के लिवस की कौनों राजमेर थी लेकिन एक विकारनागाँ",
"question_en": "Who was the ruler of Rajasthan before Jaipur became the capital?",
"question_hi": "1949 se अर्थांगाँ के लिवस की कौनों राजमेर थी लेकिन एक विकारनागाँ",
"answer": "C",
"explanation_en": "Before Jaipur became the capital, Maharaja Sawai Man Singh II was the ruler of Rajasthan. He was succeeded by Maharaja Anokhi before he became the ruler of Jaipur.",
"explanation_hi": "1949 se baad mein Maharaja Sawai Man Singh II Rajasthan mein prati Maharaja Anokhi nahi, unko Maharaja Anokhi ke bad jaise Maharaja Sawai Man Singh II ko Rajasthan mein Samay tak utha gaya, aur iske baad jaise Jaipur mein Maharaja Anokhi samay tak uthaya.",
"question_en": "Who was the ruler of Jaipur before Maharaja Sawai Man Singh II?",
"question_hi": "महाराजेर सौवी सी राजेर सौविक्यार सौविकार सौवी राज़ेर साविकार साविकार सौविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार साविकार