[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which dynasty ruled Rajasthan before the Mughals?",
"question_hi": "राजस्थान मुगल नेत्रहित किया जबकि पहले उन्हें कौन सी द्वारा राजस्थान में राजनी हुई थी?",
"A_en": "Chauhans",
"A_hi": "चौहान",
"B_en": "Rathore",
"B_hi": "रातौर",
"C_en": "Todi",
"C_hi": "तोडी",
"D_en": "Jat",
"D_hi": "जयता",
"answer": "B",
"explanation_en": "Before the Mughals ruled Rajasthan, the Rathore dynasty ruled the region. The Rathores are known for their bravery and strong rule over the state.",
"explanation_hi": "मुगलों के बाद, रातौर द्वारा राजस्थान में राजनी हुई थी। रातौर सम्पन के बारंबार में कैमारी थी।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Culture",
"question_en": "Which Festival is celebrated with great enthusiasm in Rajasthan?",
"question_hi": "राजस्थान में कैमारी तिहाँ कैमारी है।",
"A_en": "Gangaur",
"A_hi": "गांगाउर",
"B_en": "Kite Festival",
"B_hi": "कीट फेस्टमारी है।",
"C_en": "Jaisarat Rath Yatra",
"C_hi": "जयसरत रात यात्रा",
"D_en": "Chand Baithak",
"D_hi": "चांद बैटक",
"answer": "B",
"explanation_en": "The Kite Festival, also known as Uttarayan, is a popular celebration in Rajasthan. It is celebrated on Makar Sankranti every year and involves flying kites and cutting them with sharp blades.",
"explanation_hi": "राजस्थान में किट फेस्टमारी है। यह मकर संक्रमण के दिन करों की रक्षालिया किताबाड़ी के भवन्दगंधर्मण के दिन करों की रक्षाली की भवन्दगंधर्मण के दिन करों की रक्षाली की भवन्दगंधर्मण के दिन करों की रक्षाली की भवन्दगंधर्मण के दिन करों की रक्षाली की भवन्दगंधर्मण के दिन करों की रक्षाली की भवन्दगंधर्मण की रक्षाली की भवन्दगंधर्मण की रक्षाली की भवन्दगंधर्मण की रक्षाली की भवन्दगंधर्मण की रक्षाली की भवन्दगंधर्मण की रक्षाली की भवन्दगंधर्मण की रक्षाली की भवन्दगंधर्मण की रक्षाली की भवन्दगंधर्मण की रक्षाली भवन्दग्दगंधर्मण की र्षाली भवन्दगंधर्मण की र्षाली भवन्दगंधर्मण की र्षाली भवन",
"
"answer": "B",
"explanation_en": "The Kite Fair is an annual event held in Jaipur where people come together to fly kites.",
"explanation_hi": "ज्दगंधर्मण की र्षाली भवन भवन भव्दगंधर्मण की र्षाली भवन्दगंधर्मण की र्षाली भवन",
}
]