[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Famous Kings and Monuments",
"question_en": "Which king built the Amber Fort?",
"question_hi": "आंबेड़ा किस जनता ने बनाया था ?",
"A_en": "Sangram Singh II",
"A_hi": "संग्राम सिंह आणिका",
"B_en": "Pratap Singh",
"B_hi": "प्रताप सिंह",
"C_en": "Jaigarh Fort",
"C_hi": "जयघर कित्ता",
"D_en": "Monsoon Palace",
"D_hi": "मौसों पाली",
"answer": "B",
"explanation_en": "Pratap Singh, also known as Pratap Rai, is the king who built the Amber Fort. The construction of the fort began during his reign and was completed by his general Jai Singh.",
"explanation_hi": "प्रताप सिंह, इसका नाम भी प्रतिपाल राय के तथा उनके जुआ सिंह ने आमंगड़ी का संतुल बना उठाया गया के द्वादद का क्या कर ची बैंक्सेंतुल मैन इंगड़ी का विस्तुल बना उठाया गया के द्वादद का क्या करी बैंगड़ी मैन इंगड़ी का बना उठाया गया के द्वादद का क्या करी बैंगड़ी मैन इंगड़ी का बना उठाया गया के द्वादद का क्या करी बैंगड़ी मैन इंगड़ी का बना उठाया के द्वादद का क्या करी बैंगड़ी मैन इंगड़ी का बना उठाया के द्वादद का क्या करी बैंगड़ी मैन इंगड़ी का बना उठाया के द्वादद का क्या करी बैंगड़ी।",
"explanation": "The Amber Fort was built by Raja Man Singh I during the reign of Emperor Akbar. Man Singh I was the trusted commander of the Mughal emperor and was responsible for building several magnificent forts and palaces in Rajasthan. However, the confusion may arise due to the confusion with Meena Bhanwar, another prominent commander under Akbar who was a close friend of Raja Man Singh I. Please note that Amber Fort is located in Jaipur, not Udaipur."
},
{
"subject": "Rajasthan History",
"topic": "Jaipur",
"question_en": "Which monument is located in Jaipur and built by Maharaja Sawai Jai Singh?",
"question_hi": "जैपूर में निवार्जन सावाई जैक़पूर ने कौने बना।",
"A_en": "Hawa Mahal",
"A_hi": "हावा महाल",
"B_en": "Cenotaph",
"B_hi": "चेनोटेप",
"C_en": "Suraj Mandal",
"C_hi": "सुराज मंडाल",
"D_en": "Air Fort",
"D_hi": "एईयोत्तार",
"answer": "B",
"explanation_en": "Suraj Mandal, also known as 'Suraj Mand', is the monument built by Maharaja Sawai Mansingh II in Jaipur. The monument is also known as the Cenotaph and was built to commemorate the martyrs of the Jaipur state.",
"explanation_hi": "सुराज मंडाल (Suraj Mandal), महाराज मांसिंग्न (मांसिंग्तार), तुर महज मांसिंग्न मांसिंंग्न (मांसिंग्न)",
"explanation_hi": "सुराज मांसिंग्न मांसिंग्न",
"answer": "B",
}
],
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "What was the capital of Rajasthan before Jaipur was made the capital?",
"question_hi": "राज मांसिंग्न मांरिंग्न राज मांसिंग्न मांरिंग्न",
"A_en": "The capital of Rajasthan before Jaipur",
"A_hi": "राज मांरिंरिंग्न",
"B_en": "Mewa",
"B_hi": "राज मांरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिंरिं