[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which historical palace is located in Jaipur?",
"question_hi": "जयपुर में किस घरचंद्रशेखवाल पर्यावरण का एक प्रमोजन है।",
"A_en": "Amer Fort",
"A_hi": "आमे कंदरि",
"B_en": "Hawa Mahal",
"B_hi": "हवा महाल",
"C_en": "Jal Mahal",
"C_hi": "जल महाल",
"D_en": "Chand Baori",
"D_hi": "चंद बाउरी",
"answer": "B",
"explanation_en": "Hawa Mahal is a popular astronomical tower located in Jaipur known for its beautiful architecture.\nEnglish Explanation:\nHawa Mahal is a popular astronomical tower located in Jaipur known for its beautiful architecture.\nHawa Mahal is a monument built by Maharaja Sawai Pratap Singh in the early 19th century.\nIt is a part of the City Palace complex and features intricate latticework and design.\nHawa Mahal stands at a height of around 100 feet and consists of 953 windows.\nIt is named after its unique ventilation system, which allows fresh air to flow through the building.",
"explanation_hi": "जैसावाने वाला एक निर्माण सम्मानित पुरातन्तिक मंदिर Hawa Mahal एक पहलांका निर्माण सम्मानित पुरातन्तिक मंदिर Hawa Mahal एक पुरातन्तिक मैन्दर Hawa Mahal एक पुरातन्तिक मंदिर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातनिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal",

Aapko Rajasthan mein एक मुरातिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal एक पुरातिक मंदर Hawa Mahal एक पुरातन्तिक मंदर Hawa Mahal",
पुरातिक मंदर Hawa Mahal एक पुरातिक मंदर Hawa Mahal एक पुरातिक मंदर Hawa Mahal एक पुरातिक मंदर Hawa Mahal",
एक पुरातिक मंदर Hawa Mahal",
एक पुरातिक मंदर Hawa Mahal एक पुरातिक मंदर Hawa Mahal",
एक पुरातिक मंदर Hawa Mahal एक पुरातिक मंदर Hawa Mahal एक पुरातिक मंदर Hawa Mahal",
एक पुरातिक मंदर Hawa Mahal",
एक पुरातिक मंदर Hawa Mahal एक पुरातिक मंदर Hawa Mahal",
एक पुरातिक मंदर Hawa Mahal",
एक पुर