[
{
"subject": "Rajasthan History",
"topic": "Rajasthan in Mughal Era",
"question_en": "Which Mughal Emperor founded Jodhpur?",
"question_hi": "जोधपुर के मुग्लीग सरकारी कौन से कामता निर्माण करी थी?",
"A_en": "Aurangzeb",
"A_hi": "अर्थांगज",
"B_en": "Akbar",
"B_hi": "अकबर",
"C_en": "Mohammed Shah",
"C_hi": "मौहमान शाह",
"D_en": "Shah Jahan",
"D_hi": "शाह जाहाँ",
"answer": "A",
"explanation_en": "Aurangzeb, the Mughal Emperor, founded Jodhpur in 1459. It was initially named \"Rao Jodha\" after Raja Jodha of Jodhpur clan.",
"explanation_hi": "अर्थांगज, मुगलिग सरकारी, 1459 में Jodhpur को बनाया था। यह बेबल के राजा जोधों की कोणती तथा उसका नाम \"राजा जोधों को तंग करने के प्राधों को स्वीकांती नाम \"राजा जोधों को तंग करने के प्राधों को स्वीकांती नाम \"राजा जोधों को तंग करने के प्राधों को स्वीकांती नाम \"राजा जोधों को तंग करने के प्राधों को स्वीकांती नाम \"राजा जोधों को तंग करने के प्राधों को स्वीकांती नाम \"राजा जोधों को तंग करने के प्राधों को स्वीकांती नाम \"राजा जोधों को तंग करने के प्राधों को स्वीकांती नाम \"राजा जोधों को तंग करने के प्राधों को स्वीकांती नाम \"राजा जोधों को तंग करने के प्राधों को स्वीकांती नाम \"राजा जोधों को तंग के प्राधों को स्वीकांती नाम \"राजा जोधों को तंग के प्राधों को स्वीकांती नाम \"राजा जोधों को स्वीकांती नाम \"राजा जोधों को स्वीकांती नाम \"राजा जोधों को स्वीकांती नाम \"राजा जोधों को स्वीकांती नाम \"राजा जोधों को स्वीकांती नाम \"राजा जोधों को स्वीकांती नाम \"राजा जोधों को स्वीकांती नाम \"राजा जोधों की नाम \"राजा जों को स्वी नाम \"राजा जोधों कंती नाम \"राजा जोधों की", 

"question_en": "Who founded Jodhpur during Mughal Rule?",
"question_hi": "जी नाम \"राजा जों कें की नाम की राजा जे कें कों की नाम \"राजा जों कें कें की नाम \"राजा जे कें के कें कें कें की",
"A_en": "Mughal Emperor Akbar",
"A_hi": "अराजा जें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें",
"B_en": "Sikander",
"B_hi": "अराजा जें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें