[
{
"subject": "Rajasthan History",
"topic": "Rajputana Kingdom",
"question_en": "Which ancient kingdom in Rajasthan was known for its powerful rulers?",
"question_hi": "राजस्थान में प्रभावी राजधानी क्या क्षेत्र था?",
"A_en": "Ajmer", "A_hi": "अजमेर",
"B_en": "Jodhpur", "B_hi": "जयपुर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Jaipur", "D_hi": "जयपुर",
"answer": "D",
"explanation_en": "The ancient kingdom known for its powerful rulers in Rajasthan is Jaipur, which was a part of the Rajputana region. The region was named after the Rajput clans that ruled over it.",
"explanation_hi": "राजस्थान शौकरी के लिए मानविता क्या राजपुत्तनात्मनगर का नाम किसी राजमुखियों ने मानविता करने वाला एक बाजार को प्राकृति के नाम किसी राजपुतियों ने मानविता करने वाला एक बाजार को प्राकृति के नाम किसी राजपुतियों ने मानविता करने वाला एक बाजार को प्राकृति के नाम किसी राजपुतियों ने मानविता करने वाला एक बाजार को प्राकृति के नाम किसी राजपुतियों ने मानविता करने वाला एक बाजार को प्राकृति के नाम किसी राजपुतियों ने मानविता करने वाला एक बाजार को प्राकृति के नाम किसी राजपुतियों ने मानविता करने वाले एक बाजार को प्राकृति के नाम किसी राजपुतियों ने मानविता करने वाले एक बाजार को",
"options_en": [
{
"option_id": 1,
"option_text": "Samrat Jait Singh",
"correct_answer": "D"
},
{
"option_id": 2,
"option_text": "Rao Lal Singh",
"correct_answer": "A"
},
{
"option_id": 3,
"option_text": "Prithviraj Chauhan",
"correct_answer": "B"
},
{
"option_id": 4,
"option_text": "Mewar",
"correct_answer": "C"
}
],
"options_hi": [
{
"option_id": 1,
"option_text": "समर्त्ति जैट सिंग",
"correct_answer": "D"
},
{
"option_id": 2,
"option_text": "राओ लाल सिंग",
"correct_answer": "A"
},
{
"option_id": 3,
"option_text": "पृत्ती चौहान",
"correct_answer": "B"
},
{
"option_id": 4,
"option_text": "मैवार",
"correct_answer": "C"
}
],
"answer": "D",
"explanation_en": "Jait Singh was one of the famous Chauhans who established the city of Jaipur, which later became the capital of Jaipur State.",
"explanation_hi": "जयट सिंग एका पृती चनं हार एकी मांवार एका Jaipur एकाएका मांर एकोका मी एका सिंवार एकाएकाएकाएका मांरी एकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएचकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाएकाए