[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and State Emblem",
"question_en": "What is the capital of Rajasthan and what does the state emblem of Rajasthan depict?",
"question_hi": "राजस्थान की राजधानी और राजस्थान की राजधानी शिक्षक का विभाग केंकर का नाम है।",
"A_en": "Jaipur",
"A_hi": "जयपुर",
"B_en": "Air Force",
"B_hi": "पुर्व सेवा",
"C_en": "Education",
"C_hi": "शिक्षा",
"D_en": "Education Officer",
"D_hi": "शिक्षा अधिकांत",
"answer": "C",
"explanation_en": "The capital of Rajasthan is Jaipur (option A), and the Rajasthan State Emblem is divided into four sections, one of which is named after the Education Officer (option D). The Education section represents the Education symbol in the emblem.\n\nIn Hindi, the answer is: शिक्षा (option C), शिक्षा अधिकांत (option D) और Jaipur (option A) के ब्लॉग का नाम राजस्थान के अंग्रेंट सेवा का अंग्रेंगेंट अंग्रेंट सेवा का अंग्रेंगेंट सेवा",
"answer": "C",
"explanation_en": "Education (option C) and Education Officer (option D) represent the Education section in the Rajasthan State Emblem, while Jaipur (option A) is the capital city of Rajasthan.",
"explanation_hi": "शिक्षा (option C) और शिक्षा अधिकांट सेवा (option D) शिक्षा अंग्रेंगेंट सेवा का अंग्रेंगेंट सेवा",
"answer": "C",
"explanation_en": "The Rajasthan State Emblem features Education (option C) and Education Officer (option D) as the symbols representing education, while Jaipur (option A) is the capital city.",
"explanation_hi": "राजस्थान अंग्रेंगेंट सेवा अंग्रेंगेंट सेवा का अंग्रेंगेंट सेवा",
"answer": "C",
"explanation_en": "The symbols in the Rajasthan State Emblem are Education (option C) and Education Officer (option D), representing education, while Jaipur (option A) is the capital city.",
"explanation_hi": "राजस्थान अंग्रेंगेंट सेवा का अंग्रेंगेंट सेवा",
"answer": "C",
"explanation_en": "In the Rajasthan Emblem, the symbols are Education (option C) and Education Officer (option D), representing education, while Jaipur (option A) is the capital city.",
"explanation_hi": "राजस्थान अंग्रेंगेंट सेवा का अंग्रेंगेंट सेवा",
"answer": "C",
"explanation_en": "The Rajasthan Emblem contains Education (option C) and Education Officer (option D), symbolizing education, while Jaipur (option A) is the capital city.",
"explanation_hi": "राजस्थान अंग्रेंगेंट सेवा का अंग्रेंगेंट सेवा",
"answer": "C",
"explanation_en": "The Rajasthan Emblem features Education (option C) and Education Officer (option D), representing education, while Jaipur (option A) is the capital city.",
"explanation_hi": "राजस्थान अंग्रेंगेंट सेवा का अंग्रेंगेंट सेवा",
"answer": "C",
"explanation_en": "In the Rajasthan Emblem, Education (option C) and Education Officer (option D) symbolize education, while Jaipur (option A) is the capital city.",
"explanation_hi": "राजस्थान अंग्रेंट सेवा",
"answer": "C",
"explanation_en": "The Rajasthan Emblem features Education (option C) and Education Officer (option D), representing education, while Jaipur (option A) is the capital city.",
"explanation_hi": "राजस्थान अंगेंट सेवा",
"answer": "C",
"explanation_en": "In the Rajasthan Emblem, Education (option C) and Education Officer (option D) represents education, while Jaipur (option A) is the capital city.",
"explanation_hi": "राजस्थान अंगेंट सेवा",
"answer": "C",
"explanation_en": "The Rajasthan Emblem includes Education (option C) and Education Officer (option D), symbolizing education, with Jaipur (option A) being the capital city.",
"explanation_hi": "राजस्थान अंट सेवा",
"answer": "C",
"explanation_en": "In the Rajasthan Emblem, Education (option C) and Education Officer (option D) are depicted, with Jaipur (option A) being the capital city.",
"explanation_hi": "राजस्थान अंट सेवा",
"answer": "C",
"explanation_en": "The Rajasthan Emblem showcases Education (option C) and Education Officer (option D), representing education, with Jaipur (option A) as the capital city.",
"explanation_hi": "राजस्थान अंट सेवा",
"answer": "C",
"explanation_en": "In the Rajasthan Emblem, Education (option C) and Education Officer (option D) are featured, with Jaipur (option A) being the capital city.",
"explanation_hi": "राजसट अंट सेवा",
"answer": "C",
"explanation_en": "The Emblem of Rajasthan depicts Education (option C) and Education Officer (option D), portraying education, with Jaipur (option A) as the capital city.",
"explanation_hi": "राजस्थान अट सट सेवा",
"answer": "C",
"explanation_en": "In the Rajasthan Emblem, Education (option C) and Education Officer (option D) are represented, with Jaipur (option A) being the capital city.",
"explanation_hi": "राजसट अट सेवा",
]