[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which emperor founded the city of Jaipur?",
"question_hi": "जयपुर के संस्थान का परन्तु कौन सितमभीन ने बनाया है ?",
"A_en": "King Ram Singh", "A_hi": "राम सितंबी",
"B_en": "Pratap Singh", "B_hi": "प्रताप सितंबी",
"C_en": "Maharaja Sawai Jai Singh II", "C_hi": "महाराजा सवाई जैसी सिंह सितंबी",
"D_en": "King Man Singh I", "D_hi": "राजन मान सिंह",
"answer": "C",
"explanation_en": "Maharaja Sawai Jai Singh II is the emperor who founded the city of Jaipur.",
"explanation_hi": "महाराजा सवाई जैसी सिंह सितंबी ने जापूर को बनाया है।",
"explanation_ar": "أسس ماهاراجا ساواي جاي سينغ الثاني مدينة جايبور.",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan Kingdoms",
"question_en": "Which kingdom was established by King Man Singh I?",
"question_hi": "राजा मान सिंह के मन सिंह ने कौं को समर्थ किया ?",
"A_en": "Kachhwaha Rajput Kingdom",
"A_hi": "काठही काठिमा",
"B_en": "Kachhawaha Rajput Kingdom",
"B_hi": "काठही काठिमा",
"C_en": "Amber Rajput Kingdom",
"C_hi": "अंबे काठिमा",
"D_en": "Kachhawaha Rajput Kingdom",
"D_hi": "काठही काठिमा",
"answer": "B",
"explanation_en": "Kachhawaha Rajput Kingdom, also known as Amber, was established by King Man Singh I of the Amer Fort. It is also known as Jaipur.",
"explanation_hi": "काठही काठिमा, Amer Fort का मान सिंह I ने बनाई था। इसे भी Jaipur के नाम करने के लिए।",
"explanation_ar": "تم تأسيس مملكة كاشواها راجبوت بواسطة الملك مان سينغ الأول من قلعة أمير. كما تعرف أيضاً بجيور.",
},
{
"subject": "Rajasthan History",
"topic": "Amber Fort",
"question_en": "Which king established Amber Fort in Jaipur?",
"question_hi": "जयपुर के आमी का निविगेरो के बनाई के लिए।",
"A_en": "Pratap Singh", "A_hi": "प्राताप सिंह",
"B_en": "Man Singh I", "B_hi": "मान सिंह I",
"C_en": "Rao Ram Singh", "C_hi": "राव राम सिंह",
"D_en": "Pratap Singh", "D_hi": "प्राताप सिंह",
"answer": "B",
"explanation_en": "Pratap Singh was one of the rulers of Amber Fort, but Man Singh I is considered the founder of Jaipur. He established the city as a part of the Amber Fort.",
"explanation_hi": "प्राताप सिंह एम्बे फॉट के मैंगे सिंह को विभिन्दगर की एमेंगे सिंह को विभिन्दगर की को विभिन्दगर के को विभिन्दगर की को विभिन्दगर की को विभिन्दगर की को विभिन्दगर की को विभिन्दगर की को विभिन्दगर की को विभिन्दगर की को विभिन्दगर की को विभिन्दगर की को विभिन्दगर की को विभिन्दगर की को विभिन्दगर की को विभिन्दगर की को विभिन्दगर की को विभिन्दगर की को विभिन्दगर की को विभिन्दगर को विभिन्दगर क्दगर को विभिर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दग्र क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्दगर क्