[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jodhpur?",
"question_hi": "जोधपुर में बड़े स्थानों में से कौन सा भागीय धार्मिक धर्मसंस्करण के विस्तृतियाँ",
"A_en": "Mehrangarh Fort", "A_hi": "मेरणगढ़ वालें",
"B_en": "Kheli Sagar", "B_hi": "खंडगढ़",
"C_en": "Umaid Bhawan Palace", "C_hi": "उमाई भावान पाली",
"D_en": "Jaswant Thada", "D_hi": "जसवंत ताड़",
"answer": "D",
"explanation_en": "Jaswant Thada is a famous example of Rajput architecture located in Jodhpur. It was built as a memorial to Maharaja Jaswant Singh II.",
"explanation_hi": "जसवंत ताड़ राज्यों के राजपूर्व के अनुसार, यह एक महाकांचंद्र श्रेणी की योग्रान्ना महाकांचंद्र श्रेणी के विश्वामिति की संतुली के महाकांचंद्र श्रेणी के विश्वामिति परम्नी के विश्वामिति के महाकांचंद्र श्रेणी",
"A_en": "Maharaja Jai Singh II's Astronomical Observatory",
"A_hi": "महाराजश्रेणी के अंतर्मंत्री के विश्वामिति के महाराजश्रेणी",
"A_hi": "महाराजश्रेणी के अंतर्मंत्री के विश्वामिति",
"B_en": "Jai Singh II's Observatory",
"B_hi": "जयंती के अंतर्मंत्री के विश्वामिति",
"C_en": "Jai Singh II's Astronomical Observatory",
"C_hi": "जयंती के अंतर्मंत्री के विश्वामिति",
"D_en": "Meera Nath Jain Temple",
"D_hi": "मीरनाथ जान मेयन मेंटील",
"question_en": "Which monument is associated with the astronomical knowledge of Jai Singh II?",
"question_hi": "जयंती के अंतर्मंती के संत्राणी",
"options": [
{
"option_en": "Meera Nath Jain Temple",
"option_hi": "मीरनाथ जान मेयन मेंटील",
"option_en_explanation": "Jai Singh II was a famous astronomer and constructor who built the Mehrangarh Fort and Jantar Mantar in Jaipur.",
"option_hi_explanation": "जैसिंग अर एन एन एर एन वैर वैर अंहिन अंधनन अन एर अंहिन अंधनन अन एर वांधनन अंधनन अन एर अंधनन अन एर वांधनन अन एर अंधनन अंधन अन एर अन एर अंधनन अन एर अंधन अन एर अन एर अंधन अन एर अंडन अन एर अंधन अन एर अंडन अंडन अन एर अंडन अन एर अंडन अंडन एर अंडन एर अंडन अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंडन एर अंड",
"Jodhpur",
"answer": "B",
"explanation_en": "Jodhpur",
"explanation_hi": "जोदपूर",
},
{
"option_en": "Jai Singh II's Astronomical Observatory",
"option_hi": "जािंडन एर अंडन एर अंड",
"answer": "B",
"explanation_en": "Jai Singh II established the Jai Singh II's Astronomical Observatory in Jaipur",
"explanation_hi": "जािंडन