[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following is NOT a capital city of Rajasthan?",
"question_hi": "इनमें से कौन राजस्थान का नहीं है।",
"A_en": "Jodhpur", "A_hi": "जोधपुर",
"B_en": "Udaipur", "B_hi": "उदयपुर",
"C_en": "Bikaner", "C_hi": "बीकानेर",
"D_en": "Jaisalmer", "D_hi": "जयसालमर",
"answer": "D",
"explanation_en": "Jaisalmer is not a capital city of Rajasthan.",
"explanation_hi": "जयसालमर राजस्थान का नहीं है।",
"explanation_hi": ""
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following kings established the city of Jaipur?",
"question_hi": "इनमें से कौन-सा जयपुर को संरक्षित करने वाला था?",
"A_en": "Raja Man Singh",
"A_hi": "राजा मन सिंग",
"B_en": "Raja Rai Singh",
"B_hi": "राजा राय सिंग",
"C_en": "Raja Jai Singh",
"C_hi": "राजा जय सिंग",
"D_en": "Raja Kishori Lal",
"D_hi": "राजा किशोरी लाल",
"answer": "D",
"explanation_en": "Raja Kishori Lal is the king who established the city of Jaipur.",
"explanation_hi": "राजा किशोरी लाल के संतरांग की डों और को श्रुत होंग के संतरांग की डों और को श्रुत होंग के संतरांग की डोंग और को श्रुत होंग के संतरांग को श्रुत होंग के संतरांग और को श्रुत होंग के संतरांग को श्रुत होंग के संतरांग को श्रुत होंग से संतरांग को श्रुत होंग के संतरांग को श्रुत होंग के संतरांग को श्रुत होंग से संतरांग को श्रुत होंग के संतरांग के संतरांग को श्रुत होंग के संतरांग से स्तरांग को श्रुत होंग के संतरांग के स्तरांग के संतरांग के स्तरांग के संतरांग के स्तरांग के संतरांग के स्तरांग के संतरांग के स्तरांग के संतरांग के संतरांग के स्तरांग के संतरांग के संतरांग के स्रांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांरांग के संतरांग के संतरांग के संतरांतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांतरांतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग के संतरांग क