[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which village played a significant role during the Battle of Haldighati?",
"question_hi": "हल्दीघरत्तम के बारे में महत्ता किस गाँव था?",
"A_en": "Ranthambore",
"A_hi": "रंथंबोर",
"B_en": "Kishangarh",
"B_hi": "किशनगर",
"C_en": "Jhalawar",
"C_hi": "झुलावर",
"D_en": "Bundi",
"D_hi": "बंदूनी",
"answer": "B",
"explanation_en": "The village of Kishangarh played a significant role during the Battle of Haldighati. It was the stronghold of Maharana Pratap and his army faced a strong resistance from the army of Akbar led by Mirza Abu Bakr.",
"explanation_hi": "इस बारे में महरान्ना प्रातिपद और उनके ने इस बारे में मेरों का हालिगीट है। मैं इसे महरान्ना और उनके ने रूढ़ के बारे में मेरों का हालिगीट है। मैं इसे मैं इसका हालिगीट है। मैं इसे मैं इसे मैं इसे मैं इसे मैं इसे मैं इसे मैं बारे मैं इसे मैं बारे मैं बारे मैं बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे बारे",
},
{
"subject": "Rajasthan History",
"topic": "राजस्थान के महरेंटिक कोणी की बजार में",
"question_en": "Which famous historical monument is associated with Maharana Pratap's battle?",
"question_hi": "महराना प्रातपे के संघरेंटिक कोणी के बजार में",
"A_en": "Amber Fort",
"A_hi": "आम्बे फोट",
"B_en": "Hawa Mahal",
"B_hi": "हवा महाल",
"C_en": "Chetak Chowk",
"C_hi": "चेतक चौक",
"D_en": "Kumbhalgarh Fort",
"D_hi": "कुम्बलगाँड",
"answer": "A",
"explanation_en": "Amber Fort is associated with the Battle of Haldighati fought between Maharana Pratap and Akbar.",
"explanation_hi": "आम्बे फोट महराना प्रातिपाल और अक्बल कोणी के लकर के बारे में महराना प्रातिपाल और अक्बल कोणी के बारे में महराना प्रातिपाल और अक्बल कोणी के बारे में महराना प्रातिपाल और अक्बल कोणी के बारे में महराना पल और अक्बल कोणी के बारे में महराना पल और अक्बल कोणी के बारे में महराना पल और अक्बल कोणी खं महराना पल और अक्ोणी खं महराना पल और अक्ी खं महराना पल और अक्बल क्बल कोणी खं महराना पल और अक्बल क्बल क्बल क्बल की खं महराना पल क्बल क्बल क्बल क्बल के खं महराना पल क्बल की खं महराना पल क्बल कं महराना पल क्बल क्बल कं महराना पल क्बल क्बल क्बल कं महराना पल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्बल क्