[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which city was the capital of Mewar kingdom?",
"question_hi": "मेवर क्षेत्र के राजधानी किस शहर थी।",
"A_en": "Agra",
"A_hi": "आग्रह",
"B_en": "Delhi",
"B_hi": "दिल्ली",
"C_en": "Jodhpur",
"C_hi": "जोधपुर",
"D_en": "Ajmer",
"D_hi": "अजमेर",
"answer": "C",
"explanation_en": "Jodhpur was the capital of the Mewar kingdom.",
"explanation_hi": "मेवर क्षेत्र की राजधानी स्थल जोधपुर है।",
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which city was the capital of Mewar during the reign of Maharana Pratap?",
"question_hi": "मेवरा के राजधानी महाराणा प्रतिपी के समय तक केवल उसकी राजधानी शहर जोधपुर है।",
"A_en": "Amber",
"A_hi": "अंबर",
"B_en": "Udaipur",
"B_hi": "उदयपुर",
"C_en": "Chittorgarh",
"C_hi": "चीटरगढ़र",
"D_en": "Jaipur",
"D_hi": "जापान",
"answer": "C",
"explanation_en": "Chittorgarh was the capital of Mewar during the reign of Maharana Pratap.",
"explanation_hi": "मेवरा के समय तक महारांना प्रतीप के समय तक कितरणी कामतीतलकर शहर ही खरींदी में लिया राजने की बचेंगती समय के लिया में राजने के बचदेंगती समय के लिया में कित्राने के बचदेंगते समय के लिया में राजने की बचदेंगते समय के लिया में राजने की बचदेंगते समय के लिया में राजने की बचदेंगते समय के लिया में राजने की बच्या के लिया में राजने की बच्या के लिया में राजने की बच्या के लिया में राजने की बच्या के लिया में राजने की बच्या के लिया में राजने की बच्या के लिया में राजने की बच्या के लिया में राजने की बच्या के लिया में राजने की बच्या के लिया में राजने की बच्या के लिया में राजने की बच्या के लिया में राजने की बच्या के लिया में राजने की बच्या के लिया में राजने की बच्या के लिया में राजने की बच्या लिया में राजने की बच्या लिया में राजने की बच्या में राजी बच्या में राजने की बच्या में राजने की बच्या में राजने की बच्या में राजने की बच्या में राजने की बच्या में राजने की बच्या में राजने की बच्या में राजने के की बच्या में राजने की बच्या में राजने की बच्या में राजने की बच्या में राजने की बच्या में राजने की बच्या में राजने की बच्या में राजने की बच्या में राजने की बच्या में राजने की बच्या में राजने की बच्या में राजने की बच्या में राजने