[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which city was the capital of Rajasthan during the Mewar dynasty?",
"question_hi": "मैयार श्लोक के समय राजस्थान के राजधानी केवल एक शहर था ?",
"A_en": "Amber", "A_hi": "अमेर",
"B_en": "Udaipur", "B_hi": "उदयपुर",
"C_en": "Jaipur", "C_hi": "जयपुर",
"D_en": "Jodhpur", "D_hi": "झौदर",
"answer": "C",
"explanation_en": "During the Mewar dynasty, the capital of Rajasthan was only a single city, which is now known as Jaipur.",
"explanation_hi": "मैयार श्लोक के समय राजस्थान के राजधानी केवल एक शहर था।",
"options": [
{
"option_en": "Amber",
"option_hi": "अमेर",
"option_explain_en": "Amber was a city that played an important role in the history of Rajasthan, but it was not the capital during the Mewar dynasty.",
"option_explain_hi": "अमेर एक महत्ता बंगना की भारत के राजधानी केवल एक शहर था।",
"option_explain_en": "Amber was a prominent city in the history of Rajasthan, but it was not the capital during the Mewar dynasty.",
"option_explain_hi": "अमेर एक मैबगना बंगना भारत के राजधानी केवल एक शहर था।",
},
{
"option_en": "Jaipur",
"option_hi": "जैपुर",
"option_explain_en": "Jaipur was the capital of Rajasthan during the Mewar dynasty.",
"option_explain_hi": "जैपुर मैबगना बंगना के समय मैर शास्तिता छैपुर को एक शहर था।",
},
{
"option_en": "Jhalrapatan",
"option_hi": "झल्रापटान",
"option_explain_en": "Jhalrapatan was a small city that served as the capital during the Mewar dynasty.",
"option_explain_hi": "झल्रापटान मैर शास्तिता समीता हुई छैपुर को एक बड़िता समय मैर शास्तितंत छैपुर को मैर शास्तिता समीता हुई छैपुर को एक बड़िता समय मैर शास्तितंत छैपुर को एक बड़िता सम्या मिर शास्तितंत छैपुर को एक बैटिता सम्यांत छैपुर को बैटीता समय मिर शास्तितंत छैपुर को एक बैटीता सम्यांत छैपुर ko baिता सम्यांत छैपुर को एक बैटीता समय मिर शास्तंत छैपुर को एक बैटीता सम्यांत छैपुर को एक बैटीता समयांत छैपुर को एक बैटीता सम्यांत छैपुर को एक बैटीता सम्यांत छैपुर को एक बैटीता समयांत छैपुर को एक बैटीता सम्यांत छैपुर को एक बैटीता सम्यांत छैपुर को एक बैटीता सम्यांत छैपुर क एक बैटीता सम्यांत छैपुर क एक बैटीता सम्यांत छैपुर क एक बैटीता सम्यांत छैपैटीता सम्यांत छैपुर क एक बैटीता सम्यांत छैपैटीता सम्यांत छैटैटीता सम्यांत छैपुर क एक बैटीता सम्यांत छैटैटीता सम्यांत छैटैटीता सम्यांत छैटैटीता सम्यांत छैटैटैटीता सम्यांत छैटैटीता सम्यांत छैटैटैटैटैटैटैटैटैटैटैटैटैटैटैटैट षता सम्यांत छैटैटटैटैटैटतैटैटैटैटैटैटैटैटैटैटैटैटैटैटैटैटैटैटैटैट षता सम्यांत