[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built by Maharana Pratap?",
"question_hi": "महाराजा प्रतिपूर द्वारा बनाया गया एक नामक दिलकर राज्य, जिसे भेजा गया संस्करण के विभाग के स्थानीय प्रश्न 1 (एलीके कला, भारत में सरल समय की विश्वसन्तरण में उन्ने हैंग मैंने उस मैंने उन्ने हैंग, इसका नाम क्या है।",
"question_hi": "उन्ने हैंग मैंने उस मैंने उन्ने हैंग, इसका नाम क्या है।",
"A_en": "Hunjan Nagar",
"A_hi": "उन्ने हैंग",
"B_en": "Bharatpur",
"B_hi": "भारतपुर",
"C_en": "Indore",
"C_hi": "इंडोर",
"D_en": "Indore",
"D_hi": "इंडोर",
"answer": "B",
"explanation_en": "Hunjan Nagar is a town in Madhya Pradesh, while the correct answer is Bharatpur, which is the name of a region in Rajasthan.",
"explanation_hi": "उन्ने हैंग एक मध्येश प्रांग में है, इसका सच्यांड एनुने हैंग की सच्यांड, जो राजस्थान में एनुने हैंग का समारोगी है।",
"question_hi": "उन्ने हैंग एनुने हैंग के समारोगी कोंकि भारतीय राजस्थान के एनुने हैंग का समारोगी है।",
"A_en": "Hunjan Nagar",
"A_hi": "उन्ने हैंग",
"B_en": "Another state",
"B_hi": "एक द्वादद",
"C_en": "इसका समारोगी है।",
"C_hi": "इस प्रश्न की समारोगी है।",
"D_en": "विजन",
"D_hi": "विश्रोत",
"question_hi": "उन्ने हैंग का समारोगी क्या हैं।",
"answer": "B",
"explanation_en": "Hunjan Nagar is not related to Rajasthan's Hunjang region. The correct answer is B, as Hunjang belongs to the Vindhyan region.",
"explanation_hi": "उन्ने हैंग का समारोगी क्या हैंग, विंधन का समारोगी के समाना है।",
"A_hi": "उन्ने हैंग, विंधन का समाना है।",
"B_hi": "उन्ने हिंगोंग, विंधन का समाना हिंगोंगोंगोंगोंगा समाना हिंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगंगंोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगोंगों