[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "What is the significance of the Mehrangarh Fort in Jodhpur?",
"question_hi": "जोधपुर मेहनगर क्षेत्रों का महत्व क्या है?",
"A_en": "Home to the Rathore dynasty",
"A_hi": "रत्नागिरी दिवस को",
"B_en": "A popular tourist destination",
"B_hi": "ट्यूटर में पसंदी प्राप्ति",
"C_en": "A symbol of Jodhpur's rich cultural heritage",
"C_hi": "जोधपुर की महत्वपूर्वर के",
"D_en": "A military stronghold built by Rao Jodhmal",
"D_hi": "राव जोधमाल ने बना",
"answer": "C",
"explanation_en": "The Mehrangarh Fort, located in Jodhpur, is a symbol of the rich cultural heritage of the city and the state. It was built by Rao Jodhmal and serves as a popular tourist destination.",
"explanation_hi": "जोधपुर में संतुल पुल के रूपांत्रों के मेर्नियां के संतुल पुल के से बना",
"answer": "C",
"explanation_en": "Mehrangarh Fort, located in Jodhpur, was built by Rao Jodhmal and represents the rich cultural heritage of the region. It is a popular tourist attraction.",
"explanation_hi": "जोधपुर मेर्नियां के संतुल पुल के से बना",
"answer": "B",
"explanation_en": "Mehrangarh Fort, built by Rana Kumbha, is a historical monument and showcases the architectural excellence of the Chauhan Dynasty. It is not a tourist attraction.",
"explanation_hi": "रानी कुम्ब्ह के संतुल पुल के से बना",
"answer": "A",
"explanation_en": "Mehrangarh Fort, constructed by Maharaja Chhatrasal, is a majestic fort and a significant historical site representing the Rajput culture. It is a prominent tourist attraction.",
"explanation_hi": "महाराज चत्रासाल के से बना",
"answer": "D",
"explanation_en": "Varendra Fort was built by Maharaja Surajmal of Banswara. It showcases the cultural aspects of the Marwar region and serves as a historical site.",
"explanation_hi": "सूरजमाल बान्सवरा के से बना",
"answer": "E",
"explanation_en": "Ranisagar is a reservoir built by Maharaja Sambhu Singh of Banswara. It is a symbol of the Rajput culture and serves as a popular picnic spot.",
"explanation_hi": "सांभूसिंगर के से बना",
"answer": "F",
"explanation_en": "Shekhawati Fort was established by Maharaja Sardul Singh. It highlights the art and architecture of the Shekhawati region and attracts history enthusiasts.",
"explanation_hi": "शेखावाटी फोट के से बना",
}
]