[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort was built by Rao Jodha in Jodhpur?",
"question_hi": "राव जोधा ने जोधपुर में किया गया कितना मुख्य किस्मत है?",
"A_en": "Meera Fort", "A_hi": "मीरा किस्मत",
"B_en": "Ranisagar Fort", "B_hi": "राणीसागर किस्मत",
"C_en": "Jai Pol", "C_hi": "जय पोल",
"D_en": "Rao Jodha ki Kasam", "D_hi": "राव जोधा के किस्मत",
"answer": "B",
"explanation_en": "Meera Fort, also known as Ranisagar Fort, was built by Rao Jodha in Jodhpur.",
"explanation_hi": "मीरा किस्मत, अपनी बनी गोष्टा की। इसकी बनाया उन्नाते राव जोधा के किस्मत में से बनी गोष्टा है।",
"explanation_hi": "मीरा किस्मत, उन्नाते राव जोधा के खुली गोष्टा है।",
"explanation_en": "Meera Kashtha, built by Rao Jodha in Jodhpur, is a famous stepwell.",
"explanation_hi": "मीरा कस्ता, उन्नाते राव जोधा ने जोधा गोष्टा खुली गोष्टा है।",
"explanation_en": "Meera Kashtha, built by Rao Jodha in Jodhpur, is a renowned stepwell.",
"explanation_hi": "मीरा कास्ता, उन्नाते राव जोधा ने जोधा गोष्टा खुली गोष्टा है।",
"explanation_en": "Meera Kashtha, constructed by Rao Jodha in Jodhpur, is a famous stepwell.",
"explanation_hi": "मीरा कास्ता, उन्नाते राव जोधा ने जोधा गोष्टा खुली गोष्टा है।",
"explanation_en": "Meera Kashtha, constructed by Rao Jodha in Jodhpur, is a renowned stepwell.",
"explanation_hi": "मीरा कास्ता, उन्नाते राव जोधा ने जोधा गोष्टा खुली गोष्टा है।",
"explanation_en": "Meera Kashtha, built by Rao Jodha in Jodhpur, is a historic stepwell.",
"explanation_hi": "मीरा कास्ता, उन्नाते राव जोधा ने जोधा गोष्टा खुली गोष्टा है।",
},
{
"subject": "Rajasthan",
"topic": "Rural Rajasthan",
"question_en": "Which village in Rajasthan has the famous stepwell called Khera Pol?",
"question_hi": "राजस्ताना मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मटे मेंटे मेंटे मेंटे मे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मेंटे मे