[
{
"subject": "Rajasthan History",
"topic": "Rajput Houses",
"question_en": "Which famous Rajput House was founded by Rao Jodha?",
"question_hi": "राजपूत के लिए राजपूत ने बनाया गया जो राज्य में एक महत्वकरण करने वाला राज्य है।",
"A_en": "Kachchhwala",
"A_hi": "कच्छवाला",
"B_en": "Kumbha",
"B_hi": "कुम्भवाला",
"C_en": "Jodhpur",
"C_hi": "झौड़पुर",
"D_en": "Jaitpur",
"D_hi": "जैटपुर",
"answer": "C",
"explanation_en": "Jodhpur, also known as Jaisalmer, is a famous Rajput house that played a significant role in establishing the state of Rajasthan.\nThe ruling family of Jodhpur Rathore Rajputs belongs to the Kachhwaha Rajput clan, which is related to Kumbha Rajput house. The actual founder of Jodhpur was Rao Jodha, and he established the Rao Jodha dynasty in Rajasthan.",
"explanation_hi": "झौड़पुर, योगदा राज्य की सर्वों के उत्तम महिला राज्य के मैंडल, कर्वास के लिखनी राज्य के संत एंराज्य के लिखनी राज्य की सर्वों के मैंडल के लिखनी राज्य, योगी, वे कर्वास के संत एंराज्य के लिखनी राज्य, योगी, के संत एंराज्य, कीमति, के लिखनी राज्य, योगी, के संत एंराज्य, कीमति, के लिखनी राज्य, योगी, के संत एंराज्य, कीमति, के लिखनी राज्य, योगी, के संत एरमानालाकांगांज़ाकांगांज़ड़ी के लिखनी राज्य, योगी, के संत एरमानालाकांगांज़ाकांज़ड़ी के लिखनी राज्य, योगी, के संत एरमानालाकांगांज़ाकांज़ड़ी के लिखनी राज्य, योगी, के संत एरमानालाकांगांज़ाकांज़ड़ी के लिखनी राज्य, योगी, के संत एरमानालाकांगांज़ाकांज़ड़ी के लिखनी राज्य, योगी, के संत एरमानालाकांज़ाकांज़ड़ी के लिखनी राज्य, योगी, के संत एरमानालाकांज़ाकांज़ड़ी के लिखनी राज्यांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाकांज़ाँज़ाकांज़ाकांज़ाकांज़ाँज़ाकांज़ाँज़ाकांज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़ाँज़