[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "What is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी क्या होती है?",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Jaipur",
"B_hi": "जयपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Bikaner",
"D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Jaipur is the capital of Rajasthan.",
"explanation_hi": "जयपुर, राजस्थान की राजधानी है।",
"explanation_hi": "राष्ट्र की राजधानी है - जयपुर"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Rulers",
"question_en": "Who was the first Maharaja of Jaipur?",
"question_hi": "जयपुर के पहले महाराजा कौन थे।",
"A_en": "Jai Singh II",
"A_hi": "जैसिंग II",
"B_en": "Sawai Man singh I",
"B_hi": "सौएमन सिंग I",
"C_en": "Pratap Singh",
"C_hi": "प्रताप सिंग",
"D_en": "Jagmohan Singh",
"D_hi": "जगमोहन सिंग",
"answer": "B",
"explanation_en": "Jai Singh II was the first Maharaja of Jaipur. He ruled from 1723 to 1743 and laid the foundation of Jaipur, known as the Pink City.",
"explanation_hi": "जैसिंग II जय सिंग और 1723 तक 1743 से समर्थान हैंग II ने जापुर को बिलके पनिकों की स्तर से उचित करना प्रधानंदायक मूल स्तर का स्तर से उचित करना प्रधानंदायक मूल स्तर से उचित करना प्रधानंदायक मूल स्तर से उचित करना प्रधानंदायक मूल स्तर से उचित करने के लिए प्रधानंदायक मूल स्तर से उचित करने के लिए प्रधानंदायक मूल स्तर से उचित करने के लिए प्रधानंदायक मूल स्तर से उचित करने के लिए प्रधानंदायक मूल स्तर से उचित कर्ने के लिए प्रधानंदायक मूल स्तर से उचित कर्ने के लिए प्रधानंदायक मूल स्तर से उचित कर्ने के लिए प्रधानंदायक मूल स्तर से उचित कर्ने के लिए प्रधानंदायक मूल स्तर से उचित के लिए परधानंदायक मूल स्तर से उचित के लिए परधानंदायक मूल स्तर से उचिए परधानंदायक मूल स्र से उचिए परधानंदायक मूल से उचिए परधानंदायक मूल से उचिए परधानंदायक मूल से उचिए परधानंदायक मूल से उचिए परधानंदायक मूल से उचिए परधानंदायक मूल से उचिए परधानंदायक मूल से उचिए परधानंदाक मूल से उचिए परधानंदाक मूल से उचिए परधानंदाक मैए परधानंदाक मैए परधानंदाक मैए परधानंदाक मैए परधानंदाक मैए परधानंदाक मैए परधानंदाक मैए परधानंदाक मैए परधानंदाक मैए परधानंदाक मैए परधंदाक मैए परधानंदाक मैए परधानंदाक मैए परधानंदाक मैए परधानंदाक मैए