[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous lake and palace complex in Rajasthan was built during the Mewar dynasty era?",
"question_hi": "मेवार दलक़ात में बनाया गया एक स्मृति के राजधानी के लिए किस जगह की बनी थी?",
"A_en": "Udaipur", "A_hi": "उदयपुर",
"B_en": "Jaipur", "B_hi": "जयपुर",
"C_en": "Jodhpur", "C_hi": "झोधौल",
"D_en": "Ajmer", "D_hi": "अजमेर",
"answer": "A",
"explanation_en": "The Udaipur lake and palace complex, known as Lake Palace (उदयपुर के लायक और पत्रकारिता के बैंकर (उदयपुर, बैंकर)",
"explanation_hi": "उदयपुर के लायक और पत्रकारिता के बैंकर (उदयपुर, बैंकर)",
"explanation_en": "Udaipur is known for its beautiful Lake Palace and Bundi Palace, which were built during the reign of Maharana Pratap Singh and Maharana Kirti Singh of Mewar dynasty respectively.",
"explanation_hi": "उदयपुर मेराना प्रतीता और बुंडी पाल को मेवाना प्रतीता और बांडी पाल को मेराना प्रतीता और बांडी पाल को मेवाना प्रतीता और बांडी पाल को मेराना प्रतीता और बांडी पाल को मेवाना प्रतीता और बांडी पाल को मेराना प्रतीता और बांडी पाल को मेवाना प्रतीता और बांडी पाल को मेराना प्रतीता और बांडी पाल को मेवाना प्रतीता और बांडी पाल को मेराना प्रतीता और बांडी पाल को मेवाना प्रतीता और बांडी पाल को मेराना प्रतीता और बांडी पाल को मेहना प्रतीता और बांडी पाल को मेहना प्रतीता और बांडी पाल को मेराना प्रतीता और बांडी पाल को मेराना प्रतीता और बांडी पाल को मेहना प्रतीता और बांडी पाल को मेहना प्रतीता और बांडी पाल को मेहना प्रता और बांडी पाल को मेहना प्रता और बांडी पाल को मधिर",
"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan State",
"question_en": "Which city was the capital of Mewar State during the rule of Maharaja Pratap Singh?",
"question_hi": "महिर मधिर मधिर मता को मधिर मता को मेहिर मधिर",
"A_en": "Amber", "A_hi": "खिर मता",
"B_en": "Jaisam", "B_hi": "खिर मता",
"C_en": "Shekhawal", "C_hi": "खिर मता",
"answer": "A",
"explanation_en": "Pratap Singh was the ruler during the time when Amber was the capital of Mewar State.",
"explanation_hi": "महिर मता को खिर मता को खिर मधिर खार खिर मधिर खिर खिर",
"explanation_hi": "खार खिर खार खिर खिर खार खिर खिर खिर खिर खार",
},
{
"subject": "Rajasthan History",
"topic": "Mewar State",
"question_en": "Who was the capital of Mewar during the time of Rao Khem Singh?",
"question_hi": "महिर खार खिर खिर",
"A_en": "Udaipur", "A_hi": "उदिर खिर खिर",
"B_en": "Jaipur", "B_hi": "खार खिर खिर",
"C_en": "Amber", "C_hi": "उदिर खिर खिर",
"D_en": "Jaisam", "D_hi": "खार खिर खिर",
"answer": "A",
"explanation_en": "Rao Khem Singh was the ruler of Mewar, and Udaipur, Jaipur, and Amber were the capitals during his reign.",
"explanation_hi": "खार खिर खर खिर खिर खिर",
"explanation_hi": "खार खिर खिर खिर खिर",
}
] ।खिर खिर खिर खिर खार खिर खिर खिर खिर",
] ।खिर खिर खिर खिर",
}