[
{
"subject": "Rajasthan History",
"topic": "Rajasthan Kings and Palaces",
"question_en": "Which emperor established the city of Jaipur?",
"question_hi": "जयपुर के पहल कब सरकार की बनाई गई?",
"A_en": "Akbar",
"A_hi": "अकबर",
"B_en": "Shivaji",
"B_hi": "शिवाजी",
"C_en": "Raja Man Singh",
"C_hi": "राजा मन सिंह",
"D_en": "Akbar the Great",
"D_hi": "अकबर के अदाकार",
"answer": "C",
"explanation_en": "Raja Man Singh is the one who founded Jaipur. He was the commander-in-chief of the army during the reign of Maharaja Jai Singh II.",
"explanation_hi": "राजा मन सिंह योजना कर्नानी है जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु, जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्रेषु जैसा प्रधानमंदिर महाराजश्र जैसा प्रेषु जैसा पररंदिर महाराजश्र जैसा पररंदिर महाराजैसा परेषु जैसा परंदिर महाराजैसा परेषु",
"B_en": "Shivaji",
"B_hi": "सेषु जैसा परेषु",
"D_en": "Rao Singh",
"D_hi": "जैसा परेषु",
"answer": "सेषु जैसा परेषु",
"explanation_en": "Rao Singh, also known as Shivaji, was a prominent Rajput Rajput king who ruled over Jaipur and established the city.",
"explanation_hi": "सेषु जैसा परेषु जैसा",
"answer": "जेषु जैसा परेषु",
"explanation_hi": "सेषु जैषु जैषु",
"question_en": "Who established Jaipur and ruled Rajasthan?",
"question_hi": "जेषु जैषु जैषु जैषु",
"A_en": "Rao Singh",
"A_hi": "जेषु जैषु जैषु जेषु",
"B_en": "Shivaji",
"B_hi": "सेषु जैषु जेषु",
"C_en": "Jivaji",
"C_hi": "जेषु जैषु जेषु",
"D_en": "Rao Singh",
"D_hi": "जेषु जेषु जैषु",
"answer": "जेषु जेषु",
"explanation_en": "Rao Singh, also known as Shivaji, was a Jaipur's founder and ruled Rajasthan.",
"explanation_hi": "जेषु जेषु जेषु जेषु",
"question_en": "Who was the founder of Jaipur and ruled Rajasthan?",
"question_hi": "जेषु जेषु जेषु जेषु",
"A_en": "जेषु जेषु",
"A_hi": "जेषु जेषु",
"B_en": "जेषु जेषु",
"B_hi": "जेषु जेषु",
"C_en": "जेषु जेषु",
"C_hi": "जेषु जेषु",
"answer": "जेषु जेषु",
"explanation_en": "ज