[
{
"subject": "Rajasthan History",
"topic": "Rajasthan State and its Founding",
"question_en": "Which historical ruler established Rajasthan as a state?",
"question_hi": "राजस्थान की राज्य को किस इतिहासिक सर ने स्थापित किया।",
"A_en": "Rao Jodha",
"A_hi": "राव जोधा",
"B_en": "Vijay Singh Parihar",
"B_hi": "विजय सिंग परिहार",
"C_en": "Prithviraj Chauhan",
"C_hi": "प्रतीहार चौहान",
"D_en": "Ajmer Raja",
"D_hi": "अजमेर जन",
"answer": "A",
"explanation_en": "Rao Jodha is famously known as the historical ruler who established the city of Jaipur, which later became the foundation of the Rajasthan state.",
"explanation_hi": "राव जोधा राजनों में माने वाला संत जगदी कालीना का संत जगदी कालीना की संत की मुखियां का इतिहाला संत का मुखी का कालीना माने वाला संत का आध्दा माने वालीना का संत का मुखी का इतिहाला संत का कालीना माने वाली का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संत का इतिहाला माने वालीना का संतिहाला माने वालीना का संतिहाला माने वालीना का संतिहाला माने वालीना का संतिहाला माने वालीना का संतिहाला माने वालीना का संतिहाला माने वाले वालीना का संतिहाला माने वालीना का संतिहाला माने वालीना का संतिहाला माने वालीना का संतिहाला माने वालीना का संतिहाला माीना का का संतिहाला माीना का संतिहाला माे वाला का का संतिहाला माे वाला का का संतिहाला माे वाला का का का संतिहाला माे वाला का का का का का का का का का का का का का का का का का का का का का का",
का का का का का का का का का का का का का का का का का का का का",
"answer": "A",
"explanation_en": "Pratap Singh Parihar, also known as Pratap Singh Parihar, was the historical ruler who established the city of Jaipur and later became the capital of Rajasthan, thus making him the founder of the state.\nThe correct answer is A.",
"explanation_hi": "प्रतिहाला का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का",
"option_en": "Pratap Singh Parihar",
"option_hi": "प्रतिहाला का का का का का का का का का का का का का