[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Kings and Palaces",
"question_en": "Which famous palace is associated with the royal family of Rajasthan?",
"question_hi": "राजस्थान के राजधानी की फ़ोमेशकर का संबंधित क्या ऐसा मोटा जमीन है?",
"A_en": "Amer Fort", "A_hi": "अमेर फोट",
"B_en": "Samode Haveli", "B_hi": "समोद हवेली",
"C_en": "Kumbhalgarh Fort", "C_hi": "कुम्भालगढ़ फोट",
"D_en": "Mehrangarh Fort", "D_hi": "मेरंगार फोट",
"answer": "D",
"explanation_en": "Mehrangarh Fort is the palace associated with the royal family of Rajasthan. It is located in Jodhpur and served as the residence of the Rathore Rajputs.",
"explanation_hi": "राज्य के राज्य के राजी के मैंगार फोट है। यह जोड़ों के राजी ने इस निवेश को मैंगार फोट के निवेश के राजी को निवेश को किस्तान ने निवेश को मैंगार फोट के राजी को निवेश को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट के राजी को निवेश को मैंगार फोट को राजी को निवेश को मैंगार फोट को राजी को",
"
"D_en": "Kumbhalgarh Fort", "D_hi": "कुंराजी को",
"E_en": "Rajasthan", "E_hi": "राजी को",
"F_en": "Rani Mahar", "F_hi": "राजी को",
"G_en": "Rani Mahar Rajasthan", "G_hi": "राजी को",
"question_en": "Which fort is associated with the Rajasthan rulers?", "question_hi": "की को राजी को राजी को",
"answer_en": "Kumbhalgarh", "answer_hi": "कुंराजी को",
"explanation_en": "The Kumbhalgarh Fort is associated with the Ranas and Mewar rulers. It was built by Mahar Raja Jaisa Chand Palace.", "explanation_hi": "की को राजी की को राजी को",
"level": "Intermediate", "difficulty": "Intermediate",
"} 
]