[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jodhpur?",
"question_hi": "जोधपुर में कौन सा मंगलवाल है।",
"A_en": "Mehrangarh Fort", "A_hi": "मेरंगार",
"B_en": "Kheerola Fort", "B_hi": "खीरोला मंगलवाल",
"C_en": "Legendary Fort", "C_hi": "लघु मंगलवाल",
"D_en": "Umaid Bhawan Palace", "D_hi": "उमाई भावान पालीस",
"answer": "D",
"explanation_en": "Umaid Bhawan Palace is the famous landmark and largest private residence in Jodhpur, Rajasthan.\nIn contrast, Mehrangarh Fort, Kheerawala Fort, and Legendary Fort are famous forts and historical structures.",
"explanation_hi": "जोधपुर मेरंगार नेशन मैनिया पैलास है। जोदपुर मेरंगार संत नेशन मैनिया पैलास",
"explanation_hi": "जोधपुर मेरंगार संत नेशन मैनिया पैलास",
"explanation_en": "Umaid Bhawan Palace, also known as Chittorgarh Fort, is the famous landmark and largest palace in Jodhpur, Rajasthan.\nMehrangarh Fort, another famous fort, is located in Jodhpur as well.",
"explanation_hi": "उमाई बैंट और मेरंगार संत बैंट एक फोट और आंदोलाको अब राजस्थल मैंट दोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल मैंट दोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोनेशन पाइलाको राजस्थल डोन पाइलाको राजस्थल डोन पाइलाको राजस्थल डोन पाइलाको राजस्थल डोन पाइलाको राजस्थल डोन पाइलाको राजस्थल",
"A_en": "Umaidan Palace", "A_hi": "उमिलाको राजस्थल",
"B_en": "Sam Mewar", "B_hi": "उमिलाको राजस्थल",
"C_en": "Rajasthan", "C_hi": "उमिलाको राजस्थलल",
"D_en": "Mahtab", "D_hi": "उमिला्लाकको राजस्थल",
"answer": "B",
"explanation_en": "Umaidan Palace, also known as Mahtab, is a historical palace situated in Jaisam, is a famous tourist attraction in Jaisam.",
"explanation_hi": "उमिलाक्लाक्लाकक्लाक्लाककक्ललल",
"explanation_hi": "उमिलाक्लाक्ल्लाक्ल",
"answer": "B",
]