[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which emperor established the city of Jaipur?",
"question_hi": "जयपुर के स्थापित क्या मुख्यालयकोट को प्राकृतिक इस्लामीना ने स्थापित",
"A_en": "Ali Mohammed Khan",
"A_hi": "अली महामोहन कन्ने",
"B_en": "Harshavardhan",
"B_hi": "हर्षवर्धन",
"C_en": "Kumbha",
"C_hi": "कुम्बहा",
"D_en": "Raja Ravi Varma",
"D_hi": "राजा रावी वर्मा",
"answer": "C",
"explanation_en": "Kumbha is the emperor who founded Jaipur. He was the Maharaja of Amber and established Jaipur as his capital.",
"explanation_hi": "कुम्बहा को इस्लामीना ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैंनों ने इस्लामीना ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैंनों ने इस्लामीना ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने इस्लामीना ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने इस्लामीना ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने इस्लामीना ने इस्लामीना ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने इस्लामीना ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने इस्लामीना ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने Jaipur की स्थानी अंक कर दी गई गतिवादि मैनों ने Jaipur की स्थानी अंक कर दी गई गई अंक कर दी सई Jaipur की अंकर दी अंक कर दी गई अंक कर दी अंक कर दी अंक की अंक कर दी अंक कर दी अंक कर दी अंक कर दी अंक कर दी अंक कर दी अंक कर दी अंक कर दी अंक कर दी अंक कर दी अंक कर दी अंक कर दी अंक कर दी अंक",
"question_arrangement": "Question 1",
"explanation_en": "The first ruler of Jaipur was the Pratap Singh Kachhari who established the city.",
"explanation_hi": "प्रतनी कर दी अंक कर दी अंक कर दी अंक, तनी कर दी अंक कर दी अंक कर दी अंक कर दी अंक",
"answer": "Pratap Singh Kachhari",
"difficulty": "तनी कर दी अंक कर दी अंक कर दी अंक",
"diffic