[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jaipur?",
"question_hi": "जयपुर में कौन-सा महत्ता है।",
"A_en": "Amber Fort", "A_hi": "आंबे मंदिर",
"B_en": "Hawa Mahal", "B_hi": "हावा मंदिर",
"C_en": "Cenotaphs of the Royal Family", "C_hi": "राजा के मंत्र",
"D_en": "Pratapgarh Fort", "D_hi": "प्रतपगढ़ मंदिर",
"answer": "B",
"explanation_en": "Hawa Mahal is a famous landmark located in Jaipur, known for its honeycomb pattern architecture.\nIn Hindi, it translates to 'Palace of Winds'.",
"explanation_hi": "हावा मंदिर राजगढ़ मंदिर को जानने के लोकप्रधानमंडल में गढ़ मंदिर का स्पष्ट संदेश है, जहाँ उच्च मैंडल में होता है।",
"explanation_hi": "जानने के लोकप्रधानमंडल में अपना स्पष्ट संदेश होता है, जहाँ उच्च मैंडल में होता है।",
"answer": "B",
"explanation_en": "The Jantar Mantar is a famous astronomical observatory built by Maharaja Jai Singh II in Jaipur. It is one of the largest and most accurate stone observatories of its kind in the world.\nIn Hindi, it translates to 'जैनता मानता होता है, जो महाराजा जैनिका जिंगी II ने बन्नेंगी मानता होता है, जिसे सबसी दिलालकाम की एक विश्वभूमंत्रों की एक सबसी दिलालकाम है।",
"question_hi": "जैनिका जैंगी II ने बन्नेंगी की एक विश्वभूमंत्रों की एक सबसी दिलालकाम है।",
"options_en": [
{
"option": "A",
"option_text": "Meena Bazar",
"option_explain": "Meena Bazar is a popular market in Jaipur."
},
{
"option": "B",
"option_text": "Jantar Mantar",
"option_explain": "जैनिका जैंगी II ने बन्नेंगी की एक विश्वभूमंत्रण है।",
"option_explain_hi": "जैनिका जैंगी II ने बन्नेंगी की एक विश्वभूमंत्रण है।"
},
{
"option": "C",
"option_text": "Hawa Mahal",
"option_explain": "Hawa Mahal is a famous palace in Jaipur designed for admiring the beauty of the city."
},
{
"option": "D",
"option_text": "Birla Planetarium",
"option_explain": "बिला केटेनमंत्रण है।"
}
],
"answer": "B",
"explanation_en": "Jainik II built Jantar Mantar, a famous astronomical instrument.",
"answer_hi": "जैनिका जैनिका जैन मंत्र केटेन केटर बिला केटेन सन मंत्र दुन सन का जैन मंत्र बिला केटेन का जैन मंत्र बिला केटेन सन का जैन मंत्र बिला का जन मंत्र बेटेन सन का जैन मंत्र बिला का जन मंत्र बिला का जन मंत्र बिला का जन मंत्र बेटर बिला का जन मंत्र बिला का जन मंत्र बिला का जन मंत्र बिला का जन मंत्र बिला का जन मंत्र बिला का जन मंत्र बिला का जन मंत्र बिला का जन मंत्र बिला का जन मंत्र बिला का जन मंत्र बिला का जन मंत्र बिला का जन मंत्र बिला का जन मंत्र बिला जन मंत्र बिला का जन मंत्र बिला जन मंत्र बिला का जन मंत्र बिला का जन मंत्र बिला का जन मंत्र बिला जन मंत्र बिला जन मंत्र बिला का जन मंत्र बिला जन मंत्र बिला जन मंत्र बिला जन मंत्र बिला जन मंत्र