[
{
"subject": "Rajasthan History",
"topic": "Rajput Clans",
"question_en": "Which Rajput clan ruled Jaipur from 1876 to 1947?",
"question_hi": "जयपुर के बाजपुरी क्षत्रज्ञान 1876 तक 1947 तक संभाग को लागू करने वाले क्षत्रज्ञान क्या थे।",
"A_en": "Kachhwaha",
"A_hi": "कचहावा",
"B_en": "Rathore",
"B_hi": "रत्नागिरी",
"C_en": "Bikrami",
"C_hi": "बिक्रामी",
"D_en": "Chauhan",
"D_hi": "चौहान",
"answer": "A",
"explanation_en": "The Kachhwaha Rajputs were the rulers of Jaipur from 1876 to 1947. They belong to the Amber branch of the Kachhwaha clan. The Kachhwaha Rajputs were led by Maharaja Sawai Man Singh I and later by his grandson Maharaja Ram Singh II. They were the erstwhile rulers of Jaipur before the British established a direct rule over the city.",
"explanation_hi": "केसर की जैसार राजपूतों के अंगीज़हा बाजार से जैसार राजपूतों ने Jaipur में 1876 से 1947 तक द्वारा उत्तराण
[object Object]
{
"subject": "Rajasthan History",
"topic": "Rajput Clans",
"question_en": "Which Rajput clan ruled over Jaipur before the establishment of British rule?",
"question_hi": "जैसार राजपूतों ने जैसार राजपूतों ने जैसार के राजपूतों ने जैसार राजपूतों ने Jaipur में क्या राजपूत राजपूतों ने Jaipur में क्या राजपूत राजपूतों ने Jaipur में राजपूतों ने Jaipur में क्या राजपूत राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में क्या राजपूत राजपूतों ने Jaipur में राजपूतों ने Jaipur में निवास किया राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में निवास किया राजपूतों ने Jaipur में राजपूतों ने Jaipur में निवास किया राजपूतं ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूतों ने Jaipur में राजपूते Jaipur में राजपूतों ने Jaipur में राजपूते Jaipur में राजपूते Jaipur में राजपूते Jaipur में राजपूते Jaipur में राजपे Jaipur में राजपूते Jaipur में राजपूते Jaipur में राजपे Jaipur में राजपूते Jaipur में राजपूते Jaipur राजपूते Jaipur में राजपूते Jaipur में राजपूते Jaipur राजपूते Jaipur राजपूते Jaipur राजपूते Jaipur राजपूते Jaipur राजपूते Jaipur राे Jaipur राजे Jaipur राजपूते Jaipur राजपूते Jaipur राे Jaipur राजपूते Jaipur राजपूते Jaipur राजपे Jaipur राे Jaipur राजपे Jaipur राजपे Jaipur राजपे Jaipur राे Jaipur राजपे Jaipur राजपे Jaipur राजपे Jaipur राे Jaipur राजपे Jaipur राे Jaipur राजपे Jaipur राजपे Jaipur राजपे Jaipur राे Jaipur राजपे Jaipur राे Jaipur राजपे Jaipur राजपे Jaipur राे Jaipur राजपे Jaipur राे