[
{
"subject": "Rajasthan History",
"topic": "Rajasthan Capital",
"question_en": "What was the capital of Rajasthan until 1929?",
"question_hi": "राजस्थान की 1929 तक राजधानी क्या थी ?",
"A_en": "Ajmer", "A_hi": "आजमीर",
"B_en": "Dausa", "B_hi": "दौसा",
"C_en": "Jodhpur", "C_hi": "जोधपुर",
"D_en": "Alwar", "D_hi": "अलवार",
"answer": "C",
"explanation_en": "Jodhpur was the capital of Rajasthan until 1929. After that, the capital was shifted to Jaipur.",
"explanation_hi": "जोधपुर राजस्थान की 1929 तक राजधानी थी। बाद मंगलम से राजधानी की वर्तमान मंगलम है।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan Mewar Kingdom",
"question_en": "Which king established the Mewar kingdom in Rajasthan?",
"question_hi": "राजस्थान मेवार के किसी समाजगत की स्थान है।",
"A_en": "Chhattrapati Rana Kumbha",
"A_hi": "चत्रापी रानी कुम्ब्ह",
"B_en": "Pratap Singh",
"B_hi": "प्रताप सिंग",
"C_en": "Rana Kumbha",
"C_hi": "रानी कुम्ब्ह",
"D_en": "Rana Pratap Singh",
"D_hi": "प्रताप सिंग",
"answer": "C",
"explanation_en": "Pratap Singh, also known as Rana Kumbha, established the Mewar kingdom in Rajasthan.",
"explanation_hi": "प्रताप सिंग, योंकि एक मेवार संतुल की संतुलाने राजस्थान मेवार संतुल की संतुलाने ने राजस्थान मेवार संतुलाने के आपदा मेवार संतुलाने के आप्दा मेवार संतुलाने के आपदा मेवार संतुलाने के आप्दा मेवार संतुलाने के आपदा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने के आप्दा मेवार संतुलाने आप्दा मेवार संतुलाने के आप्दा मेवार संतुलानलाने आप्दा मेवार संतुलानलानलानलाने आप्दा मेवार संतुलानलाने आप्दा मेवार संतुलानला",
 आप्दा मेवार संतुलाने आप्दा मेवार संतुलाने आप्दा मेवार संतुलाने आप्दा मेवार संतुलाने आप्दा मेवार संतुलाने आप्दा मेवार संतुलाने आप्दा मेवार संतुलाने आप्दा मेवार संतुलाने आप्दा मेवार संतुलाने आप्दा मेवार संतुलाने आप्दा मेवार संतुलाने आप्दा मेवार संतुलाने आप्दा मेवार संतुलाने आप्दा मेवार संतुलाने आप्दा मेवा