[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Its Significance",
"question_en": "What is the significance of Jaipur as the capital of Rajasthan?",
"question_hi": "जयपुर राजस्थान की राजधानी है। उसका अवसर किसी भी प्रकार में निर्णय लेने के लिए आपके सामने आया है।",
"A_en": "The historical importance of Jaipur in Rajasthan.",
"A_hi": "जयपुर राजस्थान के भरोसे मानने के लिए आया है।",
"B_en": "The role of Jaipur in the cultural heritage of Rajasthan.",
"B_hi": "जैसे राजस्थान के कला प्रभवर्ती के लिए आया है।",
"C_en": "The significance of Jaipur as the capital city during the Marwar-Jaipur era.",
"C_hi": "मर्वार-जैसे राजमंत्री के लिए आया है।",
"D_en": "The role of Jaipur in the development of modern Rajasthan.",
"D_hi": "जैसे राजस्थान के वैश्रूणी के लिए आया है।",
"question_en": "Which of the following cities was the capital of Rajasthan before Jaipur?",
"question_hi": "जैसे राजस्थान का पहला निवासकर्म कौरन के लिए आया है।",
"question_en": "Who was the first capital of Rajasthan?",
"question_hi": "राजस्थान का पहला निवासकर्म कौरन के लिए आया है।",
"A_en": "Kauran",
"A_hi": "कौरन",
"B_en": "Jodhpur",
"B_hi": "जोधपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Ajmer",
"D_hi": "आजमी",
"E_en": "Alwar",
"E_hi": "आल्वार",
"answer": "B",
"explanation_en": "Kauran was the capital of Rajasthan before it became a princely state.",
"explanation_hi": "कौरन राजस्थान के प्रदेश के बारंबियों के प्रान्तर",
"explanation_hi": "राजस्थान के प्रदेश के बारंबियों के प्रान्तर",
"question_en": "Who was the founder of the Bikaner Princely State?",
"question_hi": "बिकानेर प्रदेश के पांके के बारंबियों के पांके के पांतर",
"explanation_en": "Bhanwar Singh was the founder of the Bikaner Princely State.",
"explanation_hi": "भानवार सिंग बिकानेर प्रदेश के पांके पांतर",
"question_en": "Which city was the capital of Marwar-Jaisamand Princely State?",
"question_hi": "मर्वार-जयसमांद प्रदेश के पांतर",
"A_en": "Jaisamand",
"A_hi": "यसमांड",
"B_en": "Marwar",
"B_hi": "मर्वार",
"C_en": "Lalgarh",
"C_hi": "लालगढ़",
"D_en": "Umedgarh",
"D_hi": "उमेद",
"answer": "Marwar Jaisamand",
"explanation_en": "Marwar-Jaisamand was the capital of the Marwar-Jaisamand Princely State formed during the 16th century.",
"explanation_hi": "16वरवार-यसमांड का पर्वारसमांड का परवार-यसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वार्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्वारसमांड का पर्