[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which Mughul Emperor was succeeded by Jai Singh II in 1707?",
"question_hi": "1707 में Jai Singh II की स्थापना करने वाला मुगल समाजवादी कौन थे ?",
"A_en": "Qutbuddin Aibak",
"A_hi": "कुत्तूदीनाथ Aibak",
"B_en": "Ibrat Khan",
"B_hi": "इब्राट ख़ान",
"C_en": "Aurangzeb",
"C_hi": "अर्थंगोल",
"D_en": "Kalhora",
"D_hi": "कल्होरा",
"answer": "Ibrat Khan",
"explanation_en": "Ibrat Khan, also known as Ibrat Khan, was the Mughal Emperor who was succeeded by Jai Singh II in 1707. He ruled from 1699 to 1707.",
"explanation_hi": "ये, यूर्त्तिज 1707 के बाद Jai Singh II के परम्पति थे। उन्हें बाजाना शुरू करने वाले थे 1699 का वर्ष मैं हैं।",
"C_hi": "ये, यूर्तिज 1707 के परम्पति के बाजाने वाले थे 1699 का वर्ष मैंहैं।",
"D_en": "Ortij was succeeded by Jai Singh II in 1707 after ruling for 10 years since 1699.",
"D_hi": "यूर्तिज 1707 के परम्पति के बाजाने वाले थे 1699 का वर्ष मैंहैं।",
"question_en": "Who was the last Mughal Emperor of Delhi before the establishment of the Sultanate of Marwar?",
"question_hi": "दिल्ली के प्रधान मुगल मुग्ल को मौरौ का सत्तारी मुगल मुग्ल के प्रधान मुग्ल को प्रातिसंत्तारी मुगल मुग्ल के प्रधान मुगल मुगल के प्रातिसंत्तारी मौरौ को प्रातिसंत्तारी मौरौ के प्रातिसंत्तारी मुग्ल मुगल मौरौ के प्रातिसंत्तारी मौरौ के प्रातिसंत्तारी मौरौ के प्रातिसंत्तारी मौरौ के प्रातिसंत्तारी मौरौ के प्रातिसंत्तारी मौरौ के प्रातिसंत्तारी मौरौ के प्रातिसंत्तारी मौरौ के प्रातिसंत्तारी मौरौ के प्रातिसंतारी मौरौ के प्रातिसंतारी मौरौ के प्रातिसंतारी मौरौ के प्रातिसंतारी मौरौ के प्रातिसंतारौ के प्रातिसंतारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्रातारौ के प्राता