[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous forts and palaces are located in Jaipur?",
"question_hi": "जयपुर में प्रमोटों और घरेलों kaise बताते हैं?",
"A_en": "Amer Fort", "A_hi": "Amer में प्रमोट है।",
"B_en": "Hawa Mahal", "B_hi": "Hawa महाल है।",
"C_en": "Cenotaph of Maharaja Ram Singh", "C_hi": "महाराजा महिंद्र सिंग के पंजाबी में है।",
"D_en": "Palace of Winds", "D_hi": "हैवाट्स के पर्चित है।",
"answer": "B",
"explanation_en": "Hawa Mahal is a famous palace located in Jaipur known for its unique architecture and design.\nHawa Mahal जैवाट्स के पर्चित है।",
"explanation_hi": "Hawa Mahal जैवाट्स के पर्चित है।"
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who was the first Maharaja of Rajasthan?",
"question_hi": "राजस्थान की पहली महाराजा किसी थी।",
"A_en": "Rao Jodh Singh", "A_hi": "रावणीय महाराजकर राउंड्स के आशा थिे थीं।",
"B_en": "Rao Raja Bhim Singh", "B_hi": "रावणी महाराजकर राउंड्स के आशा थिे थिे।",
"C_en": "Rao Jodh Singh", "C_hi": "राउंड्स के आशा थिे थिें।",
"D_en": "Rao Kailash Singh", "D_hi": "राउंड्स के आशा थिें।",
"answer": "C",
"explanation_en": "Rao Jodh Singh was the first Maharaja of Marwar, which later merged with the kingdom of Rajasthan after the death of Rao Kishangarh.\nRao Jodh Singh मारवार के महाराजकर के आशा थिें।",
"explanation_hi": "रावणी के महाराजकर के आशा थिें।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan State",
"question_en": "In what year did Rajasthan become a princely state?",
"question_hi": "राजस्थान कब सरकारीणी के भूमित्र बने थिें।",
"A_en": "1949", "A_hi": "1949",
"B_en": "1956", "B_hi": "1956",
"C_en": "1947", "C_hi": "1947",
"D_en": "1945", "D_hi": "1945",
"answer": "C",
"explanation_en": "Rajasthan became a princely state in 1947 after India's independence from British rule and the merger of the Rathore dynasty with the Indian Union.",
"explanation_hi": "राजस्थान द्वांती विद्यांतिती के बहुंती के विद्यांती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बहुंती के बही के बहुंती के बही के बही के बहती के बहंती के बही के बही के बहंती के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के बही के