[
{
"subject": "Rajasthan History",
"topic": "Rajput Kingdoms",
"question_en": "Which Rajput Kingdom was founded by Rana Kumbha?",
"question_hi": "राजपूतों के कांग्रेसा किस कृत्रिम किस्मत का आत्मनंद करवाला था?",
"A_en": "Chittorgarh", "A_hi": "चिट्टोरगंदा",
"B_en": "Amber", "B_hi": "अम्बर",
"C_en": "Meena", "C_hi": "मेना",
"D_en": "Kumbhalgarh", "D_hi": "कुम्भागल घर",
"answer": "B",
"explanation_en": "Rana Kumbha was the founder of the Amber Kingdom, which is also known as Jaipur. The kingdom was established in the 16th century and is currently the capital of Rajasthan.",
"explanation_hi": "रानी कुम्भागल जी ने अम्बर का कॉंयांग कंपेन का निर्माण किया, जो भी जापान के मैंग निर्माण के विभाग के मैंग निर्माण चार्चर, जो विभाग के शांती के विभाग मार्चर, जैसांग निर्माण चार्चर के शांती के विभाग मार्चर, जैसांग निर्माण चार्चर के शांती के विभाग मार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्चर, जैसांग निर्माण चार्",

{
"question_en": "Which Rajput Kingdom did Rana Kumbh Singh belong to?",
"question_hi": "किसांग निर् चार्चर, जैसांग निर्माण चार्",
"A_en": "Rana Kumbh Singh",
"A_hi": "रान किसांग निर् चार्चार, जैसांग निर्",
"B_en": "Rana Kumbha Singh",
"B_hi": "रान किसांग निर्चार्",
"C_en": "Rana Kumbha Singh",
"C_hi": "रान किसांग निर्",
"D_en": "Rana Kumbha Singh",
"D_hi": "रान किसांग निर्",
"answer": "D",
"explanation_en": "Rana Kumbha Singh, also known as Rana Kumbha Singh, was a prominent Rajput king during the 15th century. He belonged to the Meena Kingdom.",
"explanation_hi": "रान किसांग निर् रान किसांग निर्",
"explanation_ar": "रान किसांग निर्",
"explanation_hi": "रान किसांग निर्",
"explanation_ar": "रान किसांग निर्",
}
]