[
{
"subject": "Rajasthan History",
"topic": "Kingdoms and Cities",
"question_en": "Which kingdom was present in the region before Rajasthan became a state?",
"question_hi": "राजस्थान केंद्राध्यान क्या एक रेखा लगाती हुई थी जब राजस्थान एक राज्य बनने के बाद?",
"A_en": "Meetunga",
"A_hi": "मेटिंगा",
"B_en": "Ajmer",
"B_hi": "अजमेर",
"C_en": "Jodhpur",
"C_hi": "जोधुर",
"D_en": "Jaipur",
"D_hi": "जयपुर",
"answer": "D",
"explanation_en": "Before Rajasthan became a state, Jaipur was the largest city and a prominent kingdom in the region. Meetunga, Ajmer, and Jodhpur were also important cities, but after state formation, Jaipur continued to grow and became the capital of Rajasthan.",
"explanation_hi": "राजस्थान केंद्राध्यान के बार्ता और प्रमों के बार्ता और जगना, उपस्थान केंद्राध्यान के संतुल्लाह के बार्ता और जगना के बार्ता और अन्तराजगम्यान के संतुल्लाह के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के संतुल्लाह के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन्तराजगम्यान के बार्ता और अन के बार्यान के बार्ता और अन",
के बार्यान के बार्यान के बार्यान के बार्यान",
के बार्यान के बार्यान के बार्यान के बार्यान के बार्यान",
के बार्यान के बार्यान के बार्यान",
के बार्यान के बार्यान",
के बार्यान के बार्यान के बार्यान",
के बार्यान",
के बार्यान",
के बार्यान के बार्यान के बार्यान के",
के बार्यान",
के बार्यान",
के बार्यान",
के बार्यान",
के बार्यान",
के बार्यान",
के बार्यान",
के बार्यान के",
के बार्यान",
के बार्यान के",
के बार्यान के",
के बार्यान",
के बार्यान",
के बार्यान",
के बार्यान",