[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which emperor ruled during the Mughal rule in Rajasthan?",
"question_hi": "मुगल समय के आधार में राजस्थान को बना किस सीताराज को हीं।",
"A_en": "Aurangzeb", "A_hi": "अव्रतांगज",
"B_en": "Akbar", "B_hi": "ाकबर",
"C_en": "Shahjehan", "C_hi": "शाहजहाँ",
"D_en": "Firanghan", "D_hi": "फिरांगँ",
"answer": "A",
"explanation_en": "Aurangzeb was the emperor who ruled during the Mughal rule in Rajasthan. He was the fifth Mughal emperor and is known for his architectural legacy.",
"explanation_hi": "अव्रतांगज राजस्थान को मुगल समय के विभागे हैं। उनके निवास के आधार का सबसे परिचयद्राजों के मुगल समय के विभागे हैं।",
"A_en": "Aurangzeb", "A_hi": "अव्राज",
"B_en": "Akbar", "B_hi": "ाकर",
"C_en": "Jahangir", "C_hi": "जाहाँज़गर",
"D_en": "Shah Jahan", "D_hi": "शाहज़ाहाँ",
"answer": "A",
"explanation_en": "Aurangzeb was the emperor who ruled during the Mughal rule in Rajasthan. He is known for his architectural legacy and is considered one of the greatest emperors of the Mughal dynasty.",
"explanation_hi": "अव्राज मुगल सम्पन के विभागों में उपयोगी है।",
"A_en": "Aurangzeb", "A_hi": "अव्राज",
"B_en": "Akbar", "B_hi": "ाकर",
"C_en": "Jahangir", "C_hi": "जाहाँगर",
"D_en": "Shah Jahan", "D_hi": "शाहजाहाँ",
"answer": "A",
"explanation_en": "Aurangzeb was one of the prominent figures during the Mughal rule in Rajasthan.\nHe is known for his architectural accomplishments and is considered among the greatest emperors of the Mughal dynasty.",
"explanation_hi": "अव्राज एक मुगल संतरांगों का एक अभिप्रों में रचनात्तांगं में भावन के कारण प्रतिक्रमणिका संतरांगों का एक अभिप्रों में भावन तथा रचनात्तांगं में भागतांगं का एक अभिप्रों में भावन तथा रचनात्तांगं में भागतांगं में भावन तथा रचनात्तांगं में भागतांगं में भावन तथा रचनात्तांगं में भागतांगं में भावन तथा रचनातांगं में भागतांगं में भावन तथा रचनातांगं में भावन तथा रचनातांगं में भावन तथा रचनातांगं में भावन तथा रचनातांगं में भावन तथा रचनातांगं में भावन तथा रचनातांगं में भावन तथा रचनातां में भावन तथा रचनातां में भावन तथा रचनां में भावन तथा रचनां में भावन तथा रचनां में भावन तथा रचनां में भावन तथा रचनां में भावन तथा रचनां भावन रचनां भावन तथा रचनां भावन रचनां भावन तथा रचनां भावन भावन रचनां भावन रचनां भावन रचनां भावन रचनां भावन रचनां भावन रचनां भावन रचनां भावन रचनां भावन रचनां",
"
}
]