[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following battles took place between Rajput and Mughal forces during the Mughal period in Rajasthan?",
"question_hi": "राजपूतों और मुगल सेवा के बीच राजस्थान में मुगल समय से मंगल के बीच निम्नलिंग किया गया है।",
"options": [
{
"option_text_en": "Battle of Haldighati (1576)",
"option_text_hi": "हालदगढ़ीघर (1576)",
"option_key": "haldighati_battle"
},
{
"option_text_en": "Battle of Hanumangarh (1562)",
"option_text_hi": "हंनुमांगर (1562)",
"option_key": "hanumangarh_battle"
},
{
"option_text_en": "Battle of Saragarhi (1897)",
"option_text_hi": "सरागड़री के बैलेंट (1897)",
"option_key": "saragarhi_battle"
},
{
"option_text_en": "Battle of Ajmer (1460)",
"option_text_hi": "अजमेर (1460)",
"option_key": "ajmer_battle"
},
{
"option_text_en": "Battle of Gujarat (1527)",
"option_text_hi": "गुजरात (1527)",
"option_key": "gujarat_battle"
}
],
"answer": "saragarhi_battle",
"explanation_en": "The Battle of Saragarhi took place in 1897 between the Rajput tribes and the British East India Company. In this battle, 21 Sikh soldiers from the 36 Sikh Regiment defended the Saragarhi Fort against a much larger force of Afghan raiders.",
"explanation_hi": "सराग्रही को 1897 में राजपूत और बीस किम इंडी का सूचना क्रम में सराग्रही से बीस किम इंडिया का सूचना क्रम, आपसंग को मंग की बीस किम्या इंडी इंडिया का सूचना क्रम, आपसंग को मंग की बीस किम्या इंडी इंडिया का सूचना क्रम, आपसंग को मंग की बीस किम्या इंडिया इंडी का सूचना क्रम, आपसंग को मंग की बीस किम्या इंडी इंडी का सूचना क्रम, आपसंग को मंग की बीस किम्या इंडी इंडी का सूचना क्रम, आपसंग को मंग की बीस किम्या इंडी इंडी का सूचना क्रम, आपसंग को मंग की बीस किम्या इंडी इंडी का सूचना क्रम, आपसंग को मंग की बीस किम्या इंडी इंडी का सूचना क्रम, आपसंग को मंग की बीस किम्या इंडी इंडी का सूचना क्रम, आपसंग को मंग की बीस किम्या इंडी इंडी का सूचना क्र्म, आपसंग को मंग की बीस क्र्म, आपसंग को मंग की बीस क्र्म, आपसंग को म्र्म, आपसंग की बीस क्र्म, आपसंग को म्र्म, आपसंग की बीस क्र्म, आपसंग की बीस क्र्म",
 आपसंग की बीस क्र्म, आपसंग की बीस क्र्म",
आपसंग की बीस क्र्म, आपसंग की बीस क्र्म",
आपसंग की बीस क्र्म, आपसंग की बीस क्र्म",
आपसंग की बीस क्र्म",
आपसंग की बीस क्र्म",
आपसंग की बीस क्र्र्म",
आपसंग की बीस क्र्र्र्र्म",
आपसंग की बीस क्र्र्रम",
आपसंग की बीस क्र्र्र्रम",
आपसंग की बीस क्र्र्र्रम",
आपसंग की बीस क्र्र्रम",
आपसंग की बीस क्र्र्रम",
आपसंग