[
{
"subject": "Rajasthan History",
"topic": "Meera Temple",
"question_en": "Which temple is dedicated to Meera Bai in Jaipur?",
"question_hi": "जयपुर मेरा बै के विवाहित मंदिर का नाम क्या है?",
"A_en": "Govind Dev Ji Temple", "A_hi": "गोविंद देव जी मंदिर",
"B_en": "Mukhija Temple", "B_hi": "मुखिजा मंदिर",
"C_en": "Govind Garh Fort", "C_hi": "गोविंद गाढ़",
"D_en": "Hawa Mahal", "D_hi": "हावा महाल",
"answer": "B",
"explanation_en": "The temple dedicated to Meera Bai in Jaipur is the Mukhija Temple.",
"explanation_hi": "Jaipur me Meera Bai ke liye Mukhija Mandir takin diya ga."
},
{
"subject": "Rajasthan History",
"topic": "Ranthambore Fort",
"question_en": "Which famous fort in Rajasthan is near Sawai Madhopur?",
"question_hi": "राजस्थान के मौली माधोपुर के नौ कित्तेंग के दूरी में सोपर भौती सिंग के कित्तेंग का दूरी में सोपर भौती सिंग को सोपर भौती सिंग के दूरी में सोपर भौती सिंग के जलवाला का जोपर विलवाला के आध्रा दूरी में को सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवाला का जोपर आध्रा दूरी में सोपर विलवा का जोपर आध्रा दूरििला का जिरा दूरी में सोपर विलिििला का जोपर आध्रा दूरििला का जोपर विला का जोपर और विला का जोपर का जोपर विला का जोपर विला का जोपर विला का जोपर विला का जिला का",
जिला का जोपर विला का जोपर विला का जोपर विला का जोपर विला का जोपर विला",
का जोपर विला का जोपर विला का जोपर विला",
का जोपर विला का जोपर विला",
का जोपर विला का जोपर विला",
का जोपर विला का जोपर विला",
का जोपर विला",
का जोपर विला",
का जोपर विला",
का जोपर विला",
का जोपर विला",
का जोपर विला",
का जोपर विला",