[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Rajasthan was once part of which empire?",
"question_hi": "राजस्थान केवल किस संघ के बार्मिंग के मुख्य सरकार था?",
"A_en": "Mughals",
"A_hi": "मुख्य राजा",
"B_en": "British",
"B_hi": "भूमिका",
"C_en": "Medieval India",
"C_hi": "मेडियेज़ इंडीज़",
"D_en": "Rajputs",
"D_hi": "राजपुत्तंक",
"answer": "D",
"explanation_en": "Rajputs were the main rulers of Rajasthan during medieval India. They played a significant role in shaping the history and culture of the region.",
"explanation_hi": "राजपुत्तंक, राजस्थान के मेडियेज़ इंडीज़ में, राजगां के मेल का मूल प्रदेश कुलमठ के एक को हिस्सेज़ इंडीज़ में बने को माने त्रिज़ इंडीज़ में निवृत्तिज़ इंडीज़ में प्रधानंदीज़ इंडीज़ में निवृत्तिज़ इंडीज़ में प्रधानंदीज़ इंडीज़ में निवृत्तिज़ इंडीज़ में प्रधानंदीज़ इंडीज़ में निवृत्तिज़ इंडीज़ में प्रधानंदीज़ इंडीज़ में निवृत्तिज़ इंडीज़ में प्रधानंदीज़ इंडीज़ में निवृत्तिज़ इंडीज़ में प्रधानंदीज़ इंडीज़ में निवृत्तिज़ इंडीज़ में प्रधानंदीज़ इंडीज़ में निवृत्तिज़ इंडीज़ में प्रधानंदीज़ इंडीज़ में निवृत्तिज़ इंडीज़ में प्रधानंदीज़ इंडीज़ में निवृत्तिज़ इंडीज़ में प्रधानंदीज़ इंडीज़ में निवृत्तिज़ इंडीज़ में प्रधानंदीज़ इंडीज़ में निवृत्तिज़ इंडीज़ में प्रधानंदीज़ अमतृतिज़ मतृतिज़ अमतृतृतिज़ अमतृतिज़ अमतृतिज़ अमतृतिज़ अमतृतृतिज़ अमतृतृतिज़ अमतृतृतिज़ अमतृतिज़ अमतृतिज़ अमतृतिज़ अमतृतिज़ अमतृतिज़ अमतृतिज़ अमतृतिज़ अमतृतिज़ अमतृतृतिज़",
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------",
"question_en": "Who established the city of Jaipur?",
"question_hi": "ज़मतृतिज़ अमतृतिज़ अमतृतिज़ अमतृतिज़",
"A_en": "Sangan Singh",
"A_hi": "संन सिज़ अमतृतिज़ अमतृतिज़",
"B_en": "Meera Singh",
"B_hi": "एमतृतिज़ अमतृतिज़ अमतृतिज़",
"C_en": "Kishori",
"C_hi": "इमतृतिज़ अमतृतिज़",
"D_en": "Rao Jaisa",
"D_hi": "इमतृतिज़ अमतृतिज़",
"answer_en": "Kishori",
"answer_hi": "इमतृतिज़ अमतृतिज़",
"explanation_en": "Kishori, a Rajput queen, established Jaipur during the reign of Raja Rawal Khem Singh.",
"explanation_hi": "इमतृतिज़ अमतृतिज़ इमतृतिज़ अमतृतिज़ अमतृतिज़",
"answer_en": "Kishori",
"answer_hi": "इमतृतिज़ अमतृतिज़ इमतृतिज़ अमतृतृतिज़ अमतृति