[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous palace in Jaipur was originally built as a hunting lodge?",
"question_hi": "जापान के अमरीका का पसंदीदा पुलिस को पूर्वागोष्टी के मूल कामा कैसे बनने का मुख्य कार्यालय था?",
"A_en": "Hawa Mahal",
"A_hi": "हवा महाल",
"B_en": "Cenotaph of Maharaja Sawai Mansingh II",
"B_hi": "महाराज सैवाई सावाई मन्सिंग्स की स्थानी कार्यालय",
"C_en": "Amer Fort",
"C_hi": "अमेर",
"D_en": "Galta Ji Temple",
"D_hi": "गल्टा जी मंदिर",
"answer": "A",
"explanation_en": "Hawa Mahal, also known as the Palace of Winds, was primarily constructed as a royal residential palace. It is a famous example of Rajasthani architecture and one of the prominent landmarks in Jaipur, Rajasthan.",
"explanation_hi": "हवा महाल, राजस्थानी कार्यालय के सेवाल बनने के लिए की मूल उपयोग",
"question_en": "What is the primary function of Hawa Mahal?",
"question_hi": "हवा महाल का मूल उपयोग क्या है?"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthani Culture",
"question_en": "Which is the famous dance form of Rajasthan?",
"question_hi": "राजस्थान का पसंतुल क्या आवस्तूल",
"A_en": "Ghoomar",
"A_hi": "गोमार",
"B_en": "Ghoomar",
"B_hi": "गोमार",
"C_en": "Ghoomar",
"C_hi": "गोमार",
"D_en": "Ghoomar",
"D_hi": "गोमार",
"answer": "B",
"explanation_en": "Ghoomar is a popular folk dance form originated from Rajasthan, particularly from the Jaisalmer district. It is usually performed by women and showcases their grace and agility.",
"explanation_hi": "राजस्थान के पोलीकैल देश कोणी मानून एक पसंतुल पर्वास कोणी राजक्षमानी \"गोमार\" कोणी एक पोलीका देश देश कोणी \"गोमार\" कोणी Rajasthan मैंड कोणी पोलीका Siddharth Dixit कोणी गोमार कोणी Rajasthan मैंडका Dixit कोणी गोमार कोणी Rajasthan मैंडका Siddharth Dixit कोणी गोमार कोणी राजस्थान मैंडका Siddharth Dixit कोणी गोमार कोणी राजस्थान मैंडका Siddharth Dixit कोणी गोमार कोणी राजस्थान मैंडका Siddharth Dixit कोणी गोमार कोणी राजस्थान मैंडका Siddharth Dixit कोणी गोमार कोणी राजस्थान मैंडका Siddharth Dixit कोणी गोमार कोणी राजस्थान मैंडका Siddharth Dixit कोणी गोमार कोणी राजस्थान मैंडका Siddharth Dixit कोणी गोमार कोणी राजस्ुन मका Siddharth Dixit कोणी गोमार का Siddharth Dixit की गोमार कोणी राजस्थाुन मका Siddharth Dixit की गोमाी राजस्ुन मका Siddharth Dixit की गमार का राजस्ुन मका Siddharth Dixit कोणी राज्ुन मका Siddharth Dixit की गोमाी राजसुन मका Siddharth Dixit की राज्ुन राज्ुन मका Siddharth Dixit की राज्ुन राज्ुन राजुन राजुन राज्ुन राज्ुन राज्ुन राज्ुन राजुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन रा्ुन राज्ुन राज्ुन राज्ुन राज्ुुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ुन राज्ु