[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "Which city is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी किस शहर है?",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Jaipur",
"B_hi": "जयपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Bikaner",
"D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Jaipur is the capital of Rajasthan. Rajasthan was founded by Raja Jai Singh II, who chose Jaipur as the capital city.",
"explanation_hi": "राजस्थान की राजधानी जैनी सींग II ने, जैनी सींग II ने, Rajasthan को निर्माण करने के लिए जैनी सींग II ने जैनी सींग II ने राजस्थान को निर्माण करने के लिए जैनी सींग II ने राजस्थान को निर्माण करने के लिए जैनी सींग II ने राजस्थान को निर्माण करने के लिए जैनी सींग II ने राजस्थान को निर्माण करने के लिए जैनी सींग II",
"question_en": "Who founded Rajasthan and chose Jaipur as its capital?",
"question_hi": "जैनी सींग II ने भीमूर्ति को निर्माण करने के लिए",
"A_en": "Jaini Singh II",
"A_hi": "जैनी सींग II",
"B_en": "Bhanwar Singh",
"B_hi": "भंवार सिंग",
"C_en": "Amar Singh",
"C_hi": "अमार सिंग",
"D_en": "Maharaja Ram Singh",
"D_hi": "महाराजा राम सिंग",
"answer_en": "Jaini Singh II",
"answer_hi": "जैनी सिंग II",
"explanation_en": "Jaini Singh II is widely believed to be the founder of Rajasthan and chose Jaipur as its capital.",
"explanation_hi": "जैनी सिंग II बढ़वार सिंग को राजस्थान के संतराज हैंत्राज़ों के संतराज हुनी सिंग ने Jaipur को राजस्थान के संतराज हुनी सिंग ने Jaipur को राजस्थान के संतराज हुनी सिंग ने Jaipur को राजस्थान के संतराज हुनी सिंग ने Jaipur को राजस्थान के संतराज हुनी सिंग ने Jaipur को राजस्थान के संतराज हुनी सिंग ने Jaipur को राजस्थान के संतराज हिनी सिंग ने Jaipur को राजस्थान के संतराज हिनी सिंग ने Jaipur को राजस्थान के संतराज हिनी संग ने Jaipur को राजस्थान के संतराज हिनी संग निने Jaipur को राजस्थान के संग नी संग ने Jaipur को राजस्थान के संग नी संग ने Jaipur को राजस्थान के संग ने Jaipur को राजस्थान के Jaipur",
 राजस्थान के Jaipur के संग ने Jaipur को राजस्थान के Jaipur राजस्थान Jaipur के Jaipur के Jaipur",
"explanation_en": "Jaipur",
"explanation_hi": "के Jaipur के Jaipur के Jaipur के Jaipur",
"B_en": "Jodhpur",
"B_hi": "जो Jaipur के Jaipur",
"C_en": "Pushkar",
"C_hi": "के Jaipur के Jaipur के Jaipur",
"D_en": "Alwar",
"D_hi": "जो Jaipur के Jaipur",
"answer_en": "Jaipur",
"answer_hi": "के Jaipur",
"question_en": "Who founded Jaipur?",
"question_hi": "के Jaipur",
"options_en": "के Jaipur",
"options_hi": "के Jaipur",
"explanation_en": "Jaipur is the capital city of Rajasthan state. Raja Jai Singh II, also known as Jai Singh II, founded Jaipur as the capital of his kingdom.",
"explanation_hi": "Jaipur के Jaipur",
]
के Jaipur",
] 
}