[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jodhpur?",
"question_hi": "जोधपुर में प्रमोजेंगं के कुछ प्रमोजेंगं के बार्इंटर्स:
{
"A_en": "Mehrangarh Fort", "A_hi": "मेरंगार",
"B_en": "Kheerola Fort", "B_hi": "खेरोला परसोच",
"C_en": "Rao Jodhaji's Fort", "C_hi": "राउ जोधाजी के फोटो",
"D_en": "Khejarli Fort", "D_hi": "खेजारली फोटो",
"answer": "A",
"explanation_en": "Mehrangarh Fort is a famous fort located in Jodhpur, Rajasthan.",
"explanation_hi": "जोधागाँ फोटो में राजस्थान में जोधाइगाँ फोटो में राजस्थान के मैंड़ को मैंड़ मैंड़ के मैंड़ में राजस्थान के मैंड़ के मैंड़ मैंड़ के मैंड़ मैंड़ मैंड़ के मैंड़ मैंड़ मैंड़ मैंड़ के मैंड़ मैंड़ मैंड़ मैंड़ मैंड़ मैंड़ मैंड़ मैंड़ मैंड़ मैंड़ मैंड़ मैंड़ मैंड़ मैंड़ मैंड़ मैंड़",
"question_en": "Which city is the capital of Rajasthan?",
"question_hi": "राजस्थान के किस्मान किस्मान",
"options": [
{
"option_key": "A",
"option_value": "Jodhpur"
},
{
"option_key": "B",
"option_value": "Jaisamand"
},
{
"option_key": "C",
"option_value": "Udaipur"
},
{
"option_key": "D",
"option_value": "Jhunjhunu"
}
],
"answer_key": "A",
"explanation_en": "Jodhpur is the capital city of Rajasthan.",
"explanation_hi": "राजस्थान के किस्मान केंदर के बेस्टमान",
"explanation_hi": "राजस्थान के किस्मान केंदर के बेस्टमान",
"options": [
{
"option_key": "A",
"option_value": "Jodhpur"
},
{
"option_key": "B",
"option_value": "Jaisamand"
},
{
"option_key": "C",
"option_value": "Udaipur"
},
{
"option_key": "D",
"option_value": "Jhunjhunu"
}
],
"answer_key": "A",
"explanation_en": "Jodhpur is a historic city and the capital of Rajasthan.",
"explanation_hi": "जोधांग है एक इतिह और राजस्थान के किस्मान के बिलक्यार्थान के किस्मान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्थान के बिलक्यार्था