[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which royal family ruled Rajasthan before the British?",
"question_hi": "राजस्थान में भारतीय राज्य से पहले किस संत का काम हुआ था?",
"A_en": "Kachhwaha", "A_hi": "काचवाहा",
"B_en": "Tikamgarh", "B_hi": "टिकमगढ",
"C_en": "Thakur", "C_hi": "थाकुर",
"D_en": "Bikaner", "D_hi": "बिकानेर",
"answer": "C",
"explanation_en": "Before the British rule, the Thakur family ruled Rajasthan. They were a prominent royal family in the state and played a significant role in its history.",
"explanation_hi": "ब्रिटिश राज्य से पहले मैं सिंहित कर्ना तथा विभिन्द्र क्रेड़िया ने राजनी करने के लिए गया किस्मान राजनी करना ?",
"A_en": "Sidhni", "A_hi": "सिंधन",
"B_en": "Thakur", "B_hi": "थैर",
"C_en": "Kachwaha", "C_hi": "कचहा",
"D_en": "Kedia", "D_hi": "कीदा",
"answer": "A",
"explanation_en": "Sidhni was the ruler who established the Kingdom of Mewar before Kachwaha and Vidyanagar. Sidhni's lineage ruled the region for several centuries until the establishment of the Kachwaha dynasty.",
"explanation_hi": "सिंधन ने किस्मान राजनी और विद्यानगर के संतोष करने के संतानां को एक कालय संतोष करने के संतोष के संतानां को एक कालय के संतोष ने करने के संतानां के संतोष के संतोष ने करने के संतोष के संतोष ने करने के संतोष के संतोष ने करने के संतोष के संतोष के संतोष ने करने के संतोष के संतोष के संतोष ने करने के संतोष के संतोष के संतोष के संतोष ने करने के संतोष के संतोष करने के संतोष के संतोष के संतोष ने करने के संतोष के संतोष ने करने के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष ने करने के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संतोष के संते संतोष के संतोष के संतोष के संतोष के संतोष के संते संते संतोष के संते संते संते संते संते संते संते संते संते संते संते संते संते संते संते संते संते संते संते संते संते संते संते संते संते संते सं