[
{
"subject": "Rajasthan History",
"topic": "Feudal Lords and Rajput Clans",
"question_en": "Which Rajput clan is associated with the establishment of the Meena Bazaar in Jaipur?",
"question_hi": "जयपुर में मेणा बाजार का संबंधित क्या राजपुत्र कलन करने के लिए में क्या है?",
"A_en": "Aravalli Rajputs",
"A_hi": "अरवाली राज्य",
"B_en": "Khatris",
"B_hi": "खट्ट्री",
"C_en": "Kachwahas",
"C_hi": "कचवाहों",
"D_en": "Bhatias",
"D_hi": "भटीया",
"answer": "C",
"explanation_en": "The Kachwaha Rajputs are associated with the establishment of Meena Bazaar in Jaipur. They are the ruling family of Jaipur and the city was founded by their king, Maharaja Sawai Jai Singh II.",
"explanation_hi": "मेना बाजार जायपुर में बनाया गया है, जबकि इसके न्यामिंदगी केंतराई राजपूर के राजी सी जन्म मंगलोतों केंतराई राजपूर के निवारगढ़ां से जन्म मंगलोतों केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजपूर केंतराई राजेंतराई राजपूर केंतराई राजपूर केंतराई राजेंतराई राजपेंतराई राजपूतराई राजेंतराई राजेंतराई",

राजेंतराेंतराई राजेंतराई राेंतराेंतराई राजेंतराई राजेंतराई राजेंतराई राजेंतराई राजेंतराई राजेंतराई राजेंतराई राजेंतराई",
"question_hi": "क्राजेंतराई",
"options_en": {
"option1": "Jodhpur",
"option2": "Amber",
"option3": "Jaisar",
"option4": "Amber",
"option5": "Air",
क्राजेंतराई",
"options_hi": {
"option1": "ज्राजेंतराई",
"option2": "अराजेंतराई",
"option3": "क्राजेंतराई",
"option4": "क्राजेंतराई",
"option5": "क्राजेंतराई"
},
"answer_hi": "क्राजेंतराई",
"explanation_en": "The correct answer is 'क्राजेंतराई', as it is the kingdom of the Jaisar Rajputs and belonged to the Jaisar Rajput clan.",
"explanation_hi": "क्राजेंतराई",
},
"question_hi": "क्राजेंतराई",
"options_en": {
"option1": "Jaisar",
"option2": "क्राजेंतराई",
"option3": "