[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who is the author of the famous book 'Rajputana: A History of the Greatest Warriors of India'?",
"question_hi": "राजस्थान के 'राजपूतिंगा: भारत के अतिरिक्त महाकाव्य: भारत के सबसे बड़े आचार्यों का कविता",
"A_en": "Dr. Kailash Chand",
"A_hi": "डॉलर कैलश चंद",
"B_en": "Dr. R.K. Sharma",
"B_hi": "डॉलर केंद्र",
"C_en": "Dr. S.N. Tripathi",
"C_hi": "डॉलर त्रीपाठी",
"D_en": "Dr. Anil Gupta",
"D_hi": "डॉलर गुप्त",
"answer": "B",
"explanation_en": "Dr. R.K. Sharma is the author of the famous book 'Rajputana: A History of the Greatest Fighters of India'. The book focuses on the history of the Rajput warriors in India.",
"explanation_hi": "डॉलर केंद्र अभिवृषि 'राजपुत: भारत के सबसारखे बड़ियों का विचार्थ: भारत के सबसारखे बैंकों' का विचार्थ",
"answer": "B",
"explanation_en": "Dr. R.K. Sharma is the author of the famous book 'The Bravery of the Rajputs of India'. The book focuses on the bravery and valor of the Rajput warriors in India.",
"explanation_hi": "डॉलर केंद्र अभिवर्त्रों का विचार्थ: भारत के राजपुत अभिवर्त्तभारत के राजपुत अभिवर्त्तभारत के राजपुतों का विचार्णत्तभारत के राजपुतों का विचार्णत्तभारत के राजपुतों का विचार्णत्तभारत के राजपुतों का विचार्णत्तभारत के राजपुतों का विचार्णत्तभारत के राजपुतों का विचार्णत्तभारत के राजपुतों का विचार्णत्तभारत के राजपुतों का विचार्णत्तभारत के राजपुतों का विचार्णत्तभारत के राजपुतों का विचार्णत्तभारत के राजपुतों का विचार्णत्तभारत के राजपुतों का विचार्णत्तभारत के राजपुतों का विचार्णत्तभारत के राजपुतों का विचार्णत्तभारत के राजपुतों का विचार्णत्त्तभारत के राजपुत्त्त्त्तभारत के राजपुत्त्तभारत क्त्तभारत के राज्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्त्