[
{
"subject": "Rajasthan History",
"topic": "Rajasthan Royal Families",
"question_en": "Which royal family ruled Jodhpur?",
"question_hi": "जोधपुर के राज्य मंत्रालय किस अधिकारी किस्मत में थी।",
"A_en": "Sarkari Naukri", "A_hi": "सरकारी नौकरी",
"B_en": "Meena Rajputs", "B_hi": "मेना राज्य में थीं",
"C_en": "Jat Rajputs", "C_hi": "जयंतीय राज्य में थीं",
"D_en": "Alwar Rajputs", "D_hi": "अलवर राज्य में थीं",
"answer": "B",
"explanation_en": "The Meena Rajputs were a royal family that ruled Jodhpur. They belonged to the Jat Rajput clan.",
"explanation_hi": "मेना राज्य में थीं। वे जयंतीय राज्य में ही थे।",
"explanation_en": "The Alwar Rajputs were a royal family that ruled Alwar district in Rajasthan. They belonged to the Alwar Rajput clan.",
"explanation_hi": "अलवर राज्य में ही थे। वे अलवर जंगल के में ही थे।",
"explanation_en": "The Jat Rajputs were a prominent royal family in Rajasthan history. They ruled various parts of Rajasthan including the Jat state.",
"explanation_hi": "जयतीय राज्य और राजस्थान के में ही थे। वे राजस्थान के में ही थे।",
"explanation_en": "The Bishnoi community is known for its rich cultural heritage and conservation efforts. They have played a significant role in preserving Rajasthani traditions and nature.",
"explanation_hi": "बिशनी कंगल में समुद्र के में ही थे। वे राजस्थान के में ही थे।",
"explanation_en": "The Jat Rajputs were a royal family that ruled various parts of Rajasthan and contributed to the rich cultural heritage of the state.",
"explanation_hi": "जयतीय राज्य के में ही थे। वे राजस्थान के में ही थे।",
"explanation_en": "The Meera Jain community is known for their contributions to Rajasthani art, culture, and literature.",
"explanation_hi": "मीरा जैन कंगल में ही थे। वे राजस्थान के में ही थे।",
"explanation_en": "The Jat Rajputs ruled various parts of Rajasthan and contributed to its development.",
"explanation_hi": "जयतीय राज्य के में ही थे। वे राजस्थान के में ही थे।",
"explanary_en": "The Jat Rajputs played a significant role in shaping the cultural and administrative history of Rajasthan.",
"explanary_hi": "जयतीय राज्य के में ही थे। वे राजस्थान के में ही थे।",
]