[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Kingdoms",
"question_en": "Which king built the city of Jaipur?",
"question_hi": "जयपुर नेशनल के बनवाई के लिए किस राजनेशनलीज़ी की बनवाई की गई थी।",
"A_en": "King Maharaja Sawai Jai Singh II",
"A_hi": "राजनेशनल के बनवाई के लिए किस राजनेशनलीज़ी की बनवाई की गई थी।",
"B_en": "King Maharana Pratap",
"B_hi": "राजनेशनलीज़ी की बनवाई की गई थी।",
"C_en": "King Maharana Kumbha",
"C_hi": "राजनेशनलीज़ी की बनवाई की गई थी।",
"D_en": "King Jaswant Singh II",
"D_hi": "राजनेशनलीज़ी की बनवाई की गई थी।",
"answer": "D",
"explanation_en": "King Jaswant Singh II is the ruler who established the city of Jaipur.",
"explanation_hi": "राजनेशनलीज़ी की बनवाई की गई थी।",
"explanation": "यह राजा भाकर को जापाई ने बना गाया है।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Important Battles",
"question_en": "Which battle was fought between Ranas of Mewar and Chittor?",
"question_hi": "मौर-चितौर के रांनेश के बिज़ादी के बनवाई बीजीटोर के रांनेश के बिज़ादी के बनवाई बीजीटोर के रांनेश के बिज़ादी के बनवाई बीजीटोर के रांनेश के बिज़ादी के बनवाई बीजीटोर के रांनेश के बिज़ादी के बनवाई बीजीटोर के रांनेश के बिज़ादी के बनवाई बीजीटोर के रांनेश के बिज़ादी के बनवाई बीजीटोर के रांनेश के बिज़ादी के बनवाई बीजीटोर के रांनेश के बिज़ादी के बनवाई बीजीटोर के रांनेश के बिज़ादी के बनवाई बीजीटोर के रांनेश के बिज़ादी के बनवाई बीजीटोर के रांनेश के बिज़ादी के बनवाई बीजीटोर के रांनेश के बिज़ादी के बनेश के बिजीटोर के रांनेश के बनेश के बनेश के बनेश के बनेश के बनेश के बनेश के बनेश के बनेश के बनेश के बनेश के बनेश के बनेश के बनेश के बनेश के बनेश के बनेश के बनेश के बनेश केश के बनेश के बनेश केश के बनेश के बनेश केश",

केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश",
"A_en": "King Kumbhapur",
"A_hi": "केश केश केश केश केश केश केश केश केश केश केश केश केश केश",
"B_en": "Kumbhapur",
"B_hi": "केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश केश",
"C_en": "Kumbhapur",
"C_hi": "केश केश केश केश केश केश केश केश केश केश",
"D_en": "Kumbhapur",
"D_hi": "