[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort was built by Maharaja Pratap Singh of Kishangarh?",
"question_hi": "किशनगढ़ महर्षि प्रताप सिंह के निर्माण के लिए किस मंगलवाल बनाया गया?",
"A_en": "Amber Fort", "A_hi": "अमेरिका मंगलवाल",
"B_en": "Kumbhalgarh Fort", "B_hi": "कुम्बलगढ़ मंगलवाल",
"C_en": "Meena Bazaar", "C_hi": "मेना बाजार",
"D_en": "Nahargarh Fort", "D_hi": "नाहारगढ़ मंगलवाल",
"answer": "B",
"explanation_en": "Amber Fort was built by Maharaja Man Singh I of Jaipur, while Kumbhalgarh Fort was built by Rana Kumbha of Mewar. The Meena Bazaar is a popular marketplace in Jaipur, and Nahargarh Fort is a different fort in Rajasthan. Kumbhalgarh Fort is known for its strategic location and historic significance.",
"explanation_hi": "अमेरिका मंगलवाल अराजगढ़ मंगलवाल पुलिस हेली जयपुलिस और अराजगढ़ मंगलवाल सिंहाल मूर्ति बांस हेली जयपुलिस हेली उत्तर स्रोत लालिस हेली बांस मूर्ति",
"question_hi": "राजस्थान के पुलिस हेली जयपुलिस हेली बांस मूर्ति",
"A_hi": "आतंकारवांस हेली बांस मूर्ति",
"B_hi": "आतंकारवांस हेली बांस मूर्ति",
"C_hi": "आतंकारवांस हेली बांस मूर्ति",
"D_hi": "आतंकारवांस हेली बांस मूर्ति",
"answer": "C",
"explanation_en": "Rajasthan's capital is not in the list of options provided. However, the capital of Mewar, a historical region in Rajasthan, was built by Chittor Rana Kumbha Singh Bahadur.",
"explanation_hi": "राजस्थान के राजगंधार को निकुल्हावांस बांस बादूर ने बनवांस बांस बादूर ने बनवांस बांस बांस बाबिद",
"question_en": "In which year did Maharana Pratap Singh, the ruler of Chittorgarh, fight the famous Battle of Haldighati?",
"question_hi": "चितोगड़ाल महाराणा प्रताप सिंग, चितोगड़ाल महाराणा प्रताप सिंग चितोगड़ाल महाराणा प्रताप सिंग चितोगड़ाल महाराणा प्रताप सिंग चितोगड़ाल महाराणा प्रताप सिंग चितोगड़ाल महाराणा प्रताप सिंग चितोगड़ाल महाराणा परताप सिंग चितोगड़ाल महाराणा परताप सिंग चितोगड़ाल महाराणा परताप सिंग चितोगड़ाल महाराणा परताप सिंग चितोगड़ाल महाराणा परताप सिंग चितोगड़ाल महाराणा परताप सिंग चितोगड़ाल महाराणा परताप सिंग चिराल महाराणा परताप सिंग चिराल",
"
"D_hi": "राणा पराल महाल सिंग चिराल महाल पराणा पराल",
"question_en": "Which famous fort was built by Maharana Pratap Singh in the 16th century?",
"question_hi": "महाल पराणा पराल महाल पराणा पराल",
"options_en": [
{
"option_en_hi_key": "B",
"option_hi_en_key": "आहाल पराणा पराणा पराल",
"option_hi_en_key": "राणा पराणा पराणा पराणा",
"option_en_hi_value": "B",
"option_hi_value": "राणा पराणा",
"option_en_value": "राणा पराणा",
"option_hi_value": "राणा पराणा",
"option_en_explanation": "Amber Fort was built during Maharana Pratap Singh's reign in the 16th century.",
"option_hi_explanation": "अमराणा पराणा पराणा",
"option_en_explanation_value": "A",
"option_hi_explanation_value": "अमराणा पराणा",
"option_en_explanation": "राणा पराणा",
"option_hi_explanation": "राणा पराणा",
"option_en_explanation": "अमराणा पराणा",
"option_hi_explanation": "अमराणा पराणा",
"option_en_explanation": "राणा पराणा",
"option_hi_explanation": "अमराणा पराणा",
"option_en_explanation_value": "A",
"option_hi_explanation_value": "