[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jodhpur?",
"question_hi": "जोधपुर में कौन सा मंगल है?",
"A_en": "Mehrangarh Fort", "A_hi": "मेहरांगार",
"B_en": "Kumbhalgarh Fort", "B_hi": "कुम्भालगढ़ मंगल",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Jaipur", "D_hi": "जयपुर",
"answer": "B",
"explanation_en": "Kumbhalgarh Fort, located in Rajasthan, is known for its historical significance and is one of the components of the UNESCO World Heritage Site - The Great Indian Desert Circuit.\nFor Jodhpur, it is Mehrangarh Fort.",
"explanation_hi": "राजस्थान में कुम्भालगढ़ मंगल क्या है जिसका उपयोग करें विज्ञानी अनुसंग करें और यह उपयोग करें क्या है जिसका उपयोग करें | The Great Indian Desert Circuit",
"question_en": "Which fort is known for its historical significance and can be included in The Great Indian Desert Circuit?",
"question_hi": "क्या मंगल है जिसका उपयोग करें | The Great Indian Desert Circuit",
"question_ar": "أي قلعة معروفة بأهميتها التاريخية ويمكن إدراجها في دائرة الصحراء الهندية العظيمة?",
"question_zh-CN": "这个城堡是什么历史重要性并为《印度大沙漠圈》中包含在内的特定的地方性历史重要性",
"question_fr": "Quelle citadelle est connue pour sa portée historique et peut être inclus dans le Grand Circuit du désert indien ?",
"question_ja": "この城堡は歴史的重要性を持っておおわるこの印度大沙漠圈「The Great Indian Desert Circuit」の中おおわる特定の地部地域「印度大沙漠圈「The Great Indian Desert Circuit」の中おおわる指定された地域「印度大沙漠圈「The Great Indian Desert Circuit」の中おおわる特定の地域「印度大沙漠圈「The Great Indian Desert Circuit」の中おおおわる特定された地域「印度大沙漠圈「The Great Indian Desert Circuit」の中おおおわる特定された地域「印度大沙漠圈「The Great Indian Desert Circuit」の中おおおわる特定された地域「印度大沙漠圈「The Great Indian Desert Circuit」の中おおおおおおおわる特定された地域「印度大沙漠圈「The Great Indian Desert Circuit」の中おおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおおお