[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who was the founder of Jodhpur State?",
"question_hi": "जोधपुर देश के संसारी कौन थी।",
"A_en": "Rao Jodha", "A_hi": "राव जोधा",
"B_en": "Prithviraj Chauhan", "B_hi": "पृथ्वीर चौहान",
"C_en": "King Rana Kumbha", "C_hi": "राजा कुम्भा",
"D_en": "Pratap Singh", "D_hi": "प्रताप सिंह",
"answer": "A",
"explanation_en": "Rao Jodha was the founder of Jodhpur State. He was a Rathore Rajput prince who established the Meeragarh Fort and founded the city of Jodhpur in the mid-15th century.\n",
"explanation_hi": "राव जोधा जोधा देश के संसारी थी। उन्हें Meera Garh Fort और Jodhpur के संसारी के लिए हैं। उन्हें मध्यम 15वें दैं जोधा देश के संसारी से राजा को जोधा देने वाले और उन्हें मध्यम 15वें जोधा देने वाले और उन्हें मध्यम 15वें जोधा देने वाले और उन्हें मध्यम 15वें जोधा देने वाले और उन्हें मध्यम 15वें जोधा देने वाले और उन्हें मध्यम 15वें जोधा देने वाले।",
",
"answer": "A",
"explanation_en": "Rao Jodha, a Rathore prince, and his companions founded Jodhpur in the mid-15th century and established it as the capital.",
"explanation_hi": "राव जोधा, रातोर मतित्वादि मंगलों में जोधा देने वाले।",
},
{
"subject": "Rajasthan History",
"topic": "Rao Jodha",
"question_en": "Who was Rao Jodha?",
"question_hi": "राव जोधा कौने थे?",
"A_en": "Rao Jodha was a Rathore prince.",
"A_hi": "राव जोधा रातोर मतित्वादि में जोधा देने वाले।",
"B_en": "Rao Jodha was a minister of Keech Rathore.",
"B_hi": "राव जोधा केच रातोर मित्वादि में जोधा देने वाले।",
"C_en": "Rao Jodha was a general of Rathore Kings.",
"C_hi": "राव जोधा रातोर मित्वादि में जोधा देने वाले।",
"D_en": "Rao Jodha was a descendant of Kumbha Rathore.",
"D_hi": "राव जोधा केच रातोर मित्वादि में जोधा देने वाले।",
"answer": "C",
"explanation_en": "Rao Jodha was a general of Kumbha Rathore. He was a key figure during the construction of Mehrangarh Fort and played a vital role in the establishment of Udaipur.",
"explanation_hi": "राव जोधा केच रातोर में जोधा देने वाले।",
},
{
"subject": "Rajasthan History",
"topic": "Rao Jodha",
"question_en": "What was the role of Rao Jodha in the construction of Mehrangarh Fort?",
"question_hi": "राव जोधा देने वाले के देनेने वालेनिके देनेने वालेनेने वालेनिके देनेने वालेनिके देननेनेने वालेनने देने वालेनिकेने वाले देनेनेने वालेनेनेनिकेनेनेने वालेनेनेनेनेनेनेनेनेनेनेनिकेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेननेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेननेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेनेने