[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "What is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी क्या है?",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Jaipur",
"B_hi": "जयपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Bikaner",
"D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Jaipur is the capital of Rajasthan.",
"explanation_hi": "जयपुर राजस्थान की राजधानी है।",
"explanation_ar": "Jaipur is the capital of Rajasthan."
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Families",
"question_en": "Which royal family ruled Rajasthan before Mughals?",
"question_hi": "राजस्थान मुघलों से पूर्वपूर्व ने Rajasthan kaise Rajput families ke saath rajbhart mein bana maqbara aur temples?",
"A_en": "Which royal family ruled Rajasthan before the Mughals established their rule?",
"A_hi": "राजस्थान मुघलों से पूर्वपूर्व ने Rajasthan kaise Rajput families ko Rajasthan mein bana maqbara aur temples?",
"B_en": "Which Rajput families ruled Rajasthan before the establishment of Mughal rule?",
"B_hi": "पूर्व पूर्व ने Rajasthan mein Rajput families ko Rajasthan mein bana maqbara aur temples ke saath?",
"C_en": "Which dynasty ruled Rajasthan before the Mughals?",
"C_hi": "पूर्व पूर्व ने Rajasthan kaise Mughals ke saath ko jagah?",
"D_en": "Which dynasty ruled Rajasthan before the Mughals?",
"D_hi": "पूर्व पूर्व ने Rajasthan ke liye Mughals ko jagah?",
"answer": "B",
"explanation_en": "The Mughals invaded Rajasthan after the decline of the Tomar dynasty. Before that, the region was ruled by the Tomar Dynasty.",
"explanation_hi": "मुघाल राजनों ने तो राजस्थान को टोमार धर्मनों ने राजस्थान को टोमार धर्मनों ने राजस्थान को टोमार धर्मनों ने राजस्थान को टोमार धर्मनों ने राजस्थान को टोमार धर्मनों ne Rajasthan ko Tomar Dharmanon ne Tomar Chakravarti ki jhansi ki raja?",
"A_hi": "टोमार धर्मनों ne Rajasthan ko Rajput Chakravarti ki jhansi ka raja?",
"B_en": "Who was the ruler of Jhansi under Tomar Dharmanas before the establishment of Tomar dynasty?",
"B_hi": "टोमार धर्मनों ne Rajasthan mein Rajput Jhansi ka raja kaise aa gaya?",
"C_en": "Who was the ruler of Jhansi before the Tomar Dharmanas?",
"C_hi": "टोमार धर्मनों ne Rajasthan mein Rajput Jhansi ka raja kaise aa gaya?",
"D_en": "Before the establishment of the Tomar dynasty, who ruled Jhansi as a Rajput?",
"D_hi": "टोमार धर्मनों ne Rajasthan mein Rajput Jhansi ka raja kaise aa gaya?",
"answer": "B",
"explanation_en": "Before the rule of Tomar Dharmanas, the Rajput ruler of Jhansi was Raja Ganga Singh Ji.",
"explanation_hi": "टोमार धर्मनों ne Rajasthan mein Rajput Jhansi ka raja Ganga Singh Ji kaise aa gaya?",
"explanation_ar": "قبل تومار دارماناس ka rule, جاناशि के राजन Ganga Singh Ji ke paise aayi thi?"
},
{
"subject": "Rajasthan History",
"topic": "History of Jodhpur",
"question_en": "Which king was the founder of Jodhpur?",
"question_hi": "जोदुर के राजन को के दिलकं को राजन को शं रिलको टिलको राजन को को Jodhpur ka founder kaun the?",
"A_en": "Who was the founder of Jodhpur?",
"A_hi": "जोदुर को दिलको शं को जिलको Jodhpur ka founder kaun the?",
"B_en": "Who was the founder of Jodhpur?",
"B_hi": "जोदुर को दिलको शं जिलुर कुर एर Jodhpur ka founder kaun the?",
"C_en": "Who founded Jodhpur?",
"C_hi": "जोदुर कुर Jodhpur ka founder kaun the?",
"D_en": "Who established Jodhpur?",
"D_hi": "जोदुर कुर जुर Jodhpur ka founder kaun the?",
"answer": "B",
"explanation_en": "Jodhpur was founded by Raja Rana Kesho of Tomar dynasty.",
"explanation_hi": "Jodhpur ka founder Rana Keshav Singh Tomar dynasty ne banaya tha.",
"explanation_ar": "जोदुर Jodhpur ne banaya tha, Rana Keshav Singh Tomar dynasty mein.",
"explanation_ar": "Jodhpur ka founder kaun the, Rana Kesho of Tomar Dynasty mein.",
"explanation_ar": "जोर Jodhpur ka founder kaun the, Rana Kesho of Tomar Dynasty mein.",
"answer": "B