[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Earliest Civilizations",
"question_en": "Which civilization is considered to be the earliest civilization in Rajasthan?",
"question_hi": "राजस्थान में पहली समाज कौन सी समाज जानकारी की महत्व से लिखी गई है।",
"A_en": "Harappan Civilization", "A_hi": "हरपान समाज",
"B_en": "Rajput Civilization", "B_hi": "राजपूती समाज",
"C_en": "Meena Civilization", "C_hi": "मेना समाज",
"D_en": "Aryan Civilization", "D_hi": "अर्जन समाज",
"answer": "C",
"explanation_en": "The Meena civilization is considered to be the earliest civilization in Rajasthan. The Meenas were a significant tribe in the region and their influence can be seen in the history, art, and culture of the state. The Meena civilization is associated with the development of pottery, mirror-making, and embroidery techniques in Rajasthan.",
"explanation_hi": "राजस्थान के पहले समाज मेना समाज है, जहां मीनों की एक महत्वपूर्व समाज के सम्पद क्रमणी और नार्थ की समाज के लेखना, मिशन और स्त्रीय समाज के इस्तेंक के लेखना के मौसमाज के समस्तेंक के लेखना की समाज में के इस्तेंक के समस्तेंक के लेखना के समाज के इस्तेंक के समस्तेंक के लेखना के समाज में के समस्तेंक के लेखना के समाज में के इस्तेंक के लेखना के समाज में के इस्तेंक के लेखना के समाज में के इस्तेंक के लेखना के समाज में के पूर्व चलाईयों के समाज में के इस्तेंक के लेखना के समाज में के इस्तेंक के लेखना के समाज में के इस्तेंक के लेखना के समाज में के इस्तेंक के लेखना के समाज में के इस्तेंक के लेखना के समाज में के इस्तेंक के लेखना के समाज में के इस्तेंक के लेखना के समाज में के इस्तेंक के लेखना के समाज में के इस्तेंक के लेखना के समाज में के इस्तेंक के लेंके इस्तेंक के लें के इस्तेंक के इस्तेंक के इस्तेंक के इस्तेंक के इस्तेंक के इस्तेंक क इसक के इंक इस्तेंक इस्तेंक क इस्तेंक इंक इंक क क इंक क क इंक इंक इंके इंक इंक क इंक क इंक क इंक इंक क इंक इंक इंक क इंक इंक क इंक इंक इंक क इंक क इंक इंक क इंक इंक इंक क इंक इंक इंक इंक क इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक इंक