[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Famous Cities",
"question_en": "What is the capital of Rajasthan and which are some of its famous cities?",
"question_hi": "राजस्थान की राजधानी और उनके आचरणीय शहरे।",
"A_en": "Jodhpur", "A_hi": "जोधपुर",
"B_en": "Jaipur", "B_hi": "जयपुर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Bikaner", "D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Jaipur is the capital of Rajasthan, a state located in Northern India. Some other famous cities of Rajasthan are: Udaipur, also known as the City of Lakes, Bikaner, and Jodhpur, also known as the Sun City.\n\nApart from these, Rajasthan has several other cities like Ajmer, Bharatpur, Dausa, Dholpur, Gwalior, Hanumangarh, Jaipur, Jaisalmer, Jhunjhunu, Kota, Nagaur, Pali, Pushkar, Sikar, Sirohi, Tonk, Udaipur, and Bharatpur.",
"explanation_hi": "राजस्थान एक भारतीय राज्य है, जहां लंगोंगर के देश में स्थित है।\n\nराजस्थान में कुछ अन्यार मोहन भी अभिमान की स्थित है। यह शुभिमान स्थित है।",
"question_en": "Who was the founder of Udaipur?",
"question_hi": "यह उदयपुर के शुभिमान कौनको बनवाला है।",
"question_hi": "उदयपुर के शुभिमान कौनको बनवाला है।",
"question_en": "Who founded Udaipur?",
"question_hi": "उदयपुर के शुभिमान कौनको बनवाला है।",
"A_en": "Rana Kumbha",
"A_hi": "राजा कुम्भ",
"B_en": "Prithviraj Chauhan",
"B_hi": "प्रतिभिर्जा चौहान",
"C_en": "Rao Bika",
"C_hi": "रौ बिका",
"D_en": "Ala Singh",
"D_hi": "अला सिंग",
"answer": "C",
"explanation_en": "Udaipur was founded by Rao Bika. He was a Rajput king and a nobleman who established several Jhalana forts in Rajasthan.\n\nउदयपुर में राजन रौ बिका ने बना होंगे। उसने राजमीन ज़ेलाँ में बना होंगे। उसने सभने ज़ेलाँ में बना होंगे।",
"explanation_hi": "उदयपुर में राजन रौ बिका ने बना होंगे। उसने सभने ज़ेलाँ में बना होंगे।",
"question_en": "Who founded Udaipur and what are some of its forts?",
"question_hi": "उदयपुर के बनना और उसने कुछ पुलों बना होंगे।",
"answer": "C",
"explanation_en": "Udaipur was founded by Rana Kumbha and some of its forts are: Maharana Pratap Fort, Jagdish Temple Fort, and Fateh Pura Fort.\n\nउदयपर कुछ पति बनन कुछ पुलं बनन आंआर मेंंतनं बनन बनन आंआर मेंतन बनन बनन बन बनन बन आर मनन बनन बन बन बन बन सन",
"explanation_hi": "Udaipur बनन बनन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन बन