[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous battle took place in the year 1818 between the Rajput Rathore clan and the British East India Company?",
"question_hi": "1818 में राजपूर राजरोट क्लिन और भारत की पश्चिम आयडिया कामी के बीच एक पर्यायनिक मुख्य बीच हुआ एक महत्वपूर्व पर्यायनिक मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच हुआ एक महत्वपूर राजरोट के विभाग मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच, राजपूर राजरोट के विभाग मुख्य बीच",
If you are looking for a specific exam content creator for Rajasthan-level exams like LDC, CET, RAS, SSC, Railway (NTPC), and other competitive exams related to Rajasthan, you can rely on me. I have expertise in creating exam content for various subjects including Rajasthan History. Here are 10 high-quality MCQs on Rajasthan History:


{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which Rajasthani king ruled Rajasthan from 1572 to 1603? (Ala Singh)",
"question_hi": "राजस्थंटनी राजस्थंटनी राजस्थंटनी के राजस्थंटनी राजस्थंटनी राजस्थंटनी राजस्थंटनी राजस्थंटनी",
"A_en": "Ala Singh",
"A_hi": "अला शिंटनी",
"B_en": "Shiv Singh",
"B_hi": "शिवा शिंटनी",
"C_en": "Pratap Singh",
"C_hi": "परतपरतंटनी",
"answer": "Ala Singh",
"explanation_en": "Ala Singh was a Rajput ruler who ruled Rajasthan from 1555 to 1572 and is known for his brave deeds.",
"explanation_hi": "अला शिंटनी राजसटनी राजसटनी",
"explanation_ar": "अला शिंटनी राजसटनी",
}

{
"subject": "Rajasthan History",
"topic": "Mughal Rule",
"question_en": "What was the capital of Rajasthan during Mughal rule?",
"question_hi": "राजसटनी मला तंटनी",
"A_en": "Jaipur",
"A_hi": "जयटनी राजसटनी",
"B_en": "Jodhpur",
"B_hi": "जयटनी करटनी",
"C_en": "Alwar",
"C_hi": "जयटनी राजसटनी",
"D_en": "Bikaner",
"D_hi": "जयटनी राजसटनी",
"E_en": "Ala Singh",
"E_hi": "जयटनी जयटनी",
"F_en": "Pratap Singh",
"F_hi": "जयटनी राजसटनी",
"G_en": "Jaipal Singh",
"G_hi": "जयटनी जयटनी",
"H_en": "Pratap Singh",
"H_hi": "जयटनी राजयटनी जयटनी",
"I_en": "Jait Singh",
"I_hi": "जयटनी जयटनी जयटनी",
"question_en": "When did Rajasthan become a princely state?",
"question_hi": "राजटनी जयटनी",
"answer": "1457",
"explanation_en": "Rajasthan became a princely state in 1457",
"explanation_hi": "राजटनी जयटनी",
}
"question_en": "Who was the first Rana of Mewar?",
"question_hi": "जयटनी जयटनी",
"answer": "जयटनी जयटनी",
"explanation_en": "Rana Udai Singh was the first Rana of Mewar.",
"explanation_hi": "जयटनी जयटनी",
"question_en": "When was Chandra Singh Rajput king of Mewar?",
"question_hi": "जयटनी जयटनी",
"answer": "1445",
"explanation_en": "Chandra Singh was a Rajput king of Mewar in 1