[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort was built by Raja Rai Singh in Jaipur?",
"question_hi": "जयपुर में राजा राय सिंह ने किस प्राचीन फोट किया।",
"A_en": "Amber Fort", "A_hi": "अमेरिका फोट",
"B_en": "Hawa Mahal", "B_hi": "हवा महाल",
"C_en": "Cenotaph of Maharaja Jai Singh", "C_hi": "महाराजा जयसिंह की महान्याय महाविद्यालय",
"D_en": "Galta Ji Temple", "D_hi": "गालता जी मंगल",
"answer": "B",
"explanation_en": "Hawa Mahal, also known as the Palace of Winds, is a famous monument in Jaipur built by Maharaja Sawai Jai Singh II.",
"explanation_hi": "हवा महाल, महाराजा सौवा जयसिंह आत्मन के कालता जी मंगल को कैलसीना के बाणी इंगल को नौकरनी कालता जी मंगल",
"answer": "B",
"explanation_en": "Hawa Mahal, also known as the Palace of Winds, is a popular monument in Jaipur built by Maharaja Sawai Jai Singh II. The Kalan Chowk of Jaipur is not related to Galta Ji Temple.",
"explanation_hi": "हवा महाल, पार्वती कालता जी मंगल को नवसीना कालता जी मंगल",
"answer": "D",
"explanation_en": "Kalan Chowk of Jaipur is a famous square known for its narrow lanes and bustling market. The Galta Ji Temple in Jaipur is a Hindu temple dedicated to Lord Sun God. These questions are related to Jaipur, not Galta Ji Temple.",
"explanation_hi": "जयपुर की कालता जी मंगल, को नवसीना कालता जी मंगल",
"answer": "A",
"explanation_en": "Kalan Chowk is a popular place in Jaipur famous for its narrow lanes and bustling market. Kalan Ji Temple is a temple dedicated to Lord Hanuman and located in Jaipur.",
"explanation_hi": "जयपुर की कालता जी मंगल, नवसीना कालता जी मंगल",
"answer": "B",
"explanation_en": "Galta Ji Temple is a famous Hindu temple in Jaipur dedicated to Lord Sun God. The Nawasiya Kalan Ji Temple in Jaipur is not related to this question.",
"explanation_hi": "जयपुर की नवसीना कालता जी मंगल, राजस्थान जी मंगल",
"answer": "C",
"explanation_en": "Kalan Chowk is a historic place in Jaipur. Galta Ji Temple is dedicated to Lord Sun God and located in Jaipur.",
"explanation_hi": "जयपुर की नवसीना कालता जी मंगल, राजस्थान जी मंगल",
"answer": "D",
"explanation_en": "Galta Ji Temple is a historic temple in Jaipur known for its natural hot springs. The Nawasiya Kalan Ji Temple in Jaipur is not related to this question.",
"explanation_hi": "जयपुर की नवसीना कालता जी मंगल, राजस्थान जी मंगल",
}
]