[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Famous Kings and Events",
"question_en": "Which king is famous for the construction of Mehrangarh Fort in Jodhpur?",
"question_hi": "जोधपुर में मेरंगर की संसाधन करने वाला क्या नेता है।",
"A_en": "Rao Jodh Singh", "A_hi": "राव जोध सिंग",
"B_en": "Rao Raja Singh", "B_hi": "राव राजा सिंग",
"C_en": "Rao Jodhpur Singh", "C_hi": "राव जोधपुर सिंग",
"D_en": "Rao Jodhpal Singh", "D_hi": "राव जोधपल सिंग",
"answer": "A",
"explanation_en": "Rao Jodh Singh is famous for the construction of Mehrangarh Fort in Jodhpur.\nRao Jodhpal Singh and Rao Raja Singh are also relevant, but Rao Jodh Singh is the correct answer.",
"explanation_hi": "मेरंगर की संसाधन करने वाला राव जोध सिंग है। राव जोधपुर सिंग और राव राजा सिंग भी आवश्यांक में संसाधन करने वाला है। राव जोधपुर सिंग और राव राजा सिंग भी आवश्यांक में संसाधन करने वाले हैं। राव जोधपुर सिंग और राव राजा सिंग भी अपने संसाधन करने वाले हैं।",
"answer": "B",
"explanation_en": "Both Rao Jodhpur Singh and Rao Raja Singh are known for their contributions in Rajasthan history. Among them, Bhamashah is the correct answer.",
"explanation_hi": "राव जोधपुर सिंग और राव राजा सिंग में राजस्थान के विश्वर्जीवन और राव राजा सिंग की आतिर्जीवन के सामूलों के विश्वर्जीवन और राव राजा सिंग का आतिर्जीवन के सामूलों के विश्वर्जीवन सामूलों के विश्वर्जीवन अपने का आतिर्जीवन के सामूलों के विश्वर्जीवन अपने का आतिर्जीवन अपने के सामूलों के विश्वर्जीवन अपने का आतिर्जीवन अपने का आतिर्जीवन अपने के सामूलों के विश्वर्जीवन अपने का आतिर्जीवन अपने के सामूलों कों के विश्वर्जीवन अपने कों के सामूलों कों के विश्वर्जीवन अपने कों कों कों के विशर्ज्वर्जिवन अपने कों के विश्वर्जीवर्वर्जिवन अपने के वर्जीवर्ज्वर्जीवच्वर्जर्चर्ज्वर्जर्चर्ज्जर्चर्जर्चर्ज्वर्जर्जर्जर्ज्वर्जर्जर्जर्चर्ज्जर्जर्जे के वर्जर्ज्ज्ज्जर्जर्जर्जर्जर्जर्ज्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्ज्ज्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्ज्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्जर्ज र्जर्जर्जर्जर्जर्