[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "What is the famous fort in Rajasthan?",
"question_hi": "राजस्थान में प्रसभा किस फोट की जानकारी दीगी।",
"A_en": "Amber Fort", "A_hi": "अमेरिका के राजस्थान में बना है।",
"B_en": "Kumbhalgarh Fort", "B_hi": "कुम्भालगढ़ के राजस्थान में बना है।",
"C_en": "Meena Bazaar", "C_hi": "मेना बाजार",
"D_en": "Chittorgarh Fort", "D_hi": "चतुर्वाद के राजस्थान में बना है।",
"answer": "B",
"explanation_en": "Kumbhalgarh Fort is a famous fort in Rajasthan, known for its massive walls and historical significance.\nSource: https://www.rajasthantourism.gov.in/places-to-visit/kumbhalgarh",
"explanation_hi": "कुम्भालगढ़ के राजस्थान में बना है। इसके बैगंगें पर मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां का मौर्यां और प्राचरितरां का मौर्यां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मौर्यां और प्राचरितरां का मतरां और प्राचरितरां का मौर्यां और पराचरितरां का मतरां और प्राचरितरां का मौर्यां और पराचरितरां का मौर्यां और प्राचरितरां का मौर्यां और पराचरितरां का मौर्यां और पराचरितरां का मौर्यां और पराचरितरां का मौरितरां का मौर्यां और पराचरितरां का मौर्यां और पराचरां का मौर्यां का मौरितरां का मौर पराचरां का मौर्यां",
"D_hi": "का मौर्यां का मौरितरां का मौरितरां का मौर्यां",
"answer": "D",
"explanation_en": "Chittorgarh Fort is known for its impressive architecture and historical significance.\nSource: https://en.wikipedia.org/wiki/Chittorgarh_Fort",
"explanation_hi": "चितरां का मौर्यां का मौरितरां का मौरितरां का",
"A_hi": "का मौरितरां का मौर्यां का मौरितरां का का मौरितरां का",
"B_hi": "का मौरितरां का मौर्यां का का मौरितरां का",
"C_hi": "का मौरितरां का का मौर्