[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which king is associated with the construction of Chittor Fort?",
"question_hi": "चिट्टोर किस संघर्ष के लिए किया गया था?",
"A_en": "Pratap",
"A_hi": "प्रताप",
"B_en": "Kumbha",
"B_hi": "कुम्भा",
"C_en": "Mewar",
"C_hi": "मैवर",
"D_en": "Rana Kumbha",
"D_hi": "राना कुम्भा",
"answer": "D",
"explanation_en": "Rana Kumbha is associated with the construction of Chittor Fort. The fort was built to strengthen the Mewar kingdom.",
"explanation_hi": "राना कुम्भा चित्रपति के संघ मैवर के लिए बना गया था। वह मैवर संघ की संगति को बढ़ाया गया था।",
"D_hi": "राना कुमबा मैवर के लिए बना गया था। इसको संगति को बढ़ाया गया था।"
},
{
"subject": "Rajasthan",
"topic": "Rajasthan's Culture",
"question_en": "What is the most prominent dance form of Rajasthan?",
"question_hi": "राजस्थान के कांचरन्टी को क्या संगतियाँ हैं?",
"A_en": "Ghoomar",
"A_hi": "गोमार",
"B_en": "Garba",
"B_hi": "गार्बा",
"C_en": "Sarangi",
"C_hi": "सारंगी",
"D_en": "Bhopa",
"D_hi": "भोपा",
"answer": "Ghoomar",
"explanation_en": "Ghoomar is a prominent dance form originated in Rajasthan, particularly in the Jaisalmer district. It is performed by women wearing traditional Jodhpuri dress and carrying a parasol.",
"explanation_hi": "गोमार राजस्थान के कौमूरा को छाने वाले एक उच्चकरण कोणति है। इसमें जयासालमेर जिले कोणति में बना हुआ और वाले राजमूरा कोणति है।",
"Role: Aap ek expert Exam Content Creator ho jata hai jo Rajasthan ke liye LDC, CET, RAS, SC, aur Railway (NTPC) ke liye questions taiyar karein. Niche diye gaye Subject aur Topic par 10 high-quality MCQ taiyar karein.

{
"subject": "Rajasthan",
"topic": "Rajasthani Culture",
"question_en": "What is the traditional dance form of Rajasthan?",
"question_hi": "राजस्थान के तत्त्वार कोणति।",
"A_en": "Ghoomar",
"A_hi": "गोमार",
"B_en": "Taal",
"B_hi": "ताल",
"C_en": "Gujari",
"C_hi": "गुजारी",
"D_en": "Barod",
"D_hi": "बारोड",
"answer": "Ghoomar",
"explanation_en": "Ghoomar is a traditional dance form originating from Rajasthan, known for its expressive movements and vibrant costumes. It originated in Jaisalmer district.",
"explanation_hi": "गोमार एक राजस्थान के कालिक है जो मोहनों और खरियाँ के आदरियाँ है जो मोहनों और खरियाँ अवारियाँ हों",
"B_hi": "गोमार",
"C_hi": "गोमार",
"D_hi": "गोमार",
"answer": "गोमार",
"explanation_hi": "गोमार",
"explanation_en": "Ghoomar is a traditional dance form of Rajasthan, known for its lively movements and vibrant dresses. It originated in Jaisammer district.",
}
]