[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jaipur?",
"question_hi": "जयपुर में किस पसंदीदा फोट है?",
"A_en": "Amer Fort", "A_hi": "अमेर फोट",
"B_en": "Hawa Mahal", "B_hi": "हवा महाल",
"C_en": "City Palace", "C_hi": "शहर पैलेस",
"D_en": "Nahargarh Fort", "D_hi": "नाहरगढ़ फोट",
"answer": "B",
"explanation_en": "Hawa Mahal is a famous fort located in Jaipur, known for its unique design and architecture.\nहवा महाल जयपुर में खुदा है, जिसमें उनका विशेष डिजन और आर्किंग करने का एक उपयोग करने के लिए प्रासूट करो।",
"explanation_hi": "जयपुर में खुदा है, जिसमें उनका विशेष डिजन करने के लिए प्रासूट करो।",
"answer": "B",
"explanation_en": "Hawa Mahal is a famous monument in Jaipur, known for its unique design and architecture.",
"explanation_hi": "हवा महाल जयपुर में खुदा है, जिसमें उनका विशेष डिजन करने के लिए प्रासूट करो।",
"answer": "B",
"explanation_en": "The Amer Fort is a historic fort located in Jaipur, known for its beautiful architecture and significance in Rajasthan's history.",
"explanation_hi": "अमेर फोट हिस्टोर को जयपुर में खुदा है, जिसमें उनकी बहूलिंग करो।",
"answer": "B",
"explanation_en": "Which king was responsible for building of Amer Fort?",
"explanation_hi": "अमेर फोट के बनेवालों के लीन क्यां हैं?",
"answer": "KI",
"explanation_en": "When did the construction of Amer Fort start?",
"explanation_hi": "अमेर फोट के काम समूर्ति क्या हैं?",
"answer": "1528-1557",
"explanation_en": "Which famous ruler is associated with the Amer Fort?",
"explanation_hi": "अमेर फोट के मौलेवालों कें हैं?",
"answer": "KI",
"explanation_en": "In what year was the construction of Amer Fort completed?",
"explanation_hi": "अमेर फोट का काम पूरा होता है।",
"answer": "1546",
"explanation_en": "When did the construction of Amer Fort begin?",
"explanation_hi": "अमेर फोट का काम श्रम होता है।",
"answer": "1528",
"explanation_en": "Who was the ruler during the construction of Amer Fort?",
"explanation_hi": "अमेर फोट का काम करने का पहलाया होता है।",
"answer": "पोते का मौलोंं",
"explanation_en": "Who was the builder of Amer Fort?",
"explanation_hi": "अमेर फोट का बलाया होता होता होता है।",
"answer": "बलाया।",
"explanation_en": "Which dynasty built the Amer Fort?",
"explanation_hi": "अमेर फोट का बलाया होता होता होता होता होता हिं।",
"answer": "मेर फोट का बलाया होता होता होता होता हिं।",
"explanation_hi": "अमेर फोट का बलाया होता होता होता होता होता हिं।",
"answer": "अमेर फोट का बलाया होता होता होता होता होता हिं।",
"explanation_hi": "अमेर फोट का बलाया होता होता हिं।",
]