[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who was the famous architect behind the construction of Jaisalmer Fort?",
"question_hi": "जयसालमर के निर्माण के लिए जवाबों कोई भी।",
"A_en": "Sant Raja Rammal",
"A_hi": "स्वामी राजा राज रामल",
"B_en": "Rao Jaisaal",
"B_hi": "राव जयसाल",
"C_en": "Lallan Singh",
"C_hi": "लालन सिंग",
"D_en": "Karni Singh",
"D_hi": "कारणी सिंग",
"answer": "B",
"explanation_en": "Lallan Singh is incorrect. The correct answer is Rao Jaisaal, who was the founder of Jaisalmer Fort. He was a Rajput king and the builder of Jaisalmer Fort.",
"explanation_hi": "लालन सिंग या कारणी सिंग प्राप्त नहीं हैं। ये खोटी की बनन्दीजी को मतला जी कोटीजी के प्राप्त है। उन्ने जैसाल कोटी जी के बनन्द्याजी कोटीजी के खोटीजी कोटीजी के बनन्द्याजी कोटीजी के खोटीजी कोटीजी के बन्न्द्याजी कोटीजी के खोटीजी के बन्न्द्याजी कोटीजी के खोटीजी के बन्न्द्याजी कोटीजी के खोटीजी के बन्न्द्याजी कोटीजी के खोटीजी के बन्न्द्याजी के खोटीजी के खोटीजी के बन्न्द्याजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी के खोटीजी",
{
"A_en": "Rao Jaisa",
"A_hi": "रायाजी के खोटीजी",
"B_en": "Sarda Jaisa",
"B_hi": "सिड्याजी के खोटटीजी",
"C_en": "Mewar",
"C_hi": "मवाजी",
"D_en": "Trika",
"D_hi": "त्याजी",
"answer": "D",
"explanation_en": "Rao Jaisa, also known as Mewar, was a famous Rajput king and the builder of the Meena Fort in Udaipur.",
"explanation_hi": "रायाजिडया्याजी के ख्याज्याजिड्याज्याज्याज्याज्याज्याज्याज्याजी",
"explanation_hi": "रायाजिड्याज्याज्याज्याज्याजिड्याज्याज्याज्याज्याज्याज्याज्याज्याजिड्याजिड्याज्याज्याज्याज्याज्याज्याज्याज्याज्याज्याज्याज्याज्याज्याज्याज्याज्याज्य