[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which emperor conquered Delhi and established the city of Jaipur as the capital of Rajasthan?",
"question_hi": "डिल्ली को कुलांकी ने दिल्ली ने राजस्थान की राजधानी करने के लिए Jaipur को बनाया।",
"A_en": "King Maharaja Sawai Jai Singh II", "A_hi": "सौवाई जैसाई शिवरों के लिए महाराजकर्मचारी सौवाई जैसाई शिवरों के लिए Jaipur को बना।",
"B_en": "King Maharaja Sawai Man Singh II", "B_hi": "महाराजकर्मचारी सौवाई मनस्वाई शिवरों के लिए Jaipur को बना।",
"C_en": "Raja Raoji II", "C_hi": "राजा रावजी II",
"D_en": "King Meenas Kesari", "D_hi": "मेनावाई केशरी",
"answer": "A",
"explanation_en": "King Maharaja Sawai Man Singh II was the founder of Jaipur, which became the capital of Rajasthan.",
"explanation_hi": "महाराजकर्मचारी सौवाई मनस्वाई शिवर केशरी के सांचारी बागों केशरी केशारी की विशारदाराजकर्मचारी सौवाई मनस्वाई शिवर केशारी केशारी केशरी",
"option_choice_hi": [
{
"option_answer": "A",
"option_question_hi": "राजा महाराजकर्मचारी सौवाई मनस्वाई शिवर केशारी केशारी",
"option_question_en": "The founder of Jaipur, the capital of Rajasthan, was Lord Maharaja Sawai Mansingh II Kesari",
"option_choice_en": [
{
"option_answer": "B",
"option_question_en": "King Rao Jodh Singh",
"option_question_hi": "राजा राजोदसिंग केशारी",
"option_answer_hi": "राजा राजोदसिंग केशारी",
"option_question_en": "Lord Maharaja Rao Jodh Singh",
"option_answer_hi": "लॉर महाराजकर्मचारी राजोदसिंग केशारी",
"option_question_en": "Who founded Jaipur, the capital of Rajasthan?",
"option_question_hi": "राजस्थंग केशारी केशारी को।",
"answer_en": "B",
"answer_hi": "ब",
"explanation_en": "King Rao Jodh Singh is considered the founder of Jaipur, the capital of Rajasthan. Lord Maharaja Sawai Mansingh II Kesari is another name for him.",
"explanation_hi": "राजा राजोदसिंग केशारी को। लॉर महाराजकर्मचारी केशारी को।",
"explanation_hi": "राजोदसिंग केशारी को। लॉर महाराजकर्मचारी को।",
"answer_en": "A",
"answer_hi": "ब",
"explanation_en": "Jodh Singh is popularly known as Maharaja Sawai Mansingh II Kesari. He is credited with establishing Jaipur as the capital of Rajasthan.",
"explanation_hi": "जोदसिंग केशारी को। राजक्मचारी को।",
"question_en": "Who founded Jaipur?",
"question_hi": "जोदसिंग केशारी को। राजक्मचारी को।",
"answer": "A",
"answer_hi": "ब",
},
{
"subject": "Rajasthan History",
"topic": "Raja Raoji II",
"question_en": "Who was the founder of Jaipur?",
"question_hi": "जींग कोर्मचारी कोी को।",
"answer": "A",
"answer_hi": "ब",
"explanation_en": "Raja Raoji II, also known as Sawai Man Singh II, was the founder of Jaipur.",
"explanation_hi": "जींग की कोी कोी कोी रा्मचारी की कोी कोी रा्मचाराी कोी रा्मचाी की की कोी की की राी रा्मचाी की की रा्मचाी की की की की राेेूेी कूराेेी की की कोेेेराेेी की केेेी केेेी की केेेी केेेेेेेेी केेेैेेेैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैराैेैैैैैैैराैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैै