[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "What is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी क्या है?",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Jaipur",
"B_hi": "जयपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Bikaner",
"D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Jaipur is the capital of Rajasthan.",
"explanation_hi": "जैपुर राजस्थान की राजधानी है।",
"explanation_hindi": "राजस्थान की राजधानी है।"
},
{
"subject": "Rajasthan History",
"topic": "Era of Raja Man Singh I",
"question_en": "Who is the famous Rajput ruler of Jaipur during the Mughal era?",
"question_hi": "मुगोल के समृदंज़ी में जैपुर के बाज़ार किसी कौन है।",
"answer": "B",
"explanation_en": "Raja Man Singh I was a prominent Rajput ruler of Jaipur during the Mughal era. He is best known for his contribution in the Battle of Gujarat in 1527 against the Mughal Emperor Babur.",
"explanation_hi": "मुगोल के समर्थ में जैपुर के बाज़ार किसी कौन है।",
"explanation_hindi": "राजा में सम्रता में जैपुर के बाज़ारों में कौन प्रश्रों के बाज़ारों में कौन प्रश्रों के बाज़ारों में कौन प्रश्रों के बाज़ारों में कौन प्रश्रों के बाज़ारों में कोण्यां के बाज़ारों में कौन प्रश्रों के बाज़ारों में कोण्यां कोण्यां के बाज़ारों में ने कौन प्रश्रों के बाज़ारों में कोण्यां कोण्यां के बाज़ारों में कौन प्रश्रों के बाज़ारों में कौन प्रश्रों के बाज़ारों में कौन प्रश्रों के बाज़ारों में कौन प्रश्रों के बाज़ारों में कौन प्रश्रों के बाज़ारों में कौन प्रश्रों के बाज़ारों में कौन प्रश्रों के बाज़ारों में कौन परश्रों के बाज़ारों में कौन परश्रों के बाज़ारं में कौन परश्रों के बाज़ारों में कौन परश्रों के बाज़ारों में कौन परश्रों के बाज़ारों में कौन परश्रों के बाज़ारों में कौन परश्रों के बाज़ारों में कौन पर्र्रों में कौन बाज़ार्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्रें बाज़ार्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र