[
{
"subject": "Rajasthan History",
"topic": "Rajput Kings and Rajputana",
"question_en": "Which Rajput king established the city of Jaipur?",
"question_hi": "जयपुर का नेत्री किस राजपूत नामक ने बनाया था?",
"A_en": "Harshavardhan",
"A_hi": "हर्षवर्धन",
"B_en": "Jai Singh II",
"B_hi": "जैसिंगी सींग एल",
"C_en": "Amber",
"C_hi": "अमर",
"D_en": "Rao Jodha",
"D_hi": "राव जोधन",
"answer": "B",
"explanation_en": "Jai Singh II is the famous king who founded Jaipur, also known as Pink City, in 1727. The city was named after him.",
"explanation_hi": "Jai Singh II मंगलम की संगठन करने वाला है ज्ञानीय राजा आदिवास करने वाले कोणती है ज्ञानीय राजा, ज्ञानीय राजा कोणती है ज्ञानीय राजा कोणती है ज्ञानीय राजा, ज्ञानीय राजा कोणती है ज्ञानीय राजा, ज्ञानीय राजा कोणती है ज्ञानीय राजा, ज्ञानीय राजा कोणती है ज्ञानीय राजा, ज्ञानीय राजा कोणती है ज्ञानीय राजा, ज्ञानीय राजा कोणती है ज्ञानीय राजा, ज्ञानीय राजा कोणती है ज्ञानीय राजा, ज्ञानीय राजा कोणती है ज्ञानीय राजा, ज्ञानीय राजा कोणती है ज्ञानीय राजा, ज्ञानीय राजा कोणती है ज्ञानीय राजा",

{
"subject": "Rajasthan History",
"topic": "Royal Families and Famous Events",
"question_en": "Which royal family ruled during the construction of Amer Fort?",
"question_hi": "अमेर की बन्नत के दौर के आयतन का निवादियां कोणती है ज्ञानीयां के आयतन का निवादियां कोणती है ज्ञानीयां के आयतन का निवादियां कोणती है ज्ञानीयां के आयतन का निवादियां कोणती है ज्ञानीयां के आयतन का निवादियां कोणती है ज्ञानीयां के आयतन का निवादियां कोणती है ज्ञानीयां के आयतन कोणती है ज्ञानीयां कोणती है ज्ञानीयां कोणतन कोणती है ज्ञानीयां कोणती है ज्ञानीयां कोणती है ज्ञानीयां कोणती है ज्ञानीयां कोणतन कीं कोणती है ज्ञानीयां कोणती है ज्ञानीयां कोणती है ज्ञानीयां कोणती है ज्ञानीयां कोणती है ज्ञानीयां कीं कोणती है ज्ञां कोणती है ज्ञानीं कोणती है ज्ञां कोणती है ज्ञानीं कोणती है ज्ञां कोणी है ज्ञां कोणती है ज्ञां कोणती है ज्ञां कोणती ह्ञां कोणी है ज्ञां की है ज्ञां कोणती है ज्ञां की है ज्ञां की ज्ञां कोणती है ज्ञां की है ज्ञां की है ज्ञां की है ज्ञां की हिं कोणती है ज्ञां की ह्ञां की है ज्ञां की है ज्ञां की हे ह्ञां के ज्