[
{
"subject": "Rajasthan History",
"topic": "Rajasthan Capital",
"question_en": "Which city is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी कौन सी शहर है।",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Jaipur",
"B_hi": "जयपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Bikaner",
"D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Jaipur is the capital of Rajasthan, also known as the Pink City. The other options mentioned are also cities in Rajasthan, but Jaipur holds the title of being the capital.",
"explanation_hi": "जयपुर राजस्थान की राजधानी है, जैसे लाल शहर के नाम से जानने के लिए हैं। अन्य उपयोग के लिए हैं, लेकिन जानने के लिए हैं।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Families",
"question_en": "Which royal family ruled over Rajasthan before the establishment of the British Raj in India?",
"question_hi": "राजस्थान के राज प्राधिकारी को भारती राज के प्राधिकारी के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारती राज के स्थान के प्राधिकारी को भारी राज के स्थान के प्राधिकारी के भारती राज के स्थान के प्राधिकारी के हे प्राधिकारी के हे प्राधिकारी हे हे हे प्राधिकारी के हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे हे