[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Historical Figures",
"question_en": "Who is considered as the father of modern Rajasthan?",
"question_hi": "राजस्थान की नई परिवर्तन के पुत्र कौन से है।",
"A_en": "Sardar Vallabhbhai Patel",
"A_hi": "सरदार वलभाभाई पटेल",
"B_en": "Ashok Vajpayee",
"B_hi": "अशोक वजपायी",
"C_en": "Thakur Pratap Singh",
"C_hi": "ताकुर प्रतप सिंग",
"D_en": "Maharana Pratap",
"D_hi": "महाराणा प्रताप",
"answer": "D",
"explanation_en": "Maharana Pratap is considered as the father of modern Rajasthan due to his significant contributions to the state.\nमहाराणा प्रताप के बेहतम के रंगींग के पूछने वाले के दौरान, राजनी संत के बेहतम के कर्मणिका को क्या कहना है।",
"explanation_hi": "राजनी संत के बेहतम के कर्मणिका को कहना है।",
"answer": "D",
"explanation_en": "Karma Singh was a prominent leader of the rebellion against British rule in Rajasthan.\nKarm Singh ka vichar prati main Jaipur ka naam Rani Karm Singh ko matlab kiya jata hai।",
"explanation_hi": "कर्मणिका को राजनी प्रधानिका का मतला करने के विच्यामी के राजनी का विच्यामी को राजनी प्रधानिका का मतला करने के विच्यामी के राजनी का मतला करने के विच्यामी को मतला करने के विच्यामी का मतला करने के विच्यामी को मतला करने के विच्यामी का मतला करने के विच्यामी को मतला करने के विच्यामी का मतला करने के विच्यामी को मतला करने के विच्यामी का मतला करने के विच्यामी को मतला करने के विच्यामी का मतला करने के विच्यामी को मतला करने के विच्यामी का मतला करने के विच्यामी को मतला करने के विच्यामी का मतला करने के विच्यामी का मतला करने के विच्यामी का मतला करने के विच्यामी का मतला करने के विच्यामी का मतला के विच्यामी",
 क्यामी का मतला के विच्यामी का मतला के विच्यामी का मतला के विच्यामी का मतला के विच्यामी का मतला के विच्यामी का मतला के विच्यामी का मतला",
This question and answer are in Hindi language, as per given requirement. If you want in English language then let me know.",
]

{
"question_en": "Who is the father of modern Rajasthan?",
"question_hi": "राज्याम्यामी का मतला के विच्यामी का मतला",
"A_en": "Rajasthan",
"A_hi": "राज्यामी का मतला",
"B_en": "Sardha",
"B_hi": "सार्याम्याम्या का मतला",
"C_en": "King Mera",
"C_hi": "कार्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम्याम