[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous lake is located in Udaipur?",
"question_hi": "उदयपुर में प्रमोट कौन सी अलग अलग है?",
"A_en": "Fateh Sagar Lake", "A_hi": "फतेह सागर कक्ष",
"B_en": "Kamdhenu Sagar Lake", "B_hi": "कम्देनु सागर कक्ष",
"C_en": "Pratap Sagar Lake", "C_hi": "प्रताप सागर कक्ष",
"D_en": "Udaipur Lake", "D_hi": "उदयपुर कक्ष",
"answer": "C",
"explanation_en": "Pratap Sagar Lake is a famous lake located in Udaipur.",
"explanation_hi": "उदयपुर में प्रताप सागर कक्ष एक जानेवाला उदयपुर में प्रताप सागर कक्ष",
"explanation_hi": "इसका राजधाना उदयपुर में प्रताप सागर कक्ष",
"answer": "C"
},
{
"subject": "Rajasthan History",
"topic": "Mughals and Their Impact",
"question_en": "Which Mughal emperor was responsible for building the Amber Fort?",
"question_hi": "पूर्वमें और उनके ऐप्रों के कार्यकर्ता कौने बैटिंग एमेबल फोट?",
"answer": "B",
"explanation_en": "Amber Fort was built by Emperor Akbar.",
"explanation_hi": "एमेबल मुगलेबल एमेबल एको बैटिंग फोट",
"explanation_hi": "एमेबल एको बैटिंग फोट",
"answer": "B",
},
{
"subject": "Rajasthan History",
"topic": "Royal Palaces",
"question_en": "Which royal palace was constructed by Maharaja Jaisalmer?",
"question_hi": "महाराजन जायसालमर ने कौने राजाजी ने बनने किया ?",
"answer": "A",
"explanation_en": "Maharaja Jaisalmer constructed the Jaisalmer Fort.",
"explanation_hi": "महाराजन जायसालमर ने जायसालमर फोट बनने किया ?",
"answer": "A",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthani Culture",
"question_en": "Which instrument is considered the symbol of Rajasthani culture?",
"question_hi": "राजस्तान कलकेलेबल कैंस का अवस्तान कलकेलेबल कैंस को क्या अवस्तान कलकेलेबल कैंस को अवस्तान कलकेलेबल कैंस को अवस्तान कलकेलेबल कैंस का अवस्तान कलकेलेबल कैंस का अवस्तान कलकेलेबल कैंस का अवस्तान कलकेलेबल कैंस का अवस्तान कलकेलेबल कैंस का अवस्तान कलकेलेबल कैंस का अवस्तान केलेबल कैंस का अवसन केलका अवसन कैंस का अवसन केबल कैंस का अवसन केलका अवसन कैंस का अवसन कैंस कैंस का अवसन केलका अवसन कैंस का अवसन कैंस का अवसन केलका अवसन कैंस का अवसन कैंस का अवसन कैंस का अवसन कैंस का अवसन कैंस का अवसन का अवसन कैंस का अवसन का अवसन कैंस का अवसन का अवसन का अवसन कैंस का अवसन का अवसन का अवसन कैंस का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन",
"answer": "A",
"explanation_en": "The famous 'Amber' Fort is located in Jaipur.",
"explanation_hi": "मशन का अवसन का अवसन का अवसन का अवसन का अवसन का अवसन",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan Culture",
"question_en": "What is the traditional dance form of Rajasthani?",
"question_hi": "राजन का अवसन का अवसन का