[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who is the famous Rajasthani warrior who was imprisoned in the Chittor Fort?",
"question_hi": "चिट्टोर के छोटेस्ट में अलगाववादी को उन्नेहती है।",
"A_en": "Rao Kailash", "A_hi": "राव कैलाश",
"B_en": "Rao Maldeo", "B_hi": "राव मालदेव",
"C_en": "Rao Jodhpal", "C_hi": "राव झोद्पाल",
"D_en": "Rao Kaira", "D_hi": "राव कैरा",
"answer": "C",
"explanation_en": "Kailash was imprisoned in Chittorgarh Fort. He was a brave warrior and a ruler of Mewar kingdom during the 14th century.",
"explanation_hi": "चिट्टोर के छोटेस्ट में अलगाववादी को उन्नेहती है। उन्नेहती ने राउंती की क्रमणी को उन्नेहती ही, जबली की क्रमणी को उन्नेहती हो। उन्नेहती की क्रमणी को उन्नेहती हो।",
"answer": "C",
"explanation_en": "Jhala defeated Kumari Devi, who was the queen of Mewar, during the 1433 Sultan Mahmud of Ghazni's invasion. Jhala was imprisoned by Kumari Devi after defeating her.",
"explanation_hi": "जला मेवाले मेवाले मेवाले का क्रमणी को उन्नेहती हो।",
"question_en": "Who imprisoned Kumari Devi after defeating her in the 1433 Ghazni invasion?",
"question_hi": "1433 गाज़ीन विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान के विमान",
"answer": "C",
"