[
{
"subject": "Rajasthan History",
"topic": "Famous Rajasthan Kings",
"question_en": "Who was the famous king of Mewar?",
"question_hi": "मैवर के पसंदीदा राजा कौन थे?",
"A_en": "Pratap Singh",
"A_hi": "प्रताप सिंह",
"B_en": "Rao Jodha",
"B_hi": "राव जौधा",
"C_en": "Raja Khem Singh",
"C_hi": "राजा कम सिंग",
"D_en": "Hanuman Singh",
"D_hi": "हनुमान सिंह",
"answer": "B",
"explanation_en": "Pratap Singh and Rao Jodha are famous kings of Mewar, but the correct answer is Rao Jodha, who founded the city of Jaipur.\nप्रताप सिंह और Rao Jodha मैवर का प्रमाणपद और राजा जौधा हैं, लेकिन यहाँ जानकारी का उत्तम बीचे विभाग में Rao Jodha है, जैसे प्रांतीचे स्पष्टिंग विभागां में राजा जौधा हैं।",
"question_hi": "राजा जौधा का इतिहां स्पष्टिंग विभागां में राजा जौधा है।",
"question_en": "In which part of Rajasthan was Rao Jodha ruling?",
"answer": "Rao Jodha ruled in the region of Rajasthan.",
"explanation_en": "Rao Jodha was the founder of the Amer Fort and ruled in the area known as Amer, which is now a part of Jaipur district in Rajasthan. Jaipur district was established after the consolidation of Amer and Amber regions by Maharaja Sawai Mansingh I in 1727 AD.",
"explanation_hi": "कामेर लैंग सैवाई मांसिंग I ने 1727 AD में Amer और Amber क्षैवाई ने ये कमेर और अमेर के कामेर सैवाई में एमबेर और अमेर के कामेर सैवाई में एमबेर और अमेर के कामेर सैवाई में एमबेर और अमेर के कामेर सैवाई में एमबेर और अमेर के कामेर सैवाई में एमबेर और अमेर के कामेर सैवाई में एमबेर और अमेर के कामेर सैवाई में एमबेर और अमेर के कामेर सैवाई में एमबेर और अमेर के कामेर सैवाई में एमबेर और अमेर के कामेर सैवाई में एमबेर और अमेर के कामेर सैवाई में एमबेर और अमेर के कामेर सैवाई में एमबेर और अमेर कामेर सैवाई में एमबेर और अमेर कामेर सिर अमेर अमेर कामेर सिर अमर अमेर अमेर कामेर तिर अमेर कामेर अमेर अमेर कामेर कामेर अमेर अमेर तिर अमेर अमेर कामेर अमेर अमेर तिर अमेर अमेर कामेर अमेर अमेर कामेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर अमेर",
"
}
]