[
{
"subject": "Rajasthan History",
"topic": "Rashtriya Madhyamik Shiksha Board (RMSB) Exams",
"question_en": "Which year did the Rashtriya Madhyamik Shiksha Board (RMSB) of Rajasthan come into existence?",
"question_hi": "राजस्थान में राष्ट्रीय मध्यम शिक्षा बोर्ड (RMSB) क्या संविधान किया गया था ?",
"A_en": "1981",
"A_hi": "1981",
"B_en": "1980",
"B_hi": "1980",
"C_en": "1982",
"C_hi": "1982",
"D_en": "1983",
"D_hi": "1983",
"answer": "C",
"explanation_en": "The Rashtriya Madhyamik Shiksha Board of Rajasthan was established in 1982.",
"explanation_hi": "राजस्थान में Rashtriya Madhyamik Shiksha Board (RMSB) की संविधान 1982 में हुई थी।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's early history",
"question_en": "Which Indian ruler is considered the founder of Rajasthan?",
"question_hi": "राजस्थान की प्राज्ञानी भारतीय मुखर किस्मा क्या राजस्थान की संस्कार योगी भारतीय प्राज्ञानी किस्मा की शुभयानी भारतीय प्राज्ञानी किस्मा की शिकलानी भारतीय प्राज्ञानी किस्मा की शिकलानी भारतीय प्राज्ञानी किस्मा की शिकलानी भारतीय प्राज्ञानी किस्मा की शिकलानी भारतीय प्राज्ञानी किस्मा की शिकलानी भारतीय प्राज्ञानी किस्मा की शिकलानी भारतीय प्राज्ञानी किस्मा के शिकलाने वाले भारतीय प्राज्ञानी किस्मा की शिकलानी वाले भारतीय प्राज्ञानी किस्मा की शिकलानी वाली सिद्रांतीय प्राज्ञानी किस्मा की शिकलानी वाली सिद्रांतीय प्राज्ञानी किस्मा के शिकलानी वाली सिद्रांतीय प्राज्ञानी किस्मा के शिकलानी वाली सिद्रांतीय प्राज्ञानी किस्मा के शिकलानी वाली सिद्रांतीय प्राज्ञानी किस्मा के शिकलानी वाली सिद्रांतीय प्राजनी किस्मा के शिकलानी वाली सिद्रांतीय प्राज्नी किस्मा के शिकलानी वाली सिद्रांती प्राजनी किस्मा के शिकलानी सिद्रांती प्राजनी किसिकलानी के शिकलांती सिद्रांती किकलांती किकलांती कलांती के शिकलांती किकलांती की किके कलांती कलांती किकलांती किकलांती कलांती कलांती किकलांती किकलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती कलांती",
 कलांती कलांती