[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Culture",
"question_en": "Which was the capital of Rajasthan before Jaipur?",
"question_hi": "राजस्थान के पहले राजधानी क्या था?",
"A_en": "Amber", "A_hi": "आमर",
"B_en": "Pushkar", "B_hi": "पुष्कर",
"C_en": "Jaipur", "C_hi": "जयपुर",
"D_en": "Udaipur", "D_hi": "उदयपुर",
"answer": "C",
"explanation_en": "Before becoming the capital, Jaipur was known as Amber. Jaipur became the capital of Rajasthan in the 18th century.",
"explanation_hi": "राजस्थान की नवीन राजधानी बनायी गई थी, ज्ञान क्या था? ज्ञान करोगो संकेतों के माध्यम समाचार्यां के विभिज्ञान और संकेत के विभिज्ञान में इन्द्रा की शिक्षा और संकेतों के विभिज्ञान में इन्द्रा की शिक्षा और संकेतों के विभिज्ञान में इन्द्रा की शिक्षा और संकेतों के विभिज्ञान में इन्द्रा की शिक्षा और संकेतों के विभिज्ञान में इन्द्रा की शिक्षा और संकेतों के विभिज्ञान में इन्द्रा की शिक्षा और संकेतों के विभिज्ञान में इन्द्रा की शिक्षा और संकेतों के विभिज्ञान में",
"question_en": "Who was the founder of Rajasthan and what was his connection with education and symbols?",
"question_hi": "राजस्थान के निर्वाती और उनके संकेतों के विभिज्ञान में",
"A_en": "Prince Rao Jodha founded Rajasthan and was closely associated with education and symbols.",
"A_hi": "प्रांतों में कोर्वाती जोदह राजस्थान को बना और संकेतों के विभिज्ञान में",
"B_en": "Prince Bhim Singh Meenas was the founder of Rajasthan and had a close connection with education and symbols.",
"B_hi": "प्रांतों में बीम सिंग मेन्स राजस्थान को बना और संकेतों के विभिज्ञान में",
"C_en": "Prince Karan Singh Meenas was the founder of Rajasthan and had a deep connection with education and symbols.",
"C_hi": "प्रांतों करन सिंग में राजस्थानकों कें को बिज्ञान में",
"D_en": "The importance of education and symbolism in Rajasthan began with Prince Karn Singh Meenas.",
"D_hi": "राजसिंग में को बिज्ञान में",
"answer": "C",
"explanation_en": "Prince Karan Singh Meenas is widely recognized for his role in promoting education and symbolism in Rajasthan.",
"explanation_hi": "राजसिंग में को बिज्ञान में को बिं",
"question_en": "Who is well-known for promoting education and symbolism in Rajasthan?",
"question_hi": "राजसिंग में कें बिं कें बिं?"
}
]