[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jaipur?",
"question_hi": "जयपुर में प्रमुखे एक क़मरा है।",
"A_en": "Amer Fort", "A_hi": "अमेर कमरा",
"B_en": "Khebar Fort", "B_hi": "खेबर कमरा",
"C_en": "Hawa Mahal", "C_hi": "हावा महाल",
"D_en": "City Palace", "D_hi": "शहर कमरा",
"answer": "D",
"explanation_en": "The City Palace is a famous landmark located in Jaipur, known for its architecture and cultural significance.",
"explanation_hi": "जयपुर में आत्मनी और कालीगर्वान्ध में स्थित है।",
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who was the first ruler of Rajasthan?",
"question_hi": "राजस्थान के पहले राजन कौन थे।",
"A_en": "Pratap Singh",
"A_hi": "प्रताप सिंग",
"B_en": "Ala Singh",
"B_hi": "अला सिंग",
"C_en": "Maharana Pratap",
"C_hi": "महाराणा प्रताप",
"D_en": "Udai Singh",
"D_hi": "उदाय सिंग",
"answer": "C",
"explanation_en": "Maharana Pratap was the first ruler of Rajasthan, a historical figure from the Mewar region. His full name is Maharana Pratap Singh.",
"explanation_hi": "महाराणा प्रताप के आधी नाम महाराणा प्रताप सिंग है।",
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which was the capital of Rajasthan during the time of Maharana Pratap?",
"question_hi": "महाराणा प्रताप के समय में Rajasthan के नगह कौन सी थी।",
"A_en": "Amber",
"A_hi": "अम्बर",
"B_en": "Udaipur",
"B_hi": "उदयपुर",
"C_en": "Jodhpur",
"C_hi": "जोधपुर",
"D_en": "Jaipur",
"D_hi": "जयपुर",
"answer": "D",
"explanation_en": "During the time of Maharana Pratap, Jaipur was the capital of Rajasthan. It is also known as the 'Pink City' due to its pink-colored buildings.",
"explanation_hi": "महाराणा प्रताप के समय में Jaipur राजस्थान के नगर था और उनके राजपूर्वों की मोहमी के एक बीमा के अंतर्वों के समय में Jaipur राजस्थान के नगर था और उनके एक भारती के अंतर्वों के समय में Jaipur राजस्थान के नगर था और उनके एक भारती के अंतर्वों के समय में Jaipur राजस्थान के नगर था और उनके एक भारती के अंतर्वों के समय में Jaipur राजस्थान के नगर था और उनके एक भारती के अंतर्वों के समय में Jaipur राजस्थान के एक भारती के अंत्र्वों के एक भारती के अंत्र्व्र्र्व्र्व्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र