[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "Which city is the capital of Rajasthan?",
"question_hi": "राजस्थान की किस शहर की राजधानी है?",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Jaipur",
"B_hi": "जयपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Bikaner",
"D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Jaipur is the capital of Rajasthan.",
"explanation_hi": "जयपुर, Rajasthan की राजधानी है।",
"explanation_en_alt": "The capital of Rajasthan is Jaipur.",
"explanation_hi_alt": "राजस्थान की राजधानी है। यहां तभी जयपुर है।",
"explanation_en_alt_alt": "Jaipur is the capital city of Rajasthan and serves as the administrative headquarters for the state.",
"explanation_hi_alt_alt": "राजस्थान की राजधानी है। यहां तभी जयपुर है।",
},
{
"subject": "Rajasthan's Capital",
"topic": "Geographical Features",
"question_en": "What is the geographical location of Jaipur?",
"question_hi": "जयपुर का गैस्प्रेशीय स्थान क्या है?",
"A_en": "Jaipur is located in the central region of Rajasthan.",
"A_hi": "जयपुर राजस्थान को किस्प्रेशीय स्थान को किस्प्रेशीय स्थान और त्रिज्युत स्थान को किस्प्रेशीय स्थान का त्रिज्युत स्थान और त्रिज्युत स्थान का को किस्प्रेशीय स्थान और अन्तर्षित स्थान का किस्प्रेशीय स्थान और अन्तर्षित स्थान का किस्प्रेशीय स्थान और अन्तर्षित स्थान का किस्प्रेशीय स्थान और अन्तर्षित स्थान का किस्प्रेशीय स्थान और अन्तर्षित स्थान का किस्प्रेशीय स्थान और अन्तर्षित स्थान का किस्प्रेशीय स्थान और अन्तर्षित स्थान का किस्प्रेशीय स्थान और अन्तर्षित स्थान का किस्प्रेशीय स्थान और अन्तर्षित स्थान का किस्प्रेशीय स्थान और अन्तर्षित स्थान का किस्प्रेशीय स्थान और अन अन का किस्प्रेशीय स्थान का किस्प्रेशीय स्थान का किस्प्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशय स्थान का किस्रेशीय सिय स्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशीय स्रेशीय स्थान का किस्रेशीय स्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशीय स्थान का किस्रेशीय स्थान का किस