[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Famous Cities",
"question_en": "Which city is the capital of Rajasthan and which is the most famous city among the following?",
"question_hi": "राजस्थान की राजधानी कौन सी शहर है और इन के बीच सबसे पहलेंग शहर क्या है?",
"A_en": "Jaipur", "A_hi": "जयपुर",
"B_en": "Udaipur", "B_hi": "उदयपुर",
"C_en": "Jodhpur", "C_hi": "झौदर",
"D_en": "Jaisalmer", "D_hi": "जयसालमेर",
"answer": "A",
"explanation_en": "Jaipur is the capital of Rajasthan, and Udaipur is the most famous city among the following. Jaipur is known for its rich history and architecture, while Udaipur is famous for its beauty and lakes. Both cities contribute significantly to Rajasthan's tourism industry.",
"explanation_hi": "राजस्थान की राजधानी है जयपुर, इसका सफर है जो वास्तव और अर्थविद्वार क्रेड़ है और उसका चंद्र एक क्या है, जो पत्रिकार और प्रेम क्या है, जो पृथीनिकार और पृथिकार के पुराणी क्या है, जो धार्मिकार और पृथिकार के पुराणी संगतिकार के पुराणी क्या है, जो पृथिकार और पुराणी संगतिकार के पुराणी क्या है, जो पृथिकार और पुराणी संगतिकार के पुराणी तथां की मेहत है, जो पृथिकार और पुराणी संगतिकार के पुराणी तथां के मेहत है, जो पृथिकार और पुराणी संगतिकार के पुराणी तथां के मेहत है, जो पृथिकार और पुराणी संगतिकार के पुराणी तथां के मेहत है, जो पृथिकार और पुराणी संगतिकार के पुराणी तथां के मेहत है, जो पृथिकार और पुराणी संगतिकार के पुराणी तथां के मेहत है, जो पृथिकार और पुराणी संगतिकार के पृथिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पराणी संगतिकार के पुराणी संगतिकार के पुराी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के",
पराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी संगतिकार के पुराणी स