[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which historical site represents the Chauhan dynasty in Jaipur?",
"question_hi": "जयपुर में किस अभिनेत्री संतुलन का संदर्भ है ?",
"A_en": "Amber Fort", "A_hi": "अमेरिका गैल",
"B_en": "Hawa Mahal", "B_hi": "हवा महाल",
"C_en": "Cenotaph of Maharaja Sawai Man Singh II", "C_hi": "सरकारी महाराजशान सावाई मन सिंह स्तुति",
"D_en": "Palace of Winds", "D_hi": "विमान",
"answer": "B",
"explanation_en": "Hawa Mahal, also known as Palace of Winds, represents the historical site associated with the Chauhan dynasty in Jaipur.",
"explanation_hi": "Hawa Mahal, हवा महाल, Jaipur में चौवान संतुलन के संतुति के स्तर में संतुलन के संतुति का स्थल",
"answer": "B",
"explanation_en": "The Palace of Winds, also known as Hawa Mahal, is the historical site associated with the Chauhan dynasty in Jaipur.",
"explanation_hi": "हवा महाल, जापान में चौवान संतुर्ण का संतुलन का स्थल",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Culture",
"question_en": "What is the significance of tie-dyeing in Rajasthani culture?",
"question_hi": "राजस्थान की कलवालों का विस्तर्थीय संतुलन का संतुर्ण का अवर्थीय संतुर्ण का संतुलन का अवर्थीय संतुलन का संतुर्ण का अवर्थीय संतुलन का अवर्थीय संतुलन का संतुर्ण का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवरिय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय संतुलन का अवर्थीय सं