[
{
"subject": "Rajasthan History",
"topic": "Rajasthan State Formation",
"question_en": "Which ruler is associated with the formation of present-day Rajasthan?",
"question_hi": "राजस्थान की वर्तमान के निर्माता कौन से हैंसे संबंधित है।",
"A_en": "Ala Singh",
"A_hi": "अला सिंह",
"B_en": "Tarachand",
"B_hi": "तरचंद",
"C_en": "Vinay Singh",
"C_hi": "विनायसिंग",
"D_en": "Sawai Jai Singh II",
"D_hi": "स्वामी जयसिंग एल्यांन",
"answer": "D",
"explanation_en": "Sawai Jai Singh II is associated with the formation of present-day Rajasthan as the founder of Jaipur, the capital city.",
"explanation_hi": "स्वामी जयसिंग एल्यांन शामी जयसिंग एल्यांन संस्करण तथा जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयांन शामी जयसिंग एल्यांन शामी जयसिंग एल्यांन शामी जयांग एल्यांन शामी जयसिंग एल्यांन शामी जयांन शामी जयांन शामी",
"question_hi": "एल्यांन शामी जयसिंन शामी जयांन शामी",
"answer": "D",
"explanation_hi": "एल्यांन शामी जयसिंन शामी जयांन शामी",
"question_en": "Which ruler is associated with the formation of Rajasthan state?",
"question_hi": "एल्यांन शामी जयांन शामी जयांन शामी",
"A_en": "Ala Singh",
"A_hi": "एल्यांन शामी जयांन शामी जयांन शामी",
"B_en": "Sawai Jai Singh",
"B_hi": "एल्यांन शामी जयांन शामी",
"C_en": "Udaipur",
"C_hi": "