[
{
"subject": "Rajasthan History",
"topic": "Rajput Kingdoms",
"question_en": "Which Rajput kingdom was established by Rana Kumbha?",
"question_hi": "राजपूत संघों में राणा कुम्भी ने किस संघ को संरक्षण में परिभाषा कैसे सुनवाल है।",
"A_en": "Kachchhap Rajputana",
"A_hi": "काचप राजपूत",
"B_en": "Meena Rajputana",
"B_hi": "मेना राजपूत",
"C_en": "Aravalli Rajputana",
"C_hi": "अरवाली राजपूत",
"D_en": "Chauhan Rajputana",
"D_hi": "चौहान राजपूत",
"answer": "B",
"explanation_en": "Kachchhap Rajputana was established by Rana Kumbha. The kingdom is also known as Meena Rajputana.",
"explanation_hi": "Rana Kumbha ne Kachchhap Rajputana किया है। इस राजपूत को भी मेना राजपूत की भाषा में जाना है।",
},
{
"subject": "Rajputana",
"topic": "Princely States",
"question_en": "Which princely state was merged with the Indian Union after India's independence from British rule?",
"question_hi": "भारत के उत्तमत से भारत संगत के लिए प्रधानियों का कौने समांग को एनिया के संगत के लिए एनिया को उत्तमत संगत के लो को राज्य को प्रांगत के लो को राजमंडल को क्या समांगत के लो को राज्य को प्रांगत के लो को राजमंडल को प्रांगत के लो को राज्य को प्रांगत के लो को पांजने के लो को राज्य को प्रांगत के लो को राज्य को प्रांगत के लो को प्रांगत के लो को राज्य को प्रांगत के लो को राज्य को प्रांगत के लो को राज्य को प्रांगत के लो को राज्य को प्रांगत के लो को राज्य को प्रांगत के लो को राज्य को प्रांगत के लो को राज्य को प्रांगत के लो को राज्य को प्रांगत के लो को राज्य को प्रांगत के लो को राज्य को प्रांगत को राज्य को प्रांगत को राज्य को प्रांगत को राज्य को प्रांगत को राज्य को प्रांगत को राज्य को प्रांगत को राज्य को प्रांगत को राज्य को प्रांगत को राज्य को प्रांगत को प्रांगत को रांगत क्य को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत क्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत को प्रांगत क्रांगत को प्रांगत क्रांगत क्रांगत क्रांगत क्रांगत क्रां