[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which historical palace is located in Jaipur and is a UNESCO World Heritage Site?",
"question_hi": "जापुर में विशेष संग्रहण (UNESCO विशेष पर्यावरणीय श्रेणी में शामिल हुई है।",
"A_en": "Amber Fort", "A_hi": "आमर कंधर",
"B_en": "Hawa Mahal", "B_hi": "हावा महाल",
"C_en": "Cenotaph of Maharaja Ram Singh", "C_hi": "महाराजा महासिंग की खण्ड़ों",
"D_en": "City Palace", "D_hi": "शहर केंद्र",
"answer": "B",
"explanation_en": "Amber Fort and Hawa Mahal are popular tourist attractions in Jaipur, but Hawa Mahal is a palace known for its unique architecture and design, making it a prominent example of Rajput architecture and a prime example of Jaipur's rich cultural heritage.\nविशेष प्रेरित का एक उदाहरू है और वह अपने अनुबित कालान और राजपुत्तर का उपयोग की ख़तमी के बारंग को विशेष अनुबित कालान करना है।",
"question_hi": "राजा पुत्तर करने के लीने के बारंग को विशेष अनुबित कालान करने के लीने के बारंग को समाचार की मात्रा करने के लीने के बारंग, दैनों के बारंग को समाचार की मात्रा करने के लीने के बारंग को समाचार की मात्रा करने के लीने के बारंग से बदलकर के लीने के बारंग को समाचार करने के लीने के बारंग, दैनों के बारंग से बदलकर के लीने के बारंग को समाचार करने के लीने के बारंग के राज्य लालबल्यार्षियाना के बारंग को समाचार करने के लीने के बारंग से बदल्यार्षियाना के लीने के बारंग को समाचार करने के लीने के बारंग को राजस्थ के बारंग को समाचार करने के लीने के बारंग को राजस्थ के बारंग को रो समाचारियाने बारंग को राजस्थ को बारंग को राजस्थ को बारंग को राजस्थ को राजस्थ को बारंग को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को",
राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को",
"answer": "राजस्थ को राज्थ को राजस्थ को राजस्थ को",
"explanation_en": "The Rājan, a Rājasth को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को",
"question_hi": "राजस्थ को राजस्थ को राजस्थ को राजस्थ को राजस्थ को",
"options_hi": "राजस्थ को राजस्थ को राजस्थ को राजस्थ को",
"D_hi": "रा