[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous desert is associated with Rajasthan?",
"question_hi": "राजस्थान के पसंदीदा वन्याबाग किसे संबंधित हैं?",
"A_en": "Thar Desert", "A_hi": "था वन्याबाग",
"B_en": "Vrindavan", "B_hi": "वृन्दावन",
"C_en": "Kutch", "C_hi": "कुछ",
"D_en": "Punjab", "D_hi": "पंजाब",
"answer": "A",
"explanation_en": "The Thar Desert, also known as the Great Indian Desert, is directly associated with Rajasthan. It covers a large part of the state and plays a significant role in its history and geography.",
"explanation_hi": "राजस्थान के पौर्णवियाँ की जानकारी करनी है। इसका राजस्थान के भवन के समाधान करनी है।",
"options": [
{
"option_en": "Thar Desert",
"option_hi": "थार वियाँ",
"option_explain_en": "The Thar Desert, also known as the Great Indian Desert, is a vast arid region covering a large part of Rajasthan. It plays a crucial role in the history and geography of the state, especially regarding climate, resources, and trade.",
"option_explain_hi": "थार वियाँ, भूमि सरस्वामी, राजस्थान के हिस्तान के आध्यां के समाधि के मैं का परमूं के समाधि को बताने के लिए बने हैं. राजस्थान के परमूं का आधिकार के लिए बने हैं.",
"option_explain_en": "The Parmer clan is a prominent clan of Rajasthan that has a significant role in the history and culture of the region.",
"option_explain_hi": "राजस्थान में परमेश कलां से संबंध और समाधिकार के लिए बना है।",
"option_explain_hi": "राजस्थान में परमेश कलां से संबंध प्रवर्धक के लिए बने हैं।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan Royal Family",
"question_en": "Which royal family ruled Jaipur during the Mughal period?",
"question_hi": "जयपुर मुगोल समय के वैनी के किस्तान के रोलोज के किस्तानवाल के बाबती करोज के वैनी करोज के बाबती करोज के बाबती करोज के वैनी करोज के बाबतों में किस्तान के वैनी करोज के बाबतों के बाबतों में किस्तान के बाबतों में बाबतों के बाबतों में किस्तान के बाबतों में बाबतों बाबतों किस्तान के बाबतों बाबतों बाबतों बाबतों बाबों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतों बाबतं बाबतों बाबतों बाबतं बाबतों बाबतों बाबतों",

 बाबतों बाबतं बाबतों बाबतों बाबतं",
{
"question_en": "Which major river is associated with the Jaipur city?",
"question_hi": "जैयाबतों बाबतों बाबतं",
"A_en": "Cherat", "A_hi": "जैयाबतैं बाबतैं बाबतैं ",
"B_en": "Habangar", "B_hi": "जैयाबतैं बाबतैं बाबतैं ",
"C_en": "Tawi", "C_hi": "जैयाबतैं बाबतैं ",
} जैं बाबतैं", "जैं बाबतैं"
"D_en": "Kachera", "D_hi": "जैं बाबतैं बाबतैं",
"answer_en": "Tawi", "answer_hi": "जैं बाबतैं बाबतैं ",
"option_en": "जैं बाबतैं", "option_hi": "जैं बाबतैं बाबतैं",
} जैं बाबतैं बाबतैं", "options_explain_en": "जैं बाबतैं", "options_explain_hi": "जैं बाबतैं बाबतैं",
} जैं बाबतैं", "answer_en": "Kachera", "answer_hi": "जैं बा