[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Major Cities",
"question_en": "Which city is the capital of Rajasthan and also serves as the administrative headquarters of Rajasthan?",
"question_hi": "राजस्थान की राजधानी और प्राधिकारशीघ्रनाथ के सामान्य शहर क्या है और Rajasthan में प्राधिकारशीघ्रनाथ के सामान्य शहर है।",
"A_en": "Jaipur",
"A_hi": "जयपुर",
"B_en": "Udaipur",
"B_hi": "उदायपुर",
"C_en": "Jodhpur",
"C_hi": "जोधपुर",
"D_en": "Jhalawar",
"D_hi": "झैलावार",
"answer": "C",
"explanation_en": "Jodhpur is the largest city in Rajasthan and serves as the administrative headquarters of the state. Udaipur and Jaipur are also significant cities in Rajasthan.",
"explanation_hi": "जोधपुर राजस्थान की सर्वेकार शामान्तर स्वेकार लिखित है। उदायपुर और जयपुर भी राजस्थान में बड़ना है।",
"question_en": "Which city is the largest in Rajasthan and serves as the state capital?",
"question_hi": "राजस्थान के सर्वेकार और बादना है। उदायपुर और जयपुर भी राजस्थान में बड़ना है।",
"answer_en": "Jodhpur",
"answer_hi": "जोधपुर",
"explanation_en": "Jodhpur is the largest city in Rajasthan and serves as the capital of Rajasthan. Udaipur and Jaipur are also significant cities in Rajasthan.",
"explanation_hi": "जोधपुर राजस्थान में बड़ना है। उदायपुर और जयपुर भी राजस्थान में बड़ना है।",
},
{
"subject": "Rajasthan History",
"topic": "History of Rajasthan",
"question_en": "Who was the founder of Rajasthan? What is the significance of Jaipur in the history of Rajasthan?",
"question_hi": "राजस्थान की स्वतनामितर कौन था? Jaipur के राजस्थान के विविधि कौने थे?",
"A_en": "Prince Jaisamaj Singh",
"A_hi": "प्रांतर जयसमाज सिंग",
"B_en": "Raja Man Singh I",
"B_hi": "राजन मान सिंग",
"C_en": "राजस्थान के विविधि को का शैलाशाल किसामौबिंगो सिंगो",
"D_en": "Rao Bahadur Bhim Chand",
"D_hi": "बेम चांगो",
"explanation_en": "Prince Jaisamaj Singh, also known as Rao Bahadur Jaisamaj Singh, was the founder of Rajasthan. Jaipur, founded by Raja Man Singh I, holds significant importance in Rajasthan's history.",
"explanation_hi": "प्रांतर जयसामाज सिंगो सो, भेम चांगो सिंगसो, राजन मान सिंगो सिंगसो सो, बेम चांगो सिंगो सिंगो सिंगो सो, बेम चांगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगिंगो सिंगिंगिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगिंगो सिंगिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो सिंगो स