[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Culture",
"question_en": "What is the cultural capital of Rajasthan?",
"question_hi": "राजस्थान की शिक्षा और संस्करण के अध्ययनी केंद्र किस शहर है।",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Udaipur",
"B_hi": "उदयपुर",
"C_en": "Jaipur",
"C_hi": "जयपुर",
"D_en": "Alwar",
"D_hi": "अल्वार",
"answer": "C",
"explanation_en": "Udaipur is a city in Rajasthan known for its rich history and culture. Jaipur, often referred to as the Pink City, is recognized as the educational center and cultural capital of Rajasthan.",
"explanation_hi": "उदयपुर राजस्थान में एक शहर है, जब्सर का क्लास्टर और कला का नेतृत्वाना है। जयपुर राजस्थान में एक शहर है, जब्सर का क्लास्टर और कला का नेतृत्वाना है।",
"question_en": "Which city is considered as the cultural capital of Rajasthan?",
"question_hi": "राजस्थान का कला का नेतृत्वाना कौन से शहर को समझें?",
"A_en": "Jaipur",
"A_hi": "जयपुर",
"B_en": "Udaipur",
"B_hi": "उदात्तम",
"C_en": "Jhunjhunu",
"C_hi": "जेझौंनु",
"D_en": "Kishangarh",
"D_hi": "किशांगरह",
"answer": "D",
"explanation_en": "Jhunjhunu is considered as the cultural capital of Rajasthan. It is known for its rich history, art, music, and dance traditions.",
"explanation_hi": "जेझौंनु राजस्थान का कला का नेतृत्वाना है। यह भिनंदियाँ, महिला, मिथन और धार्मित विज्ञान में सम्बंधी है।",
"question_en": "What is the cultural capital of Rajasthan?",
"question_hi": "राजस्थान का कला का नेत्यां किस्तान की शिक्षा और धार्मित विज्ञान में सम्बंधित विज्ञान में सम्बंधित विज्ञान",
"question_hi": "राजस्थान के शिक्षा और धार्मित विज्ञान में सम्बंधित विज्ञान",
"explanation_en": "The capital city of Rajasthan is Jaipur, which is famous for its rich history and traditions. However, for the cultural aspect, the district of Jaisamand is known as the cultural capital of Rajasthan.",
"explanation_hi": "राजस्थान के शिक्षा का म्बंधित विज्ञान",
"A_en": "Jaisamand",
"A_hi": "जैसंद",
"B_en": "Jodhpur",
"B_hi": "झोदपुर",
"C_en": "Chittorgarh",
"C_hi": "चैतगर्ह",
"D_en": "Amber",
"D_hi": "अमेबंड",
"answer_en": "Jaisamand",
"answer_hi": "जैसंद",
"explanation_en": "Jaisamand is known for its rich history, art, and architecture. It is considered as the cultural capital of Rajasthan.",
"explanation_hi": "जैसंद",
"D_hi": "अमेबंड",
"explanation_en": "Amber derives its significance from its rich history, art, and architecture. It is regarded as the cultural capital of Rajasthan.",
"explanation_hi": "अमेबंड",
}
]