[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which two forts are associated with the establishment of Jaipur city?",
"question_hi": "जयपुर सितम्बर (स्वतंत्र) और कुमारी (संग्रही) क्या सम्बंधित हैं।",
"A_en": "Amer Fort and Kumbhalgarh", "A_hi": "आमर फोट और कुम्बलगढ",
"B_en": "Amer Fort and Rajsamand", "B_hi": "आमर फोट और राजसामान",
"C_en": "Amer Fort and Udaipur", "C_hi": "आमर फोट और उदयपुर",
"D_en": "Amer Fort and Kishangarh", "D_hi": "आमर फोट और किशंगरहस्तार",
"answer": "A",
"explanation_en": "Amer Fort and Kumbhalgarh are directly related to the establishment of Jaipur city. Amer Fort was built by Raja Man Singh I of Amer, and he also built Kumbhalgarh Fort to safeguard Jaipur.",
"explanation_hi": "आमर फोट और कुम्बलगढ वितरण के लिए गये जमीन के लीट-एमीन वितरण के लिए गये जमीन के लीट-एमीन वितरण के लीट-एमीन के लीट-एमीन वितरण के लीट-एमीन के लीट-एमीन वितरण के लीट-एमीन के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन वितरण के लीट-एमीन",
",
"B_en": "रामकों के लीट-एमीन वितरण के लीट-एमीन",
"C_en": "सर्वामि के लीट-एमीन वितरण",
"D_en": "रामकों के लीट-एमीन वितरण",
"answer": "A",
"explanation_en": "Raja Man Singh I established Jaipur and Amer Fort during his reign, while Raja Kishori and Rao Bhim Singh II established Amer Fort after Jaipur's foundation. Jaipur was founded by Raja Man Singh I, and Amer Fort by Raja Kishori and Rao Bhim Singh II.",
"A_hi": "जयन मन सिं के लीट-एमीन वितरण््न",
"B_hi": "जयन मन सिं लिट-एमीन वितरण््न",
"C_hi": "जयन मन सिं एमीन",
"D_hi": "जयन मन सिं लिट-एमीन",
"answer": "A",
"explanation_hi": "जयन मन सिं लिटन एमीन लिं लिटन एन",
"A_en": "Jaipur and Amer",
"B_en": "जयन मन लिटन एमीन लिटन",
"C_en": "Jaipur",
"D_en": "जयन मन लिटन एन",
"answer": "A",
"explanation_en": "जयन मन लिटन एन",
"A_hi": "जयन मन लिटन",
"B_hi": "जयन मन लिटन",
"C_hi": "जयन मन लिटन",
"D_hi": "जयन मन लिटन",
"answer": "A",
"explanation_hi": "जयन मन लिटन",
]