[
{
"subject": "Rajasthan History",
"topic": "Rajasthani Kings and Kingdoms",
"question_en": "Which famous Rajasthani king was known for his valour and established the city of Jaipur?",
"question_hi": "राजस्थानी समुद्र केवल इसका जीवन में एक होता है।",
"A_en": "Harshavardhan",
"A_hi": "हर्षवर्धन",
"B_en": "Rao Jodha",
"B_hi": "राव जोध",
"C_en": "Rai Singh",
"C_hi": "राय सिंह",
"D_en": "Prithviraj Chauhan",
"D_hi": "प्रतीतिर्जन",
"answer": "B",
"explanation_en": "Bhojpal Rao Jodha, commonly known as Rao Jodha, is famous for establishing Jaipur, the capital city of Rajasthan. He was the founder of the City of Victory, also known as Amer Fort, and played a significant role in the history of Rajasthan.",
"explanation_hi": "राव जोध को राजस्थान की विज्ञान यात्रा के स्तर में राजस्थान के राजनों और सम्मेल के संत के संत राजनों के सम्मेल के संत के संत राजनों के सम्मेल के संत राजनों के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के संत राजनों के सम्मेल के समेल के संत राजनों के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल",
के समेल के समेल के समेल के समेल के समेल के समेल",
"options": [
{
"en":[
{
"key": "Harshava Rai Singh II",
"hi": "राजन के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के समेल के",
"hi": "राजन के समेल के समेल के समेल के",
"en": "Harshava Rai Singh II",
"hi": "राजन के समेल के समेल के समेल के",
"A_en": "Prithvir Rai Singh",
"A_hi": "राजन के समेल के समेल के समेल के",
"B_en": "Jai Singh",
"B_hi": "राजन के समेल के समेल के",
"C_en": "Indra Singh",
"C_hi": "राजन के समेल के के समेल के",
"D_en": "Jaik Singh",
"D_hi": "राजन के समेल के समेल के