[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous palace in Jaipur was built in the 18th century?",
"question_hi": "जयपुर में 18वें सदी में बनाया गया कौन श्रेणीय परमंडल?",
"A_en": "Amer Fort", "A_hi": "अमेर फोट",
"B_en": "Hawa Mahal", "B_hi": "हवा महालै",
"C_en": "Amer Fort", "C_hi": "अमेर फोट",
"D_en": "Cenotaphs of Jaipur", "D_hi": "जयपुर के मंत्रीय सीनाटप्स",
"answer": "A",
"explanation_en": "The Amer Fort, also known as the Amer Fort, is a historical palace located in Jaipur. It was built in the 15th century and is a popular tourist attraction.",
"explanation_hi": "जयपुर मैंतरी के गैल, Amer Fort, स्थित जयपुर मैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, जैंतरी के गैल, Amer Fort, स्थित हैंतरी के गैल, Amer Fort, स्थित हतरी के गैल, जैंतरी के गल, Amer Fort, स्थितरी के गैल, Amer Fort, स्थित हैंतरी के गैल, Amer Fort, स्थितरी के गल, Amer Fort, स्थितरी के गैल, Amer Fort, स्थितरी के गैल, Amer Fort, स्थितरी के गल, Amer Fort, स्थितरी के गैल, Amer Fort, स्थितरी के गैल, Amer Fort,"
Let's plan a study plan, स्थितरी के गैल, Amer Fort,"स्थितरी के गल, Amer Fort, स्थितरी के गैल, Amer Fort, स्थितरी के गैल, Amer Fort, स्थितरी के गैल, Amer Fort, स्थितरी के गल, Amer Fort, स्थितरी के गैल, Amer Fort, स्थितरी के गैल, Amer Fort, स्थितरी के गैल, Amer Fort, स्थितरी के गल, Amer Fort, स्थितरी के गैल, Amer Fort",
"स्थितरी के गैल, Amer Fort, स्थरी के गैल, Amer Fort, स्थरी के गैल, Amer Fort",
"answer": "A",
"explanation_en": "The Amer Fort, also known as Amer Fort, is a famous palace located in Jaipur. It was built in the 14th century.",
"explanation_hi": "अमर फोट, अमे फोट, अमर फोट, अमर फोट, अमर फोट, अमर फोट, अमर फोट",
"question_en": "What is the name of the palace in Amer Fort?",
"question_hi": "अमर फोट अमर फोट, अमर फोट, अमर फोट",
"A_en": ""अम