[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort was built by Raja Rawal Jaisal in Jodhpur?",
"question_hi": "राजा रावल जयसाल ने कौन सी पहली बंदरगाँव जोड़ी गयी उसका क्या नाम है?",
"A_en": "Mehrangarh Fort", "A_hi": "मैरंगारों",
"B_en": "Udaipur", "B_hi": "उदयपुर",
"C_en": "Jaipur", "C_hi": "जयपुर",
"D_en": "Jaisalamgarh", "D_hi": "जयसलामगाँव",
"answer": "D",
"explanation_en": "Mehrangarh Fort is a well-known fort located in Jodhpur. However, the correct answer is Daisala Mahal, also known as Jaisalamgarh Fort, which was built by Raja Rawal Jaisal.",
"explanation_hi": "मैरंगारों का यह नाम राजा रावल जयसालामगाँव की पूरी तथा अल्लाहिंगारों की विभिज्ञानी मैरंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें की यात्राएं का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अल्लाहिंगारों का नाम राजा रावलें का अलाहिंगारों का नाम राजा रावलें का अलाहिंगारें का नाम राजा रावलें का अलाहिंगारें का नाम राजा रावलें का अलाहिं का नाम राजा रावलें का अलाहिं का अलाहिं का नाम राजा रावलें का अलाहें का अलाहिं का राजा रावलें का अलाहिं का नाम राजा रावलें का अलाहिं का नाम राजा रावलें का नाम राजा रावलें का अलाहिं",

"
"
का नाम राजा राजा रावलें का अलाहिं का नाम राजा रावलें का अलाहिं का नाम राजा रावलें का अलाहिं का नाम राजा रावलें का अलाहिं का नाम राजा रावलें का अलाहिं",
का नाम राजा रावलें का अलाहिं राजा राजा रावलें का अला