[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "What is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी क्या है?",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Jaipur",
"B_hi": "जयपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Bikaner",
"D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Jaipur is the capital of Rajasthan.",
"explanation_hi": "जयपुर, Rajasthan की राजधानी है।",
"explanation_hindi": "जयपुर, Rajasthan की राजधानी है।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Families",
"question_en": "Which royal family ruled Rajasthan before the establishment of British rule?",
"question_hi": "राजस्थान के राजपुर नेवाले मर्मा मंत्रियों ने राजस्थान को प्रधानमंत्रीय मंत्रों ने राजस्थान को प्रधानमंत्रीय मंत्रों ने राजस्थान को प्रधानमंत्रीय मंत्रों ने राजस्थान को प्रधानमंत्रीय मंत्रों ने राजस्थान को प्रधानमंत्रीय मंत्रों ने राजस्थान को प्रधानमंत्रीय मंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रधानमंत्रों ने राजस्थान को प्रे राजस्थान को प्रधानमंत्रे राज्थान को प्रे राजस्थान को प्रे राजस्थान को प्रे राे राजस्थान को प्रे राजस्थान को प्रे राजसे राजस्थान को प्रे राजस्थान को प्रे राजे राजस्थान को प्रे राजस्थान को प्रे राजसे राजस्थान के राे",
Background: राजस्थान को प्रे राजस्थान के राजस्थान के राजस्थान को प्रे राजस्थान के राजस्थान के राे",
Question_en": "Which king was the first king of Rajasthan who was deposed by the British?",
Question_hi": "राजस्थान के राजस्थान के राजस्थान के राे राे राजस्थानके राे राजस्थान के राे राजस्थान के राे राे राे",
Explanation_en": "The first king of Rajasthan who was deposed