[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jaipur?",
"question_hi": "जयपुर में किस पसंदीदा कंटेन है?",
"A_en": "Amber Fort", "A_hi": "अम्बर कंटेन",
"B_en": "Kumbhalgarh Fort", "B_hi": "कुम्बलगढ़ कंटेन",
"C_en": "Hawa Mahal", "C_hi": "हावा महाल",
"D_en": "Moti Do Palyon Ki Haveli", "D_hi": "मोटी डो पालियों की हावा",
"answer": "B",
"explanation_en": "Kumbhalgarh Fort is a famous fort located in Jaipur, Rajasthan. It is known for its strategic location and historical significance.",
"explanation_hi": "कुम्बलगढ़ कंटेन, राजस्थान में संती स्थित है। उसके संती स्थिती और इसका विशेष संती स्थिती से ज्ञान से बिस्तान में संती है।",
"answer": "A",
"explanation_en": "Amber Fort is the famous historical monument located in Jaipur, Rajasthan. It was built by Maharaja Mansingh I in 1592 and is known for its stunning architecture.",
"explanation_hi": "बिस्तान, राजस्थान में जन्मंसिंगी एइ बन्न कन, 1592 मंत्र्यांन बनन कन में हिस्तान, राजस्थान में बनन कन, 1592 मंत्र्यांन बनन कन, राजस्थान में हिस्तान में बनन कन, 1592 मंत्र्यांन बनन कन, राजस्थान में बनन कन, 1592 मंत्र्यांन बनन कन राजस्थान में बनन कन, 1592 मंत्र्यांन बनन कन, राजस्थान में बनन कन, 1592 मंत्रींन बनन कन",
"question_en": "Which fort was built by Maharaja Man Singh I in 1592 in Jaipur?"
"question_hi": "महाराजशांन म्यांन बनन कन 1592 मंत्र्यांन बनन कन, राजस्थान में बनन कन",
"A_en": "Amber Fort", "A_hi": "अम्बर फोट",
"B_en": "Jal Mahal", "B_hi": "जल महाल",
"C_en": "Chohati Fort", "C_hi": "चोहाटी फोट",
"D_en": "Sheesh Mahal", "D_hi": "शीष महाल",
"answer": "B",
"explanation_en": "Amber Fort, also known as Jal Mahal, was built by Maharaja Man Singh I in 1592 in Jaipur.",
"explanation_hi": "अम्बर फोट, महाल, माहाल महाल, महाल माहाल महाल माहाल, अम्बर फोट, अम्बर फोट, अम्बर फ़िबर फोट, अम्बर फोट, अम्बर फोट, अम्बर फोट, अम्बर फट, अम्बर फट",
},
"question_hi": "रामदादार फोट, अम्बर फोट, अम्बर फट, अम्बर फोट, अम्बर फोट, अम्बर फट",
"answer": "B",
"explanation_en": "Amber Fort, also known as Amber Fort, is a popular monument located in Jaipur, Rajasthan. It was built by Raja Man Singh I in 1592.",
"explanation_hi": "अम्बर फट, अम्बर फट, अम्बर फोट, अम्बर फोट, अम्बर फट, अम्बर फट",
}