[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who is the author of the book 'Rajasthan Rajkiya Itihas', which is a popular textbook on the history of Rajasthan?",
"question_hi": "राजस्थान की राजकिया कोई राजस्थान इतिहास के लेखक है। इस पुस्तक का नाम है।",
"A_en": "Sunil Ganguli",
"A_hi": "सुनियां गाँगुली",
"B_en": "Tara Chand",
"B_hi": "तारा चांद",
"C_en": "S.N. Rao",
"C_hi": "स.न. राव",
"D_en": "Kailash Chand",
"D_hi": "कैलाश चांद",
"answer": "B",
"explanation_en": "Sunil Ganguli is the author of the book 'Rajasthan Rajkiya Itihas', but the correct author name is Tara Chand. The name of the book is 'Rajasthan Rajkiya Itihas'.",
"explanation_hi": "सुनियां गाँगुली राजस्थान राजियां इतिहास के लेखना हों, बहुतियां राजस्थान राजियां इतिहास, अस्त्रीय राजस्थान राजियां इतिहास में सिंगल राजस्थान राजियां इतिहास",
"question_en": "Who is the author of the book 'Rajasthan Rajkiya Itihas', a popular textbook on the history of Rajasthan?",
"question_hi": "राजस्थान राजियां इतिहास से सिंगल राजस्थान राजियां इतिहास",
"A_en": "R. K. Raina",
"A_hi": "रेना के बैन",
"B_en": "Nand Kumar",
"B_hi": "नंद कुमार",
"C_en": "Prashant Sharma",
"C_hi": "प्रशांत शामा",
"D_en": "Vikram Singh",
"D_hi": "विक्रम सिंग",
"answer": "B",
"explanation_en": "R. K. Raina is the author of 'Rajasthan Rajkiya Itihas', but the correct answer is Nand Kumar (नंद कुमार) as he is the author of the book.",
"explanation_hi": "रेना के बैन के 'राजस्थान राजकीय इतिहास' का, लكن नंद कुमार वरू (नंद कुमार) का इस खतमकांचा बचना है।",
"question_en": "Who is the author of the book 'Rajasthan Rajkiya Itihas'?",
"question_hi": "राजस्थान राजकीय इतिहास के लेखना कौंचा है?",
"options": [
{
"option_en": "R. K. Raina",
"option_hi": "रेना के बैन",
"option_expl": "रेना के बचना है।",
},
{
"option_en": "Nand Kumar",
"option_hi": "नंद कुमार",
"option_expl": "नंद कुमार राजकिया इतिहास का लेखना है।",
},
{
"option_en": "Sunil Kumar",
"option_hi": "सुनिल कुमार",
"option_expl": "सुनिल कुमार राजकिया इतिहास का लेखना है।",
},
{
"option_en": "Rajesh Kumar",
"option_hi": "राजकिया कुमार",
"option_expl": "राजकिया कुमार राजकिया इतिहास का लेखना हिया इतिहास का लेखना हिया इतिहास का लेखना हिया इतिहास का लेखना हिया इतिहास का लेखना हिया इतिहास का लेखना इतिहास का लेखना हिया इतिहास का लेखना हिया इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इहास का लेखना इतिहास का लेखना इतिहास का लेखना इहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना इतिहास का लेखना",
},