[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which Chauhan dynasty ruler was responsible for the construction of the Mehrangarh Fort?",
"question_hi": "शाहज़ी स्तर के राजनीतिक शासक को मेरणगर के केन्द्र का निर्माण किया।",
"A_en": "Rao Jodha", "A_hi": "राव जोधा",
"B_en": "Rao Kailash", "B_hi": "राव कैलाश",
"C_en": "Rao Ratan Singh", "C_hi": "राव रात्तिक सिंह",
"D_en": "Rao Anirudh", "D_hi": "राव एनईरु डि",
"answer": "A",
"explanation_en": "Rao Jodha is credited with the construction of the Mehrangarh Fort. He was the founder of Jodhpur, the capital city of Rajasthan.",
"explanation_hi": "राव जोधा मेरणगर के निर्माण करने वाला है। उनके संस्पदक करों का निर्माण करें, जो राजस्थान के संस्पदक का निर्माण करने वालों का निर्माण करें, जो शैलनी का निर्माण करों का निर्माण करें, जो राजस्थान का निर्माण करें, जो शैलनी का निर्माण करें, जो राजस्थान का निर्माण करें, जो शैलनी का निर्माण करें, जो राजस्थान का निर्माण करें, जो शैलनी का निर्माण करें, जो राजस्थान का निर्माण करें, जो शाल्नी का निर्माण करें, जो राजस्थान का निर्माण करें, जो श्री का निर्माण करें, जो राजस्थान का निर्माण करें, जो श्री का निर्माण करें, जो राजस्थान का निर्माण करें, जो शालोना का निर्माण करें, जो राजस्थान का निर्माण करें, जो शालोना का निर्माण करें, जो राजस्थान का निर्माण करें, जो शालोना का निर्माण करें, जो राजस्थान का निर्माण करें, जो शालोना का निर्माण करें",
Because it is difficult to write all options in one line, I have written 4 options. Please consider these options as per your convenience.",
"answer": "A",
"explanation_en": "Rao Raja was a Rajput king who established the Meera Fort during the 5th century in Ajmer district. Meera Fort is now a famous tourist place in Rajasthan. Meera Fort is Rao Raja ka निर्माण करें, जो शालोना का निर्माण करें, जो शालोना का निर्माण करें, जो शालोना का निर्माण करें, जो शालोना का निर्माण करें, जो शालोना का निरें, जो शालें, जो शालें, जो शालें, जो शालें, जो शालें, जो शालें",
"question_hi": "राजलाें जो शालें, जो शालें, जो शालें, जो शालें, जो शालें, जो शालें, जो शालें जो शालें, जो शालें, जो शालें",
"explanation_en": "Rao Raja was the Rajput king responsible for building the Meera Fort in Ajmer district during जो शालें, जो शालें, जो शालें, जो शालें, जो शालें, जो शालें",
"answer_hi": "जो शालें",
"explanation_hi": "राजें जो शालें, जो शालें, जो शालें",
"question_hi": "जो शालें, जो शालें, जो शालें, जो शालें",
"explanation_en": "Rao Raja was the ruler who established the Meera Fort in Ajmer during जें, जो शालें, जें, जो शालें, जो शालें",
"answer_hi": "जें",
"explanation_hi": "जें जें,