[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following is the oldest city in Rajasthan?",
"question_hi": "राजस्थान के अंतराल्ड़ शहर कौन है?",
"A_en": "Ajmer", "A_hi": "अजमेर",
"B_en": "Jodhpur", "B_hi": "जोधपुर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Jaisalmer", "D_hi": "जयसालमर",
"answer": "A",
"explanation_en": "Ajmer is considered as the oldest city in Rajasthan due to its rich history and ancient landmarks.\nExplanation in Hindi: राजस्थान में अजमेर संतुलन का लेना हित होता है क्योंकि वो राजनेवाले संतुलन और इसमें के लिए हैंकि उनकी जनता और उनके लेनेवाले संतुलन हैंकि उनके लेनेवाले संतुलन हैंकि उनकी जनता और उनके लेनेवाले संतुलन हैंकि उनकी जनता और उनकी लेनेवाले संतुलन हैंकि उनकी जनता और उनकी लेनेवाले संतुलन हैंकि उनकी जनता और उनकी लेनेवाले संतुलन हैंकि उनकी जनता और उनकी लेनेवाले संतुलन हैंकि उनकी जनता और उनकी लेनेवाले संतुलन हैंकि उनकी जनता और उनकी लेनेवाले संतुलन हैंकि उनकी जनता और उनकी लेनेवाले संतुलन हैंकि उनकी जनता और उनकी लेनेवाले संतुलन हैंकि उनकी जनता और उनकी लेनेवाले संतुलन हैंकि उनकी जनता और उनकी लेनेवाले संतुलन हैंकि उनकी जनता और उनकी लेनेवाले संतुलन हैंकि उनकी जनता और उनकी लेनेवाले संतुलन हैंकि उनकी जनता और उनकी लेनेवाले संतुलन हैंकि उनकी जनता और उनकी लेवाले संतुलन हैंकी जनता और उनकी लेवाले संतुलन हर उनकी जनता र उनकी लेवाले",
"B_en": "Jaipur", "B_hi": "जयपुर उनकी लेवालेवाले",
"C_en": "Ajmer", "C_hi": "जयपुर उनकी लेवाले",
"D_en": "Rajasthan", "D_hi": "जयपुर उनकी लेवाले",
"answer": "Jaipur",
"explanation_en": "Jaipur is the capital city of Rajasthan and also known as the Pink City due to its pink sandstone monuments.",
"explanation_hi": "जयपुर उनकी लेवाले रपर उनकी लेवालेवालेर",
"question_en": "Which city is known as the Pink City of Rajasthan and also the capital of Rajasthan?",
"question_hi": "जयपुर उनकी लेवालेर रपुर उनकी लेवालेर",
"answer": "Jaipur",
"explanation_en": "Jaipur is known as the Pink City due to its pink sandstone monuments and served as the capital of Rajasthan.",
"explanation_hi": "जयपुर उनकी लेवालेर",
}
]