[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Other Historical Cities",
"question_en": "Which city was the capital during Rajasthan's Chauhans era?",
"question_hi": "राजस्थान के चौहानों के समय कई शहर क्या थे।",
"A_en": "Amber", "A_hi": "अमरेंड",
"B_en": "Jaipur", "B_hi": "जयपुर",
"C_en": "Pushkar", "C_hi": "पुष्कर",
"D_en": "Udaipur", "D_hi": "उदयपुर",
"answer": "B",
"explanation_en": "Amber was the capital during the Chauhan era, but the most famous city of Rajasthan in this period is Jaipur (also known as Pink City). The capital of Rajasthan changed later and now Jaipur is the capital of Rajasthan.",
"explanation_hi": "राजस्थान के चौहानों के समय में Amber के राजधाना था, लेकिन राजस्थान में इस परिवर्तन के समय में Jaipur (परंग शहर) मतलावान है। राजधाना के प्रायचंद्रपुर का विभाग में परंग शहर (Jaipur) है।",
"explanation_en": "Amber was the capital during the Chauhan era, but Jaipur, known as the Pink City, was the capital in the period of the Pratiharas. Currently, Jaipur is the capital of Rajasthan.",
"explanation_hi": "अमेर को चौहान प्रायचंद्रपुर (परंग शहर) है। प्रायचंद्रपुर (परंग शहर) में बाजारा ओवाई मंगलों के समय में बाजारा ओवाई मंगलों का विभाग में बाजारा ओवाई मंगलों के समूचक में बाजारा ओवाई मंगलों का विभाग में बाजारा ओवाई मंगलों का प्रधानंतर समूचक में बाजारा ओवाई मंगलों का विभाग में बाजारा ओवाई मंगलों का प्रधानंतर समूचक में बाजारा ओवाई मंगलों के विभाग में बाजारा ओवाई मंगलों का प्रधानंतर समूचक में बाजारा ओवाई मंगलों का विभाग में बाजारा ओवाई मंगलों का में बाजारा ओवाई मंगलों का विभाग में बाजारा ओवाई मंगलों का विभाग में बाजारा ओवाई मंगलों का विभाग में बाजारा ओवाई मंगलों का विभाग में बाजारा ओवाई मंगलों का विभाग में बाजारा ओवाई मंगलों का विभाग में बाजारा ओवाई मंगलों का विभाग में बाजारा ओवाई मंगलों का विभाग में बाजारा ओवाई मंगलों का विभाग में बाजारा ओवाई मेंगलों का विभाग में बाजारा ओवाई मेंगलों का",
 विभाग में बाजारा ओवाई में का विभाग में का",
विभाग में बाजारा ओवाई में का",
विभाग में का विभाग में का",
विभाग में का विभाग में का",
विभाग में का विभाग में का",
विभाग में का",
विभाग में का",
विभाग में का",
विभाग में का",
विभाग में का",
विभाग में का",
विभाग में का",
विभाग में का",
विभाग में का",
विभाग में का",
विभाग में का",
विभाग में का",
विभाग में का",
विभाग में का",
विभाग में का",
विभाग में का",
विभाग में