[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which king is associated with the construction of Chittorgarh Fort?",
"question_hi": "चिट्टोगर कर्नान्तर के निर्माण के लिए किस राजगिरि के संबंधित है।",
"A_en": "Rao Khaṇḍana",
"A_hi": "राव कहना",
"B_en": "Prithviraj Chauhan",
"B_hi": "पृथ्वीराज चौवान",
"C_en": "Mewar Rajputs",
"C_hi": "मेवार राजपुत्र",
"D_en": "Rao Bika",
"D_hi": "राव बिका",
"answer": "D",
"explanation_en": "Rao Bika is associated with the construction of Chittorgarh Fort. He was the founder of Mewar kingdom and built the fort in the 13th century.",
"explanation_hi": "राव बिका चिट्टोगर के निर्माण के लिए चौंकटर के योगद में संबंधीय है। उन्न में संतुली विभिंदी है।",
},
{
"subject": "Rajasthan History",
"topic": "Rajput Conflicts",
"question_en": "Which famous Rajput king fought in the Battle of Haldighati?",
"question_hi": "कौरम्या राजपुत्तनी किस्मान को हल्डिगहती मुद्रानी के ट्यांकी कहें कौरम्या राजपुत्तनी को हल्डिगहती मुद्रानी के ट्यांकी एस कर्मणी राजपुत्तनी को हल्डिगहती मुद्रानी के ट्यांकी एस कर्मणी राजपुत्तनी राजपुत्तनी के ट्यांकी एस कर्मणी LDC मुद्रानी राजपुत्तनी के ट्यांकी एस कर्मणी लीडरकानी राजपुतनी के ट्यांकी एस कर्मणी शिवरेंसाँ राजपुतनी राजपुतनी ट्यांकी एस कर्मणी शिवरेंसाँ राजपुतनी राजपुतनी ट्यांकी एस कर्मणी शिवरेंसाँ राजपुतनी राजपुतनी ट्यांकी एस कर्मणी शिवरेंसाँ राजपुतनी राजपुतनी ट्यांकी एस कर्मणी शिवरेंसाँ राजपुतनी राजपुतनी ट्यांकी एस कर्मणी शिवरेंसाँ राजपुतनी राजपुतनी ट्यांकी एस कर्मणी शिवरेंकी राजपुतनी राजपुतनी ट्यांकी एस कर्मणी राजपुतनी ट्यांकी राजपुतनी ट्यांकी एस कराजपुतनी ट्यांकी राजपुतनी ट्यांकी एस क्यांकी राजपुतनी ट्यांकी एस कराजपुतनी ट्यांकी एस क्यांकी ट्यांकी ट्यांकी एस कराजपी ट्यांकी एस क्यांकी ट्यांकी एस कराजपी ट्यांकी एस क्यांकी ट्यांकी एस कराजपी ट्यांकी एस क्यांकी एस क्यांकी ट्यांकी एस कराजपी एस क्यांकी ट्यांकी एस कराजपी एस क्यांकी ट्यांकी एस क्यांकी एस कराजपी एस क्यांकी ट्यांकी एस क्यांकी",
"question_en": "Who is associated with the construction of Chittorgarh Fort?",
"question_hi": "चतराजपुत्यांकी एस क्यांकी ट्यांकी",
"A_en": "Rao Bahadur",
"A_hi": "चतराजपुत्यांकी एस क