[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Rulers",
"question_en": "Which Mughal Emperor granted the title of 'Rajputana' to the Rajputs?",
"question_hi": "मुगल शासन के एक मुख्य शासक ने 'राजपुत्रना' का नाम लेने के लिए राजपुत्रियां को दी।",
"A_en": "Aurangzeb",
"A_hi": "अरोंगजी",
"B_en": "Shah Jahan",
"B_hi": "शाह जाहाँ",
"C_en": "Aurangazeb",
"C_hi": "अरोंगजी",
"D_en": "Alauddin Khilji",
"D_hi": "अलादीन खिलजी",
"answer": "B",
"explanation_en": "Shah Jahan is the Mughal emperor who granted the title of 'Rajputana' to the Rajputs.",
"explanation_hi": "Shah Jahan वर्धकारी थे जो राजपुत्रियां को 'राजपुत्रना' नाम दी।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Kingdoms",
"question_en": "Which kingdom was formed in the 16th century in Rajasthan?",
"question_hi": "राजस्थल 16वेंद्रीं के वर्षीय में कौने राजीं मंगलों के वर्षीय में कौने राजीं के मंगलों में क्रुत राजीं के वर्षीय में कौने राजीं के मंगलों में क्रुत राजीं के मंगलों में कौने राजीं के मंगलों में क्रुत राजीं के मंगलों में क्रुत राजीं के मंगलों में क्रुत राजीं के मंगलों में क्यां के मंगलों में क्यां के मंगलों में क्यां के मंगलों में क्यां के मंगलों में क्यां के मंगलों में के मंगलों में क्यां के मंगलों में के मंगलों में क्यां के मंगलों में क्यां के मंगलों में के मंगलों में के मंगलों में के मंगलों में के मंगलों में के में के मंगलों में के मंगलों में के मंगलों में के मंगलों में के मंगलों में के मंगलों में के मंगलों में के मंगलों में के मंगलों में के मंगलों में के मंगलों के में के में के में के में के में के मंगलों के में के में के में के में के में के में के में के में के में के में के में के में के में के में के में के में के कें के में के में के में के के के में के में के के में के के में के के में के मे के के में के के के के के के के के के के के के में के के के के के के के के के",
Author:
"के के के के के के के के के के के के के के के के के के के के के के के के के के",
}
{
"subject": "Rajasthan History",
"topic": "Raja Samvedi",
"question_en": "Which Rana ruled over Rajasthan during the Mughal Empire?",
"question_hi": "राजके के के के के के के के के के के के के के के के क