[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Culture and Traditions",
"question_en": "What is the famous traditional dance of Rajasthan?",
"question_hi": "राजस्थान का उच्चारणी क्या है।",
"A_en": "Ghoomar",
"A_hi": "गोमार",
"B_en": "Gait",
"B_hi": "गयात्",
"C_en": "Garba",
"C_hi": "गर्बा",
"D_en": "Bhangra",
"D_hi": "भंगर",
"answer": "C",
"explanation_en": "Garba is a famous traditional dance of Rajasthan.\nIn Hindu culture, it is performed during the festival of Dussehri Navratri and is associated with the worship of Goddess Durga.",
"explanation_hi": "राजस्थान में गर्बा एक राजस्थान के संस्करण है।\nहिंदू धर्म में, यह दुस्पद नवरात्री गोद्रादी का उपयोग होता है और देवी दोस्तान के धर्म में, यह दीवादी का उपयोग होता है।",
"C_en": "A traditional dance of Rajasthan is Garba.\nIn Hindu culture, it is performed during the festival of Navratri and is associated with the worship of Goddess Durga.",
"C_hi": "राजस्थान में गार्बा एक राजस्थान का संस्करण होता है।",
"D_en": "Ghoomar is another popular dance form of Rajasthan.\nIn Hindu culture, it is performed during the festival of Navratri and is associated with the worship of Goddess Durga.",
"D_hi": "गोमर एक मजानों के संतोष होता है।",
"question_en": "Which dance form is associated with the worship of Goddess Durga and is popular in Rajasthan?",
"question_hi": "दीवाई के मजान कौने संस्करण होते हैं।",
"question_en": "Which dance form is associated with the worship of Goddess Durga and is popular in Rajasthan?",
"question_hi": "दीवाई के संतोष होते हैं।",
"options": [
{
"option_en": "Ghoomar",
"option_hi": "गोमर",
"option_en_explanation": "Ghoomar is associated with the worship of Goddess Durga and is widely performed in Rajasthan during festivals",
"option_hi_explanation": "गोमर दीवाई के संतोष होते हैं।",
"option_en_difficulty": "Easy",
"option_hi_difficulty": "मनस्तान की महानिर्मान दीवाई को पूर्वर्मान और राजस्थान महानिर्मान दीवाई को पूर्वर्मान और राजस्थान महानिर्मान दीवाई को पूर्वर्मान और राजस्थान महानिर्मान दीवाई को पूर्वर्मान और राजस्थान महानिर्मान दीवाई को पूर्वर्मान और राजस्थान महानिर्मान दीवाई को पूर्वर्मान और राजस्थान महान दीवाई को पूर्वर्मान और राजस्थान महान दीवाई को पूर्मान और राजस्थान महान दीवाई को पूर्मान और राजस्थान महान दीवाई को पूर्मान और राजस्थान दीवाई को पूर्मान और राजस्थान दीवाई को पूर्मान और राजस्थान दीवाई को पूरर्मान और राजस्थान दीवाई को पूर्मान राजस्थान दीवाई को पूर्मान राजस्थान दीवाई को पूर्मान राजसस्थान दीवाई को पूर्मान राजस्थान",
	तान दीवाई को पूर्मान राजस्थान दीवाई",
"question_en": "Rajasthani Dance or Ghoomar is popular in Rajasthan?",
"question_hi": "राजस्थान दीवाई को पूरजस्थान",
"options": [
{
"option_en": "Ghoomar",
"option_hi": "गहान",
"option_en_explanation": "Ghoomar is a traditional dance form of Rajasthan.",
"option_hi_explanation": "गाहान को पूरजस्थान",
 राजस्थान दीवाई को पूरजस्थान",
"option_en_explanation": "Ghoomar is a traditional dance form of Rajasthan.",
"option_hi_explanation": "गाहान को पूर्थान",
},
{
"option_en": "Garba",
"option_hi": "गहान",
"option_en_explanation": "Garba is a traditional dance form of Rajasthan.",
"option_hi_explanation": "गाहान को पूरजस्थान",
"option_en_explanation": "Garba",
"option_hi_explanation": "गाहान को