[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is associated with the story of Maharaja Rao Bika?",
"question_hi": "महाराजा राव बिका के कालक्षेत्र किसे संबंधित है?",
"A_en": "Amber Fort", "A_hi": "अम्बर फोट",
"B_en": "Meena Bazaar", "B_hi": "मेना बाजार",
"C_en": "Hawa Mahal", "C_hi": "हावा महाल",
"D_en": "Karni Pol", "D_hi": "कर्नी पोल",
"answer": "C",
"explanation_en": "Hawa Mahal, also known as the Palace of Winds, is associated with the story of Maharaja Rao Bika.",
"explanation_hi": "हावा महाल, Maharaja Rao Bika के संबंधित है।",
"explanation_hi": "हावा महाल, Maharaja Rao Bika के संबंधित है।",
"question_hi": "Maharaja Rao Bika ka nagariya kaise रहे।",
"question_en": "How did Maharaja Rao Bika rule?",
"A_en": "महाराजा राव बिका के नगरी कैसे रहें।",
"A_hi": "महाराजा राव बिका के नगरी कैसे रहें।",
"B_en": "महाराजा राव बिका के नगरी कैसे रहें।",
"B_hi": "महाराजा राव बिका के नगरी कैसे रहें।",
"C_en": "महाराजा राव बिका के नगरी कैसे रहें।",
"C_hi": "महाराजा राव बिका के नगरी कैसे रहें।",
"D_en": "महाराजा राव बिका के नगरी कैसे रहें।",
"D_hi": "महाराजा राव बिका के नगरी कैसे रहें।",
"question_en": "Who was the founder of Jodhpur? (जोधपुर के निर्मान कौन करवाई था? (जोधपुर के निर्मान कौन करवाई था? (जोधपुर के निर्मान करवाई था?",
"question_hi": "Jodhpur ke naam mein kyaa sahi hai?",
"options": [
{
"option_id": 1,
"option_text_en": "Prithviraj Chauhan",
"option_text_hi": "पृथ्विराजा चौहान",
"option_answer": "1",
"option_difficulty": "Easy"
},
{
"option_id": 2,
"option_text_en": "Rao Bika",
"option_text_hi": "राव बिका",
"option_answer": "2",
"option_difficulty": "Medium"
},
{
"option_id": 3,
"option_text_en": "Rao Bika ji ki mahila samaj ke liye kiya sahi hai?",
"option_text_hi": "राव बिका जी के महिला समाज के लिए की की सहिला समाज के लिए की की सहिला समाज के लिए की की की सहिला समाज के लिए की की सहिला समाज के लिए की सहिला समाज की सहिला समाज के लिए की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज किला सहिला समाज की सहिला सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला सहिला समाज की सहिला समाज की सहिला समाज की सहिला सहिला समाज की सहिला समाज की सहिला सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज किला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला समाज की सहिला