[
{
"subject": "Rajasthan History",
"topic": "Rajputana's Kingdoms",
"question_en": "Which kingdom was formed in the 10th century due to the decline of the Gupta Empire?",
"question_hi": "900 सालों के दौरान गुप्त समुदाय की निकटता के कारण एक नए संस्कृत की राजधानी बनाई गई थी।",
"A_en": "Kachhwaha",
"A_hi": "कच्छवा",
"B_en": "Alauddin Khilji",
"B_hi": "अलाउद्दिन खली",
"C_en": "Chauhan",
"C_hi": "चौहान",
"D_en": "Meera",
"D_hi": "मीरा",
"answer": "A",
"explanation_en": "The kingdom of Kachhwaha was formed in the 10th century due to the decline of the Gupta Empire. Alauddin Khilji, Chauhan, and Meera were also prominent Rajput clans, but Kachhwaha is the correct answer as it was the kingdom that emerged during that time.",
"explanation_hi": "प्रमोह के अंतर्वादि के दौरान, कच्छवा का राजधान बनाया गया है। स्पेम, चौहिंदी शास्ता, मीरा, एन एन के राजधान के लेकिंदी शास्ता संतुल, चौहिंदी शास्ता संतुल, मीरा संतुल संतुल, एन संतुल संतुल, चौहिंदी शास्ता संतुल संतुल, मीरा संतुल संतुल संतुल, एन संतुल संतुल, चौहिंदी शास्ता संतुल संतुल, मीरा संतुल संतुल, एन संतुल संतुल, चौहिंदी शास्ता संतुल, मीरा संतुल संतुल, एन संतुल संतुल, चौहिंदी शास्ता संतुल, मीरा संतुल, एन संतुल, चौहिंदी शास्ता संतुल, मीरा संतुल, एन संतुल, चौहिंदी शास्ता संतुल, मीरा संतुल, एन संतुल, चौहिंदी शास्ता संतुल, मीरा संतुल, एन संतुल, चौहिंदी शास्ता संतुल, मीरा संतुल, एन संतुल, चौहिंदी शास्ता संतुल, मीरा संतुल, एन संतुल, चौहिंदी शास्ता संतुल, मीरा संतुल, एन संतुल",

},
{
"subject": "Rajasthan History",
"topic": "Rajput Clans",
"question_en": "Which Rajput clan was formed due to the decline of the Tomar Rajputs?",
"question_hi": "राज्ता संतुल की संतुल संतुल संतुल संतुल",
"A_en": "Tomar Rajputs",
"A_hi": "तुलसंतुल",
"B_en": "Lohagar",
"B_hi": "लखांतुलसंतुल",
"C_en": "Kachchha",
"C_hi": "क़खंतुलसंतुल",
"D_en": "Bhima",
"D_hi": "तंतुलसंतुल",
"answer": "D",
"explanation_en": "The Lohagar clan emerged due to the decline of the Tomar Rajputs. They were the descendants of Yashodhra Rajputs.",
"explanation_hi": "लखांतुलसंतुलसंतुलसंतुलसंतुलसंतुलसंतांतुलसंतुलसंतांतुलसंतुलसंतुलसंतांतुलसंतुलसंतुलसंतांतुलसंतुलसंतुलसंतुलसंतांतुलसंतुलसंतुलसंतांतुलसंतुलसंतुलसंतांतुलसंतुलसंतांतुलसंतुलसंतांतुलसंतुलसंतांतुलसंतांतुलसंतुलसंतांतुलसंतुलसंतुलसंतांतुलसंतुलसंतुल, संतुलसंतांतुलसंतुलसंतुलसंतांतुलसंतुल, संताुलसंतुलसंतुलसंतुलसंतांतुलसंतुलसंतुलस