[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which historical fort in Rajasthan was built by Raja Man Singh of Kumharanwala?",
"question_hi": "राजस्थान में राजा मन सिंह के कुमहानवाला में श्रीलंका विभाग में बनाया गया एक मूल तटिया।",
"A_en": "Amer Fort",
"A_hi": "अमेर फोट्ट",
"B_en": "Kumbhalgarh Fort",
"B_hi": "कुम्भलगढ़ फोट्ट",
"C_en": "Meera Fort",
"C_hi": "मीरा फोट्ट",
"D_en": "Bishnoi Nagariya",
"D_hi": "बिश्नोया नागरी",
"answer": "B",
"explanation_en": "Amer Fort was built by Raja Man Singh of Kumbhalgarh. Kumbhalgarh Fort, built by Maharana Kumbha, is a famous example of Rajasthani architecture and is part of the UNESCO World Heritage Site. Meera Fort, on the other hand, is not a famous fort and Bishnoi Nagariya is a community rather than a fort. Kumbhalgarh Fort is the correct answer.",
"explanation_hi": "अमेरा फोट्ट राजा मणसी ने बनाई है। कुम्भलगढ फोट्ट, महरानां कुम्भलगढ फोट्ट राजन कुम्भलगढ फोट्ट में बनाई है। मीरा एन सी ने बनाई है। Meera Fort is not a famous fort and Bishnoi Nagariya is a community. Kumbhalgarh Fort, built by Maharana Kumbha, is a famous example of Rajasthani architecture and is part of the UNESCO World Heritage Site. Hence, Kumbhalgarh Fort is the correct answer.",
"answer": "B",
"explanation_en": "Kumbhalgarh Fort was built by Maharana Kumbha and is a famous example of Rajasthani architecture. It is included in the UNESCO World Heritage Site. Meera Fort is not a renowned fort and Bishnoi Nagariya is a community. Therefore, Kumbhalgarh Fort is the correct answer.",
"explanation_hi": "कुम्भलगढ फोट्ट महरानां कुम्भलगढ फोट्ट राजन कुम्भलगढ फोट्ट, मीरा एन सी नागरीया कुम्भलगढ फोट्ट में बना है। मीरा एन सी नागरीया कुम्भलगढ फोट्ट, मीरा एन सी नागरीया कुम्भलगढ फोट्ट मीरा एन सी नागरीया कुम्भलगढ फोट्ट, मीरा एन सी नागरीया कुम्भलगढ फोट्ट मीरा एन सी नागरीया कुम्भलगढ फोट्ट मीरा एन सी नागरीया कुम्भलगढ फोट्ट मीरा एन सी नागरीया कुम्भलगढ फोट्ट मीरा एन सी नागरीया कुम्भलगढ फोट्ट मीरा एन सी नागरीया कुम्भलगढ फोट्ट मीरा एन सी नागरीया कुम्भलगढ फोट्ट मीरा एन सी नागरीया कुम्ट मिरा एन सी नागरीया कुम्ट मीरा एन सी नागरीया कम्ट मिरा एन सी नागरीया कुमेरा एन सी नागरीया कमेरा एन सिरा एन सी नागरेरा एन सी नागरा एन सी केरा एन सिरा एन सी नागरा एन सेरा एन सिरा एन सिरा एन सिरा एन सिरा एन",
एन सेरा एन सिराएन",
"answer": "B",
"explanation_en": "Kumbhalgarh Fort is the correct answer as it is a famous example of Rajasthani architecture and also a part of UNESCO World Heritage Site.",
"explanation_hi": "कुम्ट एन सिरा एन सिरा एन एन एन एन सिरा एन",
"answer": "B",
]