[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which event marked the establishment of Jaipur as the capital of Rajasthan?",
"question_hi": "जयपुर को राजस्थान की राजधानी मार्कर है।",
"A_en": "Scavenging of Amer Fort",
"A_hi": "अमेर को विभीन करने के लिए पहले कि जयपुर की राजधानी मार्कर होता है।",
"B_en": "Conquest of Chittorgarh",
"B_hi": "चित्रगढ़ को विभिन्न करने के लिए जयपुर की राजधानी करने के लिए जयपुर की राजधानी करने के लिए।",
"C_en": "Foundation of Jodhpur",
"C_hi": "जोधपुर मतलाई करने के लिए।",
"D_en": "Conquest of Jaisalmer",
"D_hi": "जयसालमेर को विभाग करने के लिए।",
"answer": "B",
"explanation_en": "The capital of Rajasthan was shifted from Jaisalmer to Jaipur due to the conquest of Chittorgarh.",
"explanation_hi": "इस्लामेर को चित्रगांव की तथा जयपुर की राजधानी करने के लिए।",
"explanation_hi": "इस्लामेर के चित्रगांव की तथा जयपुर की राजधानी करने के लिए।",
"explanation_en": "The capital of Rajasthan was shifted from Jaisalmer to Jaipur due to the capture of Chittorgarh and the establishment of Jaipur as the capital.",
"explanation_hi": "इस्लामेर की चित्रगांव की तथा जयपुर की राजधानी के लिए।",
},
{
"subject": "Rajasthan History",
"topic": "Rashtrapati of Rajasthan",
"question_en": "Who was the first Rashtrapati of Rajasthan?",
"question_hi": "राजस्थान के पहले राष्ट्रपति कौन थे।",
"A_en": "Prithviraj Chauhan",
"A_hi": "प्रतीतीय चौहान",
"B_en": "Alauddin Khilji",
"B_hi": "अलादिन खिलजी",
"C_en": "Bhim Singh II",
"C_hi": "भिम सिंग आई",
"answer": "B",
"explanation_en": "Bhim Singh II was the first Rashtrapati of Rajasthan before Prithviraj Chauhan, Alauddin Khilji, and Bhim Singh II. He ruled from 1913 to 1930.",
"explanation_hi": "भामी सिंग आई ने प्रतिपिस्टी और प्रतीतीय चौहान और भामी सिंग आई केंकोण केंका आन और भामी सिंग आई केंकोण केंका आन भामी सिंग आइ केंकोण केंका आन भामी सिंग आी की केंकर भामी सिंग आइ की की भामी सिंग आइ की भामी सिेंग आइ की भामी सिंग आेंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामटिंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामी सिंग आइ की भामी सिंंग आइ की भामी सिंग आइ की भामी सिंंर आइ की भामी सिंर आइ की भामी सिंर आइ की भामी सिंर आइ की भामी सिंर आइ की भामी सिंरआइ की भामी सिंर आइ की भामी सिंर आइ की भामी सिंर आइ",
"],
"D_en": "Ala II",
"D_hi": "अला आइ भामी सिंर आइ की भामी सिंर