[
{
"subject": "Rajasthan History",
"topic": "Major Festivals of Rajasthan",
"question_en": "Which of the following festivals is celebrated in Rajasthan?",
"question_hi": "राजस्थान में किस फ़ेस्टेबल को प्रदर्शित करना होता है।",
"A_en": "Gangaur",
"A_hi": "गांगुरू",
"B_en": "Kite Festival",
"B_hi": "कीट फ़ेस्टेबल",
"C_en": "Elephant Festival",
"C_hi": "अल्पसंख्यात फ़ेस्टेबल",
"D_en": "Holi",
"D_hi": "होली",
"answer": "B",
"explanation_en": "The Kite Festival, also known as Uttarayani, is celebrated in Rajasthan. Gangaur and Holi are also important festivals in the state, but they are not specifically Rajasthan-centric like the Kite Festival.",
"explanation_hi": "राजस्थान में कीट फ़ेस्टेबल, भूली एवं भी मैं राजस्थान में भी महत्रा हैं, लेकिंग या भी मैं राजस्थान में भी महत्रा हैं, भी मैं राजस्थान में भी हैं.",
"answer": "B",
"explanation_en": "The Kite Festival, also known as Uttarayani, is a significant festival celebrated in Rajasthan. Maha Shivratri and Holi are also celebrated in the state, but they are not as Rajasthan-centric as the Kite Festival.",
"explanation_hi": "राजस्थान में भी महा शिवरात्री और भूली भी राजस्थान में भी बिज़न हैं, लेकिंग या भी राजस्थान में भी हैं.",
"explanation_hi": "राजस्थान में भी महा शिवरात्री और भूली भी राजस्थान में भी हैं.",
"question_en": "Which festival is celebrated in Rajasthan during winters?",
"question_hi": "राजस्थान में winters के स्पर्दयंतों में भी भी हैं.",
"options_en": [
{
"option_text": "Gangaur",
"option_id": "B",
"option_description": "Gangaur Festival is celebrated in Rajasthan during winters.",
"option_language": "English"
},
{
"option_text": "Holi",
"option_id": "C",
"option_description": "Holi is also celebrated in Rajasthan during winters.",
"option_language": "English"
},
{
"option_text": "Diwali",
"option_id": "A",
"option_description": "Diwali is a festival of lights and not specifically related to winters.",
"option_language": "English"
},
{
"option_text": "Janmashtami",
"option_id": "D",
"option_description": "Janmashtami is a festival celebrating the birth of Lord Krishna and not celebrated during winters.",
"option_language": "English"
}
],
"option_hi": [
{
"option_text": "गंगार",
"option_id": "B",
"option_description": "गंगार फिस्ट हों में रुपिया राजस्थान में भी रुपिया राजस्थान में रुपिया राजस्थान में भी रुपिया राजस्थान में रुपिया राजस्थान में भी रुपिया राजस्थान में भी राजस्थान में भी राजस्थान में भी राजस्थान में भी राजसन में भी राजसी राजसी राजसन में भी राजसन में भी राजसी राजन में भी राजसी राजसी राजन में भी राजसी राजन में भी राजन में भी राजसी राजन में भी राजन में भी राजन में भी राजन में भी राजन मं भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भिं भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में भी राजन में