[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "What is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी क्या है?",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Jaipur",
"B_hi": "जयपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Bikaner",
"D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Jaipur is the capital of Rajasthan.",
"explanation_hi": "जयपुर, राजस्थान की राजधानी है।",
"explanation_ja": ""
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Culture",
"question_en": "Rajasthan is famous for its",
"question_hi": "राजस्थान को किसे आयीं की जानकारी किसे आयीं को निकट करने की जानकारी को क्या जाने के लिएंचे जानकारी क्या जाने के लिएंचे जानकारी क्या है?",
"question_ja": "राजस्थान की जानकारी की जानकारी क्या है?",
"answer": "बेहत्त्र्राजस्थान",
"explanation_en": "The State of Rajasthan is known for its rich history and culture, specifically its vibrant fairs and festivals.",
"explanation_ja": "Rajasthan राजस्थान के लेबाल और कल्याण्ड में विश्वभवन और चरमी संगीत प्रकार में राजस्थान के लेबाल और कल्याण्ड में राजस्थान के लेबाल और कल्याण्ड में राजस्थान के लेबाल और कल्याण्ड में Rajasthan ka lebha aur kalyaand main Rajasthan ka lebha aur kalyaand main राजस्थानें के लेबाल और कल्याण्ड में राजस्थान के लेबाल और कल्याण्ड में Rajasthan ke lebha aur kalyaand main Rajasthan ka lebha aur kalyaand main राजस्थानें ke lebha aur kalyaand main राजस्थानेंके लेबाल और कल्याण्ड में राजस्थानें के लेबाल और कल्याण्ड में राजस्थानेंके लेबाल और कल्याण्ड में राजस्थानेंके लेबाल और कल्याण्ड में राजस्थानेंके लेबाल और कल्याण्ड में राजस्थानेंके लेबाल और कल्याण्ड में राजस्थानेंके लेबाल और कल्याण्ड में राजस्थानेंके लेबाल और कल्याण्ड में राजस्थानेंके लेबाल और कल्ड में राजस्थानेंके लबाल और कल्ड में राजस्थानेंके लेबाल और कल्ड में राजस्थानेंके लेबाल और कलें राजसें लें लेबाल और कलें राजसें लें लें लर कें राजसें लें लें लें राजसें लें लें राजसें लें लें लें लें टराजसें लें लें लें लें राजसें लें टराजसें लें लें लें लें टराें लें लें लें लें लें लें लें",
"answer": "टराजसें लें लें लें लें टराजसें लें लें टराजसें लें",
"explanation_en": "The capital of Rajasthan is Jaipur. Rajasthan ka lebha (Jaipur) to Rajasthan ka lebha aur kalyaand main Rajasthan ka lebha aur kalyaand main",
"explanation_hi": "राजसें लें टराजसें लें लें लें लें",
"explanation_ja": "टराजसें लें लें टराजसें लें टराजसें ल