[
{
"subject": "Rajasthan History",
"topic": "Famous Forts and Palaces",
"question_en": "Which famous palace is located in Jaipur?",
"question_hi": "जयपुर में कौन सा फ़मीस्ट है?",
"A_en": "Amer Fort", "A_hi": "आमर फ़त्तों",
"B_en": "Hawa Mahal", "B_hi": "हवा महाल",
"C_en": "Cenotaphs of Jaipur", "C_hi": "जयपुर में कोणतियों",
"D_en": "City Palace", "D_hi": "शहर प्लास्ट",
"answer": "B",
"explanation_en": "Hawa Mahal is a famous palace located in Jaipur.",
"explanation_hi": "हवा महाल, जयपुर में एक प्रमोबार क्या है?",
"explanation_hi": "हवा महाल, जयपुर में एक प्रमोबार क्या है?"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan Rulers",
"question_en": "Which Ruler was the founder of the City of Jaipur?",
"question_hi": "जयपुर किस राजन संतुल का निवासी किस राज्य के निवासी क्या है?",
"answer": "Amber",
"explanation_en": "Amber is the founder of Jaipur, the capital city of Rajasthan.",
"explanation_hi": "जयपुर के निवासी को च्यामर कहींगे किस राज्य के निवासी क्या हींगे?",
"explanation_hi": "जयपुर की निवासी से लिखित किस राज्य के निवासी होंगे?",
"answer": "Amber",
"explanation_en": "Amber was the founder of Rajasthan, whose capital is Jaipur.",
"explanation_hi": "जयपुर के निवासी से लिखित किस राज्य के निवासी होंगे?",
"answer": "Amber",
"explanation_en": "Amber was the founder of Rajasthan, and the capital of Rajasthan is Jaipur.",
"explanation_hi": "जयपुर राज्य के निवासी से लिखित किस राज्य के निवासी होंगे?",
"answer": "Amber",
"explanation_en": "Amber was the founder of Rajasthan, and the capital of Rajasthan is Jaipur.",
"explanation_hi": "जयपुर राज्य के निवासी से लिखित किस राज्य के निवासी होंगे?",
"answer": "Amber",
"explanation_en": "Amber was the founder of Rajasthan and the ruler who founded the city of Jaipur.",
"explanation_hi": "जयपुर राज्य के निवासी से लिखित किस राज्य के निवासी होंगे?",
"answer": "Amber",
"explanation_en": "Amber was the founder of Rajasthan and the ruler who established Jaipur.",
"explanation_hi": "जयपुर राज्य के निवासी से लिखित किस राज्य के निवासी से लिखित किस राज्य के निवासी से लिखित किस राज्य के निवासी से लिखित किस राज्य किस से लिखित किस राज्य की से लिखित किस राज्य किस स से लिखित किस राज्य किस से लिखित किस राज्य किस से लिखित किस स राज्य किस से लिखित किस राज्य किस स स लिखिस से लिखिस राज्य किस स लिखिस स राज्य किस स लिखिस लिस स राज्य किस सराज्य किस लिखिसे राज्य किसलिस राज्य किसलिखिसराज्य किसलिसराज्य किसलिस लिसराज्य किसलिस राज्य किसलिस राज्य किसलिसराज्य किसलिस राज्य किसलिसराज्य किसलिसलिस राज्य किस राज्य किसलिसराज्य किसलिसराज्य किसलिस राज्य किसलिस राज्य किसलिस राज्य किसलिसराज्य किसलिसराज्य किस राज्य किसलिसराज्य किसलिसराज्य किसलि