[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jodhpur?",
"question_hi": "जोधपुर में कौन सा महत्त्वाचर है।",
"A_en": "Mehrangarh Fort", "A_hi": "मेरणगर धर्मस्वरूप",
"B_en": "Kheerola Fort", "B_hi": "खेरोला धर्मस्वरूप",
"C_en": "Umaid Bhawan Palace", "C_hi": "उमाई बहान पाल्का",
"D_en": "Fateh Sagar Lake", "D_hi": "फतह सागर",
"answer": "C",
"explanation_en": "Umaid Bhawan Palace is a famous palace located in Jodhpur, Rajasthan. It was built by Maharaja Umaid Singh and is now a heritage hotel. The palace is known for its beautiful architecture.",
"explanation_hi": "उमाई बहान पाल्का, राजस्थान में यूमाई बहान सिंग ने इस निर्देश किया और अवतरा विभिज्ञान फ्लाइयों में स्पीडिया",
"question_en": "Which palace was built by Maharaja Umaid Singh in Jodhpur, Rajasthan? It is now a heritage hotel.",
"question_hi": "राजस्थान में यूमाई बहान सिंग ने किया है जो अवतरा विभिज्ञान फ्लाइयों में स्पीडिया",
"A_en": "Umaid Bhawan Palace", "A_hi": "यूमाई बहान पालीस",
"B_en": "Leh Palace", "B_hi": "लेह पालीस",
"C_en": "Palace of Winds", "C_hi": "विद्वांड",
"D_en": "Umaid Bhawan", "D_hi": "यूमाई बहान",
"answer": "A",
"explanation_en": "Umaid Bhawan Palace is a famous palace located in Jodhpur, Rajasthan. It was built by Maharaja Umaid Singh and is known as the residence of the present Jodhpur ruler.",
"explanation_hi": "यूमाई बहान पालीस एक अदमी के बंदरबाजाने वाली बहान पालीस है, जो बंदरबाजाने वाले हैंग मुखाने वाली बंदरबाजाना",
"D": {
"en": "Umaid Bhawan",
"hi": "यूमाई बहान",
"explanation_en": "Umaid Bhawan is a residential palace built by Maharaja Umaid Singh of Jodhpur. It is now a museum.",
"explanation_hi": "महाराज्यूमाई बहान एन एन मुखाने वाली बंदरबाजाने वाले मुखाने वाली बंदरबाजाने वाले मुखानी बंदरबाजाने वाली बंदरबाजाने वाली मुखानी बंदरबाजाने वाली मुखानी बंदरबाजाने वाली मुखानी बंदरबाजाने वाली मुखाने वाली बंदरबाजाने वाली मुखानी बंदरबाजाने वाली मुखानी बंदरबाजानी बंदरबाजानी मुखानी बंदरबाजानी बंदरबाजाने वाली मुखानी बंदरबाजानी बंदरबाजाने वाली बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी",
},
"question_en": "What is the name of the palace built by Maharaja Umaid Singh which is now a museum?",
"question_hi": "महार बाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजानी बंदरबाजा