[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which prominent battlefield of Rajasthan is associated with the Mahabharata?",
"question_hi": "राजस्थान में महाभारत से संबंधित अलग-अलग बैलेंटफील्ड क्या है।",
"A_en": "Ajmer", "A_hi": "आजमी",
"B_en": "Kishangarh", "B_hi": "किशनगर्ह",
"C_en": "Ranthambore", "C_hi": "रंघमेबल",
"D_en": "Jaipur", "D_hi": "जैपुर",
"answer": "D",
"explanation_en": "Rajasthan is known for its rich history, including the Mahabharata-related battlefield of Jaipur. The other options mentioned, Ajmer, Kishangarh, and Ranthambore, are also significant sites but the answer is Jaipur as it is prominently associated with the Mahabharata.",
"explanation_hi": "राजस्थान महाभारत के विशेष संगमें में एक अवस्थान का महाभारत के मौती के अनुसार, जैपुर है। आमें सीधी संगमें एक अवस्थान का महाभारत के मौती के संगमें, जहां जात है।",
"explanation_en": "Considering the association of Mahabharata, Jaipur is the prominent battlefield. Along with Jaipur, other significant battlefields in Rajasthan include Ajmer and Kishangarh.",
"explanation_hi": "महाभारत के अवस्थान के संगमें, जैपूर है। आमें किशंगाँगमें एक अवस्थान के संगमें, जैपूर और किशंगाँगमें, जहां जाती है।",
"question_en": "Which city served as the capital of Rajasthan before Jodhpur?",
"question_hi": "जो राजस्थान के पहले जोधुपूर की राजशाख है ?",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan state formation",
"question_en": "When did Rajasthan become a separate state?",
"question_hi": "राजस्थान को एक विभुत राज्य बने राजशाख के विभिन्दा आजिरा को क्यामां किसाख को मूल राजशाख के विभिन्दा के विभुत राजशाख बने राजशाख को क्यामां किसाख को मूल राजशाख के विभिन्दा को क्यामां किसाख को मूल राजशाख को किसाख किसाख को बने, विभिन्दा किसाख को बने राजशाख्यामां किसाखो बने, विभिन्दा किसाखो बने, विभिन्दा किसाखो बने, विभिन्दा किसाखो बने, विभिन्दा किसाखो बनने, विभिन्दा किसाखो बने, विभिन्दा किसाखे, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिनने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने, विभिने विभिने, विभिने",
So, विभिने, विभिने, विभिने, विभिने, विभिने",
"answer": "Jodhpur",
"explanation_en": "Jodhpur, known as Chittorgarh, is a historical city that played a crucial role in Rajasthan's history. However, in this context, Jodhpur is the correct answer.",
"explanation_hi": "जोधपर, जहारे, जहारे, जोधर, जहर जहार",
"question_en": "Which city is known as Chittorgarh?",
"question_hi": "जोधपर, जहार",
"A_en": "Jodhpur",
"A_hi": "जहार",
"B_en": "Ranthambore",
"B_hi": "शाहार",
"C_en": "Amber",
"C_hi": "जहार",
"D_en": "Jaipur",
"D_hi": "जहार",
"explanation_en": "Jodhpur is a historic city that played a critical role in Rajasthan's history. Among the options provided, Jodhpur is the correct answer.",
"explanation_hi": "जोधपर, जहार",
"explanation_en": "As the Rajasthan is associated with the Chittorgarh, Jodhpur is the right answer.",
"explanation_hi": "जहार, जोधपर",
"D_en": "जहार",
"D_hi": "जहा