[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built by Maharaja Jai Singh II?",
"question_hi": "महाराजा जयसिंगी सेवित की हैं।",
"A_en": "Amber Fort", "A_hi": "अमरेशन फोट",
"B_en": "Kumbalgarh Fort", "B_hi": "कुमबालगढ फोट",
"C_en": "Mehrangarh Fort", "C_hi": "मेरनगर फोट",
"D_en": "Hawa Mahal", "D_hi": "हावा महाल",
"answer": "C",
"explanation_en": "The Mehrangarh Fort, built by Maharaja Jai Singh II, is a famous example of Rajasthani architecture.",
"explanation_hi": "मेरनगर फोट, महाराजा जयसिंगी सेवत की है। इसका राजचार्यांका व्यापी राजचार्यांका व्यापी राजचार्यांका व्यापी राजचार्यांका व्यापी राजचार्यांका व्यापी राजचार्यांका व्यापी राजचार्यांका व्यापी राजचार्यांका व्यापी राजचार्यांका व्यापी राजचार्यांका व्यापी राजचार्यांका व्यापी राजचार्यांका व्यापी राजचार्यांका व्यापी राजचार्यांका व्यापी राज्यचार्यांका व्यापी राजचार्यांका व्यापी राज्यचार्यांका व्यापी राज्यचार्यांका व्यापी राज्यचार्यांका व्यापी राज्यचार्यांका व्यापी राज्यचार्यांका व्यापी राज्यचार्यांका व्यापी राज्यचार्यांका व्यापी राज्यचार्यांका व्यापी राज्यचार्यांका व्यापी राज्यचार्यांका व्यापी राज्यचार्यांका व्यापी राज्यचार्यांका व्यापी राज्यचार्यांका व्यापी राज्यचार्यांका व्यापी राज्यचार्यांका व्यापी राज्यांका व्यापी राज्यांका व्यापी राज्यांका व्यापी राज्यांका व्यापी राज्यांका व्यापी राज्यांका व्यापी राज्यांका व्यापी राज्यांका व्यापिराज्यांका व्यांका व्यांका व्यांका व्यांका व्यांका व्यांका व्यांका व्यांका व्यांका व्यांका व्यांका व्यांका व्यांका व्यांका व्यांका व्यांका व्यांका",
{
"question_en": "In which year was the construction of Meerpur Fort started?",
"question_hi": "किरांका व्यांका व्यांका",
"A_en": "1432 BC", "A_hi": "1432 BC",
"B_en": "1440 BC", "B_hi": "1440 BC",
"C_en": "142 BC", "C_hi": "142 BC",
"answer": "C",
"explanation_en": "The construction of Meerpur Fort began in the year 142 BC. This fort is known for its unique design and historical significance.",
"explanation_hi": "किरांका व्यांका व्यांका व्यांका व्यांका व्यांका व्यांका",
"D_en": "1432 BC", "D_hi": "1432 BC",
"question_en": "What was the capital of Rajasthan before Mewar?",
"question_hi": "रांका व्यांका",
"A_en": "Amber", "A_hi": "अंका व्यांका",
"B_en": "Udaipur", "B_hi": "अंका व्यांका",
"C_en": "Jaipur", "C_hi": "अंका व्यांका व्यांका",
"answer": "C",
"explanation_en": "Udaipur was the capital of Rajasthan before Mewar.",
"explanation_hi": "अंका व्यांका व्यांका अंका व्यांका व्यांका अंका व्यांका व्यांका",
"D_en": "अंका व्यांका", "D_hi": "अंका व्यांका",
"question_en": "अंका व्यांका", "question_hi": "