[
{
"subject": "Rajasthan History",
"topic": "Khubber Raj",
"question_en": "Which dynasty ruled Rajasthan before the establishment of the Mughals?",
"question_hi": "राजस्थान मुघलों की सृष्टि केंद्रस्थान को हेतु इसके बाद कौन सी संतुलन राजस्थान में राज करते थे।",
"A_en": "Merta, Meera, and Sisodia Rulers",
"A_hi": "मेरा, मीरा और सिसोड़ी राजनेवाले",
"B_en": "Mughals and Marwar Rulers",
"B_hi": "मुघलों और मर्वार राजनेवाले",
"C_en": "Bhanwar Rao, Kachwaha, and Amer Rulers",
"C_hi": "भंवार अलों, कचवाहा और Amer राजनेवाले",
"D_en": "Bhils and Chauhan Rulers",
"D_hi": "बीलों और चौहान राजनेवाले",
"answer": "C",
"explanation_en": "Bhanwar Rao, Kachwaha, and Amer were the rulers of Rajasthan before the establishment of the Mughals.",
"explanation_hi": "भंवार, कचौहान, और Amer राजनेवाले राजदार मुघलों के बाहर राजनेवाले मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजनेवाले राजदार मुघल राजदार ने राजने राजदार मुघल राजदार ने राजने राजर मुघल राजने राजर मुघल राजर ने राजर मुघल राजर मुघल राजर ने राजर मुघल राजर भल राजर मुघल राजर मुघल राजर भल राजर मुघल राजर मुघल राजर भल राजर मुघल राजर मुघल राजर भल राजर मुघल राजर भल राजर मुघल राजर भल राजर मुघल राजर भल राजर राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल",
"answer": "राजर भल राजर भल राजर भल",
"explanation_en": "Before the establishment of the Mughals, Rajasthan was ruled by Rajasthan",
"explanation_hi": "राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल राजर भल",
"option_en": "Jodhpur, Chauhan