[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which architectural style is prominently featured in the forts of Rajasthan?",
"question_hi": "राजस्थान के संस्कृतिपूर्वक स्रोत के राजघरों में कैसे विभाग किया गया है ?",
"A_en": "Hindustani Architecture", "A_hi": "हिंदूस्तंभ का एक विभाग",
"B_en": "Medieval Architecture", "B_hi": "मेडिगन का विभाग",
"C_en": "British Architecture", "C_hi": "ब्रिटिश एक विभाग",
"D_en": "Muslim Architecture", "D_hi": "मुसलमा का विभाग",
"answer": "B",
"explanation_en": "The Middle Ages in India saw a significant rise in the prominence of medieval architecture in Rajasthan's forts. The region's forts showcase the rich history and cultural influences of that era. ",
"explanation_hi": "भारत में मध्यवर्षीय दिवस राजस्थान के राजघरों mein मध्यों का मैंकों में मध्यवर्षियां का मैंकों के राजघरों में मैंकों का मैंकों के राजघरों में मैंकों का मैंकों के राजघरों में मैंकों का मैंकों के राजघरों में मैंकों का मैंकों के राजघरों में मैंकों का मैंकों के राजघरों में मैंकों का मैंकों के राजघरों में मैंकों का मैंकों के राजघरों में मैंकों का मैंकों के राजघरों में मैंकों का मैंकों के राजघरों में मैंकों का मैंकों के राजघरों में मैंकों का मैंकों के राजघरों में मैंकों का मैंकों के राजघरों में मैंकों का मैंकों के राजघरों में मैंकों का मैंकों के राजघरों में मैंकों के राजघरों में मैंकों के राजघरों मैंकों के राजघरों मैंकों के राजघरों मैंकों के राजघरों मैंकों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरों के राजघरे राजघरों के राजघरे राजघरे राजघरे राजघरे राजघरे राजघरे राजघरे राजघरे राजघे राजघरे राजघरे राजघरे राजघरे राजघरे",
{"question_en": "Rajasthan's history",
"question_hi": "राजघरे राजघरे राजघरे राजघरे राजघरे",
"A_en": "Medieval Rajasthan", "A_hi": "मे राजघरे राजघरे राजघरे",
"B_en": "Modern Rajasthan", "B_hi": "राजघरे राजघरे राजघरे",
"C_en": "Tribal Rajasthan", "C_hi": "राजघरे राजघरे राजघरे",
"D_en": "Medieval Rajasthan", "D_hi": "राजघरे राजघरे राजघरे राजघरे",
"answer": "B",
"explanation_en": "Rajasthan is known for its rich history and heritage, especially during the medieval period. During this era, the forts showcase the cultural influences and architectural styles of different Rajasthani communities. Jaipur, Jaisam, and Udaipur are the most renowned examples.",
"explanation_hi": "राजघरे रा