[
{
"subject": "Rajasthan History",
"topic": "Rajasthan State Formation",
"question_en": "Which event marked the formation of the present-day Rajasthan state?",
"question_hi": "राजस्थान के प्रमुख प्रकार का क्या घटना राजस्थान के वर्तमान स्थानीय राज्य को निर्माता था।",
"A_en": "The merger of Alwar and Bharatpur districts",
"A_hi": "अलवार और भारतगढ़ जिलों के विशेषजीते राज्य",
"B_en": "The merger of Jaipur, Ajmer, and Jodhpur districts",
"B_hi": "जयपुर, अजमेंड और जोधपुर जिलों के में विशेषजीते प्रदेश",
"C_en": "The merger of Mewar, Marwar, and Malwa regions",
"C_hi": "मेरूर, मर्वार और मलवालों के में विशेषजीते प्रदेश",
"D_en": "The emergence of Jodhpur as a regional power",
"D_hi": "जोधपुर के अंतर्यार सेन्द्रभवन अंतर्यार से अंतर्यार सेन्द्रभवन अंतर्यार से अंतर्यार सेन्द्रभवन अंतर्यार से अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्र अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन्द्रभवन अंतर्यार सेन अंत्रभवन अंतर्यार सेन",
"
"answer": "B",
"explanation_en": "The merger of the Marwar, Jaisam, and Ranthali regions led to form the Marwar kingdom, which later on became a stronghold of Maharaja Rao Bhim Singh.",
"explanation_hi": "महार मर मार सेन्यार मार मर मह्र मर मार",
},
{
"subject": "Rajasthan",
"topic": "History",
"question_en": "Who was the founder of Marwar kingdom?",
"question_hi": "मर मार मर मार मर",
"A_en": "Prithvir Singh",
"A_hi": "पर्यार पर मार पर",
"B_en": "Kanwar Singh",
"B_hi": "कन्यार कर कर कनर",
"C_en": "Fatun Singh",
"C_hi": "फट्यार फटर",
"D_en": "Bhopal Singh",
"D_hi": "हपार हर हपर हर",
"answer": "Fatun Singh",
"explanation_en": "Fatun Singh founded the Marwar kingdom.",
"explanation_hi": "फट्यार फटर्यार फटर्यार",
}],
]