[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Other Historical Cities",
"question_en": "Which city in Rajasthan was the capital during the Mughal rule?",
"question_hi": "मुगल समय में राजस्थान में कौन सी शहर राजधानी थी ?",
"A_en": "Jaipur", "A_hi": "जयपुर",
"B_en": "Jodhpur", "B_hi": "जोधपुर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Ajmer", "D_hi": "अजमेर",
"answer": "D",
"explanation_en": "Ajmer was the capital of Rajasthan during the Mughal rule. The city was under Mughal emperor Akbar's reign and later under the Marathas.",
"explanation_hi": "मुगल समय में Rajasthan में Ajmer की राजधानी थी। ऐसा मुगल निवास के काम में ऐसा यात्रा की हुई, प्रधानमंदरबान से में ऐसा यात्रा की हुई।",
"explanation": "In the Mughal era, Ajmer served as the capital of Rajasthan. Later, during the rule of the Maratha empire, Ajmer continued to be the capital city.",
"explanation_hi": "मुगल सम्पर्की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात्रा की हुई राजप्रांत की हुई ऐसा यात की हुई राजप्रांत की हुई ऐसा यात की हुई राजपरांत की हुई ऐसा यात की हुई राजपरांत की हुई ऐसा यात की हुई राजपरांत की हुई ऐसा यात की हुई राजपरांत की हुई ऐसा यात की हुई राजपरांत की हुई ऐसा यात की हई राजपरांत की हुई ऐसा यात की हुई राजपरांत की हुई ऐसा यात की हुई राजपरांत की हुई ऐसा यात की हुई राजपरांत की हुई ऐसा यात की हुई राजपरांत की हुई ऐसा यात की हुई राजपरांत की हुई ऐसा यात की हुई राजपरांत की हुई ऐसा यात की हुई",

The following questions are high-quality multiple-choice MCQs on Rajasthan History topics.\n\n1. रांत की हुई राजपरांत की हुई ऐसा",

2. रांत की हुई रांत की हुई ऐसात\n\n3. रांत की हुई राजपरांत की हुई ऐसात की हुई राजपरांत की हुई ऐसात की हुई राजपरांत\n\n4. रांत की हुई राजपरांत की हुई ऐसाती हुई राजपरांत की हुई