[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "What was the capital of Rajasthan before Jaipur?",
"question_hi": "जैसे पहले जयपुर राजस्थान के राजधानी था ?",
"A_en": "Amber Fort", "A_hi": "अमेरिका के तथापि राजधानी",
"B_en": "Pushkar", "B_hi": "पुष्कर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Jodhpur", "D_hi": "झोद्धार",
"answer": "D",
"explanation_en": "Before Jaipur became the capital of Rajasthan, Jodhpur was the capital. Jodhpur was the seat of the Rathores and was considered the largest and most powerful kingdom in Rajasthan during that time.",
"explanation_hi": "जैसे जैदेश ने राजस्थान की राजधानी बनाई, झोद्धार का राजधाना से मिलाया गया था। झोद्धार का राजधाना राजस्थान का स्वतराष्ट्र और स्वतराष्ट्र का राजधाना से मिलाया गया था।",
"question_en": "Which city was the capital of Rajasthan before Jodhpur was declared as the capital?",
"question_hi": "राजस्थान का राजधाना से मिलाया गया था। राजस्थान के राज्य का राजधाना से मिलाया गया था।",
"question_hi": "राजस्थान का राजधाना से मिलाया गया था। राजस्थान के राज्य का राजधाना से मिलाया गया था।",
"A_en": "Jaisalmer",
"A_hi": "जयसालमेर",
"B_en": "Udaipur",
"B_hi": "उदयपुर",
"C_en": "Jhalrapatan",
"C_hi": "झल्रापाटान",
"D_en": "Meerpur",
"D_hi": "मीरपुर",
"answer_en": "B",
"answer_hi": "ब",
"explanation_en": "Before Jodhpur, Udaipur was the capital of Rajasthan. Rajasthan was governed from Udaipur before becoming the capital of Jodhpur.",
"explanation_hi": "पूर्व मंत्रालय के विततम राज्य के राजधाने के पूर्व बुज्यालय के राज्य मेंटम राज्य के विततम राज्य के राजधाने के पूर्व बुज्यालय के राज्य मेंटम राज्य के राजधाने के पूर्व बुज्यालय के राज्य मेंटम राज्य के विततम राज्यालय के मेंटम राज्यालय के राज्यालय के विततम राज्यालय के राज्यालय के वितम राज्यालय के राज्यालय के वितम राज्यालय के राज्यालय के राज्यालय के वितम राज्यालय के राज्यालय के राज्यालय के राज्यालय के राज्यालय के राज्यालय के राज्यालयालय के राज्यालयालय के राज्यालयालयालयालय के राज्यालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयालयाल