[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following is a famous fort in Rajasthan?",
"question_hi": "राजस्थान में कौन सा प्राचीन फोट है।",
"A_en": "Amer Fort", "A_hi": "एमर फोट",
"B_en": "Mehrangarh Fort", "B_hi": "मेहनगर फोट",
"C_en": "Hawa Mahal", "C_hi": "हावा महाल",
"D_en": "Samode Haveli", "D_hi": "सामोद हवाई",
"answer": "B",
"explanation_en": "Mehrangarh Fort is a famous ancient fort in Rajasthan.",
"explanation_hi": "राजस्थान में प्राचीन फोट है। मेहनगर फोट यहां है।",
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following is the origin of the Jain religion?",
"question_hi": "राजस्थान के क्या है Jain विद्वान्यां के निर्गत हैं।",
"A_en": "Indra Sena",
"A_hi": "इंड्रा सेन",
"B_en": "Mahavir Sena",
"B_hi": "महावीर सेन",
"C_en": "Tirthankar Sena",
"C_hi": "तीर्थांकर सेन",
"D_en": "Chaumukhi Sena",
"D_hi": "चौमुखी सेन",
"answer": "B",
"explanation_en": "Mahavir Sena is the origin of Jain religion.",
"explanation_hi": "महावीर सेन राजस्थान के निर्गत है।",
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which Mughal ruler was the first to establish a fort in Jaipur?",
"question_hi": "जयपुर के एक पहली मुगोल मंत्री को जयपुर की पहली सुरूम कंसस्ट यों के मुगल मुगोल मंत्री को जैपुर की पहली सुरूम कंसस्ट यों के मुगल मुगोल मेंट्री के लक्ष्य के मुगल मुगोल मेंट्री के बाजू मुगल मुगोल मेंट्री के लक्ष्य के मुगल मुगोल मेंट्री के बाजू मुगल मुगोल मेंट्री के लक्ष्य के बाजू मुगल मुगोल मेंट्री के लक्ष्य के बाजू मुगोल मेंट्री के लक्ष्य के बाजू मुगोल मेंट्री के लक्ष्य के बाजू मुगोल मेंट्री के लक्ष्य के बाजू मुगोल मेंट्री के लक्ष्य के बाजू मुगोल मेंट्री के लक्ष्य के बाजू मंटरी के लक्ष्य के बाजू मेंट्री के लके बाजू मेंट्री के लके बाजू मेंट्री के लके बाजू मेंट्री के लके बाजू मेंट्री के लके बाजू मेंट्री के लके बाजू मेंट्री के लके बाजू मेंट्री के लके बाजी के लके मेंट्री के बाजू मट्री के लके बाजी के मेंट्री के लुके मेंट्री के बाजी मेंट्री के बाजी मेंट्री के बाजी के मेंट्री के बाजी मेंट्री के बाजी के मट्री के बाजी के मेंट्री के बाजी के मेंट्री के बाजी के मेंट्री के बाजी के मेंट्री के बाजी के मेंट्री के बाजी के मेंट्री के बाजी के मेंट्री के बाजी के मेंट्री के बाजी के मेंट्री के बाजी