[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jaipur?",
"question_hi": "जयपुर में किस पंजाब पर छोटे फोट है।",
"A_en": "Amber Fort", "A_hi": "एमबी फोट",
"B_en": "Hawa Mahal", "B_hi": "हावा महाल",
"C_en": "Cenotaph of Maharaja Sawai Man Singh II", "C_hi": "सवाई महाराज सवाई सावाई शांतिम मंसूर सेवाई",
"D_en": "Sanganeri Handicrafts", "D_hi": "सांघानेरी हाथिकर्नेंडर",
"answer": "B",
"explanation_en": "Hawa Mahal is famous for its unique architecture and is located in Jaipur.",
"explanation_hi": "हावा महाल ये विशेष आर्थिक आर्थिकरण के आकार के लक्ष्यों को बतायेंगेंगेंगों का प्रश्रामन के आकार को बताया जायेंगा।",
"answer": "A",
"explanation_en": "The unique architectural style of Palace of Pratapgarh will be explained.",
"explanation_hi": "प्रतापगढ़ के आकार को बताया जायेंगा।",
},
{
"subject": "Rajasthan History",
"topic": "Early Chola Dynasty",
"question_en": "Which Chola dynasty king is associated with the construction of Sambhar Lake?",
"question_hi": "समभार की बन्दीनां को कौलाई शायन के बुल्ड्रें के एक नगार के काफर को कौलाई शायन के बुल्ड्रें को संभावित करें।",
"option_en": [
{
"option": "Krishnadeva I",
"value": "B",
"explanation_en": "Krishnadeva I is credited with the construction of Sambhar Salt Lake.",
"explanation_hi": "क्रिष्णादेवा एक अर्थवीय मूर्ति के बुल्ड्रें काफरें को संभावित करें।",
"value": "B",
"explanation_en": "Krishnadeva I is credited with the construction of Sambhar Salt Lake.",
"explanation_hi": "क्रिष्णादेवा एक अर्थवीय मूर्ति के बुल्ड्रें काफरें को संभावित करें।",
"value": "A",
"explanation_en": "Amar Singh is credited with the construction of the Sambhar Salt Lake.",
"explanation_hi": "अमर सिंग एक अर्थवीय मूर्ति के बुल्ड्रें काफरें को संभावित करें।",
"value": "A",
"explanation_en": "Amar Singh is credited with the construction of the Sambhar Salt Lake.",
"explanation_hi": "अमर सिंग एक अर्थवीय मूर्ति के बुल्ड्रें काफरें को संभावित करें।",
"value": "A",
"explanation_en": "Amar Singh is credited with the construction of the Sambhar Salt Lake.",
"explanation_hi": "अमर सिंग एक्ड्रें काफरें को संभावित करें को सामर्ड्र्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्ड्