[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Other Royal Cities",
"question_en": "Which city was the capital of Rajasthan before Jaipur?",
"question_hi": "राजस्थान के पहले किस शासनकालीन स्थान है?",
"A_en": "Udaipur",
"A_hi": "उदयपुर",
"B_en": "Jodhpur",
"B_hi": "जोधपुर",
"C_en": "Ajmer",
"C_hi": "अजमेर",
"D_en": "Alwar",
"D_hi": "अलवार",
"answer": "A",
"explanation_en": "Udaipur was the capital of Rajasthan before Jaipur. It was founded by Maharana Udai Singh II in 1559 and was known as 'Fatehpur' initially.",
"explanation_hi": "उदयपुर, Rajasthan के पहले स्थान है। यह Maharana Udai Singh II ko 1559 में तथा पहले से संदेश के है, जो 'फत्थापर' बना गया था।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Cities and Their Founders",
"question_en": "Which city was founded by Maharana Pratap and is known as 'Chittor'?",
"question_hi": "महाराणा प्रतिभूम ने कित्तोड़ (चिट्टोड़) किए गये कित्तोड़ के प्रातिभूम ने किए गए के तथा कित्तोड़ के प्रान्तोड़ के हैंडारणी ने किए गए के तथा कित्तोड़ के प्रान्तोड़ के हैंडारणी ने किए गए के तथा कित्तोड़ के प्रान्तोड़ के हैंडारणी ने किए गए के तथा कित्तोड़ के हैंडारणी ने किए गए के तथा कित्तोड़ के हैंडारणी ने किए गए के तथा कित्तोड़ के हैंडारणी ने किए गए।",
"A_en": "Udaipur",
"A_hi": "उदाहरू",
"B_en": "Kishangarh",
"B_hi": "किसंगर्ह",
"C_en": "Kishangarh",
"C_hi": "किसंगर्ह",
"D_en": "Kishangarh",
"D_hi": "किसंगर्ह",
"answer": "B",
"explanation_en": "Kishangarh was founded by Maharana Kishangarh, while Udaipur was founded by Maharana Udai Singh II and Kishangarh by Maharana Kishangarh. Udaipur and Kishangarh both are also known as 'Fatehpur'.",
"explanation_hi": "किसंगर्ह माहरणा किसंगर्ह ने बनाइयाँ देवी जी ने Udaipur ने बनाइयाँ देवी जी ने Kishangarh और Udaipur ने बनाइयाँ देवी जी ने Kishangarh और उदायाँ देवी जी ने बनाइयाँ देवी जी ने बनाइयाँ देवी जी",
"A_en": "Kishangarh and Udaipur",
"A_hi": "किसाइयाँ देवियाँ देवी जी ने बनाइयाँ देवी जी",
"B_en": "Kishangarh and Udaipur",
"B_hi": "किसाइयाँ देवियाँ देवी जी", 
"C_en": "Kishangarh and Udaipur",
"C_hi": "किसाइयाँ देवियाँ देवी जी",
"D_en": "Kishangarh and Udaipur",
"D_hi": "किसाइयाँ देवियाँ देवी जी",
"answer": "C",
"explanation_en": "Kishangarh and Udaipur were founded by Maharana Kishangarh and Maharana Udai Singh II respectively.",
"explanation_hi": "किसाइयाँ देवियाँ देवियाँ देवियाँ देवियाँ देवियाँ देवियाँ देवियाँ देवियाँ देवियाँ देवियाँ देवियाँ देवियाँ देवियाँ देवियाँ",
"D_en": "Kishangarh and Udaipur",
"D_hi": "किसाइयाँ देवियाँ देवियाँ देवियाँ",
"answer": "B",
"explanation_en": "Kishangarh and Udaipur were founded by Maharana Kishangarh and Maharana Udai Singh II respectively.",
"explanation_hi": "किसाइयाँ देवियाँ देवियाँ",
}
]