[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which king founded the city of Jaipur?",
"question_hi": "जयपुर के नेता कौन सीओं निर्माण करीं।",
"A_en": "Samrat Maharaja Sawai Jai Singh II", "A_hi": "सामर्थ्य महाराजा सवाई जयश्री सिंह सेवाई जीवन महाराजा",
"B_en": "Samrat Maharaja Bikramajit Singh", "B_hi": "समर्थ महाराजा बिक्रामजी",
"C_en": "Samrat Maharaja Rai Singh", "C_hi": "समर्थ महाराजा राई सिंह",
"D_en": "Samrat Maharaja Man Singh", "D_hi": "समर्थ महाराजा मन सिंह",
"answer": "A",
"explanation_en": "Samrat Maharaja Sawai Jai Singh II is the founder of Jaipur, also known as Pink City. He was the fifth ruler of the Kachhava Dynasty and established Jaipur in 1727 AD.",
"explanation_hi": "साधु महाराजा सावाई जी जयपुर के राजा और चंद्रो नामी के निर्वांचल संत और पालना पुर के कलकों के राजा और पालना पुर के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा के निर्वांचल संत और पालना पुर के राजा निर्वांचल संत और पालना पुर के राजा ना निर्वांचल संत और पालना पुर के राजा ना ना पुरर संत और पालना ना ना र के राजा ना ना ना पुरर संत",
र के राजा ना ना ना र के राजा ना ना र करे र के राजा ना र के राजा",
"explanation": "राजा ना र के राजा र के राजा रके राजा",
"answer": "राजा ना र राजा रके राजा रे राजा"
राजा राजा",
राजा रके राजा",
राजा राजा",
राजा राजा",
राजा राजा",
राजा राजा",
राजा राजा",
राजा राजा",
राजा राजा",
राजा",
राजा राजा",
राजा राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
राजा",
रा