[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort was built during the reign of Prithviraj Chauhan?",
"question_hi": "प्रतित्तिर्जन के राजनीति में कौन सी उच्चमूर्ति सेना का निर्माण करने वाले प्रतित्तिर्जन के राजनीति में आज़मा की विवरण",
"A_en": "Amber Fort",
"A_hi": "अमेर",
"B_en": "Mezban Fort",
"B_hi": "मेज़बान का निर्माण",
"C_en": "Toad Fort",
"C_hi": "तौदेव का निर्माण",
"D_en": "Sisod Fort",
"D_hi": "सिसोद का निर्माण",
"answer": "A",
"explanation_en": "Amber Fort was built during the reign of Maharaja Man Singh I in the rule of Raja Jai Singh II.",
"explanation_hi": "अमेर का निर्माण, मान सिंग I के राजने वाले राजकमंतराई यात्रा के स्तर में बनी एमेर बाजी, मान सिंग I के राजने वाले राजकमंत्रा के स्तर में बनी एमेर बाजी",
"answer": "A",
"explanation_en": "Amber Fort was built during the reign of Maharaja Man Singh I in the court of Raja Jai Singh II.",
"explanation_hi": "एमेर बाजी, मां सिंग I के राजनेवाले राजक्षमाने वाले राजा जयसिंग II के स्तर में बना करने वाला एमेर बाजी",
"explanation_en": "Amber Fort was built in the court of Raja Jai Singh II in the reign of Maharaja Man Singh I.",
"explanation_hi": "एमेर बाजी, मां सिंग I के राजने वाले राजा जयसिंग II के स्तर में बना करने वाला एमेर बाजी",
}
{
"subject": "Rajasthan History",
"topic": "Jaipur",
"question_en": "Which is the birthplace of Maharaja Sawai Jai Singh II?",
"question_hi": "महाराजस्थान के विद्यांक सौवाई जैसींग II का जन्मन्यांक किया महो।",
"A_en": "Jaipur",
"A_hi": "जयपुर",
"B_en": "Udaipur",
"B_hi": "उदायपुर",
"C_en": "Chittor",
"C_hi": "छत्त्र",
"D_en": "Alwar",
"D_hi": "अलवार",
"answer": "Jaipur",
"explanation_en": "Maharaja Sawai Jai Singh II was born in Jaipur.",
"explanation_hi": "महाराजस्तांक सौवाई सिंग II सिंग महो।",
}
{
"subject": "Rajasthan Culture",
"topic": "Gujarat and Rajasthan",
"question_en": "In which Indian state, Rajasthan is located?",
"question_hi": "भाराजस्तांक किंग सौवाई सिंग महो।",
"A_en": "Gujarat",
"A_hi": "गजराजस्तांक किंग सिंग महो।",
"B_en": "Rajasthan",
"B_hi": "भाराजस्तांक किंग सिंग महो।",
"C_en": "Haryana",
"C_hi": "हराजसटांक किंग भाजस्तांक किंग महो।",
"D_en": "Madhya Pradesh",
"D_hi": "भाजसटांक किंग महो।",
"answer": "Haryana",
"explanation_en": "भाजसटांक किंग भाजसटांक किंग महो।",
"explanation_hi": "भाजसटांक किंग महो।",
}
{
"subject": "Rajasthan History",
"topic": "Major Events",
"question_en": "What important event took place during the rule of Maharaja Man Singh II?",
"question_hi": "एमलटांक भाजसटांक क भाजसटांक भाजसटांटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसटांक भाजसट