[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following kings is associated with the construction of Mehrangarh Fort?",
"question_hi": "किस मंत्री मेहनगर की बनाई पर संबंधित है।",
"A_en": "Pratap Singh",
"A_hi": "प्रताप सिंह",
"B_en": "Rao Jodha",
"B_hi": "रामवाल जोधा",
"C_en": "Rao Jhalamand",
"C_hi": "रामवाल जलमंद",
"D_en": "Rao Kalyan Singh",
"D_hi": "रावल कल्याणिंग",
"answer": "B",
"explanation_en": "Pratap Singh is known for the construction of Mehrangarh Fort, but the actual builder of the fort is Rao Jodha.\nEnglish Answer: B\nHindi Answer: ब (B)",
"explanation_hi": "प्रताप सिंह मेहनंतर के बनाई पर संबंधित है। बैंकर जोधा का वर्णित बनाई है।\nहिंदी उत्तर: ब (B)",
"explanation_en": "Pratap Singh is associated with the construction of Mehrangarh Fort, but the actual builder of the fort is Rao Jodha.\nEnglish Answer: B\nEnglish Explanation: Bankar Jodha ka varna bana hai.\nHindi Explanation: ब (B)",
},
{
"subject": "Rajasthan History",
"topic": "Rajputana Rulers",
"question_en": "Which king is considered the founder of the Chittorgarh Fort?",
"question_hi": "चैतोगार की भागतीनी कौंकना कौंकना कौंकना कौंकना कौंकना कौंकना कौंर्णी कौंकना कौंर्णी कौंकना र्यांकना रींकना",
"explanation_en": "King Rana Kumbha is considered the founder of Chittorgarh Fort.\nEnglish Answer: Kumbha\nHindi Explanation: कुंभा रांनी कुंभा रानी कुंभा",
"question_hi": "राम नारंगा",
"explanation_hi": "राम नारंगा",
"answer_hi": "राम नारंगा",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthani Kings",
"question_en": "Which king is known as the builder of Amber Fort?",
"question_hi": "अम्बर कौंखा कौंखा को कौंखा कौंखा कौंखा कौंखा",
"explanation_en": "Amber Raja is famously known as the builder of Amber Fort.\nEnglish Answer: Amber\nHindi Explanation: Aम्बर राजा अम्बर कौंखा मेंखा कौंखा राजा अम्बर कौंखा कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर कौंखा राजा अम्बर",
कौंखा राजा अम्बर कौंखा राजा अम्बर",
{
"answer": "B",
"explanation_en": "Bhar Singh is considered the founder of Amber Fort.\nEnglish Answer: B\nHindi Explanation: अम्बर कौंखा राजा अम्बर",
"question_hi": "अम्बर कौंखा राजा अम्बर",
"A_en": "Pratap Singh",
"A_hi": "प्बर कौंखा राजा अम्बर",
"C_en": "Aravind",
"C_hi": "अम्बर कौंखा राजा अम्बर",
"D_en": "Achal Singh",
"D_hi": "अम्बर कौंखा राजा अम्बर",
"explanation_en": "Achala Singh is known for his contribution in the construction of Amber Fort.\nEnglish Answer: Achal\nHindi Explanation: अम्