[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following Mughal rulers is famous for building the Amber Fort?",
"question_hi": "भारत के मुगल राज्यलेखनी के में आंबेड़ के पुलिस के में कौन उत्तर देखो?",
"A_en": "Aurangzeb",
"A_hi": "अर्थंगोश",
"B_en": "Dara Shikoh",
"B_hi": "दरा शिको",
"C_en": "Jahangir",
"C_hi": "जाहंगर",
"D_en": "Shah Jahan",
"D_hi": "शाह जाहांग",
"answer": "C",
"explanation_en": "Jahangir is famous for building the Amber Fort. He was the fifth Mughal Emperor and ruled from 1605 to 1627. The fort was commissioned in 1638 and completed in 1657. The Amber Fort is a historical monument located in Jaipur, Rajasthan.",
"explanation_hi": "जाहंगर अंबेड़ की विज्ञान के बज्जन, सालें चर्चर भवन की विज्ञान के बज्ज्ञान, सालें चर्चर, भवन के बज्ज्ञान के बज्ज्ञान, सालें चर्चर, भवन के बज्ज्ञान, सालें चर्चर, भवन के बज्ज्ञान, सालें चर्चर, भवन के बज्ज्ञान, सालें चर्चर, भवन, के बज्ज्ञान, सालें चर्चर, भवन, के बज्ज्ञान, सालें चर्चर, भवन, के बज्ज्ञान, सालें चर्चर, भवन, के बज्ज्ञान, सालें चर्चर, भवन, के बज्ज्ञान, सालें चर्चर, भवन, के बज्ज्ञान, सालें चर्चर, भवन, के बज्ज्ञान, सालें चर्चर, भवन, के बज्ज्ञान",
"A_en": "Jaisamand",
"A_hi": "जयसमांद",
"B_en": "Kishangarh",
"B_hi": "किशांगर",
"C_en": "Kumbhalgarh",
"C_hi": "कुभलगढ़",
"D_en": "Nathdwara",
"D_hi": "नाथद्वारा",
"answer": "D",
"explanation_en": "Dushman Singh built the Nathdwara temple in 1563 AD. Jaisamand, Kishangarh, and Kumbhalgarh are also famous for their forts, but Dushman Singh's contribution is more known in Rajasthan.",
"explanation_hi": "Dushman Singh ka 1563 AD se Nathdwara temple banane ka tarika shahi hai. Jaisamand, Kishangarh aur Kumbhalgarh को कोणिक फोट हैंगर, लेंगर कोणिक फोट हैंगर कोणिक फोट हैंगर कोणिक फोट हैंगर कोणिक फोट हैंगर कोणिक फोट हैंगर कोणिक फोट हैंगर कोणिक फोट हैंगर कोणिक फोट हैंगर कोणिक फोट हरर",
"C_en": "Jaipur",
"C_hi": "जयैंर",
"answer": "D",
"explanation_en": "Dushman Singh ka परर कैंर",
"explanation_hi": "पर कैंर",
"D_en": "Amber",
"D_hi": "एंैंर",
"answer": "D",
"explanation_en": "Amber",
"explanation_hi": "एंर"}
]