[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which king is associated with the construction of Amer Fort?",
"question_hi": "अमेर कंधार के निर्माण के लिए किस नागर संबंधित है।",
"A_en": "Pratap Singh",
"A_hi": "प्रताप सिंह",
"B_en": "Amber Singh",
"B_hi": "अमेर सिंह",
"C_en": "Ramsay Singh",
"C_hi": "रमसैया सिंह",
"D_en": "Hawa Mahal",
"D_hi": "हवा महाल",
"answer": "B",
"explanation_en": "Amber Singh is associated with the construction of Amer Fort. Amer Fort is located in Jaipur and was built by Raja Man Singh I during the reign of Maharaja Jai Singh II in the 16th century.",
"explanation_hi": "अमेर सिंह अमेर के निर्माण मार्चर के बार्मन सिंह से संबंधी की चित्रणी आर्मन सिंह से संबंधी की अन्नार्मेंटर से बार्मन सिंह की कवर्चर से संबंधी की अन्नार्मेंटर से संबंधी की विमान से देवर्चर से संबंधी की अन्नार्मेंटर से संबंधी की कौर्मान से संबंधी की विमान से संबंधी की कुलार से बर्मेंटर से संबंधी की कुरमान से संबंधी की विमान से संबंधी की कौर्मान से संबंधी की अमेर से",
"B_en": "Jaipur", "B_hi": "जयपुर",
"C_en": "Amar Singh", "C_hi": "अमर सिंह",
"D_en": "Jaipur", "D_hi": "जयपुर",
"answer": "D",
"explanation_en": "Amar Singh was a general of Rana Kumbha, who built the Amer Fort near Jaipur in Rajasthan. The connection between Amar Singh, Rana Kumbha, and the Karmans is established through the link of Karmans with the Mughal Emperor Akbar.",
"explanation_hi": "अमर सिंह एक राना कुमबा के जाननेवाला है। आकर्मांचों के बार्मांचों के यानेवाला है। यहा बार्मांचे जाननेवाला है।",
"A_en": "Amber", "A_hi": "ऐमबर",
"B_en": "Rajasthan", "B_hi": "राजस्थान",
"C_en": "Amber Fort", "C_hi": "ऐमबर का फोट",
"D_en": "Amber Fort", "D_hi": "ऐमबर का फोट",
"answer": "D",
"explanation_en": "Amber Fort is also known as Amer Fort and is located near Jaipur, the capital of Rajasthan. The connection between Amber Fort, Rajasthan, and Mughal Emperor Akbar can be established through the fact that Mughal Emperor Akbar visited Amber Fort during his journey to fight against Rana Pratap.",
"explanation_hi": "ऐमबर फोट भींचर का हिद्या एमबर एमबर फट",
"answer": "D",
}
]