[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which historical fort was built by Raja Man Singh of Amber?",
"question_hi": "आमरण के राजा मन सिंह ने किस इतिहासिक गैरिया की बनी।",
"A_en": "Amer Fort", "A_hi": "आमरण गैरिया",
"B_en": "Kumbalgarh Fort", "B_hi": "कुम्बलगढ़ गैरिया",
"C_en": "Mehrangarh Fort", "C_hi": "मेरंगरगढ़ गैरिया",
"D_en": "Nahargarh Fort", "D_hi": "नाहरगढ़ गैरिया",
"answer": "A",
"explanation_en": "Amer Fort was built by Raja Man Singh of Amber. It is one of the most famous forts in Rajasthan and attracts tourists from across the world.",
"explanation_hi": "आमरण गैरिया, राजा मन सिंह के बाबती है। यह राजस्थान में एक नवीन सर्वों की अप्रत्यक्तियां के में यह नेशन किया है।",
"A_en": "Amer Fort",
"A_hi": "आमरण गैरिया",
"B_en": "Kumbhalgarh Fort",
"B_hi": "कुम्बेलगढ़ गैरिया",
"C_en": "Chittorgarh Fort",
"C_hi": "चीटोरगढ़ गैरिया",
"D_en": "Nathdwara",
"D_hi": "नाथड़ा",
"answer": "B",
"explanation_en": "Kumbhalgarh Fort, built by Rana Kumbha of Mewar, is a strategically located fort and is known for its impregnable walls. It is one of the most visited forts in Rajasthan.",
"explanation_hi": "कुम्बेलगढ़ गैरिया, Rana कुम्बेह के मेवारे के बने हैंड्से गैरिया",
"question_en": "Which fort was built by Rana Kumbha of Mewar? ",
"question_hi": "राजा कुम्बेलगढ़ गैरिया के बने हैंड्से गैरिया",
"A_en": "Nathdwara",
"A_hi": "नाथड़ा",
"B_en": "Chittorgarh",
"B_hi": "चीटोरगढ़",
"C_en": "Amber",
"C_hi": "अमर",
"D_en": "Jaipur",
"D_hi": "जयपुर",
"answer": "B",
"explanation_en": "Rana Kumbha of Mewar built the famous Chittorgarh Fort. Chittorgarh Fort is known for its historical significance and strong walls.",
"explanation_hi": "राजा कुम्बेलगढ़ गैरिया, मेवारे के राजगढ़",
"question_en": "Which fort was built by Rana Kumbha of Mewar?",
"question_hi": "राजा कुम्बेलगढ़ गैरिया, मेवारे के राजगढ़",
"A_en": "Nathdwara",
"A_hi": "नाथड़ा",
"B_en": "Amber",
"B_hi": "अमर",
"C_en": "Chittorgarh",
"C_hi": "चीटोरगढ़",
"D_en": "Jaipur",
"D_hi": "जयपुर",
"answer": "B",
"explanation_en": "Rana Kumbha of Mewar built the Amber Fort, which is also known as Amer Fort. It is a popular tourist spot in Rajasthan and is famous for its medieval architecture.",
"explanation_hi": "राजा कुम्बेलगढ़, मेवारे के राजगढ़",
"question_en": "Which fort was built by Rana Kumbha of Mewar?",
"question_hi": "राजा कुमेवारे राजगढ़",
"A_en": "Amer Fort",
"A_hi": "अमेवारे अमेरे राजा",
"B_en": "Chittorgarh",
"B_hi": "चीटोरे चोरे चीटोरे चैरे चैरैरेचैरे चैरे चैरे चैरे चैरे चैरे चरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे चैरे च