[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous battle fought between the Mughals and Rathore Rajputs took place in Jodhpur?",
"question_hi": "मगही और रात्री राज्यों में निम्नलिंग के मुख्य किस घंटे पर निकलीं? ",
"A_en": "Meera Fort", "A_hi": "मेरा घंटा",
"B_en": "Rajasthani War", "B_hi": "राजस्थानी गुरु",
"C_en": "Jaisalmer Fort", "C_hi": "जयसालमेर घंटा",
"D_en": "Jodhpur Fort", "D_hi": "जोधपुर घंटा",
"answer": "D",
"explanation_en": "The famous battle fought between the Mughals and Rathore Rajputs took place on Meera Fort. ",
"explanation_hi": "मुघरों और रात्री राजनों के बैठ रजाओं के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुए गंवों के बातचरण में हुी गंवं के बातचरण में हुए गंवों के बातचरण में हुए गंवी बातचरण में हुए गंवी बातचरण में हुए गंवए गुए बातचरण",


Explanation_en: In the 15th century, the famous battle known as "Jodhpur Garh" took place between the Rathore Rajputs and Mewar Rajputs. ",ुए गंवी बातचरण में हुए गंवी",
 बातचरण में हुए गंवी बातचरण में हुए गंवी बातचरण"
Explanation_hi: 15या बातचण में हुए गंवी बातचरण",
Option_en:
{
"option": [
"बातचरण",
"option_hi": [
"बातचण",
"option_explanation_en": "The Battle of Jodhpur took place between the Rathore Rajputs and Mewar Rajputs.", "option_explanation_hi": "बातचण बातचरण",
{
"option": "Jodhpur Garh",
"option_hi": "बातचण बातचरण",
"option_explanation_en": "The battle was fought between the Rathore Rajputs and Mewar Rajputs.", "option_explanation_hi": "बातचण बातचरण"},
{
"option": "बातचण",
"option_hi": "बातचण",
"option_explanation_en": "The Battle of Jodhpur was fought between the Rathore Rajputs and Mewar Rajputs.", "option_explanation_hi": "बातचण बातचण",
]
]