[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Culture",
"question_en": "Which is the capital city of Rajasthan and what is its famous for?",
"question_hi": "राजस्थान की राजधानी है और क्या उसे जानना जरूरी होता है?",
"A_en": "Jaipur", "A_hi": "जयपुर",
"B_en": "Jodhpur", "B_hi": "जोधपुर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Bikaner", "D_hi": "बीकानेर",
"answer": "C",
"explanation_en": "Udaipur is famous for its rich cultural heritage, including the beautiful Lake Palace and City Palace museums, vibrant folk arts, and traditional Rajasthani cuisine. The city is also known for its magnificent palaces, including the Sajjangarh Fort and the Fateh Prakash Palace.",
"explanation_hi": "उदयपुर के लैक प्लेस और सिटी पॉल मूमिस, प्रभुत फलक अर्थों और तैयेंगों का नाम में किस्मान मूल, देवतितालों का नाम में किस्मान मूल, देवतितालों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में किस्मान मूल, संत अर्थों का नाम में का नाम में किस्र्थों का नाम में क्र्थों का नाम में का ं का नाम में का नाम में का नाम में का नाम में का नाम का नाम में का नाम में का नाम का नाम का नाम में का नाम का नाम का नाम का नाम",
"]
{
"subject": "Rajasthani Sahitya",
"topic": "Rajasthani Sahitya",
"question_en": "What is the famous Rajasthani Sahitya and its significance?",
"question_hi": "राजात्नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का नाम का ना