[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following places was the capital of Mewar Dynasty?",
"question_hi": "मेवार संघ के विभागीय स्थान क्या है?",
"A_en": "Amber", "A_hi": "एमबी",
"B_en": "Pushkar", "B_hi": "पुष्कर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Jodhpur", "D_hi": "जोधपुर",
"answer": "C",
"explanation_en": "Udaipur was the capital of Mewar Dynasty during the reign of Maharana Udai Singh II.",
"explanation_hi": "मेवार संघ के वर्षिका महाराणा उदायंसींग II के वर्षिका समय में Udaipur में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में Udaipur में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में Udaipur में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय में मेवार संघ के वर्षिका समय मेवार संघ के वर्षिका समय मेवार संघ के वर्षिका समय मेवार संघ के वर्षिका समय मेवार संघ के वर्षिका समय मेवार संघ के वर्षिका समय मेवार संघ के वर षिका समेवार संघ के वर षिका समय मेवार संघ के वर षिका समय मेवार संघ के वर षिका समेवार संघ के वर षिका समेवार संघ के वर षिका समय मेवार संघ के वर षिका समेवार संघ के वर षिका समेवार संघ के वर षिका समेवार संघ के वर षिका समेवार संघ के वर षिका समेवार षिका संघ के वर षिका समेवार षिका समेवार षिका संघ के वर षिका",
Note: In this question, Rajasthan's capital during the reign of Rao Jaisa Singh, Kishori, and Mansinghji ka समेवार षिका संघ के वर षिका संघ के वर षिका संघ के वर षिका संघ के वर षिका",
",
"question_en": "What was the capital of Rajasthan during the reign of Rao Jaisa Singh, Kishori, and Maharana Kishori ka संघ के वर षिका संघ के वर षिका संघ के वर षिका संघ के वर षिका",
},
"question_hi": "राशंघ के वर षिका संघ के वर षिका सं