[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jaipur?",
"question_hi": "जयपुर में कौन सा महत्त्वनाथ है?",
"A_en": "Amber Fort", "A_hi": "अमेर कंत्र",
"B_en": "Hawa Mahal", "B_hi": "हवा महाल",
"C_en": "Cenotaph of Sawai Jai Singh I", "C_hi": "सौवा जैसिंग सिंग एक नाम होंगे?",
"D_en": "Gayatri Temple", "D_hi": "गैरी मंदिर",
"answer": "Hawa Mahal",
"explanation_en": "Hawa Mahal, also known as \"Palace of Winds\", is a famous landmark in Jaipur, Rajasthan. It is a five-storied building made of pink sandstone and has been a popular tourist attraction since its construction in the early 19th century.",
"explanation_hi": "हवा महाल, \"हैवा महाल\" के नाम किसे कहा गया है? इसका नईपुर, राजस्थान में एक फ़्यात्र कहा गया है। इसका नईपुर, राजस्थान में एक फ़्यात्र किया गया है। यह नईपुर, राजस्थान में एक फ़्यात्र किया गया है।",
"answer": "B",
"explanation_en": "The Jantar Mantar in Jaipur, Rajasthan is a famous astronomical observatory built by Maharaja Jai Singh II in the 18th century. It was declared a UNESCO World Heritage Site in 1987.",
"explanation_hi": "जनता मंटर एन, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में मैं नईपुर, राजस्थान में मैं नईपुर, राजस्थान में मैं नईपुर, राजस्थान में मैं नईपुर, राजस्थान में मैं नईपुर, राजस्थान में मैं नईपुर, राजस्थान में मैं नईपुर, राजस्थान में मैं नईपुर, राजस्थान में मैं नईपुर, राजस्थान में मैं नईपुर, राजस्थान में मैं नईपुर, राजस्थान में मैं नईपुर, राजस्थान में मैं नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान मं नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान मं नईपुर, राजस्थान में नईपुर, राजस्थान में न नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में न नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान में नईपुर, राजस्थान मे