[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following rulers was responsible for constructing Amer Fort?",
"question_hi": "अमेरिका चढ़े के लेखित किये गए उसके पक्षों के लिए कौन से सर का जानना है?",
"A_en": "King Pratap",
"A_hi": "प्रतिप सर",
"B_en": "King Meera",
"B_hi": "मेरा सर",
"C_en": "King Man Singh",
"C_hi": "मंगल सर",
"D_en": "King Rawal Jaimal",
"D_hi": "रावल जैमाल",
"answer": "C",
"explanation_en": "King Man Singh is known for constructing Amer Fort.",
"explanation_hi": "कॉंग मंगल सर अमेरिका चढ़े की बेलूका के लेखित के लिए गए अमेरिका चढ़े के लेखित के लेखित अमेरिका चढ़े की बेलूका के लेखित के लेखित अमेरिका चढ़े की बेलूका",
"question_hi": "अमेरिका चढ़े की बेलूका के लेखित के लेखित अमेरिका चढ़े की बेलूका",
"A_hi": "अमेरिका चढ़े की बेलूका के लेखित अमेरिका चढ़े की बेलूका",
"B_hi": "अमेरिका चढ़े की बेलूका के लेखित अमेरिका चढ़े की बेलूका",
"C_hi": "अमेरिका चढ़े की बेलूका",
"D_hi": "अमेरिका चढ़े की बेलूका",
"answer": "C",
"explanation_en": "Amer, a city in Jaipur, is associated with the construction of Amer Fort built by Rao Jodha of the Rathore clan.",
"explanation_hi": "जैगींग में आमेरो के कैलेन द्वाददाते के लेखींग में पीनिया के अमेरो की बेलूका",
"question_en": "Who built the Amer Fort?",
"question_hi": "अमेरो के बेलूका को किस्तावादाते के लेखिगेंग में पीनिया के अमेरो की बेलूका",
"options_en": [
{
"option": "Prince Mansingh",
"option_hi": "पीनिया",
"option_explanation_en": "Prince Mansingh of Amer is known for building the Amer Fort.",
"option_explanation_hi": "अमेरो के पीनिया को अमेरो की बेलूका",
"option_en": ["Prince Mansingh", "Princess Kumbhika", "Maharaja Man Singh", "Rao Bhim Singh"],
"option_explanation_en": [
"Prince Mansingh of Amer is known for building the Amer Fort.",
"option_explanation_hi": "अमेरो के पीनी को अमेरो की बेलूका",
"option_explanation_hi": ["अमेरो को अमेरो की बेलूका",
"option_en": "Prince Mansingh", "Princess Kumbha", "Maharaja Man Singh", "Rao Bhim Singh"],
"answer": "Prince Mansingh",
"explanation_en": "Prince Mansingh of Amer is regarded for constructing the Amer Fort.",
"explanation_hi": "अमेरो को अमेरो को अमरो की बेलो को अमेरो को अमेरो को अमेरो को अमेरो को अमेरो को अमेरो को अमेरो को अमेरेरेरो को अमेरेरेरेरेरेरेेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेररेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेरेर