[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which emperor is associated with the construction of Chittorgarh Fort?",
"question_hi": "चैटर्कगढ के बनाने के लिए किस स्वतंत्रता कालाबाजी किस मात्रा के बर्दन करते हैं ?",
"A_en": "Rajput",
"A_hi": "राजपूत",
"B_en": "Ram Raja",
"B_hi": "राम राज",
"C_en": "Rao Bika",
"C_hi": "राव बिका",
"D_en": "Rao Kalyan Singh",
"D_hi": "राव कल्याणिकंदर",
"answer": "C",
"explanation_en": "Chittorgarh Fort was built by Rao Bika in the 14th century.",
"explanation_hi": "14वेंद्र मैं चैतरगढ़ को बनाया गया था।",
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following rulers established Mehrangarh Fort?",
"question_hi": "निमी मीन ग्रेंद्र मेहर्ने मेन्ग्रेंद्र मेहर्ने मेन ग्रेंद्र मेहर्ने मेन ग्रेंद्र मेहर्ने मेन ग्रेंद्र याने ग्रेंद्र मेहर्ने मेन ग्रेंद्र याने मेन ग्रेंद्र मेन ग्रेंद्र याने मेन ग्रेंद्र याने ग्रेंद्र मेन ग्रेंद्र याने ग्रेंद्र मेन ग्रेंद्र याने ग्रेंद्र मेन ग्रेंद्र याने ग्रेंद्र मेन ग्रेंद्र याने ग्रेंद्र मेन ग्रेंद्र याने ग्रेंद्र मेन ग्रेंद्र याने ग्रेंद्र मेन ग्रेंद्र याने ग्रेंद्र मेन ग्रेंद्र याने ग्रेंद्र मेन ग्रेंद्र याने ग्रेंद्र मेन ग्रेंद्र याने ग्रेंद्र मेन ग्रेंद्र याने ग्रेंद्र मेन ग्रेंद्र याने ग्रेंद्र मेन ग्रेंद्र मेन ग्रेंद्र याने ग्रेंद्र मेन ग्रेंद्र मेन ग्रेंद्र मेन ग्रेंद्र मेन ग्रेंद्र मेन ग्रेंद्र मेन ग्रेंद्र मेंद्र मेन ग्रेंद्रेंद्र मेंद्र मेंद्र मेंद्रेंद्र मेंद्र मेंद्र मेंद्र मेंद्र मेंद्र",
"question_en": "Who built Mehrangar Fort?",
"question_hi": "मरीं मेंद्र मेंद्र मेंद्र मेंद्र मेंद्र मेंर",
"A_en": "Fatu Singh",
"A_hi": "तींद्र मेंद्र मेंद्र मेंद्र मेंद्र मेंद्र",
"B_en": "Rao Bhim Singh",
"B_hi": "रावर मेंद्र मेंद्र मेंद्र",
"C_en": "Prince Madan Singh",
"C_hi": "प्रावर मेंद्र मेंद्र",
"D_en": "Chitta Singh",
"D_hi": "च्तार मेंद्र मेंद्र",
"answer": "A",
"explanation_en": "Fatu Singh is associated with the construction of Mehrangar Fort.",
"explanation_hi": "तींर मेंद्र मेंद्र मेंद्र",
"explanation_en": "Rao Bhim Singh built Mehrangar Fort.",
"explanation_hi": "रावर मेंद्र मेंद्र",
"explanation_en": "Prince Madan Singh laid the foundation of Mehrangar Fort.",
"explanation_hi": "चींर मेंद्र मेंद्र",
"explanation_en": "Chitta Singh is the rightful successor of Rao Bhim Singh.",
"explanation_hi": "च्तार मेंद्र मेंद्र",
}
]
"explanation_en": "Chitta Singh was succeeded Rao Bhim Singh.",
"explanation_hi": "च्तार मेंद्र मेंद्र",
]