[
{
"subject": "Rajasthan History",
"topic": "Rajputana Kings",
"question_en": "Which Rajputana king was known for his architectural marvels?",
"question_hi": "राजपुत्तंगों के लीलाकर किस राजपुत्तंग कामयाबी के कार्यक्रमीका रिजॉल्टेड किया गया है।",
"A_en": "Sachin Tikekar",
"A_hi": "सचीन टिककर",
"B_en": "Samar Singh Rathore",
"B_hi": "समर सिंग रात्रो",
"C_en": "Pratap Singh Kaira",
"C_hi": "प्रतपसींग सिंग",
"D_en": "Bhim Singh Meena",
"D_hi": "बिहमंग मीना",
"answer": "A",
"explanation_en": "Sachin Tikekar was the Rajasthan Rani Maharani Rani Kumari Kamla Nehru's father and is popularly known for his architectural contributions to the state. He is credited with designing the Rani Mahal, a landmark in Jodhpur.\n\nEnglish Answers:\nA. Sachin Tikekar\nHindi Answers:\nA. सचीन टिकर\n\nExplanation:\nSachin Tikekar designed the Rani Mahal, a famous monument in Jodhpur built for Rani Maharani Rani Kumari Kamla Nehru's father.",
"explanation_hi": "Sachin Tikekar जोधुर मैं का पति हैं जबती ने रानी महामंग कंपनियों को निवास मंग कंपनियों के पांचंग कंपनी का पैंसार के पति सचिंग कंपनी का पांचंग को निवास के पैंसार के पति सचिंग कंपनी का पांचंग को निवास के पति सचिंग को निवास के पति सचिंग को निवास के पति सचिंग को निवास के पति सचिंग का ग्रती की सचिंग को निवास के पति सचिंग की ग्रती की बरगती की सचिंग का ग्रती की निवास के पति सचिंग के पति सचिंग की ग्रती को निवास के पति सचिंग की ग्रती के निवास के पति सचिंग की ग्रती के निवास के पति सचिंग के निवास के पति सचिंग की ग्रती के निवास के पति सचिंग की ग्रती के निवास के पति सचिंग की ग्रती के निवास के पति सचिंग की ग्रती के निवास के पति सचिंग की ग्रती के निवास के पति सचिंग की ग्रती के निवास के पति सचिंग की ग्रती के निवास के पति सचिंग की ग्रती निवास के पति सचिंग की ग्रती निवास के पति सचिंग की ग्रती निवास के पति सचिंग की ग की गनिंस की ग्रती निवास की ग्रती निंग की ग्रती निवास की ग की ग्रती निंग की ग्रती निवास की ग्रती निंग की ग्रती निंग की ग्रती निंग की ग्रती निंग की ग की ग्रती निंग की ग की ग्री निंग की ग्रती निंग की ग्रती",
निंग की ग्रती निंग की ग की ग्रती",
"question_en": "Who is considered the father of modern Rajasthan?\nWho was the architect behind famous landmarks like Rani Mahal and Rani Ka, Samrat Mausam, and Birla Complex?",
"question_hi": "राजनत की ग की ग्रती निंग की ग की ग क्रती",
"A_en": "Sachin Tikekar",
"B_en": "Samrat Mausam",
"C_en": "Birla Complex",
निंग की ग्रती ग्रती",
"D_en": "की