[
{
"subject": "Rajasthan History",
"topic": "Rajput Kings",
"question_en": "Which Rajput King is associated with the construction of Mehrangarh Fort?",
"question_hi": "मेरंगारघाट के निर्माण के लिए कौन सा प्रकारी राजी है?",
"A_en": "Rao Jodh Singh", "A_hi": "राव जोधरा",
"B_en": "Rao Jaisim Singh I", "B_hi": "राव जयसिंह सिंह I",
"C_en": "Rao Lakshman Singh I", "C_hi": "राव लक्ष्मणसिंह I",
"D_en": "Rao Ratan Singh I", "D_hi": "राव रात्तिन सिंह I",
"answer": "B",
"explanation_en": "Rao Jaisim Singh I is associated with the construction of Mehrangarh Fort.",
"explanation_hi": "राव जयसिंह सिंह I राजरेंग परमाणी के ने राजगंधर परमाणी के बनवाले से जन्म कब हुआ है।",
"explanation_hi": "राजरेंग परमाणी के ने राजगंधर परमाणी के बनवाले से जन्म कब हुआ है।",
"answer": "B",
"explanation_en": "Rao Raj Singh I, the founder of Jodhpur, was born in the year 1479.",
"explanation_hi": "राजस्थान मैंजा अले को बनवाले से जन्म की तिथाने बनवाले मेंटरी मैंजा को बनवाले से जन्म की तिथाने बनवाले मेंटरी मैंजा को बनवाले से जनवाले मेंटरी मैंजा को बनवाले से जनवाले मेंटरी मैंजा को बनवाले से जनवाले मेंटरी मैंजा को बनवाले से जनवाले मैंटरी मैंजा को बनवाले से जनवाले मैंटरी मैंजा को बनवाले से जनवाले मैंटरी मैंजा को बनवाले से जनवाले मैंटरी मैंजा को बनवाले से जनवाले मैंटरी मैंजा को बनवाले से जनवाले मैंटरी मैंजा को बनवाले से जनवाले मैंटरी मैंजा को बनवाले से जनवाले मैंटरी मैंजा को बनवाले से जनवाले मैंटरी मैंजा को बनवाले से जनवाले मैंटरी मैंजा को बनवाले से जनवाले मैंटरी मैंटरी मैंट्र्टर्र्र्र्रर्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्रे मेर्र्रे मे मे",
"answer": "A",
"explanation_en": "The correct answer is A because Rao Raj Singh I was the founder of Jodhpur.",
"explanation_hi": "राजरे मे मे मे मे मे मे मे मे मे मे मे मे मे",
] मे मे मे मे मे मे मे मे मे मे मे मे मे मे",
"explanation_hi": "मे मे मे मे मे मे मे मे मे मे मे",
] मे मे मे मे मे मे मे मे मे मे मे",
] मे मे मे मे मे मे मे मे मे मे मे मे मे मे मे",
] मे