[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "What is the current capital of Rajasthan?",
"question_hi": "राजस्थान का मूल राजधानी क्या था?",
"A_en": "Ajmer",
"A_hi": "अजमेर",
"B_en": "Jodhpur",
"B_hi": "जोधपुर",
"C_en": "Alwar",
"C_hi": "अल्वार",
"D_en": "Udaipur",
"D_hi": "उदयपुर",
"answer": "B",
"explanation_en": "Ajmer Sahib was the capital of Rajasthan in the past. However, the current capital is Jodhpur, known as Jodhpur City in English.\nExplanation in Hindi: Ajmer Sahib राजस्थान का मूल राजधानी था, लेकिन वर्तमान मूल राजधानी है, जो English mein Jodhpur को जोधपुर के रूटमान मूल राजधानी थी, लेकिन वर्तमान मूल राजधानी है, जो English mein Jodhpur को जोधपुर के रूटमान मूल राजधानी थी, लेकिन वर्तमान मूल राजधानी है, जो English mein Jodhpur को जोधपुर के रूटमान मूल राजधानी थी, लेकिन वर्तमान मूल राजधानी है, जो English mein Jodhpur को जोधपुर के रूटमान मूल राजधानी थी, लेकिन वर्तमान मूल राजधानी है, जो English mein Jodhpur को जोधपुर के रूटमान मूल राजधानी थी, लेकिन वर्तमान मूल राजधानी है, जो English mein Jodhpur को जोधपुर के रूटमान मूल राजधानी थी, लेकिन वर्तमान मूल राजधानी है, जो English mein Jodhpur को जोधपुर के रूटमान मूल राजधानी थी, लेकिन वर्तमान मूल राजधानी है, जो English mein Jodhpur को जोधपुर के रूटमान मूल राजधानी थी, लेकिन वर्तमान मूल राजधानी है, जो English mein Jodhpur को जोधपुर के रूटमान मूल राजधानी थी, लेकिन वर्तमान मूल राजधानी थी, जो English mein Jodhpur को जोधपुर के रूटमान मूल राजधानी थी, लेकिन वर्तमान मूल राजधान थी।",
	
"question_hi": "राजपुर को जोधपुर को राजपुर को जोधान थी।",
"explanation_en": "The capital of Rajasthan changed over time. During the Mughal period, Jodhpur was the capital, but after that, Jaipur became the capital.\nIt was later shifted to Ajmer, and then to Alwar.",
"explanation_hi": "राजपुर को जोधान थी।को जोधान थी।को राजपुर को जोधान थी।को जोधान थी।को राजपुर को जी को जोधान थी।कौु थकौडान थीौडुरौदकौडौडाौढौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौडौड