[
{
"subject": "Rajasthan History",
"topic": "Rajasthan State Formation",
"question_en": "Which ruler played a crucial role in the formation of the Marwar region?",
"question_hi": "मर्वा के क्षेत्र को बनाने के लिए किस सन्धियां की प्रभावित हुई थी?",
"A_en": "Prithviraj Chauhan",
"A_hi": "प्रतितिप्रजन",
"B_en": "Rao Jodha",
"B_hi": "राव जोधा",
"C_en": "Abu l-Hasan Ali Khan",
"C_hi": "अभूल-हस्ता अली कहान",
"D_en": "Alauddin Khalji",
"D_hi": "अलादीन खालजी",
"answer": "B",
"explanation_en": "Rao Jodha is known for his role in the formation of the Marwar region, which later became the state of Rajasthan. He was the founder of the city of Jaipur, the capital of Rajasthan.",
"explanation_hi": "राव जोधा बंगावा में मर्वा के सामाने वाले घरचर के अर्थविविधंदी को किसी को मैं कैसे स्वामितरंग के सामाने वाले घरचर को छज्ञान दिलने वाले घरचर को तसाफरावलया सामाने वाले घरचर को तसाफरावली सामाने वाले घरचर (घरचर को तसाफरावली सामाने वाले घरचर (घरचर को तसाफरावली सामाने वाले घरचर (घरचर को तसाफरावली सामाने वाले घरचर (घरचर को तसाफरावली सामाने वाले घरचर (घरचर को तसाफरावली सामाने वाले घरचर (घरचर को तसाफरावली सामाने वाले घरचर (घरचर को तसाफरावली सामाने वाले घरचर (घरचर को तसाफरावली सामाने वाले घरचर (घरचर को तसाफरावली सामाने वाले घरचर (घरचर को तसाफरावली सामाने वाले घरचर (घरचर को तसाफरावली सामाने वाले घरचर (घरचर को तसाफरावली सामाने वाले घरचर (घरचर को तसाफरावली सामाने वाले घरचर (घरचर को तसाफरावली सामाने वाले घरचर (घरचर को तसाफरावली सामाने घरचर (घरचर को तसाफरावली सामाने घरचर (घरचर को तसाफरावली सामाने घर (घरचर को तसाफरावली सामाने घर (घरचर को तसाफरावली सामाने घर (घरचर को तसाफराी सामाने घर (घरचर को तसाफरावली सामाे घर (घरचर को तसाफराे घरचर (घरचर को तसाफराी सामाने घर (घरचर को तसाफराी सामाे घर (घरचर को तसाफराे घर (घरचर को तसाफराे घर (घरचर को तसाफराे घर (घरचर को तसाफराे घर (घरचर को तसाफराे घर (घरचर को तसाफराे घर (घरचर को तसाफराे घर (घर को तसाफराे घर (घरचर)",
को तसाफराे घर (घरचर को तसाफराे घर (घर)",
को तसाफराे घर (घरचर)",
को तसाफराे घर (घर को तसाफराे घर (घरचर)",
मंचर).",
"answer": "D",
"explanation_en": "Bikaner",
"B_hi": "बिके घर (घरचर)",
"explanation_en": "बिके घर (घरचर)",
"के घर (घर)",