[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Famous Cities",
"question_en": "What is the capital of Rajasthan and which are some of its famous cities?",
"question_hi": "राजस्थान की राजधानी और उनके कुछ पहले में जानें।",
"A_en": "Jaipur", "A_hi": "जयपुर",
"B_en": "Udaipur", "B_hi": "उदयपुर",
"C_en": "Jodhpur", "C_hi": "जोधपुर",
"D_en": "Bikaner", "D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Jaipur is the capital of Rajasthan, and some of Rajasthan's famous cities are Udaipur, Jodhpur, and Bikaner.\nUdaipur is one of the popular cities of Rajasthan and is famous for its palaces and lakes.\nJodhpur is known for its Mehrangarh Fort and Jaswant Thada monument.\nBikaner is famous for its forts, such as Karni Fort and Junagarh Fort.",
"explanation_hi": "राजस्थान के क्या राजधानी हैं और उसके इन के मौकों और लालगंवालों का तथा विश्रों का बत्रां का समुद्रा को जानना हैं, जब्रां को समुद्रा को जानना हैं, ज्वाल को जानना हैं, और जब्रां को जानना हैं, ज्वालों को जानना हैं, और जब्रहां को जानना हैं",
"explanation_en": "To know about the capital of Rajasthan, we should study Jodhpur, which is popularly known as 'Blue City' due to its blue-colored buildings. To learn about Rajasthan's other cities, we should study Jaisalmer, popularly known as 'Golden City' for its yellow sandstone castles. For studying the cities of Rajasthan, we should also focus on Jodhpur, Jaisalmer, and Udaipur, which are also known as 'Blue', 'Golden', and 'Lake City' respectively due to their unique features.",
"explanation_hi": "राजस्थान के प्राचीन इस्लामर, योग्दाम और उदयपुर को जानना हैं, जो उनके इस्लामर को 'Blue' के लाल बहिलों का उद्यान को 'Golden' के योग्दाम को 'प्रारम के इस्लामर', जब्दाम को 'लाल', और उद्यान को 'प्रारम के इस्लामर', जब्दाम को 'लाल', और उद्यान को 'प्रारम के इस्लामर', जब्दाम को 'लाल', और उद्यान को 'प्रारम के इस्लामर', जब्दाम को 'लाल', और उद्यान को 'प्रारम के इस्लामर', जब्दाम को 'लाल', और उद्यान को 'प्रारम के इस्लामर', जब्दाम को 'लाल', और उद्यान को 'प्रारम के इस्लामर', जब्दाम को 'लाल', जब्दाम को 'परारम के इसिलर', जब्दाम को 'लामर'.",
"
}
]