[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built by Raja Man Singh of Amber?",
"question_hi": "राजस्थान में राजा मन सिंह के एम्बर से बनाया गया किस मौलियां का नाम है।",
"A_en": "Amber Fort", "A_hi": "एम्बर फोट",
"B_en": "Kumbhalgarh Fort", "B_hi": "कुम्भलगाँड फोट",
"C_en": "Meena Bazar", "C_hi": "मेना बाजार",
"D_en": "Laxmi Niwas Palace", "D_hi": "लाक्षिणी निवास कंधना",
"answer": "B",
"explanation_en": "Amber Fort was built by Raja Man Singh of Amer, while Kumbhalgarh Fort is associated with the Rana Kumbha of Mewar.",
"explanation_hi": "एम्बर फोट राजा मैंसी एम ने बनाया है, पर कुम्भलगार फोट राणा कुम्ब के लेने वाले लैंगा मुखियों में संबंधे हैंगां के लेने वाले मंगों में संबंधे हैंगां",
"A_en": "Amber Fort",
"A_hi": "एम्बर फोट",
"B_en": "Kumbhalgarh Fort",
"B_hi": "कुम्भलगार फोट",
"C_en": "Meena Bazaar",
"C_hi": "मेना बाजार",
"D_en": "Gola Temple",
"D_hi": "गोला मेल्बेट",
"answer": "B",
"explanation_en": "Kumbhalgarh Fort, also known as the 'untouchable fort', was built by Rana Ahilya Bai of Bundi and is connected with the Meena Bazar (Meena Bazaar) in Marwar region.",
"explanation_hi": "कुम्भलगार फोट, मैना बाजार (मेना बाजार) को मेंटोब्लगार फोट को संबंध करते हैंगार फोट को संबंध करने वाले एहीना बाजार (दुशाल बाजार) को मेंटोब्लगार फोट को संबंध करते हैंगार फोट को संबंध करते हैंगार फोट",
"answer": "B",
"explanation_en": "Kumbhalgarh Fort was connected to the Hisargarh Fort by Rana Ahilya Bai of Bundi, while Meena Bazar (हीसाल बाजार) is mentioned as a market in Marwar region.",
"explanation_hi": "कुम्भलगार फोट को बुंडी के राणा भाई ने संबंध करवाल, बुंडी के राणा भाई के संबंध करवाल, Meena Bazar (हीसाल बाजार) एक मैलान के बुंडी के राणा भाई ने संबंध करवाल, बुंडी राणा भाई ने संबंध करवाल, Meena Bazar (हीसाल बाजार)",
"answer": "B",
"explanation_en": "Kumbhalgarh Fort was built by Rana Ahilya Bai of Bundi, while Meena Bazar (हिसाल बाजार) is a market located in Marwar region.",
"explanation_hi": "कुमखल बाजार एकहल बाजार एकहल बाजार",
}
]