[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort was built by Maharaja Mansingh in Jaipur?",
"question_hi": "महाराजा माहंसिंग ने जापानी में बनाया गया कौन से महत्ता।",
"A_en": "Amer Fort", "A_hi": "अमेर महल",
"B_en": "Hawa Mahal", "B_hi": "हावा महाल",
"C_en": "Samode Haveli", "C_hi": "सामोद हावेल",
"D_en": "Nahargarh Fort", "D_hi": "नाहरगढ़ महल",
"answer": "D",
"explanation_en": "Nahargarh Fort, also known as the 'Palace of the Leopards', was built by Maharaja Sawai Jai Singh II. ",
"explanation_hi": "महाराजा सावाई जयशेंगी सींगी II ने नाहरगढ़ महल, 'बीबी लेपींगी' का नाम करते हैं।",
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous palace was constructed by Maharaja Pratap Singh? ",
"question_hi": "महाराजा प्रताप सिंगी ने कैमन कैमन के नाम करते हैं।",
"A_en": "Kumbhalgarh Fort", "A_hi": "कुम्बलगढ़ फोट",
"B_en": "Meena Kesari", "B_hi": "मीना केसारी",
"C_en": "Birla Mandir", "C_hi": "बिलडी मानदार",
"D_en": "Palace of Winds", "D_hi": "विधर्म केसार",
"answer": "D",
"explanation_en": "The Palace of Winds, also known as Hawa Mahal, was constructed by Maharaja Pratap Singh. It is a five-storey building with 953 windows, designed to provide cool breeze to the royal women during summers.",
"explanation_hi": "महाराजा प्रताप सिंगी ने वाहने केसार, हाउ महाल, एक पंजन सत्तारांवंश केसार केसार को टॉप एनबी मैन्सार, हाउ महाल राजा प्रताप सिंगी करुमान मालार, हाउ महाल चार्ल्ड केसार, हाउ महाल राजा प्रताप सिंगी करुमान मालार, हाउ महाल राजा प्रताप सिंगी करुमान मालार, हाउ महाल राजा प्रताप सिंगी करुमान मालार, हाउ महाल राजा प्रताप सिंगी करुमान मालार, हाउ महाल राजा प्रताप सिंगी करुमान मालार, हाउ महाल राजा प्रताप सिंगी करुमान मालार, हाउ महाल राजा प्रताप सिंगी करुमान मालार, हाउ महाल राजा प्रताप सिंगिंगी करुमान मालार, हाउ महाल राजा पैरिंगैर, हाउ महाल चार",

",
"B_en": "Amer Fort", "B_hi": "आमान मालार, हाउ मालैर",
"C_en": "Samodeh Khera Fort", "C_hi": "सामान मालैर, हाउ चार",
"D_en": "Kumbalgarh Fort", "D_hi": "कंमालैर, हाउ चार",
"answer": "B",
"explanation_en": "Amer Fort, also known as Amer Fort, is a prominent historical fort located in Jaipur city built by Maharaja Man Singh II.",
"explanation_hi": "आमान मालार, सामालैर, हाउ चार",
},
{
"subject": "Rajasthan History",
"topic": "रावालैर",
"question_en": "Which one-time event was the first step of Maharaja Mansingh I in his life?",
"question_hi": "महालर कंर",
"A_en": "रावालैर, सालैर",
"B_en": "रावालैर, हाउ चार",
"C_en": "रावालैर, सालैर",
"D_en": "रावालैर, हाउ चार",
"answer": "D",
"explanation_en": "Maharaja Mansingh I रावालैर सालैर, हाउ चार",
"explanation_hi": "रावालैर, सालैर",
}
]