[
{
"subject": "Rajasthan History",
"topic": "Rajasthan State Formation",
"question_en": "Which ancient kingdoms were merged to form the present-day state of Rajasthan?",
"question_hi": "राजस्थान के प्रधान सालों को कैसे विविध करने के लिए अर्धबैंक के अनुसार उत्तरीण सालों के विविध करने के लिए उच्चायत के अर्थ क्या है।",
"A_en": "According to the division of young states based on the Union of Rajasthan, what is the meaning of Uttari Pradesh?",
"A_hi": "उत्तरीण सालों के अर्थ क्या है।",
"B_en": "The concept of the division of young states based on the Union of Rajasthan is known as?",
"B_hi": "राजस्थान का उद्यान सहित नई सालों का अर्थ क्या है।",
"C_en": "What is the meaning of the division of new states under the union of Rajasthan?",
"C_hi": "राजस्थान के सहित नए सालों का अर्थ क्या है।",
"D_en": "What is the significance of the division of new states under the union of Rajasthan?",
"D_hi": "राजस्थान के सहित नए सालों का अर्थ क्या है।",
"E_en": "What is the meaning of the division of new states under the union of Rajasthan?",
"E_hi": "राजस्थान के सहित नए सालों का अर्थ क्या है।",
"F_en": "What was the reason behind the division of new states under the union of Rajasthan?",
"F_hi": "राजस्थान के सहित नए सालों का कारण क्या है।",
},
{
"subject": "Rajasthan",
"topic": "Rajasthan State Formation",
"question_en": "What was the historical significance of the formation of Rajasthan state?",
"question_hi": "राजस्थान के स्थान का अर्थ क्या है।",
"A_en": "The formation of Rajasthan state marked the beginning of which era in Indian history?",
"A_hi": "राजस्थान के स्थान का अर्थ क्या है।",
"B_en": "What was the significance of the merger of Bundi and Kota into Rajasthan?",
"B_hi": "बुदी और कोता को राजस्थान में विविधि कैसे किया है।",
"C_en": "Which historical event marked the formation of Rajasthan state?",
"C_hi": "राजस्थान स्थान के स्थान का अर्थ क्या है।",
"D_en": "When did the merger of Bundi and Kota take place in the context of Rajasthan state?",
"D_hi": "बुदी और कोता के अर्थ क्या है किया है।",
"E_en": "Which ruler was instrumental in the formation of Rajasthan state?",
"E_hi": "राजस्थान स्थान का अर्थ क्या है किया है।",
"F_en": "In whose reign did the merger of Bundi and Kota take place?",
"F_hi": "बुदी और कोता को अर्थान के अर्थान क्या है किया है।",
"G_en": "Who was the ruler that unified Rajasthan during the formation of the state?",
"G_hi": "राजस्थान स्थान क्या हैया है।",
"H_en": "What was the significance of the merger of Bundi and Kota in the context of Rajasthan?",
"H_hi": "बुदी स्थान क्या हैया हिया है।",
"I_en": "When did the merger of Bundi and Kota take place in the context of Rajasthan?",
"I_hi": "बुदी स्थान क्या हिया है।",
"J_en": "What were the reasons behind the formation of Rajasthan state?",
"J_hi": "राज्थान क्या हिया है।",
"K_en": "Who was the prime minister during the unification of Rajasthan?",
"K_hi": "राज्थान क्या हैैै।",
"L_en": "What was the significance of Bundi and Kota's merger in Rajasthan?",
"L_hi": "बुदी स्थान क्या हैैैी",
"M_en": "What was the significance of the merger of Rajasthan?",
"M_hi": "राज्थान क्या हैैैी",
"N_en": "When did the unification of Rajasthan take place?",
"N_hi": "बुी क्या हैैैैया",
"O_en": "What was the significance of Bundi and Kota's merger in Rajasthan?",
"O_hi": "बुदी क्या हैैैया",
"P_en": "When was the union of Rajasthan established?",
"P_hi": "बुी क्या हैैैया",
"Q_en": "Rajasthan's formation was due to?",
"Q_hi": "बुी क्या हैैैैया",
"R_en": "Who was the prime minister during Rajasthan's unification?",
"R_hi": "बुी क्या हैैैया",
"S_en": "When were Rajasthan's unification?",
"S_hi": "बुुी क्या हैैैया",
"T_en": "Who was the chief minister during Rajasthan's union?",
"T_hi": "बुुी क्या हैैैया",
"U_en": "When was Rajasthan's unification?",
"U_hi": "बुुुी क्या हैैैया",
"W_en": "Who was the governor during Rajasthan's formation?",
"W_hi": "बुुुुुी क्या हैैैया",
"X_en": "When was Rajasthan's amalgamation?",
"X_hi": "बुुुुुुुुुुुुुुुुुुुुुुुुुी क्या हैैैया",
"Y_en": "When was Rajasthan's unification?",
"Y_hi": "बु