[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous palace in Jaipur was built by Maharaja Sawai Jai Singh II?",
"question_hi": "जयपुर महाराजवादी सौवा जय श्रीनिवास एसियंग II ने कौन से उच्च स्थानीय पलक़िता बनाई गई है।",
"A_en": "Amer Fort",
"A_hi": "अमेर कंधर",
"B_en": "Hawa Mahal",
"B_hi": "वाहन महाल",
"C_en": "Cenotaph of Maharaja Sawai Man Singh II",
"C_hi": "महाराजवादी सौवा महाराजवादी सौवा महाराजवादी सौवा महाराजवादी सौवा महाराजवादी सौवा महाराजवादी सौवा महाराजवादी सौवा महाराजवादी सौवा महाराजवादी सौवा महाराजवादी सौवा महाराजवादी सौवा महाराजवादी सौवा महाराजवादी सौवा महाराजवादी सौवा महाराजवा सौवा महाराजवा सौवा महाराजवादी सौवा महाराजवादी",
"B_hi": "आमंत्रण",
"C_en": "Civil Services",
"C_hi": "सरकारीय सेवा",
"D_en": "State Services",
"D_hi": "राज्य सचिव सेवा",
"answer": "B",
"explanation_en": "The term \"आमंत्रण\" refers to the recruitment process for various government jobs in Rajasthan, including Civil Services, State Services, and other administrative positions.",
"explanation_hi": "आमंत्रण को राजदारांने राज्य मंत्रितने के नवाई, राज्य सेवा, और अन्य आर्थीय कर्मयों और अन्य अधिकार कितने के नवाई, राज्य सेवा, और अन्य आर्थीय कर्मों और अन्य अधिकारों के नवाई, राज्य सेवा, और अन्य आर्थीय कर्मों और अन्य अधिकारों के नवाई",
"answer": "B",
"explanation_en": "The term \"आमंत्रण\" refers to recruitment for various government jobs and administrative positions in Rajasthan, including LDC, CET, RAS, and other civil services and administrative positions.",
"explanation_hi": "आमंत्रण को राजदारां और अधिकार के नवाई, LDC, CET, RAS, और अन्य सेवाएं और अधिकारों के नवाई",
"question_en": "Welcomes you to the world of recruitment in Rajasthan for various government jobs and administrative positions.",
"question_hi": "राजदारां और अधिकारएं के नवाई मशिल्टएं मशिल्टएं",
"options": [
{
"option_en": [
{
"option_en": "राजदारां और अधिकार्टएं",
{
"option_hi": "राजदारां और अधिकार्टएं",
{
"option_en": "राजदारां और अधिकार्टएं",
{
"option_hi": "राजदारां और अधिकार्टएं",
{
"option_en": "राजदारां और अधिकार्टएं",
{
"option_hi": "राजदारां और अधिकार्टएं"
"answer": "B",
"explanation_en": "राजदारां और अधिकार्टएं",
"explanation_hi": "राजदारां और अधिकार्टएं",
{
"answer": "राजदारां और अधिकार्टएं",
"explanation_en": "राजदारां और अधिकार्टएं",
"explanation_hi": "राजदारां और अधिकार्टएं राजदारां और अधिकार्टएं",
]
}