[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous palace in Jaipur is also known as the Pink Palace?",
"question_hi": "जयपुर में पंकिंग पालीस क्या नाम देते हुए भी जानकारी के लिए जानकारी क्या होती है ?",
"A_en": "Hawa Mahal", "A_hi": "हवा महाल",
"B_en": "Amer Fort", "B_hi": "अमेर फोट",
"C_en": "Cenotaphs of Jaipur", "C_hi": "जयपुर की मोटर",
"D_en": "Palace of Winds", "D_hi": "वाहनों का घर",
"answer": "D",
"explanation_en": "The Palace of Winds, also known as Hawa Mahal, is a famous palace in Jaipur that is renowned for its unique architectural design. Its name is derived from the intricate latticed windows that allow cool air to flow through the palace.",
"explanation_hi": "राजस्थान की जाती जानकारी को क्या नाम देते हैं ?\n\nजानकारी, अल्लासंग को प्रवर्ती देते हैं ?\n\nजानकारी को देते हैं ?\n\nजानकारी को प्रवर्ती देते हैं ?",
"answer_en": "Palace of Winds",
"answer_hi": "पालें का संग",
"answer_ar": "قصر الرياح",
"explanation_en": "Palace of Winds, also known as Hawa Mahal, is a famous landmark in Jaipur. Built in the 18th century by Maharaja Sawai Pratap Singh, it is a five-storied building with 953 windows, providing a unique architectural design. The palace is named after the 'Anup Mahal', a palace of winds, which was a part of the palace complex.",
"explanation_hi": "पालें का संग, Hawa Mahal को प्रतिमान सोवाल का नाम क्यां नाम देते हैं ?",
"answer_hi": "पालें का संग",
"answer_ar": "قصر الرياح",
"explanation_ar": "قصر الرياح, المعروف أيضاً بقصر الرياح، هو معلم بارز في جايبور. بُني في القرن الثامن عشر بواسطة ماهاراجا سوائي بريتام سينغ، وهو بناء من خمسة طوابق يحتوي على 953 نافذة، مما يوفر تصميم معماري فريد. القصر يحمل اسم 'पालें का संग' (ऐपीएन को एक देते हैं ?",
"answer_hi": "पालें का संग",
"answer_ar": "قصر الرياح",
"explanation_ar": "قصر الرياح، المعروف أيضًا بـ 'قصر الرياح', هو معلم بارز في جايبور. تم بناءه في القرن الثامن عشر بواسطة ماهاراجا سوائي بريتام سينغ، وهو بناء من خمسة طوابق يحتوي على 953 نافذة، مما يوفر تصميم معماري فريد. القصر يحمل اسم 'ऐपीएन' (ऐपीएन को एक देते हैं ?",
"explanation_hi": "ऐपीएन",
"answer_hi": "ऐपीएन",
"answer_ar": "أبواب الجنة",
}
]