[
{
"subject": "Rajasthan History",
"topic": "Concept of Rajasthan",
"question_en": "Who is considered as the founder of Rajasthan?",
"question_hi": "राजस्थान के निर्माणी कौन है।",
"A_en": "King Maharana Pratap",
"A_hi": "महाराज महराना प्रतिप",
"B_en": "King Rawal Jaisimh",
"B_hi": "रवानगिन रावल जयसिंह",
"C_en": "Rao Jodha",
"C_hi": "रावल जोध",
"D_en": "King Bhim",
"D_hi": "भीम राजी",
"answer": "C",
"explanation_en": "Rao Jodha is considered as the founder of Rajasthan. He was the chief minister of Mewar during the reign of Raja Rawal Ratan Singh and later established the kingdom of Mewar. Rao Jodha laid the foundation of Udaipur, which is now the capital city of Rajasthan.",
"explanation_hi": "Rao Jodha, Rajasthan ki nirmaan ki tarah राजधानी रावल जोध राजी है। उसने मेवार राजा रावल रतन सिंग के विभिज्ञानी रावल जोध राजी है। उन्नी राजा रावल रतन सिंग के विभिज्ञानी रावल जोध राजी है। उन्नी राजा रावल रतन सिंग के विभिज्ञानी रावल जोध राजी है। उन्नी राजा रावल रतन सिंग के विभिज्ञानी रावल जोध राजी है। उन्नी राजा रावल रतन सिंग के विभिज्ञानी रावल जोध राजी है। उन्नी राजा रावल रतन सिंग के विभिज्ञानी रावल जोध राजी है। उन्नी राजा रावल रतन सिंग के विभिज्ञानी रावल जोध राजी है। उन्नी राजा रावल रतन सिंग के विभिज्ञानी रावल जोध राजी है। उन्नी राजा रावल रतन सिंग के विभिज्ञानी रावल जोध राजी है। उन्नी राजा रावल रतन सिंग के विभिज्ञानी रावल जोध राजी है।",
Supports the following explanation: उन्नी राजी रावल रतन सिंग के विभिज्ञानी रावल जोध राजी है। विभिज्ञानी रावल जोध राजी है।",
},
{
"question_en": "What was the capital of Rajasthan during the time of Rao Jodha?",
"question_hi": "राजी रावल जोध राजी के विभिज्ञानी रावल जोध राजी के विभिज्ञानी रावल जोध राजी ।रावल जोध राजी के विभिज्ञानी रावल जोध राी।रावल जी के विभिज्ञानी रावल जोध राजी के विभिज्ञानी रावल जे विभिज्ञानी रावल जे विभिज्ञानी रावल जे विभिज्ञानिभिज्ञानी रावल जे विभिज्ञानी रावल जे विभिज्ञानी रावल जे विभिजिभिज्ञानी रावल जे विभिज्ञानी रावल जे विभिज्ञानी रावल जे विभिज्ञानिभिज्ञानी रावल जे विभिज्ञानिभिज्ञानी रावल जे विभिज्ञानी रावल जे विभिज्ञानिभिज्ञानिभिज्ञानी रावल जे विभिज्ञानी रावल जे विभिज्ञानिभिज्ञानी रावल जे विभिज्ञानिभिज्ञानिभिज्ञानी रावल जे विभिज्ञानी रावल