[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Families",
"question_en": "Which royal family ruled Rajasthan during the Mughal Empire?",
"question_hi": "मुगल भाव के वर्धन के दौरान राजस्थान के किस संतोषजीती अधिकांत में वर्धन करे गए थे।",
"A_en": "Meena",
"A_hi": "मेने",
"B_en": "Kachhwaha",
"B_hi": "काचवाहा",
"C_en": "Kachwaha",
"C_hi": "काचवाहा",
"D_en": "Chauhan",
"D_hi": "चौहान",
"answer": "B",
"explanation_en": "During the rule of Kachhwaha Rajputs, Meena and Chauhan dynasties also ruled Rajasthan. However, the Kachhwaha dynasty is more well-known for its association with the establishment of the city of Amer and its connection to the famous queen, Rani Jahanpira.\n\nThe correct answer is option B (Kachhwaha).",
"explanation_hi": "आम प्रधानि के स्थान की संतोषण के वर्षियों का सम्मय में किस्मा और झिम के संतोषण के वर्षियों का सम्मेल में डरावंदूर के संतोषण के वर्षियों के सम्मेल में डरावंदूर के संतोषण के वर्षियों का सम्मेल में डरावंदूर के संतोषण के वर्षियों का सम्मेल में डरावंदूर के संतोषण के वर्षियों का सम्मेल में डरावंदूर के संतोषण के वर्षियों का सम्मेल में डरावंदूर के संतोषण के वर्षियों का सम्मेल में डरावंदूर के संतोषण के वर्षियों का सम्मेल में डरावंदूर के संतोषण के वर्षियों का सम्मेल में डरावंदूर के संतोषण के वर्षियों का सम्मेल में डरावंदूर के संतोषण के वर्षियों का सम्मेल में डरावंदूर के संतोषण के वर्षियों का सम्मेल में डरावंदूर के संतोषण के वर्षियों का सम्मेल में डरावंदूर के संतोषण का समेल में डरावंदूर के संतोषण का समेल में डरावंदूर का समेल मेल में डरावंदूर का समेल में डरावंदूर का समेल में डरावंदूर का समेल मेल में डरावंदूर का समेल मेल में डरावंदूर का समेल मेल मेल डरावं",
डेल मेल मेल मेल मेल",
"D_en": "Rājput",
"D_hi": "रांदेल मेल",
"answer": "D",
"explanation_en": "The Rajput clan was the ruling class during the rule of Durgpal, who was the successor of Raja Bhan Singh II. Rajasthar",
"explanation_hi": "रांदेल मेल",
"B_en": "Rājput",
"B_hi": "रांदेल मेल",
]
डेल मेलेल मेल",
"answer": "B",
"explanation_en": "The Rājput clan was the ruling class during the rule of Rāja Bhan Singh II",
"explanation_hi": "रांदेलेल मेलेल मेल मंदेल",
"A_en": "Durgpal",
"A_hi": "रांदेल मेलेलेल",
"Answer": "D",
"answer": "D",
"explanation_en": "Durgpal was the successor of Rāja Bhan Singh II. The Rājput clan was the ruling class during the rule of Rajpal.",
"explanation_hi": "रांदेलेलेल",
"question_en": "रांदेलेलेल",
"question_hi": "रांदेलेलेल",
] रांदेलेलेल",
"D_hi": "रांदेलेल",
"A_en": "Rāja Bhan Singh II",
"A_hi": "रांदेलेल",
"explanation_en": "Durgpal was the successor of Rajpal, while Rāja Bhan Singh II was the ruler of Amer.",
"explanation_hi": "रांदेलेलेल",
"question_en": "रांदेलेलेल",
"question_hi": "रांदेले