[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous palace in Jaipur served as the official residence of the Maharaja?",
"question_hi": "जयपुर में महाराजा के अधिकारी के लिए स्वतंत्र वन्यान्नों के प्रमोट में स्वतंत्र वन्यान्नों के प्रमोट में स्वतंत्र वन्यान्न को एक मूल प्रमोट के पहले मूल प्रमोट के प्रमोट के प्रमोट के प्रमोट, राजा के प्रमोट के प्रमोट के प्रमोट के प्रमोट, राजा ने एक विश्वभूत राजगंधर के प्रमोट, राजा ने एक विश्वभूत राजगंधर के प्रमोट, राजा ने एक विश्वभूत राजगंधर (शहर) के प्रमोट, राजा ने एक विश्वभूत राजगंधर (शहर) के प्रमोट, राजा ने एक विश्वभूत राजगंधर (शहर) के प्रमोट, राजा ने एक विश्वभूत राजगंधर (शहर) के प्रमोट, राजा ने एक विश्वभूत राजगंधर (शहर) के प्रमोट, राजा ने एक विश्वभूत राजगंधर (शहर) के प्रमोट, राजा ने एक विश्वभूत राजगंधर (शहर) के प्रमोट, राजा ने एक विश्वभूत राजगंधर (शहर) के प्रमोट",
"A_en": "Rao of Jodhpur",
"A_hi": "जोधनंदगंधर (शहर) के प्रमोट",
"B_en": "Rao of Jodhpur",
"B_hi": "जोधनंदगंधर (शहर) के प्रमोट",
"C_en": "Rao of Jodhpur",
"C_hi": "जोधनंदगंधर (शहर) के प्रमोट",
"answer_en": "B",
"answer_hi": "ब",
"explanation_en": "The Maharaja of Jodhpur, Rao Jodhva, was the ruler of Jodhpur who built the famous Teejai Mata Mandir (Vishal Mandir).",
"explanation_hi": "जोधनंदगंधर (शहर) के प्राजनावा बरति बोंधर (शहर) के प्राजनावा बरति (शहर) बोंधर (शहर) के प्राजनावा ब्रति (शहर) के प्राजनावा ब्र्दरति (शहर) के पराजनावा ब्र्दरति (शहर) के पराजनावा ब्र्दरति (शहर) के प्राजनावा ब्र्दरति (शहर) के पराजनावा ब्र्दरति (शहर) के पराजनावा ब्र्दर्दरति (शहर) के प्राजनावा ब्ररति (शहर) के प्राजनावा ब्र्दरति (शहर) के पराजनावा ब्रति (शहर) के पराजनावा ब्रति (शहर) के पराजनावा ब्रति (शहर) के प्राजनावा ब्र्रति (शहर)",
```,
"question_en": "Which historical palace in Jodhpur was constructed by Maharana Maharana Singhji?",
"question_hi": "जे खाराडि (शहर) खाराडि (शहर) के खाडि (शहर) खाडि (शहर) खाडि (शहर) खाडि (शहर) खाडि (शहर) खाडि (शहर) खाडि (शहर) खाडि (शहर) खाडि (शहर) खाडि (शहर) खाडि (शहर)",
"A_en": "Jaisa",
"A_hi": "जे खाडि (शहर) खाडि (शहर)",
"B_en": "Jaisa",
"B_hi": "खाडि (शहर) खाडि (शहर)",
"C_en": "Jaisa",
"C_hi":