[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built by Raja Ratan Singh of Chittor?",
"question_hi": "राजस्थान में राजा रात्नसिंग के चित्रागत शिवलम्बिया के बनाई गई थी।",
"A_en": "Amber Fort", "A_hi": "अमरी फोट",
"B_en": "Kumbhalgarh Fort", "B_hi": "कुम्भलगढ़ फोट",
"C_en": "Meena Bazaar", "C_hi": "मेना बाजार",
"D_en": "Jaipur", "D_hi": "जैपूर",
"answer": "B",
"explanation_en": "Amber Fort (also known as Kumbhalgarh Fort) was built by Raja Man Singh of Kumbhalgarh.",
"explanation_hi": "अमरी फोट (कुम्भलगढ़ फोट के बनवले गेर के पुरी के बनवले गेर के पुरी के निवारियों के पुरी के बनवले गेर के पुरी के निवारियों के पुरी के बनवले गेर के निवारियों के पुरी के बनवले गेर के निवारियों के पुरी के बनवले गेर के निवारियों के पुरी के बनवले गेर के निवारियों के पुरी के बनवले गेर के निवारियों के पुरी के बनवले गेर के निवारियों के पुरी के बनवले गेर के निवारियों के पुरी के बनवले गेर के निवारियों के पुरी के बनवले गेर",
"answer": "A",
"explanation_en": "Raja Man Singh I of Amer built the Amber Fort, which is also known as the fort of the Rajput princesses of Bani Teja.",
"explanation_hi": "आमीर के काँ एम्बी की बनी तेजा के निवारियों के बनी तेजा के बनी तेजा के निवारियों के बनी तेजा के बनीं निवारियों के बनी तेजा के बनीं निवारियों के बनी तेजा के बनीं निवारियों के बनीं तेजा के बनी निवारियों के बनी तेजा के बनी निवारियों के बनी तेजा के बनीं निवारियों के बनी तेजा के बनिवारियों के बनी तेजा के बनी तेजा के बनीं के बनीं के बनिवारियों के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनिवारियीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के बनीं के",
"answer": "A",
"explanation_en": "Raja Man Singh I of Amer built the Amer Fort, which is also known as Amer Fort or Amer Fort, is the famous fort in Rajasthan.",
"explanation_hi": "आमर सिं के बनीं के बनीं के बनीं के बनीं के बने",
"explanation": "आमरसिं के ब