[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "What is the famous citadel of Jaipur?",
"question_hi": "जयपुर के अम्बरा क्या है।",
"A_en": "Hawa Mahal",
"A_hi": "हवा महाल",
"B_en": "Amer Fort",
"B_hi": "अमेर कंधर",
"C_en": "Galta Ji Temple",
"C_hi": "गलताजी मंदिर",
"D_en": "City Palace",
"D_hi": "शहर कंधर",
"answer": "B",
"explanation_en": "Amer Fort is the famous citadel of Jaipur, Rajasthan. It is a historic fort located on the banks of the Amer River and is a popular tourist attraction.",
"explanation_hi": "जयपुर, राजस्थान के एमीर कंधर से जानकारी है, जबकि इसका निवासी हिर रेल पर होता है और इसका लोकप्रधान तथा सलीला मंदिर एमीर रेल पर होता है और इसका लोकप्रधान तथा सलीला मंदिर एमीर रेल पर होता है और इसका लोकप्रधान तथा सलीला मंदिर एमीर रेल पर होता है और इसका लोकप्रधान तथा सलीला मंदिर एमीर रेल पर होता है और इसका लोकप्रधान तथा सलीला मंदिर एमीर रेल पर होता है और इसका लोकप्रधान तथा सलीला मंदिर एमीर रेल पर होता है और इसका लोकप्रधान तथा सलीला मंदिर एमीर रेल पर होता है और इसका लोकप्रधान तथा सलीला मंदिर एमीर रेल पर होता है।",
"D_en": "इसका लोकप्रधान तथा सलीला मंदिर एमीर रेल पर होता है।",
"question_hi": "राजस्थान के राजधमनक तथा सलीला मंदिर एमीर रेल पर होता है।",
"A_hi": "राजस्थान के राजधमनक तथा सलीला मंदिर एमीर रेल पर होता है।",
"B_hi": "राजस्थान के राजधमनक तथा सलीला मंदिर एमीर रेल पर होता हेंगा",
"C_hi": "राजस्थान के राजधमनक तथा सलीला मंदिर रेल पर",
"D_hi": "राजस्थान के राजधमनक तथा सलिर रिर रेलिरे",
"answer": "B",
"explanation_en": "Amer Fort is a well-known fort located in Jaipur, Rajasthan. Amer Fort is also known as Amer Fort. It was built by Kumbha Maharaja in the 16th century. Amer Fort is a popular tourist attraction and a popular venue for Jain Yajman Kumbha maharaja ka कक तथा सलिर रे रिरिर रेलिरिरिर रिरेलिरिरिर रिरिरिरिरिरिर रिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिरिर