[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Historical Cities",
"question_en": "Which historical city is known for its unique architecture and served as the capital of Rajput kingdoms?",
"question_hi": "राजस्थान में व्याख्यान कामना करने वाली एक हिस्ट्री के विशाल संस्करण और महाभिन्न राजपूर्वजनक राजधानी"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Cities",
"question_en": "Which city served as the capital of Mewar Kingdom and is also known for its rich history and strategic location?",
"question_hi": "मेवार क्या क्षेत्र में राजपूर्व राजधानी रही थी और उसके विशाल संग्राह और अर्थांचार्मणिक में राजपूर्व राजधानी थी।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Families",
"question_en": "Which historical city served as the capital of Marwar during the reign of Rana Kumbha?",
"question_hi": "राजपुर में राने कुम्ब की समय में मर्वार की राजधानी थी।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Families",
"question_en": "Which Jat king established the city of Jaipur and laid the foundation of the Jaipur State?",
"question_hi": "जापुर के उत्तम और जापुर स्टेट को संरक्षक संत के नामे कांची समय में नौसमूला कांची राज्य को सृष्टि करने वाले कोणत समूलांचां ने मुलगड़ी लालाम स्पष्टी करणे वाले कोणत समूलांचां ने मुलगड़ी लालाम स्पष्टी करणे वाले कोणत समूलांचां ने मुलगड़ी लालाम स्पष्टी करने वाले कोणत समूलांचां ने मुलगड़ी लालाम स्पष्टी करने वाले कोणत समूलांचां ने मुलगड़ी लालाम स्पष्टी करने वाली कोणत समूलांचां ने मुलगड़ी लालाम स्पष्टी करने वाली कोणत समूलांचां ने मुलगड़ी लालाम स्पष्टी करने वाली कोणत समूलांचां ने मुलगड़ियालाम स्पष्टियालांचां ने मुलांचां ने मुलांचांचां ने मलांचांचां नै मुलांचां नै मुलांचांचांचांचां नै मुलांचांचांचांंचां नै मलांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचांचां