[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which emperor from the Maurya Dynasty was the founder of the city of Jaipur?",
"question_hi": "मौर्य संतति के एकमात्र गुरु केवल जैसे राजपुर के स्थल की बनी एकमात्र प्रतिपादक था?",
"A_en": "Chandragupta Maurya",
"A_hi": "चंद्रगुप्त मौर्य",
"B_en": "King Ashoka",
"B_hi": "किंग अशोक",
"C_en": "Sanchaita Maurya",
"C_hi": "संखिता मौर्य",
"D_en": "Ashok Vihar",
"D_hi": "अशोक विहार",
"answer": "A",
"explanation_en": "Chandragupta Maurya was the founder of the city of Jaipur. He established the city in the 4th century BCE as the capital of his kingdom during the Maurya Dynasty.\n(Note: Dinanath Bhatt is the authoritative figure who wrote about Jaipur's history, but he was not the founder of the city.)",
"explanation_hi": "चंद्रगुप्त मौर्य किस्मान तथा बहनन भात ने जैसा का विचार्मान बहनन तथा दिनान भात ने जयपुट का संतुलका का विचार्मान बहान तथा दिनान भात ने जयपुट का संतुलका का विचार्मान बहान तथा दिनान भात ने जयपुट का संतुलका का विचार्मान बहान तथा दिनान भात ने जयपुट का संतुलका का विचार्मान बहान तथा दिनान भात ने जयपुट का संतुलका का विचार्मान बहान तथा दिनान भात ने जयपुट का संतुलका का विचार्मान बहान तथा दिनान भात ने जयपुट का संतुलका का विचार्मान बहान तथा दिनान भात ने जयपुट का संतुलका का विचार्मान बहान तथा दिनान भात ने जयपुट का संतुलका का विचार्मान बहान तथा दिनान भात ने जयपुट का संतुलका का विचार्मान बहान तथा दिनान भात ने जयपुट का संतुलका का विचार्मान बहान तथा दिनान भात ने जयपुट का संतुलका का विचार्मान बहान तथा दिनान भात ने जयपुट का संतुलका ए एका विचार्मान बहान तुलका ए एका विचार्मान बहान तुलका एका विचार्मान बहान तुलका एका विचार्मान बहान तुलका एका विचार्मान बहान तुलका एका विचार्मान बहान तुलका एका विचारेलका एका विचारेलीका खका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचारेलका एका विचा