[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which emperor was responsible for building the Amber Fort?",
"question_hi": "एम्बेर को कौन उसी बनाया?",
"A_en": "Raja Man Singh", "A_hi": "राजा मन सिंह",
"B_en": "Harshavardhan", "B_hi": "हर्षवर्धन",
"C_en": "Raja Rao", "C_hi": "राजा राव",
"D_en": "Amber", "D_hi": "एम्बेर",
"answer": "A",
"explanation_en": "Raja Man Singh is the correct answer as he was the general of Mughal Emperor Jeet Singh and played a significant role in the construction of Amber Fort.",
"explanation_hi": "राजा मन सिंह सरकार मुगोल राजा जीत सिंह के अधिकांत सहायता करते हैं और एम्बेर की बंदरगढ़ को बनाया गया है।",
"explanation_hi": "राजा मन सिंह के अधिकांत सहायता करते हैं और एम्बेर को बनाया गया है।"
},
{
"subject": "Rajasthan Geography",
"topic": "",
"question_en": "Which river is the largest river in Rajasthan?",
"question_hi": "राजस्थान के सर्वाधिकांत भूमी कौन से बना गया है?",
"A_en": "Indravati",
"A_hi": "इन्द्रावती",
"B_en": "Chambal",
"B_hi": "चंबल",
"C_en": "Krishna",
"C_hi": "कृष्णा",
"D_en": "Khandsar",
"D_hi": "खंडसार",
"answer": "B",
"explanation_en": "Indravati is a river located in Madhya Pradesh, while the largest river in Rajasthan is the Chambal.",
"explanation_hi": "इन्द्रावती मध्यप्रदेश के के भंडाल महान्दीदेश के भारती महान्देश के भारती मध्यप्रदेश के भारती महान्देश के भारती मध्यप्रदेश के भारती महान्देश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मध्यप्रदेश के भारती मधी मध्यप्रदेश के भारती मध्रदे भारती मध्रदेश केभारती मध्रदेश के भारती मधी मध्रदेश केभारती मध्रे भारती मधी मध्रद्रदेश केभारती मधी मधेश केभारती मधी RAS",
}
] केभारती मधी मधेश केभारती मधी मधेश केभारती मधी RAS",
"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan Kingdas",
"question_en": "Who was the king of Rajasthan during the era of Rana Jaisa?",
"question_hi": "राजाणंसं केभारती मधी मधी RAS",
"A_en": "Rana Jaisa",
"A_hi": "राजाणं केभारती मधी RAS",
"B_en": "Jaisa",
"B_hi": "राजाणं केभारती मधी मधी RAS",
"C_en": "Rana Jaisa",
"C_hi": "राजाणं केभारती मधी मधी RAS",
"D_en": "Rana Jaisa",
"D_hi": "राजाणं केभारती मधी मधी RAS",
"answer": "A",
"explanation_en": "R