[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "What was the significance of the Battle of Haldighati?",
"question_hi": "हल्दीघर के भागे का उपयोग क्या था?",
"A_en": "The victory ensured the independence of Rajput kingdoms.",
"A_hi": "राजपूतों के संघों की सहरशानी के आधार पर मंगलवाल में हुआ था।",
"B_en": "The battle was fought to protect the kingdom from Mughal invasions.",
"B_hi": "मुगल में लड़ने के लिए राजदूत काम किया गया।",
"C_en": "The battle was fought to unite Rajput kingdoms.",
"C_hi": "राजपूतों का निवारण करने के लिए राजदूत काम किया गया गया।",
"D_en": "The battle took place to protect the kingdom from external threats.",
"D_hi": "काम करने के लिए राज्य का सामरण हुआ है।",
"answer": "C",
"explanation_en": "The Battle of Haldighat was fought to unite Rajput kingdoms and establish a strong kingdom.",
"explanation_hi": "हल्दीघर के लिए गया गया गया हुआ है।",
},
{
"subject": "Rajasthan History",
"topic": "Miniature Paintings",
"question_en": "What is the origin of miniature paintings in Rajasthan?",
"question_hi": "राजस्थान मैनी फैलों की आशा किस्तान के आलोकों के लिए गया गया हुआ है।",
"A_en": "The origin of miniature paintings is associated with the artisans of Rajasthan.",
"A_hi": "राजस्थान के आलोकों के आलोकों के लिए गया गया हुआ है।",
"B_en": "Miniature paintings originated in Rajasthan due to the influence of Mughal art.",
"B_hi": "मुगल कालेख के आलोकों के समूची आलोकों के आलोकों के लिए गया गया हुआ है।",
"C_en": "The art of miniature paintings was influenced by Mughal art.",
"C_hi": "मुगल कालेख के आलोकों के आलोकों के आलोकों के लिए गया हुआ है।",
"D_en": "Miniature paintings were introduced in Rajasthan by the Mughal rulers.",
"D_hi": "मुगल राजनों के आलोकों के आलोकों के लिए गया हुआ है।",
"E_en": "Miniature paintings were developed by Rajasthani artists.",
"E_hi": "राजस्थानी कलकरित के आलोकों के आलोकों के आलोकों के आलोकों के आलोकों के आलोकों के आलोकों के आलोकों के आलोकों के आलोकों के आलोकों की आलोकों के आलोकों के आलोकों की आलोकों के आलोकों के आलोकों की आलोकों के आलोकों के आलोकों की आलोकों के आलों कों के आलों की आलों के आलों कों की आलों के आलों के आलों कों की आलों के आलों के आलों की आले के आले के के आलों के आलों के आलों के के आले के के आले के के के आलं के के आले के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के क