[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Famous Kings",
"question_en": "Which famous king from Rajasthan was known for his military conquests?",
"question_hi": "राजस्थान के पढ़ाई पद के अधिकांवती अधिकांवती राज्य के बीच निम्नलिखित सेवाओं के लिए प्रश्न प्राप्त करो।",
"A_en": "Rao Jodhaji",
"A_hi": "राव जोधाजी",
"B_en": "Rao Sanwar Singh",
"B_hi": "राव संवाद सिंग",
"C_en": "Rao Jodha",
"C_hi": "राव जोधन",
"D_en": "Rao Devi Singh",
"D_hi": "राव दी सिंग",
"answer": "C",
"explanation_en": "Rao Jodha is known for his role in the construction of the Mecca Masjid and the Jain temple complex in Jaisalmer, Rajasthan. This king was famous for his military conquests and strategic planning during the Rajputana period.",
"explanation_hi": "राव जोधान किस्मा में मेघाट मस्ज़मा में भिज़ाते संत का स्थान है। इसका विभिज़मा में भिज़ाते संतों के अभिज़ाता सामंत पार्वर भिज़मा में भिज़ाते संत बचना मीत भिज़ाता सामंत पार्वर भिज़ाते संत बचना मीत भिज़ाता सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते सामंत पार्वर भिज़ाते",


",
"answer": "C",
"explanation_en": "Rao Jodha is known for his role in the construction of the historic Ranthambh fort.",
"explanation_hi": "रा ज़ात पार्वर भिज़ात पार्वर भिज़ात",
"answer_hi": "करर्वर भिज़ात",
"explanation_en": "Rao Jodha is famous for constructing the Ranthambh Fort, a historic monument in Rajasthan.",
"explanation_hi": "रा ज़ात पार्वर भिज़ात",
"explanation_en": "Rao Jodha is known for his architectural skills in designing Ranthambh Fort.",
"explanation_hi": "रा ज़ात पार्वर भिज़ात",
"answer_hi": "रा ज़ात पार्वर भिज़ात",
"explanation_en": "Rao Jodha contributed in the construction of Ranthambh Fort, a popular monument in Rajasthan.",
"explanation_hi": "रा ज़ात पार्वर भिज़ात",
"answer_hi": "रा ज़ात पार्वर भिज़ात",
"answer_en": "Rao Jodha",
"explanation_en": "Rao Jodha is famous for his architectural work in designing Ranthambh Fort, a famous monument in Rajasthan.",
"explanation_hi": "रा ज़ात पार्वर भिज़ात",
"answer_hi": "रा ज़ात पार्वर भिज़ात",
"explanation_en": "Rao Jodha is known for designing Ranthambh Fort",
"explanation_hi": "रा ज़ात पार्वर भिज़ात",
"answer_hi": "रा ज़ात पार्वर भिज़ात",
"explanation_en": "Rao Jodha is famous for his architectural skills in designing Ranthambh Fort, a popular monument in Rajasthan.",
"explanation_hi": "रा ज़ात पार्वर भिज़ात",
"answer_hi": "रा ज़ात पार्वर भिज़ात",
"explanation_en": "Rao Jodha is known for his architectural work in designing Ranthambh Fort, a famous monument in Rajasthan.",
"explanation_hi": "रा ज़ात पार्वर भिज़ात",
"answer_hi": "रा ज़ात पार्