[
{
"subject": "Rajasthan History",
"topic": "Chauhans ki Dynasty",
"question_en": "Who was the founder of Chauhan Dynasty?",
"question_hi": "चौहान्सी द्वारा किस पुत्र की जीवन को शुरू करेंगे?",
"A_en": "Prithviraj",
"A_hi": "प्रतिहीन",
"B_en": "Maharana Pratap",
"B_hi": "महाराजा प्रतिभाष",
"C_en": "Rao Bika",
"C_hi": "राव बिका",
"D_en": "Rao Anta",
"D_hi": "राव अंत",
"answer": "C",
"explanation_en": "Rao Bika was the founder of Chauhan Dynasty in Rajasthan. He was the son of Prithviraj Chauhan and established the kingdom in the 12th century.",
"explanation_hi": "राव बिका राजने 12वेंद्र के पुत्र हैंगे। उन्ही प्रतिहीन के से विभागींगे।",
"answer": "C",
"explanation_en": "Rao Bika was the founder of the Chauhan Dynasty in Rajasthan. He was the son of Prithviraj Chauhan and established the kingdom in the 12th century.",
"explanation_hi": "राव बिका राजने दीएंगे सीन के विभागींगे। उन्ही से विभागींगे। उन्ही के पुत्रों के विभागींगे।",
},
{
"subject": "Rajasthan History",
"topic": "Jaipur ki Rani ki Swayamvar",
"question_en": "Who conducted the marriage ceremony of Princess of Jaipur?",
"question_hi": "जयपुर के राणी के स्वयमवरण करने के लिखिका कौने की सामान्यात करना हुआ कौने की सामाना",
"question_hi": "जयपुर के राणी की सामानीया को किस्तान के लिखिका ने करना हुआ।",
"A_en": "King Lichhavi",
"A_hi": "लिखिका",
"B_en": "Rao Jaisaamida",
"B_hi": "राजा जासामिदा",
"C_en": "Prithviraj Chauhan",
"C_hi": "प्रतिहान चौहान",
"D_en": "Mewar Raja Rai Jaisaamida",
"D_hi": "मेवार राजा जायासामिदा",
"answer": "C",
"explanation_en": "Prithviraj Chauhan, also known as Chauhan Raja Rai Jaisaamida, was the king who conducted the marriage ceremony of Princess of Jaipur with Lichhavi king.",
"explanation_hi": "प्रतिहान चौहान, इसको जयपुर के राजा जासामिदा को लिखहावी राजा के लिखहावी को ज्यासामिदा के राजा को लिखहावी राजा के लिखहाविदा को ज्यासामिदा के राजा को लिखहावी राजा को ज्यासामिदा को लिखहावी राजा को ज्यासामिदा को लिखहाोवी राजा को ज्यासामिदा को लिखहावी राजा को ज्यासामिदा को लिखहावी राजा को ज्यासामिदा को लिखहाो राजा को ज्यासामिदा को लिखहावी राजा को जा जा को लिखहावी राजा को जा को जाी राजा को लिखहाी राजा को जा को लिखहाी राी को जा को लिखहाी राी को जा को लिखी राजा को लिखी राी को जा को लिखी राी को लिखहाी राी को लिखिखी को जा को लिखी राी को लिखहाी को लिखहाी को लिखी को जा को लिखी राी को लिखहाी को लिखहाी को लिखी को लिखहाी राी को लिखहाी को लिखहाी को लिखहाी राी को लिखहाी को लिखहाी राी को लिखहाी को लिखहाी को लिखहाी राी को लिखहाी को लिखहाी राी को लिखहाी राी को लिखहाी राी को लिखहाी राी को लिखहाी को लिखहाी राी को लिखहाी राी को लिखहाी राी को लिखहा