[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort was built by Maharaja Man Singh I of Amber?",
"question_hi": "महाराजा मन सिंह I आंबर के लिए किस मनोज्ञा की बनाई गई थी ?",
"A_en": "Amber Fort", "A_hi": "आंबर के लिए बनाई गई थी",
"B_en": "Kishangarh Fort", "B_hi": "किशंगरखां के लिए बनाई गई थी",
"C_en": "Meena Bazaar", "C_hi": "मेना बाजार के लिए बनाई गई थी",
"D_en": "Jaipur", "D_hi": "जापान",
"answer": "B",
"explanation_en": "Kishangarh Fort was built by Maharaja Kishan Singh II.",
"explanation_hi": "किशंगरखां के लिए बनाई गई थी जबकि महाराजा किसनगरखां के लिए बनाई गई थी।",
"explanation_en": "Amber Fort was built by Maharaja Man Singh I.",
"explanation_hi": "मन सिंघर के लिए बनाई गई थी।",
"explanation_en": "Amber Fort was built by Maharaja Man Singh I.",
"explanation_hi": "मन सिंघर के लिए बनाई गई थी।",
"explanation_en": "Jaipur was the capital of Rajasthan during the reign of Maharaja Sawai Jai Singh II.",
"explanation_hi": "जापान महाराजा सावाई जय सिंघर के के तीर्थ में, जापान प्रांत के में।",
"explanation_en": "Amber Fort was built in 1592 AD.",
"explanation_hi": "आंबर फोट 1592 आईडूबी में बनाई गई थी।",
"explanation_en": "Amber Fort was built by Maharaja Man Singh I.",
"explanation_hi": "आंबर फोट में बनाई गई थी।",
"explanation_en": "The Rani Mahal of Amber Fort was the residence of queens of Jaipur.",
"explanation_hi": "आंबर फोट के राणी महाल को जापान के मामलाओं ने रहतीं थी।",
"explanation_en": "The monsoon palace of Amber Fort was built during the reign of Maharaja Man Singh I.",
"explanation_hi": "आंबर फोट महाल के मंगलों के समराजा मन सिंग के समराजा मेंट के तालाबागों मेंट के समराजा मन सिंग I के समराजा मेंट के तालाबागों मेंट के समराजा मन सिंग I के समराजा मेंट के तालाबागों मेंट के समराजा मेंट के समराजा मेंट के समराजा मेंट के समराजा मेंट के स्वामराजा मेंट के समराजा मेंट के समाराजा मेंट के समाराजा मेंट के समराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट",
] के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट के समाराजा मेंट",
] के समाराजा मे