[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous Fort in Rajasthan was built by Raja Rao Jodha of the Jaswant Thada clan?",
"question_hi": "राजस्थान में प्रसंग के जस्वांत ठाड़े के राजकर्मचारी राजकट जोड़ा उसको बनाया गया है।",
"A_en": "Amer Fort",
"A_hi": "अमेर",
"B_en": "Meena Bazaar",
"B_hi": "मेना बाजार",
"C_en": "Jaigarh Fort",
"C_hi": "जयगर्ह फोट",
"D_en": "Kumbhalgarh Fort",
"D_hi": "कुम्भलगढ़ फोट",
"answer": "C",
"explanation_en": "Jaigarh Fort was built by Raja Man Singh I of the Amer Fort-building Karni Singh Birla family. It is a massive hilltop fortification with a stunning view of the Aravali Range.\n\nजयगर्ह फोट मैं बनाई कर्नी सिंग बिला फर्म की एम बर्ल सिंग बिला फर्म की एम बर्ल सिंग बिला फर्म ने की एम बर्ल सिंग बिला फर्म की लाहट की एम बर्ल सिंग बिला फर्म की लाहट की एम बर्ल सिंग बिला फर्म की लाहट की एम बर्ल सिंग बिला फर्म की लाहट की एम बर्ल सिंग बिला फर्म की लाहट की एम बर्ल सिंग बिला फर्म की लाहट की एम बर्ल सिंग बिला फर्म की लाहट की एम बर्ल सिंग बिला फर्म की लाहट की एम बर्ल सिंग बिला फर्म की लाहट",
}
{
"subject": "Rajasthan History",
"topic": "Rural Development in Rajasthan",
"question_en": "Which scheme was initiated by the Government of Rajasthan to improve the living conditions of rural people? ",
"question_hi": "राजस्थान के सचिवाले अवल्लाह्ट के विक्ट",
"A_en": "Pradhan Mantri Gram Sarv Kalyan Yojana",
"A_hi": "प्रधानि मन्तीं ग्राम सर्व काल्यान योजना",
"B_en": "Jal Sadak Parivartan Yojana",
"B_hi": "जै साधक परिवार्त्तींग योजना",
"C_en": "Gram Vikas Yojana",
"C_hi": "गाँम विकास योजना",
"D_en": "Gram Saksham Yojana",
"D_hi": "गाँम सकास योजना",
"answer": "C",
"explanation_en": "The Gram Vikas Yojana was initiated by the Government of Rajasthan to improve the living conditions of rural people.",
"explanation_hi": "राजस्तींग योजना",
},
{
"subject": "Rajasthan History",
"topic": "Famous Kings and Queens of Rajasthan",
"question_en": "Who was the famous queen of Mewar State during the reign of Rana Khem Raj?",
"question_hi": "मेवार सिंग जींग केंग केंग केंग जिंग केंग केंग केंग जिंग केंग केंग जिंग केंग केंग केंग केंग केंग केंग जिंग केंग केंग केंग जिंग केंग केंग केंग जिंग केंग केंग जिंग केंग केंग जिंग केंग केंग केंग केंग जिंग केंग केंग जिंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग केंग",
"केंग केंग केंग केंग केंग केंग केंग",
"B_en": "Jai Singh", "B_hi": "जेंग केंग केंग केंग केंग केंग केंग केंग केंग केंग",
"C_en": "Pratap Singh", "C_hi": "