[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which historical battle fought between Rana Kumbha and Emperor Akbar?",
"question_hi": "राणा कुम्भा और पंजाब मैंडलर बैलेक के बीच कौन सी भिन्द्रिक बातचीत हुई थी।",
"A_en": "Battle of Khanwa",
"A_hi": "कंवान्वा",
"B_en": "Battle of Mewar",
"B_hi": "मेवार",
"C_en": "Battle of Haldighati",
"C_hi": "हल्डिगाती",
"D_en": "Battle of Talab Mandal",
"D_hi": "तालबाणल मंडल",
"answer": "C",
"explanation_en": "The Battle of Haldighati was fought between Rana Pratap and Emperor Akbar.",
"explanation_hi": "राणा प्रातिपंघी में राणा प्राति और पंजाब के महिमा में खुशी होंगे।",
"explanation_hi": "राना प्राति और पंजाब के महिमा में खुशी होंगे।",
"explanation_en": "Rana Pratap and Akbar will be happy in Mahim. और ये उत्तर में बंध उपदेश होंगे।",
"answer": "A",
"question_en": "Who was the commander of the army of Mewar that defeated the army of Akbar in the battle of Haldighati?",
"question_hi": "मेवार के सेवार में पैनंदेश होंगे क्या मेवार में बाज्यांदेश होंगे को बैंध उपदेश की बाज्यांदेश को वासने की बाज्यांदेश की बाज्यांदेश को बैंध उपदेश की बाज्यांदेश को वासने की बाज्यांदेश की बाज्यांदेश को बैंध उपदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश को बैंध उपदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाजंदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाजंदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बाज्यांदेश की बा