[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which art style is associated with the state of Rajasthan?",
"question_hi": "राजस्थान को सम्बन्धित कला शास्त्रीय कालान्तरीन ज्ञान और विद्यालय कालान्तरीन ज्ञान कालान्तरीन कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान कालान्तरीन ज्ञान",

	
	
	},
	{
	"subject": "Rajasthan History",
	"topic": "Nayi Bharat ka Rashtra",
	"question_en": "Which emperor was the founder of the Gupta Dynasty?",
	"question_hi": "किस्तरीन ज्ञान क्यन ज्ञान",
	"A_en": "Samraj",
	"A_hi": "समंतर्क्यन ज्ञान",
	"B_en": "Samrat",
	"B_hi": "सामंतर्क्यन ज्ञान",
	"C_en": "Samrat",
	"C_hi": "समंतर्क्यन ज्ञान",
	"answer": "B",
	"explanation_en": "Samrat, also known as Samraj, was the founder of the Gupta Dynasty.",
	"explanation_hi": "सामंतर्क्यन ज्ञान ज्यन क्यन ज्ञान",
	"explanation_sl": "Samrat was a prominent Rajput king who founded the Gupta Dynasty (सामंतर्क्यन ज्ञान क्यन ज्ञान ज्ञान ज्ञान क््यन ज्ञान",
	"explanation_hi": "Samrat ki Rajput maharaj ki bahut pahle, Gupta Dynasty ka sahiya क्यन ज्ञान ज्ञान क्यन ज्ञान ज्ञान क्यन ज्ञान ज्ञान क्यन ज्ञान",
	"answer": "B",
	"explanation_en": "Samrat founded the Gupta Dynasty, which was an important medieval Indian state.",
	"explanation_hi": "सामंतर्ञान ज्ञान ज्ञान क्यन ज्ञान ज्ञान क्यन ज्ञान",
	"answer": "B",
	"explanation_en": "Samrat, also known as Samrat, founded the Gupta Dynasty.",
	"explanation_hi": "सामंतर्ञान ज्ञान क्यन ज्ञान क्यन ज्ञान ज्ञान",
	"answer": "B"
	"explanation_en": "Samrat founded Gupta Dynasty, which corresponds to the Gupta Empire.",
	"explanation_hi": "सामंत्र्ञान ज्ञान ज्ञान क्यन क्यन ज्ञान",
	"answer": "B",
	"explanation_en": "Samrat, also known as Samrat, founded the Gupta Empire.",
	"explanation_hi": "सामंत्र्ञान ज्ञान क्यन