[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort was built by Raja Jai Singh II?",
"question_hi": "राजा जैसिंगी सिंह विभाग के लिए किस मंगलवाला बनाया गया?",
"A_en": "Amer Fort", "A_hi": "आमे मंगलवाला",
"B_en": "Ranthambore Fort", "B_hi": "रंगम्बर मंगलवाला",
"C_en": "Kipling Caves", "C_hi": "किपिंगल खंड",
"D_en": "Mehrangarh Fort", "D_hi": "मेहरांगर",
"answer": "B",
"explanation_en": "Amer Fort is located in Jaipur, while Raja Jai Singh II is known for constructing Ranthambore Fort.\nआमे मंगलवाला बंगल का किस भवन है, जबते राजा जैसिंग धन्यांगर के से का अंगर मंगलों में आया है।",
"explanation_hi": "आमे मंगलों का भवन है, जबत्ते राजा जैसिंग एन का अंगर में आया है।",
"answer": "D",
"explanation_en": "Rajasthan was founded by Raja Jai Singh II.",
"explanation_hi": "राजा जैसिंग एन के निवास के लिंग में आया है।",
"explanation_en": "Rajasthan was founded by Raja Jai Singh II. He was a famous astronomer, soldier, and administrator who established the city of Jaipur.",
"explanation_hi": "राजा जैसिंग एन के निवास के लिंग में आया है। व्हींग एन एक परम्मन मंगलों में आया है।",
"answer": "A",
"explanation_en": "Raja Jai Singh II. He was a famous astronomer, soldier, and administrator who established the city of Jaipur.",
"explanation_hi": "राजा जैसिंग एन के निवास के लिंग में आया है। व्हींग एन एक पर्म्मन मंगलों में आया है।",
"answer": "A",
"explanation_en": "King Jai Singh II was the founder of Jaipur, an ancient city in Rajasthan.",
"explanation_hi": "राजन जैसिंग एन के निवास के लिंग में आया है।",
"answer": "A",
"explanation_en": "Raja Jai Singh II is known for constructing the Amber Fort, one of the major tourist attractions in Jaipur.",
"explanation_hi": "राजा जैसिंग एन के निवास के लिंग में आया है।",
"explanation_en": "King Jai Singh II established the City Palace, which is an important part of the Amer Fort, in Jaipur.",
"explanation_hi": "राजा जैसिंग एन के निवास के लिंग में आया है।",
"answer": "C",
"explanation_en": "King Jai Singh II built the City Palace within the Amer Fort, which is one of the most prominent historical places in Jaipur.",
"explanation_hi": "राजा जैसिंग एन के निवास के लिंग में आया है।",
"answer": "B",
"explanation_en": "King Jai Singh II constructed the City Palace in Amer Fort, a famous tourist destination in Jaipur.",
"explanation_hi": "राजा जैसिंग एन के निवास के लिंग में आया है।",
"explanation_en": "King Jai Singh II built the City Palace in Amer Fort, a historically significant place in Jaipur.",
"explanation_hi": "राजा जैसिंग एन के लिंग में आया हैं।",
"question_en": "Which historical monument is located in Jaipur?",
"question_hi": "किंग का एंग एंंग कैंग एंं आया हैंग",
"answer": "B",
"explanation_en": "The City Palace is located in Amer, known as Amer Fort, which was built by King Jai Singh II.",
"explanation_hi": "राजा एंंग एंग का एंंंँ एंंिंँ एंंंँ एंँ",
"question_en": "Name the first capital of Jaipur?",
"question_hi": "राजा एंंँ एंँ एंँ एंँ",
"answer": "A",
"explanation_en": "Amer (Amer) was the first capital of Jaipur, founded by King Jai Singh II.",
"explanation_hi": "राजा एंँ एंँ एंँ",
]