[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which temple was built during the reign of Maharaja Jagatprakash?",
"question_hi": "महाराजधानी जगतप्रकाश के भावेंद्र के समावेशवाल शहर में बनाया गया था?",
"A_en": "Raj Mandir",
"A_hi": "राज मंदिर",
"B_en": "Birla Mandir",
"B_hi": "बिल्रा मंदिर",
"C_en": "Amer Fort",
"C_hi": "आमे किया",
"D_en": "Meena Bazaar",
"D_hi": "मेना बाजार",
"answer": "B",
"explanation_en": "The Birla Mandir, also known as the Laxmi Narayan Temple, was built in Jaipur during the reign of Maharaja Sawai Jai Singh II. It marks his dedication to Lord Vishnu.",
"explanation_hi": "सवाई जयसिंग II के राजप्रधान Maharaja Sawai Jai Singh II के द्वारा जैसारे लोकप्रधान महाराजवाई जयसिंग II ने तो बनाया गया है, जहां क्रेंटो महाराजवाई जैसारे लोकप्रधान महाराजवाई जयसिंग II ने हिलें गये हैं, जहां क्रेंटो महाराजवाई जयसिंग II ने बनाया गया है, जहां क्रेंटो महाराजवाई जयसिंग II ने बनाई गयी है, जहां क्रेंटो महाराजवाई जयसिंग II ने बनाई गयी है",
"answer": "C",
"explanation_en": "Sir Syed Shah Jehan built the Taj Mahal in Agra, while Maharaja Sawai Jai Singh II built the Hawa Mahal in Jaipur.",
"explanation_hi": "सीर शाह जीह ने ताजमहाल एगाटा में बनाई गयी है, जबकि महाराजवाइयां सवाई ने हावा महाल जापुर में बनाई गयी है।",
"explanation_hi": "सीर शाह जीवां ने ताजमहा ला एगाटा में बनाई गयी है, जबकि महाराजवाइयां ने हावा महाल जापुर में बनाई गयी है।",
"explanation_en": "Sir Syed Shah Jehan built the Taj Mahal in Agra, while Maharaja Sawai Jai Singh II built the Hawa Mahal in Jaipur.",
},
{
"subject": "Rajasthan",
"topic": "Rajput Kingdoms",
"question_en": "Which Rajput kingdom was established by the ruler Bhagwant Singh in the 14th century?",
"question_hi": "बहवांट सिंग के 14वीं कांचे महरकाणीं बहवांट सिंग के कांचा महारकाणीं बहवांट सिंग के कांचा महारकाणीं बहवांट सिंग के कांचा महारकाणीं बहवांट सिंग के कांचा महारकाणीं बहवांट सिंग कांचा महारकाणीं बहवांट सिंग कांचा महारकाणीं बहवांट सिंग कांचा महारकाणीं बहवांट सिंग कांचा महारकाणीं बहवांट सिंट कांचा महारकाणीं बहवांट काणीं बहवांट कांट कांट काणीं बहवां बहवांट कांट सिंट कांट काणीं बहवांट कांट कांट कांट बहवांट काणीं बहवां बहवांट कांट कांट कांट कां बहवांट कांट कांट कारिंट कांट कांट काणीं बहवांट कांट कांट कांट कांट कांट कारिंट कारिंट कारिंट कांट कांट कारिंट कांट कारिंट कांट कारिंट कारिंट कांट कारिंट कारिंट कारिंट कारिंट कारिंट कारिंट कारिंट कारिंट कारिंट कारिंट कांट कारिंट कारिंट कारिंट कारिंट कारिंट कारिंट कारिं