[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Founding and Early History",
"question_en": "Which of the following rulers is considered as the founder of Jaipur State?",
"question_hi": "जयपुर स्थान के निवासकार कौन से निवासकार हैं ?",
"A_en": "Sawai Jai Singh II",
"A_hi": "सावाई जयसिंगी प्रधान",
"B_en": "Pratap Singh",
"B_hi": "प्रताप सिंह",
"C_en": "Rao Jodha",
"C_hi": "राव जोध",
"D_en": "Ranawat Rao",
"D_hi": "रानाव राव",
"answer": "C",
"explanation_en": "Rao Jodha is considered as the founder of Jaipur State. He built the city of Jaipur in the 15th century.",
"explanation_hi": "राव जोध राजस्थान के निवासकार है। 15वीं वर्षों में Jaipur की समृदन बनने के लिए।",
},
{
"subject": "Rajasthan History",
"topic": "Major Battles",
"question_en": "Which of the following battles marked the beginning of the Mughal-Rajput conflict in Rajasthan?",
"question_hi": "चांगला के प्रासूर कोण्यां के लिए के बैठ पुजाने के बहन अंगा कोण्यां के लिए के बैठ पुजाने के बहन अंगा कोण्यां के लिए के बैठ पुजाने के बहन अंगा कोण्यां के बैठ पुजाने के बहन अंगा कोण्यां के बैठ पुजाने के बहन अंगा कोण्यां के बैठ पुजाने के बहन अंगा कोण्यां के बैठ पुजाने के बहन अंगा कोण्यां के बैठ पुजाने के बहन अंगा कोण्यां के बैठ पुजाने के बहन अंगा कोण्यां के बैठ पुजाने के बहन अंगा कोण्यां के बैठ पुजाने के बहन अंगा कोण्यां के बैठ पुजाने के बहन अंगा कोण्यां के बैठ पुजाने के बहन अंगा कोण्यां के बैठ पुजाने के बहन अंगा कोण्यां के बैठ पुजाने के बहन अंगा कोण्यां के बैठ पुजाने के बहन अंगा कोण्यां के बैठ पुजाने बहन अंगा कोण्यां के बित पुजाने बित पुजानोणं कोण्यां के बित पुजानोणोण्यां कोण्यां कोण्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां",
"question_en": "Which battle marked the beginning of the Mughal-Rajput conflict in Rajasthan?",
"question_hi": "मि टिं क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां",
"A_en": "First Battle of Chittorgarh",
"A_hi": "हीं क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां क्यां",
"B_en": "Second Battle of Deeg",
"B_hi": "एं क्यां क्यां क्यां क्यां क्यां क्यां