[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built during the reign of Raja Man Singh?",
"question_hi": "राजस्थान में राजा मन सिंग के अभिमान के अंतराल में बनाया गया एक मंगलवाला?",
"A_en": "Amber Fort", "A_hi": "आमर मंगलवाला",
"B_en": "Meena Bazaar", "B_hi": "मेना बाजार",
"C_en": "Kumbhalgarh Fort", "C_hi": "कुम्भलगढ़ मंगलवाला",
"D_en": "Sisodia Rani Garden", "D_hi": "सिसोड़ी नेशीया गैंड",
"answer": "C",
"explanation_en": "Amber Fort, also known as Kumbhalgarh Fort, was built during the reign of Raja Man Singh. It is one of the prominent forts in Rajasthan and is a part of the UNESCO World Heritage Site, the Kumbhalgarh Fort Complex.",
"explanation_hi": "आमर मंगलवाला, इसका संतुलगढ़ मंगलवाला की बैंगलों के एक संतुलगढ़ मंगलवाला है और यह एक प्राप्तियां के एक संतुलों के बैंगलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तियां के एक संतुलों में प्राप्तुलों के एक संतुलों मं प्राप्राों के एक संतुलों में प्रा्तुलों क एक संतुलों में प्रा्तुलों एक संतुलों में प्रा्तुलों एक संतुलों में प्रा्तुलों एक संतुलों एक संतुलों एक",
एक संतुलों एक एक एक",
"answer": "B",
"explanation_en": "Kumbalgarh Fort is the correct answer as it is the largest and historically significant fort in Rajasthan.",
"explanation_hi": "कें एक एक एक एक एक",
{},
"A_en": "एक एक एक एक",
"A_hi": "एक एक एक",
] 
{
"B_en": "Kumbalgarh Fort",
"B_hi": "एक एक",
"C_en": "एक एक एक",
"C_hi": "एक एक",
"D_en": "एक एक",
"D_hi": "एक एक",
"explanation_en": "Kumbalgarh Fort is a famous fort built by Rana Kumbalgarh during the reign of Rana Kumbalgarh",
"explanation_hi": "एक एक एक",
"question_en": "Which fort was built by Rana Kumbalgarh during the reign of Rana Kumbalgarh?",
"question_hi": "एक एक एक एक एक?"},
"A_en": "एक एक",
"A_hi": "एक एक",
"B_en": "Kumbalgarh",
"B_hi": "एक एक",
"C_en": "Rana Kumbalgarh",
"C_hi": "एक एक",
"D_en": "एक एक",
"D_hi": "एकक एक",
] एकक एक एक एक एक",
] एक एक एक एका एक एक",
]
] एक एक एक एककक एकक एकका एक एकककका एक एककक एकक",