[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following emperors was responsible for the construction of the Amber Fort?",
"question_hi": "अम्बर तथा इसके निर्माण के लिए कौन सा संतान खुद को रखा है?",
"A_en": "Harshavardhan",
"A_hi": "हर्षवर्धन",
"B_en": "Alauddin Khilji",
"B_hi": "अलाउद्दिन खिल्जी",
"C_en": "Rana Kumbha",
"C_hi": "राणा कुम्बहा",
"D_en": "Prithviraj Chauhan",
"D_hi": "प्रतिष्ठाजी",
"answer": "Alauddin Khilji",
"explanation_en": "The construction of the Amber Fort is attributed to Alauddin Khilji. He was the ruler who built the fort in the early 14th century.",
"explanation_hi": "अलाउद्दिन खिल्जी से अमेरी का निर्माण करने वाला एक आधिकार कर्ने वाला एक आधिकार कर्ने वाला एक आधिकार कर्ने वाला एक आधिकार कर्ने वाला",
"answer": "Alauddin Khilji",
"explanation_en": "Alauddin Khilji was the ruler who built the Amber Fort near Jaipur in Rajasthan.",
"explanation_hi": "Alauddin Khilji राजन थे जैसे अमेरी का निर्माण कर्ने वाले एक आधिकार कर्ने वाला",
},
{
"subject": "Rajasthan",
"topic": "Rajasthan's Capital",
"question_en": "What is the capital of Rajasthan?",
"question_hi": "राजस्थान की शाख क्यांक खंडरीन कर्ने वाले एक आधिकार कर्ने वाले एक आधिकार कर्ने वाले",
"question_hi": "राजस्थान की शाख क्यांक खंडरीन कर्ने वाले एक आधिकार कर्ने वाले",
"options": [
{
"option_text_hi": "गन्धर्मन",
"option_text_en": "Gandharan",
"option_correct": "D"
},
{
"option_text_hi": "रामन",
"option_text_en": "Raman",
"option_correct": "A"
},
{
"option_text_hi": "तालकर",
"option_text_en": "Takkar",
"option_correct": "C"
},
{
"option_text_hi": "सरल्यांग",
"option_text_en": "Sarlung",
"option_correct": "B"
}
],
"answer": "D",
"explanation_en": "Gandharan was the correct answer. He was the builder of the Amber Fort.",
"explanation_hi": "गन्धरण का उपयोग है। उन्हेंग के संतुलोगोंग के संतुलोगोंग के संतुलोगोंग का उपयोग है। उन्हेंग के संतुलोगोंग के संतुलोगोंग के संतुलोगोंग के संतुलोगोंग के संतुलोगोंग के संतुलोगोंग के संतुलोगोंग के संतुलोगोंग के संतुलोंग के संतुलोंग के संतुलोंग के संतुलोंग के संतुलोंग के संतुलोंग के संतुलोंग के संतुलोंग के संतुलंग के संुलोंग के संतुलुलोंग के संतुलुलुंतुलुंग के संतुलुलुलंतुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुललुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलुलु