[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which Mughal Emperor built the City Palace in Udaipur?",
"question_hi": "उदयपुर के नई कंपास किस मुगल राजनीतिक सत्ता निर्माता था।",
"A_en": "Raja Rai Singh",
"A_hi": "राजा राय सिंह",
"B_en": "Alauddin Khilji",
"B_hi": "अलाउद्दीन खिल्जी",
"C_en": "Krishna Singh",
"C_hi": "कृष्ण सिंह",
"D_en": "Sangram Singh",
"D_hi": "सांग्राम सिंह",
"answer": "B",
"explanation_en": "Alauddin Khilji is the correct answer as he built the City Palace in Udaipur, also known as the Lake Palace or Udaipur Palace.\nExplanation: The City Palace, a key landmark in Udaipur, Rajasthan, India, was constructed during the reign of Alauddin Khilji in the 14th century. It is renowned for its architectural beauty and has been declared a UNESCO World Heritage Site.",
"explanation_hi": "उदयपुर के मैनर (लैक पेल या उदयपुर पैल) एक मैनर के विशेष, राजस्थान के एक मैनर की नौलाई के अंबन्दी का संदर्भवन की संतुलाई का स्वति एक मैनर की नौलाई के अंबन्दी का संतुलाई की संदर्भवन की नौलाई का संतुलाई के अंबन्दी का संतुलाई की नौलाई का संतुलाई के अंबन्दी का संतुलाई की नौलाई का संतुलाई के अंबन्दी का संतुलाई की नौलाई का संतुलाई के अंबन्दी का संतुलाई की नौलाई का संतुलाई के अंबन्दी का संतुलाई की नौलाई का संतुलाई के अंबन्दी का संतुलाई के अंबन्दी का संतुलाई की नौलाई के अंबन्दी का संतुलाई के अंबन्दी का संतुलाई के अंबन्दी का संतुलाई के अंबन्दी का संतुलाई के अंबन्दी का संतुलाई के अंबन्दी का संतुलाई के अंबन्दी का संतुलाई के अंबन्दी का संतुलाई के अंबन्दी का संतुलाई के अंबन्दी का संतुलाई के अंबन्दी का संतुलाई के अंबन्दी का संतुलाई के अंबन्दी का संतुलाई के अंबन्दी का संतुलाई के अंबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी का संबन्दी",
"answer": "D",
"explanation_en": "Although several rulers contributed to the construction of the City Palace in Udaipur, Rajasthan, the correct answer is Raja Mewar as he is considered the founder