[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital & Famous Fairs",
"question_en": "Which fair is famous in Rajasthan and is held annually in Pushkar?",
"question_hi": "राजस्थान में आया और पुष्कर में अग्रंद बाज़ार किस वर्षीय मूल्यांकित होते हैं?",
"A_en": "Pushkar Camel Fair",
"A_hi": "पुष्कर मुख्यांकित होते हैं",
"B_en": "Jaisalmer Desert Festival",
"B_hi": "जयसालमर डेस्ट फेस्टवर",
"C_en": "Kumbhlgarh Mela",
"C_hi": "कम्ब्लगढ़ मेला",
"D_en": "Mehendi Festival",
"D_hi": "मेहनी फेस्टवर",
"answer": "C",
"explanation_en": "Kumbhlgarh Mela is the festival held annually in Kumbhlgarh, Rajasthan. It is also known as the Rajasthan State Level Exhibition.",
"explanation_hi": "कम्ब्लगढ़ मेला राजस्थान राजवाणी का फेस्टवर, राजस्थान राजवाणी, मेला का फेस्टवर में आता है। उसका नाम भी राजस्थान राजवाणी के राजवाणी में लिखा यानों को क्यांची राजवाणी में लिखा यानों के राजवाणी में लिखा यानों को क्यांची राजवाणी में लिखा यानों के राजवाणी में लिखा यानों को क्यांची राजवाणी में लिखा यानों के राजवाणी में लिखा यानों को क्यांची राजवाणी में लिखा यानों के राजवाणी में लिखा यानों को क्यांची राजवाणी में लिखा यानों के राजवाणी में लिखा यानों को क्यांची राजवाणी में लिखा यानों को क्यांची राजवाणी में लिखा यानों को क्यांची राजवाणी में लिखा यानों को क्यांची राजवाणी में लिखा यानों को क्यांची राजवाणी में लिखा यानों को क्यांची राजवाणी में लिखा यानों को क्यांची राजवाणी में लिखा यानों को क्यांची राजवाणी में लिखा यांची राजवाणी में लिखा यांची राजवाणी में लिखा यांची राजवाणी में लिखा यांची राजवाणी में लिखा यांची राजवाणी में लिखा यांची राजवाणी में लिखा यांची राजवाणी में लिखा यांची राजवाणी में",
लिखा यांची राजवाणी में लिखा यांची राजवाणी में लिखा यांची राजवाणी में लिखा यांची राजवाणी में लिखा यां",
"answer": "में लिखा यांची राजवाणी में",
"explanation_en": "The famous fort of Mehengar in Rajasthāṛ (मेंलिखा यां लिखा यांची राजवाणी में लिखा यांची राजवाणी मेंलिखा यां",
"explanation_hi": "में लिखा राजवाणी में लिखा यांची राजवाणी मेंलिखा यांची राजवाणी में लिखा यां",
"explanation_hi": "में लिखा यांची राजवाणी मेंलिखा यांची राजवाणी मेंलिखा यां राजवाणी में