[
{
"subject": "Rajasthan History",
"topic": "Royal Families and Palaces",
"question_en": "Which well-known palace in Rajasthan was built during the Mughal era?",
"question_hi": "राजस्थान में कई मुगल समय के समय में बनाया गया एक जानकारी के लिए इसे पूछें।",
"A_en": "Amer Fort", "A_hi": "अमेर कंधन",
"B_en": "Lal Mandir", "B_hi": "लाल मंदिर",
"C_en": "Pratapgarh Fort", "C_hi": "प्रातपगंधन",
"D_en": "Rashtrapati Bhawan", "D_hi": "राष्ट्रीय भवन",
"answer": "A",
"explanation_en": "Amer Fort, also known as Amer Fort, is a historic palace located in Jaipur, Rajasthan. It was built during the Mughal era and is a popular tourist attraction.",
"explanation_hi": "आमेर कंधन, Jaipur, Rajasthan में प्रवक्षति करों के लिए बने हैं।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Famous Kings and Rulers",
"question_en": "Which famous Rajput king was known for his contribution to the development of Jaipur and its surroundings?",
"question_hi": "जयपुर और उपन्याँ के विकास को कौन स्वत ज्ञान के लिए हैं, जिनों को करों के विकास को प्रदर्श के लिए हैं, जिनों को प्रदर्श के विकास को प्रदर्श के लिए हैं, जिनों को प्रदर्श के विकास को प्रदर्श के लिए हैं, जिनों को प्रदर्श के विकास को प्रदर्श के लिए हैं, जिनों को प्रदर्श के विकास को प्रदर्श के लिए हैं, जिनों को प्रदर्श के विकास को प्रदर्श के लिए हैं, जिनों को प्रदर्श के विकास को प्रदर्श के लिए हैं, जिनों को प्रदर्श के विकास को प्रदर्श के लिए हैं, जिनों को प्रदर्श के विकास को प्रदर्श के लिए हैं, जिनों को प्रदर्श के विकास को प्रदर्श के लिए हैं, जिनों को प्रदर्श के विकास को प्रदर्श के लिए हे जिनों को प्रदर्श के विकास को प्रदर्श के लिए जिनों को प्रदर्श के विकास के लिए जिनों को प्रदर्श के लिए जिनों के विकास के लिए जिनों के लिए विए जिनों के लिए जिए विए जिए लिए विए जिए विए जिए लिए जिए विए जिए लिए विए जिए विए",
",
"Answer": "जिए लिए विए लिए जिए विए जिए विए जिए विए जिए लिए विए जिए विए जिए",
"Explanation_en": "The famous Rajput king who established Jaipur, also known as Amer, built the Amer Fort. The fort was named after his mother Queen Jodhan, who was a princess from the Guhil Rathore clan. His father was Maharaja Man Singh, a member of the Kachwara Rathore clan.",
"Explanation_hi": "जिए लिए जिए विए जिए विए जिए विए जिए विए जिए विए जिए",
},
{
"subject": "Rajasthan History",
"topic": "Rajput Kings",
"question_en": "Who was the first Rajput king of Rajasthan?",
"question_hi": "राजिए जिए विए जिए जिए विए",
"A_en": "Pratap Singh", "A_hi": "परताजिए जिए विए जिए जिए",
"B_en": "Pratap Singh", "B_hi": "परताजिए जिए विए जिए जिए विए",
"C_en": "Jaisamaj Singh", "C_hi": "जिए जिए विए विए जिए",
"D_en": "Udai Singh", "D_hi": "जिए जिए जिए विए