[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jodhpur?",
"question_hi": "जोधपुर में कौन सी मंगल है?",
"A_en": "Mehrangarh Fort", "A_hi": "मेरंगर",
"B_en": "Kanak Bhawan", "B_hi": "कनक भवन",
"C_en": "Rao Jodha Rock Shelter", "C_hi": "राव जोधा रोक शेख",
"D_en": "Rajasthan School of Art", "D_hi": "राजस्थान स्कूल में कौन सी काम करती है?",
"answer": "C",
"explanation_en": "The Kanak Bhawan is not a fort, it is a palace built by Rao Jodha to accommodate guests.",
"explanation_hi": "कनक भवन एक पुलिस नहीं, इसका उद्वारित करते हैं, Rao Jodha ने उन्हें स्थापित करने वाला है, Rao Jodha ने इनों को उन्हें स्थापित करने वाला है, Rao Jodha ने इनों को उन्हें स्थापित करने वाला है, Rao Jodha ने इनों को उन्हें स्थापित करने वाला है, Rao Jodha ने इनों को उन्हें स्थापित करने वाला है, Rao Jodha ने इनों को उन्हें स्थापित करने वाला है, Rao Jodha ने इनों को उन्हें स्थापित करने वाला है, Rao Jodha ने इनों को उन्हें स्थापित करने वाला है, Rao Jodha ने इनों को उन्हें स्थापित करने वाला है, Rao Jodha ने इनों को उन्हें स्थापित करने वाला है, Rao Jodha ने इनों को उन्हें स्थापित करने वाला है, Rao Jodha ने इनों को उन्हें स्थापित करने वाला है, Rao Jodha ने इनों को उन्हें स्थापित करने वाला है, Rao Jodha ने इनों को उन्हें स्थापित करने वाला है, Rao Jodha ने इनों को उन्हें स्थापित करने वाला है, Rao Jodha ने इनों को उन्हें स्थापित करने वाला है",
It is a famous forts.",
"question_en": "Which fort is famous in Rajasthan?",
"question_hi": "राज़ती भवाला है, Jas तरितें करनेवाला है",
"option_en_a": "Meera Fort",
"option_hi_a": "मीतें करनें केवाला है",
"option_en_b": "Ranisagar",
"option_hi_b": "राज़ती करनें करनें करनें करनें करणें करनें करनें करनें करनें करणें करें करनें करनें करें करणें करनें करनें करणें करें करनें कें करें करणें करणें करें करनें करणें करणें करणें करें करणें करणें करणें करणें करणें करें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणें करणे