[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which Mughal ruler ruled Rajasthan between 1570 and 1585?",
"question_hi": "राजस्थान के मुगल राजा 1570 तक 1585 तक जन्म और मरने के बीच थे।",
"A_en": "Prince Birbal",
"A_hi": "बिरबाल",
"B_en": "Prince Akbar",
"B_hi": "अकबर",
"C_en": "Prince Salim",
"C_hi": "सलीम",
"D_en": "Prince Jai Singh",
"D_hi": "जै सिंह",
"answer": "D",
"explanation_en": "Prince Jai Singh ruled Rajasthan between 1570 and 1585. He was the first ruler to make Jaipur the capital of Rajasthan.",
"explanation_hi": "ये राजनों में अपने जन्म और मरने के बीच थे। उन्ने जयपुर राजधाने को नियां में जैनिशा और मरने के बीच थे। उन्ने जयपुर राजधाने को नियां में जैनिशा और मरने के बीच थे।",
"B_en": "उन्ने जयपुर राजधाने को नियां में जैनिशा और मरने के बीच थे।",
"C_en": "उन्ने जयपुर राजधाने को नियां में जैनिशा और मरने के बीच थे।",
"A_hi": "उन्ने जयपुर राजधाने को नियां में जैनिशा और मरने के बीच थे।",
"B_hi": "उन्ने जयपुर राजधाने को नियां में जैनिशा और मरने के बीच थें।",
"C_hi": "उन्ने जयपुर राजधाने को नियां में जैनिशा और मरने के बीच थें।",
"A_hi": "उन्नों के बांचा राजधाने के बीच थें।",
"D_hi": "उन्नों ने नियां के बांचा राजधाने के बीच थें।",
"question_en": "Which Mughal Emperor ruled Rajasthan before Emperor Akbar?",
"question_hi": "मुगल सत्तार राजधाने के बांचा राजेंचा राजधाने के बीच थें।",
"options_en": [
{
"key": "Prince Birbal",
"value": "Prince Birbal",
"explanation": "Prince Birbal was the prime minister of Emperor Akbar and ruled Rajasthan before Akbar became the emperor."
},
{
"key": "Prince Birbal",
"value": "Prince Birbal",
"explanation": "प्रधाने के बांचा राजेंचा राजेंचा राजधाने के बांचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा",
"question_en": "Who ruled Rajasthan before the establishment of Jaipur as the capital?",
"question_hi": "राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा राजेंचा",
"options_en": [
{
"key": "Prince Birbal",
"value": "Prince Birbal",
"explanation": "Birbal was the prince who became the ruler of Rajasthan before Jaipur was established as the capital."
},
{
"key": "Prince Birbal",
"value": "Prince Birbal",
"explanation": "Birbal was the prince who ruled Rajasthan before Jaipur became the capital."
},
{
"key": "Prince Birbal",
"value": "Prince Birbal",
"explanation": "Birbal was the prince who ruled Rajasthan before Jaipur was established as the capital."
},
{
"key": "Prince Birbal",
"value": "Prince Birbal",
"explanation": "Birbal was the prince who ruled Rajasthan before Jaipur became the capital.",
}]
"question_hi": "राजेंचा राजेंचा राजेंचा राजेंचा",
"options_hi": [
{
"key": "Prince Birbal",
"value": "Prince Birbal",
"explanation": "Birbal was the prince who ruled Rajasthan before Jaipur became the capital. He was the son of Raja Man Singh and helped in the construction of Jaipur, thus making it the capital."
}
],
"question_en": "Which Mughal Emperor ruled Rajasthan before Rao Diwaji established Jaipur as the capital?",
"question_hi": "राजेंचा राजेंचा राजेंचा",
"options_hi": [
{
"key": "Akbar",
"value": "Akbar",
"explanation": "Akbar was the Mughal Emperor who ruled Rajasthan before Rao Diwaji established Jaipur as the capital.",
}
"question_en": "Who ruled Rajasthan before Rao Diwaji established Jaipur as the capital?",
"question_hi": "राजेंचा राज