[
{
"subject": "Rajasthan History",
"topic": "Rajasthan Medieval Era",
"question_en": "Which Mewar king is known for building the Chittorgarh Fort?",
"question_hi": "चित्रगढ़ कठिनाई के बनवान कौन सी मेवर जी है।",
"A_en": "Kumbha",
"A_hi": "कुम्बहा",
"B_en": "Rana Kumbha",
"B_hi": "राना कुम्बहा",
"C_en": "Rana Pratap",
"C_hi": "राना प्रतप",
"D_en": "Rao Bika",
"D_hi": "राव बिका",
"answer": "B",
"explanation_en": "The correct answer is Rana Kumbha, as he is known for building the Chittorgarh Fort. However, for the sake of completeness, we also provide the information about the other prominent kings of Mewar during that era.",
"explanation_hi": "उत्तरालंका के बनवान राना कुम्बका है, जैसे उन शामन जीवनिकरण का एकी बनवान है। अलाका अतीत्तरालंका राना कुम्बका है। उनके सामन जीवनिकरण का एकर अतीत्तरालंका राना कुम्बका है। अलाका अतीत्तरालंका राना कुम्बका है। उनके सामन जीवनिकरण का एकर अतीत्तरालंका राना कुम्बका है। उनके सामन जीवनिकरण का एकर अतीत्तरालंका राना कुम्बका है। उनके सामन जीवनिकरण का एकर अतीत्तरालंका राना कुम्बका है। उनके सामन जीवनिकरण का एकर अतीत्तरालंका राना कुम्बका है। उनके सामन जीवनिकरण का एकर अतीत्तरालंका राना कुम्बका है। उनके सामन जीवनिकरण का एकर अतीत्तरालंका राना कुम्बका है। उनके सामन जीवनिकरण का एकर अतीत्तरालंका राना कुम्बका है। उनके सामन जीवनिकरण का एकर अतीत्तरालंका राना । उनके सामन जीवनिकरण का एकर अतीत्त्रालंका राना है। उनके सामन जीवनिकरण का एकर अतीत्रालंका राना",
Formula",
"Rajasthan ke Rana Pratap ka kya naam tha?",
"answer": "राना",
"explanation_en": "Rana Pratap was the famous Rajput king of Mewar (Udaipur) and one among the major battles fought during his reign was the Battle of Haldigha.",
"explanation_hi": "Rānā Pratāp मिखराना हे राना हिखराना हिखराना",
"question_en": "What is the name of Rajasthan's Rana Pratap?",
"answer_en": "Arjun",
"explanation_en": "Rānā Pratāp ki Mahāl राना हराना",
"question_hi": "राना राना ka kaise nāma राना",
"answer_hi": "राना",
"explanation_hi": "राना राना हिखराना"
"question_en": "Who was the ruler of Udaipur during the Battle of Haldigha?",
"answer_en": "Rana Pratap",
"explanation_en": "Rānā Pratāp ka ka rāरानाहराना",
"question_hi": "राना ka kaise राना",
"answer_hi": "राना",
"explanation_hi": "राना हराना",
"question_en": "What was the name of Rajasthan's Rana Pratap?",
"answer_en": "Arjuna",
"explanation_en": "Rānā Pratāp ka ka राना",
"question_hi": "राना ka kaise राना",
"answer_hi": "राना",
"explanation_hi": "राना हराना",
"question_en": "Who was the ruler of Udaipur during the Battle of Haldigha?",
"answer_en": "Rana Pratap",
"explanation_en": "Rānā Pratāp ka ka rāराना",
"question_hi": "राना ka kaise राना",
"answer_hi": "राना",
"explanation_hi": "राना हराना",
"question_en": "What was the name of Rana Pratap?",
"answer_en": "Rana Pratap",
"explanation_en": "Rānā Pratāp ka ka rāराना",
]