[
{
"subject": "Rajasthan History",
"topic": "Rajasthan State's Founding and Early History",
"question_en": "Which king founded the city of Jaipur?",
"question_hi": "जयपुर के प्राकृतिक और पहली बारहने के लिए कौन सा जन्मनगर यात्रा का मूल विश्वासन बैलैंड्रो के लिए की।",
"A_en": "Raja Man Singh I",
"A_hi": "राजा मन सिंह एवं",
"B_en": "Raja Pratap Singh",
"B_hi": "राजा प्रतपस्वामी एवं",
"C_en": "Raja Kumbha",
"C_hi": "राजा कुम्बहा",
"D_en": "Raja Rawal Jaisal Singh",
"D_hi": "राजा रावल जयसाल सिंह",
"answer": "Raja Man Singh I",
"explanation_en": "Jaipur was founded by Raja Man Singh I, one of the ten commanders of Mughal Emperor Akbar.\nAlternatively, you can provide the explanation in Hindi as: Raja Man Singh I ne Jaipur ka banaya tha, Akbar ka sapta maharajon ke ten commander tha.\n",
"explanation_hi": "मुग़बल में राजा मन सिंह ने जैपुर बना था, अकबर के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के सपैं तिहाँ के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अन्धान के एक अ