[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built during the era of the Rajputs?",
"question_hi": "राजस्थान में राजपूतों के तथापि बनाए गए एक ग्रीष्मकारी क्या है?",
"A_en": "Amber Fort", "A_hi": "अमर्ह ग्रीष्मकारी",
"B_en": "Mehrangarh Fort", "B_hi": "मेरनगर ग्रीष्मकारी",
"C_en": "Kumbhalgarh Fort", "C_hi": "कुम्भालगढ़ ग्रीष्मकारी",
"D_en": "Jaigarh Fort", "D_hi": "ज़ैगर ग्रीष्मकारी",
"answer": "B",
"explanation_en": "Mehrangarh Fort is a famous fort in Rajasthan built by Rao Jodhaji in the 16th century.\nMehrangarh Fort (मेरनगर ग्रीष्मकारी) is known for its beautiful architecture and strategic location.",
"explanation_hi": "राजस्थान में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवन में संगीत जीवन बीजन द्वीर जीवीर में संगीत जीवन द्वीर में सं गीर मीर द्वीर मं सं गीत जीवीर में सं गीर द्वीर मीर मीर द्वीर में सं गीर मं सं गीर मीर द्वीर मीर में सं",
" संगीर में सं गीर मीर में सं गीर में सं",
" संगीर में सं गीर में सं गी",
},
"question_en": "Which famous Rajasthan monument is known as the 'Palace of Winds'?",
"question_hi": "रामन में सं गीर में सं गीर में",
"option_en": [
{
"option_hi": [
{
"A_en": "Amber Fort",
"A_hi": "जां सं गीर में गीर में संगीर में",
"B_en": "Hawa Mahal",
"B_hi": "हावन मेंगीर में गीर में",
"C_en": "Ras",
"C_hi": "रां गीर में गीर में",
"D_en": "Maota Fort",
"D_hi": "में गीर में गीर