[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Founding Kings",
"question_en": "Which king founded Jodhpur?",
"question_hi": "जोधपुर कौन सा शासनकर्ता निवासित किया?",
"A_en": "Rao Jodha",
"A_hi": "राव जोध",
"B_en": "Rao Kriparam",
"B_hi": "राव कृपेम",
"C_en": "Rao Jaisimha",
"C_hi": "राव जैसिम",
"D_en": "Rao Ratan Singh",
"D_hi": "राव रात्तिसिंग",
"answer": "A",
"explanation_en": "Rao Jodha is the founder of Jodhpur. He established the city in the 15th century and laid the foundation of the Meera Temple as well.",
"explanation_hi": "राव जोध भूमि Jodhpur के संतराईयें हरियाँ को बनाया और 15वेंचे संवत में इसे स्थापन करेंचे में मेरी मंदिर भूमि कलाई करेंचे में मोई भूमि कलाई करेंचे में मोई भूमि कलाई करेंचे मोई भूमि कलाई करेंचे मोई भूमि कलाई करेंचे मोई भूमि कलाई करेंचे मोई भूमि कलाई करेंचे मोई भूमि कलाई करेंचे मोई भूमि कलाई करेंचे मोई भूमि कलाई करेंचे मोई भूमि कलाई करेंचे मोई भूमि कलाई करेंचे मोई भूमि कलाई करेंचे मोई भूमि कलाई करेंचे मोई भूमि कलाई करेंचे मोई भूमि कलाई करेंचे मोई भूमि कलाई।",
"answer": "B",
"explanation_en": "Rao Jaisimha was the founder of Meerpur. It was established before the establishment of Jaisamand, which was ruled by Rao Kriparam.",
"explanation_hi": "Rao Jaisimha मेर्पुर के निविकरण के वक्त है। यहां Rao Kriparam के निविकरण में हुए हैं।",
},
{
"subject": "Rajput Rulers of Mewar",
"topic": "Rao Kriparam",
"question_en": "Who was the Rajput ruler who established Rao Kriparam?",
"question_hi": "राजपुत मेवार के मात्रों पर मेवार के निविकरणी में हुए हैं।",
"A_en": "Rao Jaisimha",
"A_hi": "राजस्त मेवार के मातर्यार के मात्रों पर मेवार के मात्रों पर मेवार के मात्रों पर मेवार के मात्रों पर मेवार के मात्रों पर मेवार के मात्रों पर मेवार के मात्रों पर मेवार के मात्रों पर मेवार के मात्रों पर मेवार के मात्रों पर मेवार के मात्रों पर मात्रे मात्रे मात्रे मात्रे मात्रे मात्रे मात्रे मात्रे मात्रे मात्रे मात्रे मात्रे मा्रे मात्रे मात्रे मात्रे मात्रे मात्रे मात्रे मात्रे मात्रे माे मात्रे मात्रे मात्रे मात्रे मा्रे मात्रे मात्रे मात्रे मात्रे मा्रे मात्रे मा्रे मा्रे मात्रे माे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे मा्रे माे मा्रे मा्रे मा्र