<think>
Okay, I need to create 10 high-quality MCQs for Rajasthan History for exams like LDC, CET, RAS, SSC, and Railway. Let's start by recalling key topics in Rajasthan History. The topic is general Rajasthan History, so I'll cover important dynasties, rulers, historical events, and cultural aspects.

First question: The establishment of the Mewar Kingdom by Rana Sanga is a significant event. That's a good topic. The options can include other rulers or dynasties like Maharana Pratap or Raja Raja Singh. Wait, Rana Sanga founded the Sisodia dynasty, right? So the question can be about who founded the Mewar Kingdom. The answer is Sanga.

Second question: The Chauhan dynasty is well-known in Rajasthan. Who was their founder? Rao Deva or some others. Options can include other dynasties like Solanki or Parmar. The correct answer is Rao Deva.

Third question: The capital of Marwar changed from Mandore to Jodhpur. When did that happen? Marwar is Jodhpur's region. The shift was during Rao Jodha's time. The answer is 1459 AD.

Fourth question: The foundation of Rajasthan state. When was it formed? The answer is 1949 after merging princely states. Options can include 1947, 1956, etc. The correct year is 1949.

Fifth question: The Battle of Haldighati. When did it happen between Maharana Pratap and Akbar? The answer is 1576. Other dates could be 1572 or 1580. 

Sixth question: The founder of Udaipur city. Raja Udai Singh II built it in 1559. Options can include other rulers like Rana Sanga or Maharana Pratap. The answer is Udai Singh II.

Seventh question: The ruler who defeated Mughal emperor Humayun. Rao Maldeo of Marwar defeated him. Other options could be Maharana Sanga or Rana Pratap. The answer is Rao Maldeo.

Eighth question: The first capital of the Mewar Kingdom. It was Chittorgarh, but later moved to Udaipur. Options can include Ajmer, Jodhpur, etc. The answer is Chittorgarh.

Ninth question: The ruler of Mewar who fought against Akbar and died in the Battle of Sarangpur. Maharana Shah Jahan Singh? Wait, the correct answer is Maharana Pratap. Wait, no, the Sarangpur battle was fought by Maharana Shah Jahan Singh of Mewar against Akbar. But maybe I should verify. Alternatively, the Battle of Haldighati is more famous. Hmm, maybe this question is tricky. Let me check. The Battle of Sarangpur was in 1577 where Maharana Shah Jahan Singh of Mewar fought Akbar's forces. He defeated them but later died of his wounds. So the answer is Shah Jahan Singh.

Tenth question: The founder of the Kumbhalgarh fort. Rana Kumbha is the correct answer. Options can include other Ranas like Rana Sangram Singh or Rana Pratap. The answer is Rana Kumbha.

Now, I need to structure each question with Hindi and English parts as per the example. Ensure the difficulty is appropriate for the exams, not too easy. Check the facts for accuracy. For example, the capital of Marwar being Jodhpur since 1459. Also, confirm the correct dates for events like the Battle of Haldighati. Once all questions are framed, present them in the required JSON format without any markdown. Make sure explanations are concise in both languages.
</think>

[
    {
        "subject": "Rajasthan History",
        "topic": "Founding of the Mewar Kingdom",
        "question_en": "Who founded the Mewar Kingdom?",
        "question_hi": "मेवाड़ राज्य की स्थापना किसने की थी?",
        "A_en": "Rana Sanga",
        "A_hi": "राणा सांगा",
        "B_en": "Maharana Pratap",
        "B_hi": "महाराणा प्रताप",
        "C_en": "Raja Raja Singh",
        "C_hi": "राजा राजा सिंह",
        "D_en": "Rao Jodha",
        "D_hi": "राओ जोधा",
        "answer": "A",
        "explanation_en": "Rana Sanga founded the Mewar Kingdom and established the Sisodia dynasty.",
        "explanation_hi": "राणा सांगा ने मेवाड़ राज्य की स्थापना की और सिसोदिया वंश की शुरुआत की।"
    },
    {
        "subject": "Rajasthan History",
        "topic": "Chauhan Dynasty",
        "question_en": "Who was the founder of the Chauhan dynasty in Rajasthan?",
        "question_hi": "राजस्थान में चौहान वंश के संस्थापक कौन थे?",
        "A_en": "Rao Deva",
        "A_hi": "राओ देव",
        "B_en": "Sultan Mahmud",
        "B_hi": "सुल्तान महमूद",
        "C_en": "Raja Bhoj",
        "C_hi": "राजा भोज",
        "D_en": "Raja Raja Singh",
        "D_hi": "राजा राजा सिंह",
        "answer": "A",
        "explanation_en": "Rao Deva was the founder of the Chauhan dynasty in Rajasthan.",
        "explanation_hi": "राजस्थान में चौहान वंश के संस्थापक राओ देव थे।"
    },
    {
        "subject": "Rajasthan History",
        "topic": "Marwar Capital Shift",
        "question_en": "In which year did the capital of Marwar shift from Mandore to Jodhpur?",
        "question_hi": "मरवाड़ की राजधानी में मंडोर से जोधपुर कब शिफ्ट किया गया था?",
        "A_en": "1459 AD",
        "A_hi": "ईस्वी 1459",
        "B_en": "1485 AD",
        "B_hi": "ईस्वी 1485",
        "C_en": "1501 AD",
        "C_hi": "ईस्वी 1501",
        "D_en": "1523 AD",
        "D_hi": "ईस्वी 1523",
        "answer": "A",
        "explanation_en": "The capital of Marwar shifted from Mandore to Jodhpur in 1459 AD under Rao Jodha.",
        "explanation_hi": "राजा जोधा के शासनकाल में मरवाड़ की राजधानी मंडोर से जोधपुर का शिफ्ट 1459 ईस्वी में हुआ था।"
    },
    {
        "subject": "Rajasthan History",
        "topic": "Formation of Rajasthan State",
        "question_en": "When was Rajasthan state formed after the merger of princely states?",
        "question_hi": "महाराज्यों के एकीकरण के बाद राजस्थान राज्य किस वर्ष बना?",
        "A_en": "1947",
        "A_hi": "1947",
        "B_en": "1949",
        "B_hi": "1949",
        "C_en": "1950",
        "C_hi": "1950",
        "D_en": "1956",
        "D_hi": "1956",
        "answer": "B",
        "explanation_en": "Rajasthan state was formed in 1949 after the merger of princely states.",
        "explanation_hi": "महाराज्यों के एकीकरण के बाद राजस्थान राज्य 1949 में बना।"
    },
    {
        "subject": "Rajasthan History",
        "topic": "Battle of Haldighati",
        "question_en": "In which year did the Battle of Haldighati take place between Maharana Pratap and Akbar?",
        "question_hi": "महाराणा प्रताप और अकबर के बीच हल्दीघाटी की लड़ाई किस वर्ष हुई थी?",
        "A_en": "1576",
        "A_hi": "1576",
        "B_en": "1572",
        "B_hi": "1572",
        "C_en": "1580",
        "C_hi": "1580",
        "D_en": "1585",
        "D_hi": "1585",
        "answer": "A",
        "explanation_en": "The Battle of Haldighati between Maharana Pratap and Akbar occurred in 1576.",
        "explanation_hi": "महाराणा प्रताप और अकबर के बीच हल्दीघाटी की लड़ाई 1576 में हुई थी।"
    },
    {
        "subject": "Rajasthan History",
        "topic": "Founding of Udaipur",
        "question_en": "Who founded the city of Udaipur?",
        "question_hi": "उदयपुर शहर की स्थापना किसने की थी?",
        "A_en": "Raja Udai Singh II",
        "A_hi": "राजा उदय सिंह द्वितीय",
        "B_en": "Rana Sanga",
        "B_hi": "राणा सांगा",
        "C_en": "Maharana Pratap",
        "C_hi": "महाराणा प्रताप",
        "D_en": "Raja Man Singh",
        "D_hi": "राजा मान सिंह",
        "answer": "A",
        "explanation_en": "Raja Udai Singh II founded the city of Udaipur in 1559.",
        "explanation_hi": "राजा उदय सिंह द्वितीय ने उदयपुर शहर की स्थापना 1559 में की।"
    },
    {
        "subject": "Rajasthan History",
        "topic": "Defeat of Humayun",
        "question_en": "Which Rajput ruler defeated Mughal emperor Humayun?",
        "question_hi": "मुगल सम्राट हुमायूं को हराने वाला राजपूत शासक कौन था?",
        "A_en": "Rao Maldeo",
        "A_hi": "राओ मल्लदेव",
        "B_en": "Maharana Sanga",
        "B_hi": "महाराणा सांगा",
        "C_en": "Rana Pratap",
        "C_hi": "राणा प्रताप",
        "D_en": "Raja Man Singh",
        "D_hi": "राजा मान सिंह",
        "answer": "A",
        "explanation_en": "Rao Maldeo of Marwar defeated Mughal emperor Humayun in the Battle of Dholpur in 1539.",
        "explanation_hi": "मरवाड़ के राजा राओ मल्लदेव ने मुगल सम्राट हुमायूं को 1539 में ढोलपुर के युद्ध में हराया।"
    },
    {
        "subject": "Rajasthan History",
        "topic": "First Capital of Mewar",
        "question_en": "What was the first capital of the Mewar Kingdom before Chittorgarh?",
        "question_hi": "चित्तौड़गढ़ से पहले मेवाड़ राज्य की पहली राजधानी कौन-सी थी?",
        "A_en": "Ajmer",
        "A_hi": "अजमेर",
        "B_en": "Udaipur",
        "B_hi": "उदयपुर",
        "C_en": "Chittorgarh",
        "C_hi": "चित्तौड़गढ़",
        "D_en": "Rajpipla",
        "D_hi": "राजपिपला",
        "answer": "C",
        "explanation_en": "Chittorgarh was the first capital of the Mewar Kingdom before it was moved to Udaipur.",
        "explanation_hi": "चित्तौड़गढ़ मेवाड़ राज्य की पहली राजधानी थी जिसे बाद में उदयपुर में स्थानांतरित कर दिया गया।"
    },
    {
        "subject": "Rajasthan History",
        "topic": "Battle of Sarangpur",
        "question_en": "Which Mewar ruler fought against Akbar in the Battle of Sarangpur and died of his wounds?",
        "question_hi": "किस मेवाड़ के शासक ने अकबर के साथ सरंगपुर के युद्ध में लड़ाई लड़ी और घावों से मर गया?",
        "A_en": "Maharana Shah Jahan Singh",
        "A_hi": "महाराणा शाहजहां सिंह",
        "B_en": "Maharana Pratap",
        "B_hi": "महाराणा प्रताप",
        "C_en": "Rana Sanga",
        "C_hi": "राणा सांगा",
        "D_en": "Raja Man Singh",
        "D_hi": "राजा मान सिंह",
        "answer": "A",
        "explanation_en": "Maharana Shah Jahan Singh of Mewar fought against Akbar in the Battle of Sarangpur in 1577 and died of his wounds.",
        "explanation_hi": "मेवाड़ के महाराणा शाहजहां सिंह ने 1577 में अकबर के साथ सरंगपुर के युद्ध में लड़ाई लड़ी और घावों से मर गए।"
    },
    {
        "subject": "Rajasthan History",
        "topic": "Kumbhalgarh Fort",
        "question_en": "Who was the founder of the Kumbhalgarh Fort?",
        "question_hi": "कूंभलगढ़ किले के संस्थापक कौन थे?",
        "A_en": "Rana Kumbha",
        "A_hi": "राणा कुंभा",
        "B_en": "Rana Sangram Singh",
        "B_hi": "राणा संग्राम सिंह",
        "C_en": "Rana Pratap",
        "C_hi": "राणा प्रताप",
        "D_en": "Raja Man Singh",
        "D_hi": "राजा मान सिंह",
        "answer": "A",
        "explanation_en": "Rana Kumbha founded the Kumbhalgarh Fort in the 15th century.",
        "explanation_hi": "राणा कुंभा ने 15वीं शताब्दी में कूंभलगढ़ किले की स्थापना की।"
    }
]