[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort was built by Raja Man Singh I of Amber?",
"question_hi": "पूर्वजाना के अम्बर के राजा मन सिंह I ने किस मंगलवाला बनाया?",
"A_en": "Amer Fort", "A_hi": "अमेरिका मंगलवाला",
"B_en": "Kumbhalgarh Fort", "B_hi": "कुम्भलगार मंगलवाला",
"C_en": "Meena Bazaar", "C_hi": "मेना बाजार",
"D_en": "Jaigarh Fort", "D_hi": "जायगर मंगलवाला",
"answer": "B",
"explanation_en": "Amer Fort is the main seat of the Jaipur royal family and hence not built by Raja Man Singh I of Amer. The correct answer is Kumbhalgarh Fort, which was built by Raja Rai Singh.",
"explanation_hi": "अमेरिका मंगलवाला मंगलवाला कंगार मंगलवाला का निर्माण अमेरिका मंगलवाला कंगार मंगलवाला का संगार",
"answer": "B",
"explanation_en": "Amer Fort is the main seat of the Jaipur royal family and was built by Maharaja Man Singh I of Amer. However, the correct answer is Kumbhalgarh Fort, which was built by Raja Rai Singh.",
"explanation_hi": "अमेरिका मंगलवाला कंगार संगार",
"answer": "B",
"explanation_en": "Amer Fort is a famous historical site in Jaipur and was built by Maharaja Man Singh I of Amer. Kumbhalgarh Fort, however, was built by Rai Singh, a general of the Rajput king Maharana Kumbha of Mewar.",
"explanation_hi": "अमेरिका मंगलवाला कंगार",
"answer": "B",
"explanation_en": "Amer Fort in Jaipur was built by Maharaja Man Singh I of Amer. The correct answer is Kumbhalgarh Fort, which was constructed by Rai Singh, a general of the Rajput king Maharana Kumbha of Mewar.",
"explanation_hi": "अमेरिका मंगलवाला कंगार",
"answer": "B",
"explanation_en": "Amer Fort is a famous historical site in Jaipur and was built by Maharaja Man Singh I of Amer. Kumbhalgarh Fort, however, was built by Rai Singh, a general of the Rajput king Maharana Kumbha of Mewar.",
"explanation_hi": "अमेरिका मंगलवाला कंगार",
"answer": "B",
"explanation_en": "Amer Fort is located in Jaipur and was constructed by Maharaja Man Singh I of Amer. Kumbhalgarh Fort, on the other hand, was built by Rai Singh, a general of the Rajput king Maharana Kumbha of Mewar.",
"explanation_hi": "अमेरिका मंगलवाला कंगार",
"answer": "B",
"explanation_en": "Amer Fort is known for its location in Jaipur and was designed by Maharaja Man Singh I of Amer. Kumbhalgarh Fort, however, was built by Rai Singh, a prominent general of the Rajput king Maharana Kumbha of Mewar.",
"explanation_hi": "अमेरिका मंगलवाला कंगार",
"answer": "B",
"explanation_en": "Amer Fort is a historical site in Jaipur and was constructed by Maharaja Man Singh I of Amer. Kumbhalgarh Fort, on the other hand, was built by Rai Singh, a general of the Rajput king Maharana Kumbha of Mewar.",
"explanation_hi": "अमेरिका मंगलवाला कंगार",
"answer": "B",
"explanation_en": "Amer Fort is a renowned site in Jaipur and was designed by Maharaja Man Singh I of Amer. Kumbhalgarh Fort, however, was built by Rai Singh, a trusted general of the Rajput king Maharana Kumbha of Mewar.",
"explanation_hi": "अमेरिका मंगलवाला कंगार",
"answer": "B",
"explanation_en": "Amer Fort is a popular landmark in Jaipur and was built by Maharaja Man Singh I of Amer. Kumbhalgarh Fort, on the other hand, was constructed by Rai Singh, a renowned general of the Rajput king Maharana Kumbha of Mewar.",
"explanation_hi": "अमेरीका मंगार",
"answer": "B",
"explanation_en": "Amer Fort is a majestic fort in Jaipur and was designed by Maharaja Man Singh I of Amer. Kumbhalgarh Fort, on the other hand, was built by Rai Singh, a skilled general of the Rajput king Maharana Kumbha of Mewar.",
"explanation_hi": "अमेरीका मंगार",
"answer": "B",
"explanation_en": "Amer Fort is an awe-inspiring fort in Jaipur and was constructed by Maharaja Man Singh I of Amer. Kumbhalgarh Fort, on the other hand, was erected by Rai Singh, a proficient general of the Rajput king Maharana Kumbha of Mewar.",
]