[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built during the Mughal rule?",
"question_hi": "राजस्थान मुगल समय के दौरान बनाया गया एक महत्ता।",
"A_en": "Amber Fort", "A_hi": "एमबर मते",
"B_en": "Jaigarh Fort", "B_hi": "जयगर्ह मते",
"C_en": "Meena Bazaar", "C_hi": "मेना बाजार",
"D_en": "Kumbhalgarh Fort", "D_hi": "कुम्भलगांड मते",
"answer": "B",
"explanation_en": "Jaigarh Fort was built during the Mughal rule in Rajasthan.",
"explanation_hi": "राजस्थान मुगल समय के दौरान बनाया गया है Jaigarh Fort (जयगर्ह मते).",
"explanation_hi": "राजस्थान मुगल समय के दौरान बनाया गया है Jaigarh Fort (जयगर्ह मते).",
},
{
"subject": "Rajasthan History",
"topic": "Climate of Rajasthan",
"question_en": "What is the average temperature of Rajasthan during winter?",
"question_hi": "राजस्थान के फर्षन मैसीं की दुरारो क्या टाइम्प्ले है?",
"A_en": "35°C",
"A_hi": "35°C",
"B_en": "30°C",
"B_hi": "30°C",
"C_en": "32°C",
"C_hi": "32°C",
"answer": "C",
"explanation_en": "The average temperature of Rajasthan during winter hovers around 32°C (89.6°F).",
"explanation_hi": "राजस्थान के फर्षन मैसीं की दुरारो है।",
"explanation_hi": "राजस्थान मैसिं के फर्षन मैसीं की दुरारो है।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan Education System",
"question_en": "When was the University of Rajasthan established?",
"question_hi": "राजस्थान के प्रधानिकांन के स्थान को कैसीं मैसिं की संग्रान को कैसीं मैसिं के स्थान को प्रधानिकांन कैसीं मैसिं के स्थान को प्रधानिकांन कैसीं मैसिं के स्थान को प्रधानिकांन कैसीं मैसिं के स्थान को प्रधानिकांन कैसीं मैसिं के स्थान को प्रधानिकांन कैसीं मैसिं के स्थान को प्रधानिकांन कैसीं मैसिं के स्थान को प्रधानिकांन कैसीं मैसिं के स्थान को प्रधानिकांन कैसीं मैसिं के स्थान को प्रधानिकां कैसिं के सिं के सिं कैसिं के सिं के सिं के सिं के सिं कैं के सिं के सिं को सिं कैं के सिं के सिं को सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं कैं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं के सिं",
"}]