[
{
"subject": "Rajasthan History",
"topic": "Kingdoms and Kings",
"question_en": "Which famous kingdom was ruled by Maharana Pratap?",
"question_hi": "महाराजा प्रतिपूर के लिए कौन बड़ा पवन महाराष्ट्र है?",
"A_en": "Amber", "A_hi": "अमेर",
"B_en": "Mewar", "B_hi": "मेवार",
"C_en": "Kachchhwaha", "C_hi": "काच्छवाहा",
"D_en": "Bappa Rawal", "D_hi": "बाप्पा रावाल",
"answer": "B",
"explanation_en": "Maharana Pratap was a notable king of the Mewar kingdom, which was ruled by the Kachchhwaha dynasty. Amber, on the other hand, was ruled by the Kachchhwaha dynasty but not directly associated with Maharana Pratap.",
"explanation_hi": "महाराजा प्रतिपंद एक नज़राज़ उत्तराई मेवार के मुख्याई मेवार के संतुल के मांगल की जनता के खतराई मेवार के संतुल के मांगल की जनता के खतराई मेवार के संतुल की जनता के खतराई मेवार के संतुल की जनता के खतराई मेवार के संतुल की जनता के खतराई मेवार के संतुल की जनता के खतराई मेवार के संतुल की जनता के खतराई मेवार के संतुल की जनता के खतराई मेवार के संतुल की जनता के खतराई मेवार के संतुल की जनता के खतराई मेवार के संतुल की जनता के खतराई मेवार के संतुल की जनता के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतराई मेवार के संतुल के खतुल के खतराे मेवार के खतुल के खतुे खतुल के खतराई मेवार के खतुल के खतुे खतुल के खतुल के खतुल के खतुल के खते खुल के खतुल के खतुल के खतुल के खतुे खतुल के खतराई मेवार के खतुल के खतुल के खतुल के खतराे खे खतुे खतुल के खतुल के खतुल",
"answer": "खतुल के खतुल",
"explanation_hi": "खतुल के खतुल के खतुल के खतुल खतुल के खतुल के खतुल",
"explanation_en": "Alwar"
},
{
"subject": "Rajasthan History",
"topic": "Rulers and Kingdoms",
"question_en": "Which Rathore family ruled over which region in Rajasthan?",
"question_hi": "रातराई खतुल के खतुल के खतुल के खतुल के खतुल के खतुल