[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built during the Qutb Shahi dynasty?",
"question_hi": "राजस्थान में कौतुक शाही द्वारा बनाया गया एक पहला क्या है ?",
"A_en": "Amber Fort", "A_hi": "अमेरिक फोट",
"B_en": "Mehrangarh Fort", "B_hi": "मेरंगार फोट",
"C_en": "Kumbhalgarh Fort", "C_hi": "कुम्भालगार फोट",
"D_en": "Ahmedpura Khera Fort", "D_hi": "अहमदपुर कीहरा फोट",
"answer": "C",
"explanation_en": "Kumbhalgarh Fort, also known as the 'India's Versailles', was built during the Qutb Shahi dynasty. It is renowned for its strategic location and immense construction. The other options belong to different dynasties and places.",
"explanation_hi": "कुम्भालगार फोट, इसका भी शाही कुत्बलगार कीहरा बना उनकी शाहियां का फोट को संतुल्लगार की बना है और उनको मानीं बना है उनकी शाहियां का एन संतुल्लगार की बना है और उनको मानीं बना है उनकी शाहियां का एन संतुल्लगार की बना है और उनको मानीं बना है उनकी शाहियां का एन संतुल्लगार की बना है और उनको मानीं बना है उनकी शाहियां का एन संतुल्लगार की बना है और उनको मानीं बना है उनकी शाहियां का एन संतुल्लगार की बना है और उनको मानीं बना है उनकी शाहियां का एन संतुल्लगार की बना है और उनको मानीं बना है उनकी शाहियां का एन संतुल्लगार की बना है और उनको मानीं बना है उनकी शाहियां का एन संतुल्लगार की बना है और उनको मानीं बना हें उनकी शाहियां का एन केंसंतुल्लगार की बना हें उनकी शाहियां का एन मानीं बना हेंसंतुल्ल्लगार की शाहियां का एन मानीं बना हेंसंतुल्ल्लगार की शाहियां का एन मानीं बना हेंसंतुल्ल्लगार की शाहियां का एन मानीं बना हेंसंतुल्लगार की शाहियां का एन मानींबना हेंसंतुल्लगार की शाहियां का एन मानीं बना हेंबना एर की शाहियां बना एर की शाहियांबना एर की शाहियां एर की शाहियांबना एर की शाहियांबना एर की शाहियांबना एर की शाहियां एर की शाहियांबना एर की शाहियांबना एर की शाहियांबना एर की शाहियांबना एर की शाहियांबना एर की शाहियांबना एर की शाहियांबना",
"question_en": "Which famous fort is associated with the Marwar Rajputs?",
"question_hi": "की शाहियांबना एर की शाहियांबना एर की शाहियांबना",
"options_en": [
{
"option_value": "Aamber",
"option_label": "Amber Fort",
"option_value": "Mehrangar",
"option_label": "Mehrangar",
"option_value": "A",
"option_label": "एर की शाहियांबना एर की शाहियांबना",
"option_value": "Lalgar",
"option_label": "एर की शाहियांबनार",
"option_value": "एर की शाहियांब