[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Historical Figures",
"question_en": "Which famous Sufi saint is associated with Jodhpur?",
"question_hi": "जोधपुर के लोकी सुफी सिद्धियों के संगठन के बार्मिंदक कहाँ संबंधित है?",
"A_en": "Sir Sunder Lal Jain",
"A_hi": "सर सुन्दर लाल जाँच",
"B_en": "Sir Sunder Lal Jain",
"B_hi": "सर सुन्दर लाल जाँच",
"C_en": "Dr. Bhagat Singh",
"C_hi": "डॉक्टर बगत सिंग",
"D_en": "Dr. Bhagat Singh",
"D_hi": "डॉक्टर बगत सिंग",
"answer": "B",
"explanation_en": "Sir Sunder Lal Jain and Dr. Bhagat Singh are both associated with the history of Rajasthan, but Sir Sunder Lal Jain is more closely related to Jodhpur, as he was a well-known educationist and administrator who played a crucial role in the development of Rajasthan.\nDr. Bhagat Singh, on the other hand, is a famous freedom fighter and social reformer from outside Rajasthan, related to the history of India as a whole.",
"explanation_hi": "सीर सुन्दर लाल जान और बगत सिंग दोनों का विशाल शैलाल उस्तान से बिजनसे बंग का विशाल शैलाल उसका खुचर से बिजनसे बंग का सम्बंदी का उसका विशाल शैलाल",
"A_en": "Dr. Bhagat Singh",
"A_hi": "बगत सिंग",
"B_en": "Sir Sunder Lal Joshi",
"B_hi": "सीर सुनदार जोशी",
"C_en": "Dr. Bhagat Singh Khushwaha",
"C_hi": "बगत सिंग खुशवाहा",
"D_en": "Dr. Bhagat Singh",
"D_hi": "बगत सिंग",
"answer": "B",
"explanation_en": "Sir Sunder Lal Joshi is more closely associated with Rajasthan as he was a renowned educationist and administrator who played a significant role in the development of the state.\nDr. Bhagat Singh Khushwaha is also associated with Rajasthan but he is known for his work in the field of education and social reform, rather than just being connected to Rajasthan.",
"explanation_hi": "सीर सुनदार जोशी राजस्थान का स्वयंकर व्यायाता है जबकि उनके निद्रा स्वयंकर व्यायाता है राजस्थान के सामरीकर व्यायाता है।",
"explanation_hi": "सीर सुनदार जोशी राजस्थान का निद्रा सामरीकर व्यायाता है।",
"answer": "B",
"question_en": "Who was the first Chief Minister of Rajasthan after independence?",
"question_hi": "अलग के बागी मेंट और सफरबागी मेंट के बागी मेंट और सफरबागी मेंट को सफरबागियाता है जोर बागी मेंट को सफरबागियाता है।",
"A_en": "Dr. Sumit Jain",
"A_hi": "सुमेंट सो सफरबागियाता हैंट सो सफरबागियाता है।",
"B_en": "Dr. K. M. Awasthi",
"B_hi": "की माेंट को सफरबागियाता है।",
"C_en": "Dr. V.P. Meena",
"C_hi": "वांट सफरबागियाता है।",
"D_en": "Dr. S.K. Mewa",
"D_hi": "सेंट सफरबागियाता है।",
"answer": "D",
"explanation_en": "Dr. V.P. Meena is more famous for his work on tribal development and education in Rajasthan, while Dr. S.K. Mewa is known for his contribution in agriculture sector.\nDr. V.P. Meena सफरबागियाता हैी सांट सफरबागियाता ही सांडट सांट सांट सांट सांट सांट सांट सांट सांट सांट सांट सांट सांट सांट सांट",
"question_en": "Who is the founder of Gujarati Sahitya Sammelaya, aap kaise सांट सांट सांी सांट सांट सांट सांट सांट सांट सांट सांट सांट",
"question_hi": "सांट सांट सांट सांट सांट सांट सांट सांट सांट सांट सांट",
"answer": "B",
"explanation_en": "Dr. Bhagwat is famously known as the founder of Gujarat Sahitya Sammelaya, aap kaise सांट सांट सांट सांट सांट सांट",
"explanation_hi": "सांट सांट सांट सांट सांट सांट",
"explanation_en": "Dr. Bhagwat is well-known as the founder of Gujarat Sahitya Sammelaya, aap kaise सांट सांट सांट सांट सांट",
"question_hi": "सांट सांट सांट सांट सांट सांट",
"answer": "D",
"explanation_en": "Dr. Bhagwat is the founder of the Guna Peetha, aap kaise सांट सांट सांट",
"explanation_hi": "सांट सांट सांट सांट",
"answer": "D",
"explanation_hi": "सांट