[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and History",
"question_en": "Which historical battle took place between the Mughal Emperor Akbar and Maharana Pratap? ",
"question_hi": "मगही मुख्यालयकोणी अकबर और महाराणा प्रतिप के बीच कब हुई एक परिचयक महंगी? ",
"A_en": "Battle of Haldighat",
"A_hi": "हैल्डिगट महंगी",
"B_en": "Battle of Deeg",
"B_hi": "डेग महंगी",
"C_en": "Battle of Khanwa",
"C_hi": "कहनवा महंगी",
"D_en": "Battle of Mewar",
"D_hi": "मेवा महंगी",
"answer": "C",
"explanation_en": "The Battle of Khanwa took place between Maharana Pratap and Akbar in 1576. It was a significant battle in Indian history.",
"explanation_hi": "महाराणा प्रतिप और अकबर के बेड़ी में 1576 में बैल के बेड़ी में अरस से हुए राजधाना में समुद्र बेड़ी में 1576 में महाराणा प्रतिप के बेड़ियाँ में अरस से हिले राजधाना में 1576 में महाराणा प्रतिप के बेड़ियाँ में अरस से हिले राजधाना में 1576 में महाराणा प्रतिप के बेड़ियाँ में अरस से हिले राजधाना में 1576 में महाराणा प्रतिप के बेड़ियाँ में अरस से हिले राजधाना में 1576 में महाराणा प्रतिप के बेड़ियाँ में अरस से हिले राजधाना में 1576 में महाराणा प्रतिप के बेड़ियाँ में अरस से हिले राजधाना में 1576 में महाराणा प्रतिप के बेड़ियाँ में अरस से हिले राजधाना में 1576 में महाराणा प्रतिप के बेड़ियाँ में अरस से हिलें राजधाना में 1576 में महाराणा प्रतिप के बेड़ियाँ में अरस से हिलें राजधाना में 1576 में महाराणा प्रतिप के बेड़ियाँ में अरस से हिलें राजधाना में 1576 में महाराणा प्रतिप के बियाँ में अरस सिलें राजधाना महाराणा प्रतिप के बें अरस सिलें राजधाना में 1576 में राजधाना में अराणा प्रतिप के बें अरस सिलें राजधाना में 1576 में राजधाना प्र",
	",
",  अराणा में अराजधाना में 1576 अराजधाना पराजधाना में राजधाना में 1576 अराजधाना प्राजधाना में 1576 अराजधाना में राजधाना में राजधाना में 1576 अराजधाना में राजधाना मे 1576 अराजधाना में राजधाना में 1”,
",
"answer": "अ",
"explanation_en": "The Battle of Haldighat took place between Maharana Pratap and Akbar in 1576 अराजधाना में राजधाना मे राजधाना मे राजधाना में",
"explanation_hi": "में राजधाना मे राजधाना में 1576 अराजधाना में राजधाना में राजधाना में 1",
",
] अराजधाना में राजधाना में 1576 अराजधाना में राजधाना में राजधाना में",
",
"answer_hi": "अ",
] अराजधा