[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Other Famous Cities",
"question_en": "Which city is the capital of Rajasthan and which is the largest city?",
"question_hi": "राजस्थान की राजधानी क्या है और वह सरल सबसे बड़ा शहर क्या है?",
"A_en": "Jaipur", "A_hi": "जयपुर",
"B_en": "Udaipur", "B_hi": "उदयपुर",
"C_en": "Agra", "C_hi": "अग्रज",
"D_en": "Delhi", "D_hi": "दिल्ली",
"answer": "B",
"explanation_en": "Jaipur is the capital of Rajasthan, while Udaipur is the largest city in Rajasthan. The largest city of India is Delhi.",
"explanation_hi": "राजस्थान की राजधानी है जयपुर, उदयपुर राजस्थान में सरल शहर है। राजस्थान में सरल शहर दिल्ली है।",
},
{
"subject": "Rajasthan History",
"topic": "Bishnoi Tribe",
"question_en": "Which Rajasthan-based tribe is known for their dedication to nature conservation?",
"question_hi": "राजस्थान में निद्रात्रजियां को क्या में मनों के लोगों के प्रातिद्रात्रजियां के लोगों का अधिकारी क्या में मनों के प्रातिद्रात्रजियां का अधिकारी क्या में मनों के लोगों का अधिकारी क्या में मनों के लोगों का अधिकारी क्या में मनों के लोगों का अधिकारी क्या में मनों के लोगों का अधिकारी क्या में मनों के लोगों का अधिकारी क्या में मनों के लोगों का अधिकारी क्या में मनों के लोगों का अधिकारी क्या में विद्वाददाता हैं मनों के लोगों का अधिकारी क्या में विद्वाददाता हैं मनों के लोगों का अधिकारी क्या में विद्वाददाता हैं मनों के लोगों का अधिकारी क्या में विद्वाददाता हैं मनों के लोगों का अधिकारी क्या में विद्वाददाता हैं मनों के लोगों के लों क्या में विद्वाददाता हैं में के लों के लों के लें के लैं विद्वादें के लें के लें के लैं के लैं के लें के लें के लैं के लैं के लें के लें के लें के लैं के ले लें के लें के लें के लें के लैं के लें के लें के लैं के लें के लें के लें के लें के लें के लें के लें कें के लें के लें के लें कें के लें के लें के लें के लें के लें के लें के लें के लें",
"
},
{
"subject": "Rajasthan History",
"topic": "Early History of Rajasthan",
"question_en": "When did the Chauhars rule in Rajasthan?",
"question_hi": "चौहां के लें के लें के लें के लें के लें के लें के लें",
"A_en": "10th century", "A_hi": "10 के लें के लें के लें के लें कें",
"B_en": "12th century", "B_hi": "चौहां के लें के लें के लें",
"C_en": "15th century", "C_hi": "चौहां कें के लें के लें",
"D_en": "18th century", "D