[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Famous Places",
"question_en": "What is the capital of Rajasthan and which important places are associated with it?",
"question_hi": "राजस्थान की राजधानी और इसके महत्वपूर्ण स्थानों का विवेकां क्या हैं?",
"A_en": "Jaipur, Udaipur, Jodhpur, Bikaner, and Jaisalmer",
"A_hi": "जयपुर, उदयपुर, जोधपुर, बिकानेर, aur जयसालमंसम्बनी",
"B_en": "Jaipur, Udaipur, Jodhpur, Bikaner, and Ajmer",
"B_hi": "जयपुर, उदयपुर, जोधपुर, बिकानेर, और Ajmer",
"C_en": "Jaipur, Udaipur, Jodhpur, Bikaner, and Jaisalmer",
"C_hi": "जयपुर, उदयपुर, जोधपुर, बिकानेर, और Jaisalmer",
"D_en": "Jaipur, Jodhpur, Bikaner, Ajmer, and Chittor",
"D_hi": "जयपुर, जोधपुर, बिकानेर, अजमेर, aur Chittor",
"answer": "D",
"explanation_en": "Among the given options, Jaipur, Jodhpur, and Bikaner are the cities in Rajasthan while Ajmer and Chittor are also important historical places in Rajasthan.",
"explanation_hi": "देखा वर्षियों को दों के लिए हैं - Jaipur, जोधपुर, बिकानेर, अजमेर, और Chittor हैं। Ajmer और Chittor के लीने में हैं हिस्टोरियां, अज्ञान और Chittor को स्टोरियों में हिस्टोरियां को स्टोरियां में हिस्टोरी और Chittorgarh को स्टोरियां में हिस्टोरियां को स्टोरियां में हिस्टोरी और Chittorgarh को स्टोरियां में हिस्टोरी को स्टोरियां में हिस्टोरियां को स्टोरियां में हिस्टोरी और Chittorgarh को स्टोरियां में हिस्टोरियां को स्टोरियां में हिस्टोरियां में हिस्टोरियां को स्टोरियां में हिस्टोरियां में हिस्टोरियां को स्टोरियां में हिस्टोरियां में हिस्टोरियां को स्टोरियां में हिस्टोरियां को स्टोरियां को स्टोरियां को सटोरियां को स्टोरियां को स्टोरियां को स्टोरियां को स्टोरियां को स्टोरियां को स्टोरियां को स्टोरियां को स्टोरियां को स्टोरियां को सटोरियां को स्टोरियां को स्टोरियां को सटोरियां को स्टोरियां क्टोरियां क्टो",
",
"explanation_en": "The capital of Rajasthan is Jaipur, and the options provided are the famous cities and historical places in Rajasthan. Jaipur, Udaipur, Jodhpur, Bikaner, Ajmer, Chittor, and Chittorgarh are important cities and places in Rajasthan.",
"explanation_hi": "राजन्टोरियां क्टोरियां क्टोरियां क्टोरियां क्टोरियां क्टोरियां क्टोरियां क्टोरियां क्टोरियां क्टोरियां क्टोरियां क्टोरियां क्टोरियां क्ट्टोरियां क्ट्टोरियां क्टोरियां क्ट्टोरियां क्ट्ट्टोरियां क्ट्ट्ट्ट्ट्ट्ट्ट्ट्ट्ट्टरियां क्ट्ट्ट्ट्ट्टट्ट्ट्ट्ट्ट्ट्ट्ट्ट्