[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous forts of Rajasthan were built during the Mughal period?",
"question_hi": "राजस्थान मुग्ल समय के दिनों में बनी कई मंगलवाली किस कलाक्षतियाँ से जाना जाना चाहिए।",
"A_en": "Amber Fort, Mehrangarh Fort",
"A_hi": "एमबीर कलाक्षति, मेरंगर कलाक्षति",
"B_en": "Kumbhalgarh Fort, Udaipur City",
"B_hi": "कुम्भलगढ़ कलाक्षति, उदायपुर शहती",
"C_en": "Jaipur Fort (Hawa Mahal), Jaisalmer Fort",
"C_hi": "जयपुर कलाकलवालगढ़, जयंती",
"D_en": "Chittorgarh Fort, Mount Abu",
"D_hi": "चीटरगंगा कलाक्षति, मोट अबु",
"answer": "A",
"explanation_en": "Among the given options, Amber Fort (Hawa Mahal) and Jaisalmer Fort are famous forts built during the Mughal era in Rajasthan.",
"explanation_hi": "दीवालगें कलाकलाक्षति और जैसालमे कलाकलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति और जैसालमे कलाक्षति",

"
"D_en": "Jaipur",
"D_hi": "जैसाले क्षति और जैसालमे कलाक्षति",
"question_en": "Which historical city was founded by Rawal Jaisal Singh?",
"question_hi": "रावाले कलाक्षति जैसालमे कलाक्षति जैसालमे क्षति",
"answer": "Jaisal Singh",
"explanation_en": "Rawal Jaisal Singh was a famous Rajput king who founded the city of Jaipur.",
"explanation_hi": "रावाले जैसाले कलाक्षति जैसालमे कलाक्षति",
"explanation_hi": "जैसाले कलाक्षति जैसाले क्षति जैसाले कलाक्षति",
"explanation_en": "Jaisal Singh founded Jaipur in जैसाले कलाक्षति",
"explanation_hi": "जैसाले कलाक्षति जैसाले कलाक्षति ",
"explanation_hi": "जै