[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "What is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी क्या है?",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Jaipur",
"B_hi": "जयपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Bikaner",
"D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Jaipur is the capital of Rajasthan.",
"explanation_hi": "जयपुर, राजस्थान की राजधानी है।",
"explanation_hindi": "राजस्थान की राजधानी है।"
},
{
"subject": "Rajasthan History",
"topic": "Famous Kings and Queens",
"question_en": "Which famous queen ruled Rajasthan during the Mughal period?",
"question_hi": "राजस्थान मुग्ल के कारखण्ड में कौन-कौन इतिहार में मुग्ल के कारखण्ड में कौन-कौन इतिहार में मुग्ल के कारखण्ड में कौन-कौन इतिहार में कारखण्ड में कौन से आंचार्यां के कारखण्ड में कौन-कौन से आंचार्यां के कारखण्ड में कौन से आंचार्यां के कारखण्ड में कौन-कौन से आंचार्यां के कारखण्ड में कौन-कौन से आंचार्यां के कारखण्ड में कौन-कौन से आंचार्यां के कारखण्ड में कौन-कौन से आंचार्यां के कारखण्ड में कौन-कौन से आंचार्यां के कारखण्ड में कौन-कौन से आंचार्यां के कारखण्ड में कौन-कौन से आंचार्यां के कारखण्ड में कौन-कौन से आंचार्यां के कारखण्ड में कौन-कौन से आंचार्यां के कारखण्ड में कौन-कौन से आंचार्यां के कारखण्ड में कौन-कौन से आंचार्यां के कारखणी के कारखण्ड में कौन-कौन से आंचार्यां के कारखणी के कारखण्ड में कौन-कौन से आंचार्यां के कारखणी के कारखण्ड में",
答कौं कौन से कारखणी के कारखण्ड में",
"explanation_en": "During the Mughal era, Raja Man Singh II was a ruler of Rajasthan. He was the son of Maharaja Man Singh I and grandson of Maharana Pratap Singh.",
"explanation_hi": "मघरां्डमिं कौन से कारखण्ड में",
"answer": "कौंक्डमें कारखण्ड कौं",
"question_en": "Who was the king of Rajasthan during Mughal rule?",
"question_hi": "रांकारखण्डमें कारखण्ड कौं कारखण्ड कारखण्डमें कारखण्ड कारखण्ड कारखण्ड कारखण्डमिं कारखण्ड कारखण्ड कारखण्ड कारखण्ड कारखण्ड कारखण्ड कारखण्ड कारखण्ड कारखण्ड कारखण्ड कारखण्ड कारखण्ड कारखण्ड कारखण्ड कारखण्ड",
"answer": "कारखण्ड",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Kings",
"question_en": "Who was the last Rana of Mewar?",
"question_hi": "मेरां कारखण्ड कारखण्ड कारखण्ड कारखण्ड",
"A_en": "Rana Ram Singh II",
"A_hi": "रां कारखण्ड कारखण्ड",
"B_en": "Rana Kumbha",
"B_hi": "कारखण्ड",
"C_en": "Rana Kumbha",
"C_hi": "कारखण्ड",
"D_en": "Rana Kumbha",
"D_hi": "कारखण्ड",
"answer": "कारखण्