<think>
Okay, let's tackle this task. The user wants me to create 10 high-quality MCQs on Rajasthan History for various exams like LDC, CET, RAS, SSC, and Railway. The instructions specify that each question and options should be in both Hindi and English, following the Testbook style. The JSON format is strict, and I need to make sure I don't add any extra text or explanations beyond the JSON array.

First, I need to choose 10 relevant topics from Rajasthan History. Let's brainstorm some key areas: ancient kingdoms, famous rulers, historical events, important cities, monuments, cultural aspects, religious sites, and administrative changes. 

Starting with the first question, maybe the oldest known city in Rajasthan. I know that Kalibanga is a significant archaeological site. The options could include Bikaner, Chittorgarh, and Jaisalmer. The answer would be A, Kalibanga.

Next, the founder of the Sisodiya dynasty. Rana Sanga is a notable figure, so the options might be Rana Sanga, Rana Pratap, Raja Man Singh, and Maharana Pratap. The correct answer here is B, Rana Sanga.

Third question could be about the ruler who defeated the Mughal Empire at Haldighati. Rana Pratap is the correct answer here. The options would include Rana Sanga, Maharana Pratap, Raja Man Singh, and Raja Bhoj. Answer is B again.

Fourth, the capital of the Maurya Empire in Rajasthan. Ujjain wasn't in Rajasthan, so maybe Pushkar? Wait, Pushkar is more religious. The Mauryan capital might be Pataliputra, but Rajasthan's capital during Mauryan times was Ujjain? Hmm, perhaps the question is about the capital of a specific region in Rajasthan during a certain period. Maybe Chittorgarh during the Chauhan dynasty? Wait, the user might be referring to a different period. Let me verify. The Mauryan Empire's capital was Pataliputra (Patna), but in Rajasthan, the capital of the Mauryan administration might have been a different city. Maybe it's a trick question. Alternatively, perhaps the question is about the capital of a kingdom in Rajasthan during the Maurya period. Let me check: The Mauryan Empire included parts of Rajasthan, but the administrative center might not be a specific city in Rajasthan. Maybe the question is about the capital of the region that is now Rajasthan during the Maurya period. Since the Mauryan Empire's capital was in Bihar, but Rajasthan's cities like Ujjain were important. Wait, Ujjain is in Madhya Pradesh. So perhaps the answer is Chittorgarh? No, Chittorgarh became important later. Maybe the answer is Jalore? Hmm, this is getting confusing. Let me rephrase the question to avoid confusion. Instead of Maurya Empire, maybe a different dynasty. Alternatively, maybe the question is about the capital of the Rajput kingdoms in Rajasthan. But the user specified Maurya Empire. Let me think again. The Mauryan Empire's capital was Pataliputra, and Rajasthan was part of their territory. The administrative center in Rajasthan might not have been a single city. Maybe the question is incorrect. Alternatively, perhaps the intended answer is Ujjain, but that's in MP. Maybe the user intended a different answer. Alternatively, maybe the question is about the capital of the Mauryan Empire in Rajasthan, but the correct answer is Pataliputra. Wait, that doesn't make sense. Maybe the question is a trick question. Alternatively, perhaps the user made a mistake, but I have to proceed. Let me adjust the question. Let's find a better topic. How about the capital of the Rajput kingdom in Rajasthan during the medieval period? For example, Chittorgarh was a capital for the Chauhans. So the question could be about the capital of the Chauhan dynasty, and the answer is Chittorgarh. That makes more sense. So question 4 would be about the capital of the Chauhan dynasty, answer is Chittorgarh. Options could include Jalore, Chittorgarh, Jaisalmer, Bikaner. Answer is B.

Fifth question: The founder of the Mewar kingdom. Rana Sanga is a possible answer, but the original founder might be Bappa Rawal. Let me confirm. The Sisodiya dynasty in Mewar was founded by Bappa Rawal, so the answer is A. The options would be Bappa Rawal, Rana Sanga, Rana Pratap, Maharana Pratap. Answer is A.

Sixth question: The ruler who defeated the combined forces of the Rajput kings at the Battle of Haldighati. The correct answer is Akbar. The options would include Akbar, Rana Pratap, Rana Sanga, Raja Man Singh. So answer is A.

Seventh question: The historical site where the earliest known human settlements in Rajasthan were found. Kalibanga is the correct answer. Options could include Bhanbhore, Dholavira, Kalibanga, Lothal. Answer is C.

Eighth question: The ruler who shifted the capital from Chittorgarh to Udaipur. Rana Udai Singh II did this. Options include Rana Kumbha, Rana Udai Singh II, Rana Pratap, Maharana Pratap. Answer is B.

Ninth question: The famous temple in Jodhpur dedicated to Lord Shiva. The answer is Ghanerao Temple. Options: Ghanerao Temple, Jaswant Thada, Mehrangarh Fort, Umaid Bhawan Palace. Answer is A.

Tenth question: The historical city known as the "City of Mirrors." Udaipur is famous for its marble palaces and is called the City of Lakes, but sometimes it's referred to as the City of Mirrors. Wait, actually, Udaipur is known as the City of Lakes, while Jaisalmer is called the Golden City. Maybe the question is about a different city. Alternatively, the City of Mirrors might refer to Udaipur's use of marble. Let me confirm. Udaipur is often called the City of Lakes (Shiv Dutt Singh's nickname), but the City of Mirrors could be another term. Alternatively, maybe the question is incorrect. Alternatively, the answer is Udaipur. So the options would include Udaipur, Jaisalmer, Jodhpur, Bikaner. Answer is A.

Now, I need to structure each question in JSON with the required fields, ensuring the Hindi and English questions and options are present, the answer is correct, and explanations are accurate. I also need to check the difficulty level for Rajasthan exams, which might require some depth but not too obscure. Finally, ensure the JSON is properly formatted without any syntax errors.
</think>

[
{
"subject": "Rajasthan History",
"topic": "Ancient Kingdoms",
"question_en": "Which city is considered the oldest known city in Rajasthan?",
"question_hi": "राजस्थान में सबसे पुराने शहर के रूप में किस शहर को माना जाता है?",
"A_en": "Kalibanga", "A_hi": "कलिबंगा",
"B_en": "Bikaner", "B_hi": "बीकानेर",
"C_en": "Chittorgarh", "C_hi": "चित्तौड़गढ़",
"D_en": "Jaisalmer", "D_hi": "जैसलमेर",
"answer": "A",
"explanation_en": "Kalibanga, an archaeological site, is recognized as one of the oldest cities in Rajasthan dating back to the Indus Valley Civilization.",
"explanation_hi": "कलिबंगा, एक पुरातात्विक स्थल, सिंधु घाटी सभ्यता में राजस्थान के सबसे पुराने शहर में से एक माना जाता है।"
},
{
"subject": "Rajasthan History",
"topic": "Medieval Rulers",
"question_en": "Who founded the Sisodiya dynasty in Rajasthan?",
"question_hi": "राजस्थान में सिसोदिया वंश स्थापित करने वाला कौन था?",
"A_en": "Rana Sanga", "A_hi": "राणा सांगा",
"B_en": "Rana Sanga", "B_hi": "राणा सांगा",
"C_en": "Rana Pratap", "C_hi": "राणा प्रताप",
"D_en": "Maharana Pratap", "D_hi": "महाराणा प्रताप",
"answer": "B",
"explanation_en": "Rana Sanga is credited with establishing the Sisodiya dynasty in the 15th century.",
"explanation_hi": "15वीं शताब्दी में राणा सांगा के द्वारा सिसोदिया वंश की स्थापना की गई थी।"
},
{
"subject": "Rajasthan History",
"topic": "Battle of Haldighati",
"question_en": "Which ruler defeated the Mughal Empire at the Battle of Haldighati?",
"question_hi": "हल्दीघाटी के युद्ध में मुगल साम्राज्य किस शासक द्वारा पराजित किया गया था?",
"A_en": "Rana Sanga", "A_hi": "राणा सांगा",
"B_en": "Maharana Pratap", "B_hi": "महाराणा प्रताप",
"C_en": "Raja Man Singh", "C_hi": "राजा मान सिंह",
"D_en": "Raja Bhoj", "D_hi": "राजा भोज",
"answer": "B",
"explanation_en": "Maharana Pratap led the Rajput forces against the Mughal Empire at Haldighati in 1576.",
"explanation_hi": "महाराणा प्रताप ने 1576 में हल्दीघाटी के युद्ध में मुगल साम्राज्य के खिलाफ राजपूत सेना का नेतृत्व किया।"
},
{
"subject": "Rajasthan History",
"topic": "Chauhan Dynasty",
"question_en": "What was the capital of the Chauhan dynasty in Rajasthan?",
"question_hi": "राजस्थान में चौहान वंश की राजधानी क्या थी?",
"A_en": "Jalore", "A_hi": "जालौर",
"B_en": "Chittorgarh", "B_hi": "चित्तौड़गढ़",
"C_en": "Jaisalmer", "C_hi": "जैसलमेर",
"D_en": "Bikaner", "D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Chittorgarh served as the capital of the Chauhan dynasty during the medieval period.",
"explanation_hi": "मध्यकाल में चित्तौड़गढ़ चौहान वंश की राजधानी रहा।"
},
{
"subject": "Rajasthan History",
"topic": "Mewar Kingdom",
"question_en": "Who is considered the founder of the Mewar kingdom?",
"question_hi": "मेवाड़ राज्य के स्थापक कौन माने जाते हैं?",
"A_en": "Bappa Rawal", "A_hi": "भगवान रावल",
"B_en": "Rana Sanga", "B_hi": "राणा सांगा",
"C_en": "Rana Pratap", "C_hi": "राणा प्रताप",
"D_en": "Maharana Pratap", "D_hi": "महाराणा प्रताप",
"answer": "A",
"explanation_en": "Bappa Rawal is revered as the founder of the Sisodiya dynasty and the Mewar kingdom.",
"explanation_hi": "भगवान रावल की सिसोदिया वंश और मेवाड़ राज्य के स्थापक के रूप में आदर है।"
},
{
"subject": "Rajasthan History",
"topic": "Mughal Rajput Relations",
"question_en": "Who was the Mughal Emperor during the Battle of Haldighati?",
"question_hi": "हल्दीघाटी के युद्ध के दौरान मुगल सम्राट कौन थे?",
"A_en": "Akbar", "A_hi": "अकबर",
"B_en": "Rana Pratap", "B_hi": "राणा प्रताप",
"C_en": "Rana Sanga", "C_hi": "राणा सांगा",
"D_en": "Raja Man Singh", "D_hi": "राजा मान सिंह",
"answer": "A",
"explanation_en": "The Battle of Haldighati in 1576 occurred during the reign of Emperor Akbar.",
"explanation_hi": "1576 में हल्दीघाटी के युद्ध के दौरान सम्राट अकबर के शासन में यह लड़ाई लड़ी गई थी।"
},
{
"subject": "Rajasthan History",
"topic": "Prehistoric Sites",
"question_en": "Where were the earliest known human settlements in Rajasthan discovered?",
"question_hi": "राजस्थान में प्राचीनतम मानव बस्तियों की खोज कहाँ की गई थी?",
"A_en": "Bhanbhore", "A_hi": "भनभोरे",
"B_en": "Dholavira", "B_hi": "धोलावीरा",
"C_en": "Kalibanga", "C_hi": "कलिबंगा",
"D_en": "Lothal", "D_hi": "लोथल",
"answer": "C",
"explanation_en": "Kalibanga, a Harappan site, houses one of the earliest human settlements in Rajasthan.",
"explanation_hi": "कलिबंगा, एक हड़प्पा स्थल, राजस्थान में प्राचीनतम मानव बस्तियों में से एक है।"
},
{
"subject": "Rajasthan History",
"topic": "Rajput Shift of Capital",
"question_en": "Which ruler shifted the capital from Chittorgarh to Udaipur?",
"question_hi": "किस शासक ने चित्तौड़गढ़ से उदयपुर तक राजधानी को शिफ्ट किया था?",
"A_en": "Rana Kumbha", "A_hi": "राणा कुंभा",
"B_en": "Rana Udai Singh II", "B_hi": "राणा उदय सिंह द्वितीय",
"C_en": "Rana Pratap", "C_hi": "राणा प्रताप",
"D_en": "Maharana Pratap", "D_hi": "महाराणा प्रताप",
"answer": "B",
"explanation_en": "Rana Udai Singh II moved the capital from Chittorgarh to Udaipur in the 16th century.",
"explanation_hi": "राणा उदय सिंह द्वितीय ने 16वीं शताब्दी में चित्तौड़गढ़ से उदयपुर तक राजधानी को शिफ्ट किया।"
},
{
"subject": "Rajasthan History",
"topic": "Temples and Architecture",
"question_en": "Which temple in Jodhpur is dedicated to Lord Shiva?",
"question_hi": "जोधपुर में श्री शिव के समर्पित मंदिर कौन सा है?",
"A_en": "Ghanerao Temple", "A_hi": "गणेराव मंदिर",
"B_en": "Jaswant Thada", "B_hi": "जसवंत ठाड़ा