[
{
"subject": "Rajasthan History",
"topic": "Rajputana",
"question_en": "Which Rajput clan ruled Rajasthan before the establishment of the Mewar dynasty?",
"question_hi": "राजस्थान में मेवर द्वारा संचार की संस्था को पहले मेवार श्लोक के अधिकांत के संतुलन पर विभागी लगा।",
"options_en": [
{
"option_text": "Aravalli",
"option_value": "Aravalli",
"option_explain": "राजस्थान में विभागी अधिकांत के संतुलन पर विभागी लगा।",
"option_explain": "राजस्थान में विभागी अधिकांत के संतुलन पर विभागी लगा।"
},
{
"option_text": "Kumbhalgarh",
"option_value": "Kumbhalgarh",
"option_explain": "राजस्थान में विभागी अधिकांत के संतुलन पर विभागी लगा।"
},
{
"option_text": "Udaipur",
"option_value": "Udaipur",
"option_explain": "राजस्थान में विभागी अधिकांत के संतुलन पर विभागी लगा।"
},
{
"option_text": "Jaipur",
"option_value": "Jaipur",
"option_explain": "राजस्थान में विभागी अधिकांत के संतुलन पर विभागी लगा।",
"option_explain_en": "Under the reign of Rana Pratap Singh, the city of Jaipur was founded in 1727 AD. The city was named after him and is also known as the Pink City."
},
{
"option_text": "Mewar",
"option_value": "Mewar",
"option_explain": "राजस्थान में विभागी अधिकांत के संतुलन पर विभागी लगा।",
"option_explain_en": "Mewar was the kingdom ruled by Rana Pratap Singh before the establishment of the city of Jaipur. The city was founded by Maharaja Sawai Jai Singh II and is famous for its unique architectural heritage."
},
{
"option_text": "Kumbhalgarh",
"option_value": "Kumbhalgarh",
"option_explain": "राजस्थान में विभागी अधिकांत के संतुलन पर विभागी लगा।",
"option_explain_en": "Kumbhalgarh was a stronghold of the Kachhwahas before the establishment of the city of Jaipur. It is known for its ancient fort and contribution to Rajasthani culture."
},
{
"option_text": "Amber",
"option_value": "Amber",
"option_explain": "राजस्थान में विभागी अधिकांत के संतुलन पर विभागी लगा।",
"option_explain_en": "Amber was a kingdom ruled by Rana Kumbha before Jaipur's establishment. It is famous for its Amer Fort and Rana Kumbha's contribution in Rajasthani history"
},
{
"option_text": "Shekhawat Rajputs",
"option_value": "Shekhawat Rajputs",
"option_explain": "राजस्थान में विभागी अधिकांत के संतुलन पर विभागी लगा।",
"option_explain_en": "The Shekhawat Rajputs were the ruling dynasty before Jaipur's establishment. They are known for their contribution to Rajasthani culture and history."
},
{
"option_text": "Jaisam Rajputs",
"option_value": "Jaisam Rajputs",
"option_explain": "राजस्थान में विभागी अधिकांत के संत क्षत के संत के संत को अधिकांत को संत को अधिको अधिकांत के संत के संत को अधिकांत को अधिकांत को संत अधिकांत के संत की अधिकी के संत अधिकांत अधिकांत अधिकांत की अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत अधिकांत",
"options_en": [
{
"option_text": "Tughluq",
"option_value": "Tughluq",
"option_explain": "Tughlaq dynasty ruled Rajasthan before the establishment of the Rana Kishora kingdom.",
"option_explain_en": "The Tughlaq dynasty ruled Rajasthan before the establishment of the Rana Kishora kingdom."
},
{
"option_text": "Kachhwaha",
"option_value": "Kachchwaha",
"option_explain": "Kachchwaha clan was a prominent family in Rajasthan before the Shekhawas dynasty took over.",
"option_explain_en": "The Kachchwaha clan was a prominent family in Rajasthan before the Shekhawas dynasty took control."
},
{
"option_text": "Rana Kishora",
"option_value": "Rana Kishora",
"option_explain": "Rana Kishora was the first ruler of Rajasthan before the establishment of the Jait Singh dynasty.",
"option_explain_en": "Rana Kishora was the first ruler of Rajasthan before the establishment of the Jait Singh dynasty."
},
{
"option_