[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who was the first Chieftain of Chittorgarh?",
"question_hi": "चीटरगंधरपुर के पहले कभीर किसे बनाया गया था?",
"A_en": "Prithviraj Chauhan",
"A_hi": "प्रतीतीर चौहान",
"B_en": "Kumbha Rao Diwali",
"B_hi": "कुम्भार डीवाल",
"C_en": "Rao Kriparam",
"C_hi": "राव कृपयपारम",
"D_en": "Rao Dundaji",
"D_hi": "राव दौंडाजि",
"answer": "C",
"explanation_en": "Kriparam was the first Chieftain of Chittorgarh. He was also known as Rao Kriparam.",
"explanation_hi": "कृपारम चित्रगढ़ के पहले कभीर केन की स्वरूपी केन केन केन के पहले कभीर केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन केन",
"D_hi": "राजस्तान केन केन",
"Answer": "D",
"explanation_en": "Dara Singh was the first Chieftain of Ranthambore, who was also known as Raja Pratap Singh. He was a notable warrior and played a significant role in the history of Rajasthan.",
"explanation_hi": "द्रा सिंग राण्तान केन केन वीर, उन केन केन केन केन केन केन केन केन केन केन केन केन केन केन",
"Explanation_hi": "द्राण्थान केन केन केन केन केन केन केन केन केन",
"explanation_en": "Dara Singh was a prominent Rajput chieftain who established Ranthambore kingdom in 1333 CE (133 CE) and fought in various battles, including the famous Battle of Tarain in 1544 CE (154 CE)."
},
{
"subject": "Rajasthan History",
"topic": "Chiefs and Kings",
"question_en": "Who was the first Chieftain of Ranthambore?",
"question_hi": "चीण खेन केन केन केन केन खेन",
"A_en": "Dara Singh",
"A_hi": "द्राण खेन",
"B_en": "133 CE (133 CE)",
"B_hi": "133 CE",
"C_en": "चीन केन खेन केन खेन",
"C_hi": "ख्रेन केन खेन",
"answer": "D",
"explanation_en": "The first Chieftain of Ranthambore was Dara Singh, who established the kingdom in 133 CE (133 CE) and ruled until 1544 CE (154 CE).",
"explanation_hi": "चिन खेन केन खेन केन खेन ख्रेन",
"D_hi": "133 CE (133 CE)",
"D_en": "154 CE",
"answer": "D",
}