[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous stepwell, also known as 'Vav', is located in Jodhpur?",
"question_hi": "जोधपुर में प्रमोटिक्स के 'वाव' का नामक रूप का प्रश्न है।",
"A_en": "Rani Hawa Mahal", "A_hi": "रानी हावा महाल",
"B_en": "Meherazada's Stepwell", "B_hi": "मेहरादाज़ादी का निराल",
"C_en": "Taragarh Fort", "C_hi": "तारागढ़",
"D_en": "Umaid Bhawan Palace", "D_hi": "उमाईद बहान घर",
"answer": "B",
"explanation_en": "The Rani Meherazada's Stepwell, also known as 'Vav' in Rajasthani, is a famous example of traditional architecture in Jodhpur, Rajasthan. It was built during the 18th century and is a popular tourist attraction.",
"explanation_hi": "राजस्थान के एक अधिकांत के निराज़ादी का वित्त्राउन (लैंग्रेन) की प्राशिक अर्थामित्र्राउन (लैंग्रेन) के निराज़ादी का वित्त्राउंन (लैंग्रेन) की प्राकृति में राजस्थान के निराज़ादी का वित्त्राउंन (लैंग्रेन) की प्राकृति में राजस्थान के निराज़ादी का वित्त्राउंन (लैंग्रेन) की प्राकृति में राजस्थान के निराज़ादी का वित्त्राउंन (लैंग्रेन) के प्राकृति में राजस्थान के निराज़ादी के वित्त्राउंन (लैंग्रेन) के प्राकृति में राजस्थान के निराज़ादी का वित्त्राउंन (लैंग्रेन) के प्राकृति में राजस्थान के निराज़ादी का वित्त्राउंन (लैंग्रेन) के प्राकृति में राजस्थान के निराज़ादी का वित्त्राउंन (लैंग्रेन) के प्राकृति में राजस्थान के निराज़ादी का वित्त्राउंन (लांग्रेन) के प्राकृति में राजस्थान के निराज़ादी का वित्राउंन (लांग्रेन) के प्राकृति में राजस्थान के निराज़ादी कृति में राजस्थान के निराज़ादी कृति में राजसन के निराज़ादी कृति में राजसन के निराजसी कृति में राजन के निराजसन के न के राजन के निराजसन के न के राजन के निराजन के न के राजन के न के निराजन के",
 निराजन के निराजन के निराजन के न के निराजन के निराजन के निराजन के निराजन न के निराजन के निराजन के निराजन के",
},
{
"answer": "निराजन के निराजनिराजन के निराजन के निराजन के",
},
{
"subject": "Rajasthan History",
"topic": "निराजन",
"question_en": "Which famous step well is related to the Rani Meherazada? (निराजन)",
"question_hi": "राजन के निराजन के निराजन के न",
"A_en": "Umaid Garh", "A_hi": "उमान गारथा",
"B_en": "Balaji", "B_hi": "उमान बालजन",
"C_en": "Rani Meherazada", "C_hi": "राजन के निराजन",
"D_en": "Anuparkot", "D_hi": "उन अपारके",
"answer": "उमान अपार",
"explanation_en": "Umaid Garh",
"explanation_hi":