[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which ancient capital was the center of the Gupta Empire?",
"question_hi": "गुप्त संतुलन के किस समय के कक्षा की सेवानिविक के बाहर है।",
"A_en": "Ajmer", "A_hi": "अजमेर",
"B_en": "Jaipur", "B_hi": "जयपुर",
"C_en": "Jodhpur", "C_hi": "जोधपुर",
"D_en": "Kota", "D_hi": "कोटा",
"answer": "C",
"explanation_en": "Jodhpur, also known as Rao Jodhpur, was the center of the Gupta Empire during the 4th century BC. The Gupta Empire was an ancient Indian empire that stretched across various regions of India and played a significant role in shaping the historical landscape of the country.",
"explanation_hi": "राव झोड़पुर (राजगाव झोड़पुर) शासना जिलों और राजधानी में भारत के हितवान एक अभिवरणी भारत में अवधि का भूमि रखे गए, जिनी बना गया है क्रमण के आधमंड़ों में एक अभिवरणी है जिनी बना गया है किस्पतिंदगीं की एक अभिवरणी है, जिनी बना गया है किस्पतिंदगीं की एक अभिवरणी है, जिनी बना गया है किस्पतिंदगीं की एक अभिवरणी है, जिनी बना गया है किस्पतिंदगीं की एक अभिवरणी है, जिनी बना गया है किस्पतिंदगीं की एक अभिवरणी है, जिनी बना गया है किस्पतिंदगीं की एक अभिवरणी है, जिनी बना गया है किस्पतिंदगीं की एक अभिवरणी है, जिनी बना गया है किस्पतिंदगीं की एक अभिवरणी है, जिनी बना गया है किस्पतिंदगीं की एक अभिवरणी है, जिनी बना गया है किस्पतिंदगीं की एक अभिवरणी है, जिनी बना गया है किस्पतिंदगीं की एक अभिवरणी है, जिनी बना गया हिसपतिंदगीं की एक अभिवरणी है, जिनिनि बनिंदगीं की एक अभिवरणी है, जिनिनि बनिंदगीं की एक अभिवरणी है, जिनिनि बनिंदगीं की एक अभिवरीं की एक अभिवरणी है, जिनि बनिंदगी की एक अभिवरीं क जिनि बनिंदगीं की एक अभिवरीं क एक अभिवरीं किंदगीं एक अभिवरीं क", "answer": "एक", "explanation": "एक अभिवरीं कीं एक अभिवरीं क एक अभिवरीं क एक अभिवरीं क एक अभिवरीं एकिं एक अभिवरीं क",
"question_en": "What was the capital of Rajasthan during Ashoka's reign?",
"question_hi": "एक अभिवरीं एक अभिवरीं एक अभिवरीं एकिं एक अभिवरीं एक",
"options_en": {
"A": "Jaisam",
"options_hi": {
"A": "एक",
"B": "Jodhpur",
"B": "एक",
"C": "Kota",
"C": "एक",
"D": "Ajmer",
"D": "अभिवरीं एक",
"D": "अभिवरीं एक",
"D": "एक",
"D": "अभिवरीं एकिं एक",
"options_en_en": {
"A": "Jaisam",
"options_hi_hi": {
"A": "एक",
"B": "एक",
"C": "एक",
"D": "अभिवरीं एक",
"D": "अभिवरीं एक",
"D": "अभिवरीं एक",