[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Royal Cities",
"question_en": "Which city was the capital of Rajasthan during the reign of Maharaja Bir Singh Deo?",
"question_hi": "महाराजा बिर सिंह देव के नेत्रागत में राजस्थान का किस शहर था?",
"A_en": "Jaipur",
"A_hi": "जयपुर",
"B_en": "Udaipur",
"B_hi": "उदयपुर",
"C_en": "Jodhpur",
"C_hi": "झौड़पुर",
"D_en": "Bikaner",
"D_hi": "बिकानेर",
"answer": "C",
"explanation_en": "Udaipur was the capital of Rajasthan during the reign of Maharaja Bir Singh Deo.",
"explanation_hi": "महाराजा बिर सिंह देव के नेत्रागत में राजस्थान का क्या शहर था?",
"explanation_hi": "महाराजा बीर सिंह देव के नेत्रागत में राजस्थान का क्या शहर था?"
},
{
"subject": "Rajasthan History",
"topic": "Early History",
"question_en": "Which ancient city was the capital of Rajasthan during the reign of Lakshman Sagar?",
"question_hi": "लक्ष्मणी के नेत्रागत में राजस्थान का क्या शहर था?",
"A_en": "Udaipur",
"A_hi": "उदयपुर",
"B_en": "Jaisamand",
"B_hi": "जयसमंद",
"C_en": "Neemuch",
"C_hi": "नीमुख",
"D_en": "Jhalore",
"D_hi": "झालोर",
"answer": "B",
"explanation_en": "During the reign of Lakshman Sagar, Udaipur was the capital city of Rajasthan. However, the capital was moved to Jaisamand later on. Jaisamand is a famous reservoir built by Maharaja Jai Singh II.",
"explanation_hi": "लक्ष्मणी के निवासर के वर्षियांला में राजस्थान का शहर उदायपुर था लेकिंगावांला में राजस्थान का शहर उदयपुर था, लेकिंगा में राजस्थान का शहर उदयपुर से बदल गया, लेकिंगा में राजस्थान का शहर उदयपुर से बदल गया, लेकिंगा में राजस्थान का शहर उदयपुर से बदल गया है।",
"B_hi": "राजस्थान के शहर उदयपुर से बदल गया है।",
"C_hi": "राजस्थान के शहर उद्यपुर से बदल गया है।",
"D_hi": "राजस्थान के शहर उद्यापुर से बदल गया हें।",
"answer": "D",
"explanation_en": "During the reign of Maharaja Bir Singh Deo, the capital of Rajasthan was shifted from Udaipur to Jodhpur. Thus, Jodhpur is the correct answer.",
"explanation_hi": "महाराजा बीसिंगयां बदल का शहर उदापयां सिंगयां बदल का शहर उदापयां सिंगयां बीसिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर Rajasthan ka kya सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंगर उदापयां सिंग