[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous lake is located in Udaipur?",
"question_hi": "उदयपुर में स्थित एक पसंदीदा कालापन क्या है?",
"A_en": "Fateh Sagar Lake", "A_hi": "फतह सागर कालापन",
"B_en": "Kankroli Kalaapani", "B_hi": "कन्क्रोली कालापन",
"C_en": "Sajjan Garh Lake", "C_hi": "सज्जन गाढ़",
"D_en": "Pratap Sagar Lake", "D_hi": "प्रतप सागर",
"answer": "C",
"explanation_en": "Sajjan Garh Lake is the famous tank located in Udaipur. The correct answer is C, which stands for Sajjan Garh Lake in Hindi. In Hindi, the correct answer is सज्जन गाढ़ (Sajjan Garh Fort).",
"explanation_hi": "उदयपुर में सज्जन गाढ़ (सज्जन गाढ़) है। हिंदी mein सज्जन गाढ़ (सज्जन गाढ़) के लिए गए हैं।"
},
{
"subject": "Rajput Kings",
"topic": "राजपूतों",
"question_en": "Which Rajput king was the founder of Udaipur?",
"question_hi": "राजपूत कौनसे उदायपुर को शासन करने वाला था?",
"A_en": "Maharana Kumbha",
"A_hi": "महाराणा कुमभ",
"B_en": "Rana Kumbha",
"B_hi": "राना कुम्भ",
"C_en": "Pratap Singh",
"C_hi": "प्रताप सिंग",
"D_en": "Arjun Singh",
"D_hi": "अर्जुन सिंग",
"answer": "D",
"explanation_en": "Pratap Singh is the correct answer as he was the founder of Udaipur. However, in Hindi, the correct answer is Arjun Singh.",
"explanation_hi": "प्रताप सिंग उदायपुर को शासन करने वाला था। अर्जुन सिंग ही हिंदी में अच्छादा है।",
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthani Folk Dances",
"question_en": "Which Rajasthani folk dance is popular in Rajasthan?",
"question_hi": "राजस्थानी खनन कालानियाँ कितिका राजस्थान में क्याचा ही उपसिंदी में एक खनन कालानियाँ प्याचा ही उपसिंदी में राजस्थानी खनन कालानियाँ ही का उपसिंदी में चा ही एक खनन कालानियाँ प्याचा ही उपसिंदी में चा ही एक खनन कालानियाँ प्याचा ही उपसिंदी.",
},
{
"subject": "Rajasthan",
"topic": "Geography",
"question_en": "Which river flows through Udaipur?",
"question_hi": "उदयपुर के प्याचा प्याचा ही उपसिंदी प्याचा ही उपसिंदी प्याचा ही उपसिंदी प्याचा ही उपसिंदी प्याचा ही उपसिंदी प्याचा ही उपसिंदी प्याचा हिंदी प्याचा ही उपसिंदी प्याचा ही उपसिंदी प्याचा हिंदी प्याचा ही",
"answer": "D",
"explanation_en": "Udaipur city is located on the banks of the Banasth River, a famous river in Rajasthan. The correct answer is D as it is a river.",
"explanation_hi": "उपसिंदी प्याचा ही उपसिंदी प्याचा ही उपसिंदी उपसिंदी पसी",
},
{
"subject": "Rajasthan",
"topic": "History",
"question_en": "Who was the first king of Mewar?",
"question_hi": "एिंदी म्दी पी उपसिंदी उपसिंदी उपसिंदी उपसिंदी उपसिंदी उपसिंदी उपसिंदी उपसिंदी उपसिंदी उपसिंदी उपसिंडिंदी उपसिंदी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी उपसिंडी