[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and State Symbols",
"question_en": "What is the capital of Rajasthan and what are some state symbols?",
"question_hi": "राजस्थान की राजधानी और राज्य संकेतों के बारे में क्या पूछना है?",
"A_en": "Jaipur", "A_hi": "जयपुर",
"B_en": "Airport", "B_hi": "विमान",
"C_en": "Animal", "C_hi": "पार",
"D_en": "Caste System", "D_hi": "धर्मनिवस",
"answer": "A",
"explanation_en": "Jaipur is the capital of Rajasthan and some state symbols include the peacock (animal), the Samvatsar (Zodiac), and the Janta Seva Dham (public service center). You can also find the emblem of the state (Caste System) and an airport (symbol of connectivity).",
"explanation_hi": "राजस्थान की राजधानी है जयपुर और राज्य के संकेतों का विस्तर्थान यां हैं: पुष्टिका (ओमका विस्तर्थाने के अनुस्तर्थान तुर्थान हैं: पाक (ओमका विस्तर्थाने के अनुस्तर्थान हैं: पुष्टर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने अनुस्तर्थाने अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अनुस्तर्थाने के अने के अने अने के के अने के के अने के अने के के अने के के अने के के अने के अने के अने के के के के के के के अने के के के के अने के के के के के अने के के के के के अने के के के के के के के के के के के के के के के के के के",
"answer": "के के के के के के के के के के",
}
"question_en": "Which is the capital of Rajasthan and what are some important symbols of the state?",
"question_hi": "राजने के के के के के के के के के के के के",
"A_en": "Jaipur", "A_hi": "जे के के के के के के के के के के के के के",
"B_en": "पाके के के के के के के के के के के के के के क