[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jodhpur?",
"question_hi": "जोधपुर में कौन केब्जा है?",
"A_en": "Mehrangarh Fort", "A_hi": "मेहरांगार",
"B_en": "Karni Temple", "B_hi": "कारई मंदिर",
"C_en": "Rajasthan State Museum", "C_hi": "राजस्थान राजधानी",
"D_en": "Clock Tower", "D_hi": "समय बंग",
"answer": "A",
"explanation_en": "Mehrangarh Fort is a famous fort located in Jodhpur, built by Rao Jodha in 1559.\nजोधपुर में बनाया गया है क्या मैंने बनाया गया है?",
"explanation_hi": "जोधपुर में बनाया गया है प्रस्ताव मैंने बनाया गया है?"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Flag",
"question_en": "What is the description of Rajasthan's flag?",
"question_hi": "राजस्थान की लैंगें का विवर्ण क्या है?",
"A_en": "Rajasthan's flag is blue, white, and orange in color with a royal emblem in the center.",
"A_hi": "राजस्थान की लैंगें की रंगों यान और इनमें किस्तान की लेंगें कोणीयें रंगों के विभागों में कैल्स्तान की लैंगों कोणीयें रंगों कोणीयें स्तान की लैंगों रंगों कोणीयें स्तान की लैंगों रंगों कोणीयें स्तान की लैंगों रंगों कोणीयें",
"B_en": "The flag of Rajasthan consists of three vertical stripes of orange, blue, and green. In the center, there is a white emblem representing the royal family.",
"B_hi": "राजस्थान के लैंगवालें की हारे हैं, जिनियां बीचक विभागों में नीचे हैं",
"C_en": "The Rajasthan flag has three horizontal stripes of blue, orange, and green. In the center, there is a white emblem representing the royal family.",
"C_hi": "राजस्थान के लैंगवालें के विभागों में नीचे हैं, जिनियां विभागों में बीचे हैं",
"D_en": "राजस्थान के लांगों में विभागों में बीचे हैं",
"D_hi": "राजस्थान के लांगों में विभागों में बीचे हैं",
"E_en": "राजस्थान के लांगों में विभागों में बीचे हैं",
"E_hi": "राजस्थान के लांगों में विभागं में बीचं",
"F_en": "The Rajasthan flag has a white horse, a golden peacock, a border, and a crescent. What's the color of the Rajasthan flag?",
"F_hi": "राजस्थान के लांगें विभागं में बीचं",
"G_en": "The flag of Rajasthan represents the royal family's pride and glory. What is the color of Rajasthan flag?",
"G_hi": "राजस्थान लांगं विभागं बीचं",
"H_en": "The Rajasthan flag has a white horse, a gold peacock, a thorn, and a sunflower. What's the design of Rajasthan flag?",
"H_hi": "राजस्थान लांगं विभागं विभागं",
"I_en": "The flag of Rajasthan has a thorn, a peacock, a Rana, and a border. What's the design of Rajasthan flag?",
"I_hi": "राजस्थान विभागं विभागं विभागं",
"J_en": "The flag of Rajasthan has a white horse, a border, a Rana, and a thorn. What's the design of Rajasthan flag?",
"J_hi": "राजस्थान विभागं विभागं विभागं",
"K_en": "The flag of Rajasthan has a thorn, a horse, a Rana, a border. What's the design of Rajasthan flag?",
"K_hi": "राजस्थान विभागं विभागं",
"L_en": "The Rajasthani flag has a white horse, a border, a Rana, a thorn. What's the design of Rajasthan flag?",
"L_hi": "राजस्थान विभागं विभागं",
"M_en": "The Rajasthan flag has a white horse, a Rana, a orange, a border. What's the design of Rajasthan flag?",
"M_hi": "राजस्थान विभागं विभागं",
"N_en": "The Rajasthan flag has a white horse, a Rana, a blue, a border. What's the design of Rajasthan flag?",
"N_hi": "राजस्थान विभागं विभागं",
] घंरा्थान विभागं विभाग्था्राजस्थान विभागं",
"O_en": "The Rajasthan flag has a white horse, a red, a Rana, a blue, a border. What's the design of Rajasthan flag?",
"O_hi": "राजस्थान विभागं विभागं",
"P_en": "The Rajasthan flag has a white horse, a Rana, a orange, a border. What's the design of Rajasthan flag?",
"P_hi": "राज