[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which historical site is associated with the famous battle of Deeg?",
"question_hi": "डीग के लिए प्रसिद्ध बैलेक्शन के संबंधित किस भूमिका है?",
"A_en": "Amber Fort", "A_hi": "अमरेल फोर्ट",
"B_en": "Samode", "B_hi": "सामोद",
"C_en": "Ajmer", "C_hi": "अजमेर",
"D_en": "Jaipur", "D_hi": "जयपुर",
"answer": "D",
"explanation_en": "The famous battle of Deeg is associated with the historical site of Jaipur. Jaipur is the capital of Rajasthan, and it was the battlefield where the battle took place in the 18th century between the Mughal emperor Aurangzeb and the Rathore ruler Sawai Jai Singh II.",
"explanation_hi": "डीग की मौलिक स्रोत जैन मुगल इमोब और स्वामी सावाई जय सिंग II के बैल में पृथिया मौलिक इमोब और स्वामी सावाई जय सिंग II के बैल में आया गया क्यामी इमिक और स्वामी सावाई जय सिंग II के बैल में आया क्यामी और स्वामी सावाई जय सिंग II के बैल में आया क्यामी और स्वामी सावाई जय सिंग II के बैल में आया क्यामी और स्वामी सावाई जय सिंग II के बैल में आया क्यामी और स्वामी सावाई जय सिंग II के बैल में पेश की मात्रा और स्वामी सावाई जय सिंग II के बैल में पेश की मात्रा और स्वामी सावाई जय सिंग II के बैल में पेश की मात्रा और स्वामी सावाई जय सिंग II के बैल में पेश की मात्रा और स्वामी सावाई जय सिंग II के बैल में पेश की मात्रा और स्वामी सावाई जय सिंग II के बैल में पेश की मात्रा और स्वामी सावाई जय सिंग II के बैल में पेश की मात्रा और स्वामी सावाई जय सिंग II के बैल मेंपेश की मात्रा और स्वामी सावाई जय सिंग II के बैल मेंपेश की मात्रा और सिंग II के बैल मेंपेश की मात्रा और सिंग II के बैल मेंपेश की मात्रा और सिंग II के बै मेंपेश की मात्रा और सिंग II के बैल मेंपेश की मात्रा और सिंग II के बै मेंपेश की मात्रा और सिंग II के बैल मेंपेश की मात्रा और सिंग II के बैंपेश की मात्रा और सिंग II के बैंपंकेश की मात्रा और सिंग II के बैंपेश की मात्रा और सिंग II के बैंंपेश की मात्रा और सिंग II के बैंपेश की मात्रा और सिंग II किंग II के बैंग II के बैंग II के बैंग II के बैंग II के बैंग II के बैंर सिंग II के बेंग II के बैंग II के बैंर सिंर सिंग II के बैंर सिंग II के बैंर सिंर के बैंर सिंग II के बैंरे बैंर सिंर के बैंर स