[
{
"subject": "Rajasthan History",
"topic": "Rajasthan Capital",
"question_en": "What is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी क्या है?",
"A_en": "Jodhpur", "A_hi": "जोधपुर",
"B_en": "Jaipur", "B_hi": "जयपुर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Bikaner", "D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Jaipur is the capital of the Indian state of Rajasthan.",
"explanation_hi": "जयपुर राजस्थान की राजधानी है।",
"explanation_ar": "جايبيور هو عاصمة ولاية راجستان الهندية."
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan Culture",
"question_en": "What is the importance of Rajasthan's rich culture in Indian history?",
"question_hi": "राजस्थान की धर्मन काल में राजस्थान की धर्मन का विस्तर में राजस्थान की धर्मन का विस्तर में राजस्थान की धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विस्तर में राजस्थान का धर्मन का विसर में राजस्थान का धर्मन का विसर में राजस्थान का धर्मन का विस्र में राजस्थान का धर्मन का विस्तर",
Non-categorized", का धर्मन का विसर में राजस्थान का धर्मन का विसर में राजस्थान का", धर्मन का विसर",

"answer": "B",
"explanation_en": "The state of Rajasthan is known for its rich history and culture, and Jaipur (Jaipur) is the capital city in Rajasthan. Among many historical attractions, Amer Fort, Meena Kachhra, and Amber Fort are famous.",
"explanation_hi": "राजस्थान का विसर्य्तराजस्थान का विसर",
"explanation_ar": "राजस्थान का विसर",
"answer": "B",
"explanation_en": "Rajasthan is known for its rich history and culture. Jaipur (Jaipur) is the capital city of Rajasthan. Among famous historical attractions, Amer Fort, Meena Kachhra, and Amber Fort are popular.",
"explanation_hi": "राजस्थान का विसर",
"explanation_ar": "राजस्थान का विसर",
]