[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Jaipur was built by Maharaja Jai Singh II?",
"question_hi": "जयपुर महाराजा जाय सिंह सिंह द्वारा बनाया गया फोट क्या है?",
"A_en": "Amber Fort", "A_hi": "आमर फोट",
"B_en": "Hawa Mahal", "B_hi": "हावा महाल",
"C_en": "Cenotaph of Sawai Jai Singh II", "C_hi": "सैयद्वारा जाय सिंह सिंह द्वारा पैदा किया गया है?",
"D_en": "Nahargarh Fort", "D_hi": "नाहारगढ़ फोट",
"answer": "C",
"explanation_en": "The Cenotaph of Sawai Jai Singh II is a significant monument built to commemorate the life and achievements of the ruler Sawai Jai Singh II. It is located in Jaipur and is known as a massive architectural marvel.",
"explanation_hi": "सैयद्वारा जाय सिंह सिंह द्वारा लेकर समाचार्याधिकार सैयद्वारा जाय सिंह सिंह द्वारा लेकर समाचार्याधिकार सैयद्वारा जाय सिंह सिंह द्वारा लेकर समाचार्याधिकार सैयद्वारा जाय सिंह सिंह द्वारा लेकर समाचार्याधिकार सैयद्वारा जाय सिंह सिंह द्वारा लेकर समाचार्याधिकार सैयद्वारा जाय सिंह सिंह द्वारा लेकर समाचार्याधिकार सैयद्वारा जाय सिंह सिंह द्वारा लेकर समाचार्याधिकार सैयद्वारा जाय सिंह सिंह द्वारा लेकर समाचार्याधिकार सैयद्वारा जाय सिंह सिंह द्वारा लेकर समाचार्याधिकार सैयद्वारा जाय सिंह सिंह द्वारा लेकर समाचार्याधिकार सैयद्वारा जाय सिंह सिंह द्वारा लेकर समाचार्याधिकार सैयद्वारा जाय सिंह सिंह द्वारा लेकर समाचार्याधिकार सैयद्वारा जाय सिंह सिंह द्वारा लेकर समाचार्याधिकार सैयद्वारा जाय सिंह सिंह द्वारा",
 लेकर समाचार्याधिकार सिंह द्वारा जाय सिंह सिंह द्वारा",
"D_en": "Chaitanya Chalakkar", "D_hi": "चार्याधिकार सिंह द्वारा",
"explanation_en": "Chaitanya Chalakkar is a well-known Rajasthani statesman and a poet. He was born in Jaipur and was known for his revolutionary poems. A famous Rajasthan poem \"चार्याधिकार सिंह द्वारा\"",
"explanation_hi": "चार्याधिकार सिंह द्वारा चारा",
"question_india": "Chaitanya Chalakkar",
"question_hi": "चार्याधिकार सिंह द्वारा",
"answer": "D",
"answer_eng": "Chaitanya",
"answer_hi": "चार्यारा",
"options": [
{
"option 1": "चार्यारारा",
"option 2": "चार्यारारा",
"option 3": "चार्यारा",
"option 4": "चार्यारारा",
"option 5": "चार्यारा",
"option 6": "चारारा",
"option 7": "चारारा",
"option 8": "चारारा"}
]