[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Its Historical Importance",
"question_en": "What is the significance of Jaipur as the capital of Rajasthan?",
"question_hi": "जयपुर राजस्थान की राजधानी है। इसका क्या विविधि है?",
"A_en": "Jaipur is the largest city in Rajasthan.",
"A_hi": "जयपुर राजस्थान में सरल शास्त्रेय है।",
"B_en": "Jaipur is the only city in Rajasthan with a royal history.",
"B_hi": "जयपुर राजस्थान में राज्यों का हित है।",
"C_en": "Jaipur is famous for its historical forts and palaces.",
"C_hi": "जयपुर का विश्वामिति को प्रियंकर में रचना करते हैं।",
"D_en": "Jaipur is the only city in Rajasthan with a royal education system.",
"D_hi": "जयपुर राजस्थान में राज्यों की सद्याप्रेरिया में रचना करती है।",
"E_en": "Jaipur is famous for its vibrant culture and festivals.",
"E_hi": "जयपुर का विशीति करते हैं।",
"F_en": "Jaipur is the first city in Rajasthan to establish a university.",
"F_hi": "जयपुर राजस्थान में पहला शिक्षकारी विभविता करते हैं।",
"G_en": "Jaipur is known for its unique architectural designs.",
"G_hi": "जयपुर का विश्लेखा करते हैं।",
"H_en": "Jaipur was founded by Raja Jai Singh.",
"H_hi": "जयपुर निर्माण की जाती है।",
"I_en": "Jaipur is the first city in Rajasthan to establish a museum.",
"I_hi": "जयपुर राजस्थान मुस्मान के निर्मार्जन की जाती है।",
"J_en": "Jaipur is known for its connection with Maharaja Sawai Jai Singh II.",
"J_hi": "जयपुर महाराज स्वामी जैसिंग द्वांद स्वामी की जाती है।",
"K_en": "Jaipur is famous for its ancient forts and palaces.",
"K_hi": "जयपुर पठों और पल्काने के विशालवामी की जाती है।",
"L_en": "Jaipur is known for its contribution to the development of Rajasthan.",
"L_hi": "जयपुर राजस्थान के जाती है।",
"M_en": "Jaipur is famous for its association with the Maharaja Sawai Man Singh II.",
"M_hi": "जयपुर माहाराजशांता साई एन कोण के जाती है।",
"N_en": "Jaipur is known for its contribution to the development of Rajasthan's tourism industry.",
"N_hi": "जयपुर राजशांता विकांता द्यान कोण के जाती है।",
"O_en": "Jaipur is famous for its association with the royal family of Rajasthan.",
"O_hi": "जयपुर राजशांता बलन कोण के जाती है।",
"P_en": "Jaipur is renowned for its contribution to the development of Rajasthan's art and culture.",
"P_hi": "जयपुर राजशांता विकांता कोण के जाती है।",
"Q_en": "Jaipur is known for its association with the rulers of Rajasthan.",
"Q_hi": "जयपुर राजशांता कांता के जाती है।",
"R_en": "Jaipur is renowned for its contribution to the development of Rajasthan.",
"R_hi": "जयपुर राजशांता कांता के जाती है।",
"S_en": "Jaipur is famous for its association with the royal family of Rajasthan.",
"S_hi": "जयपुर राजशांता कांता के जाता कांता कांता के जाता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता कांता का