[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous forts and palaces are located in Jaipur?",
"question_hi": "जयपुर में कौन से महत्तावनाएं और मंदिरों के बारे में पूछे जा सकते हैं?",
"A_en": "Amer Fort, Hawa Mahal, City Palace, and Galta Temple",
"A_hi": "ऐमेर महल, हावा महल, शहर का मंदिर और गलता मंदिर",
"B_en": "Amer Fort, Hawa Mahal, and City Palace",
"B_hi": "ऐमेर महल, हावा महल और शहर का मंदिर",
"C_en": "Gaitor Fort, Birla Mandir, and Govindgarh Fort",
"C_hi": "गईटीर मंदिर, बिला मंदिर और गोविंदगढ़ मंदिर",
"D_en": "Amer Fort, Hawa Mahal, and City Palace",
"D_hi": "ऐमेर महल, हावा महल और शहर का मंदिर",
"answer": "A",
"explanation_en": "Jaipur is famous for its beautiful forts and palaces, and among them, Amer Fort, Hawa Mahal, and City Palace are the most popular tourist attractions.",
"explanation_hi": "जैगाउमर के बहुते विमेर महल, हावा महल और शहर का मंदिर हैं। इनों में शामिल विमेर महल, हावा महल और शहर का मंदिर",
"explanation_en": "The three main forts in Jaipur are Amer Fort, Hawa Mahal, and City Palace. These attractions are major tourist spots in Jaipur.",
"explanation_hi": "जैगाउमेर महल, हावा महल और शहर का मंदिर हैं।", 
},
{
"subject": "Rajasthan History",
"topic": "Solar System",
"question_en": "Which is the name of the largest planet in our solar system?",
"question_hi": "ऑडिया के सपैलर संगम में वर्तमंडल का अन्याचंद्र",
"A_en": "Jupiter",
"A_hi": "ऑडिया",
"B_en": "Mars",
"B_hi": "महारा",
"C_en": "Neptune",
"C_hi": "नेप्ती",
"D_en": "Venus",
"D_hi": "वंशा",
"answer": "B",
"explanation_en": "Among the planets, Mars is the largest one. It is also known as Mangal in Sanskrit.",
"explanation_hi": "ऑडिया स्पार्थान",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan Kingdom",
"question_en": "Which famous Rajasthani king is associated with the establishment of Jaipur?",
"question_hi": "जापुर की बजार्तित्रणी मेंटी",
"A_en": "Ala Singh",
"A_hi": "आला सिंग",
"B_en": "Sawai Maharaja Jai Singh",
"B_hi": "स्वामहात्रानी जोयार्नी",
"C_en": "Maharaja Ram Singh",
"C_hi": "महाराजानी महारासिंग",
"D_en": "Pratap Singh",
"D_hi": "प्रताप सिंग",
"answer": "B",
"explanation_en": "Sawai Maharaja Jai Singh II is associated with the establishment of Jaipur. He was responsible for designing the city's layout and constructing several buildings, including the Amer Fort.",
"explanation_hi": "स्वामहाराजानी महारासिंग",
},
{
"subject": "Rajasthan History",
"topic": "Important Battles",
"question_en": "Which battle is associated with Maharaja Pratap Singh?",
"question_hi": "महाराजानी प्राजानी महाराजानी प्राजानी महाराजानी पराजानी महाराजानी पराजानी महाराजानी पराजानी महाराजानी पराजानी महाराजानी पराजानी महाराजानी महाराजानी पराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी मी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजानी महाराजा