[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Chieftains and Kings",
"question_en": "Which Chieftain ruled over Rajasthan before the establishment of the Marwar and Mewar states?",
"question_hi": "राजस्थान के मर्वाई और मेवार स्थानों को संरक्षण करने के लिए किस चित्रा बोलाई का नाम।",
"A_en": "Rao Jodha",
"A_hi": "राव जोधा",
"B_en": "Rao Kalyan",
"B_hi": "राव कल्याण",
"C_en": "Rao Siwaji",
"C_hi": "राव सीवाजी",
"D_en": "Rao Bika",
"D_hi": "राव बिका",
"answer": "D",
"explanation_en": "Before the establishment of Marwar and Mewar states, Rao Bika, also known as Rao Bikaji, is famous for his bravery and strategic skills. He was the ruler of Jodhpur and played a significant role in the formation of Ranthambore Fort.",
"explanation_hi": "राजनी मार्व और मेयार स्टेट का बनाने के लिए चंद्रपुर के जमान के सिमान के नामी को महान बीकाई को राजकोणी मार्व और मेयार स्टेट के चंद्रपुर के सिमान को प्रतीक्षिति के नामी को राजकोणी मार्व और मेयार स्टेट के चंद्रपुर के सिमान को प्रतीक्षिति के नामी",
"answer": "A",
"explanation_en": "Chandragupta Maurya is known for founding the Maurya Empire and played a crucial role in the establishment of the states of Marwar (Jodhpur) and Mewar (Udaipur). Therefore, the answer is A - Chandragupta Maurya.",
"explanation_hi": "चंद्रगुप्ति मौरा मुर्वाई को मुर्वाई संतरंग कामोत्तार सम्पति मुर्वाई के नामी",
"explanation_hi": "चंद्रगुप्ति मौरा मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मेंबन्ती मुर्वाई के नामेंबन्ती मुर्वाई के नामेंबन्ती मै के नामेंबन्ती मेंबन्ती के नाे ही नामे नामेंबन्ती मेंबन्ती के नामे के नामेंबन्ती मे नामे नाे नामे नामंबन्ती मेंबन्ती के नामे नामे नामे नामे नामेंबन्ती मे नामे नामे नाे नामे नाे नामे नामे नामे नामे नामे नामे नामे नामे नामे नामे नामे",
},
"नामे नाे नामे नामे नामे नाे नामे नामे नामे",
"B_en": "Chauhan",
"B_hi": "चौहांमे नामे नाे नामे नामे नामे नामे नामे",
"C_en": "Shri Bhim Singh",
"C_hi": "राजनामे नामे नाे नामे नामे नामे",
"D_en": "Fal Singh",
"D_hi": "राजनामे नाे नामे नाे नामे नामे",
"answer": "B",
"explanation_en": "Bhim Singh, also known as Chauhan, was a