[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which king established the city of Jaipur?",
"question_hi": "जयपुर के निर्माण करने वाला कौन सा सर्वोत्रा?",
"A_en": "Alauddin Khilji", "A_hi": "अलाउद्दिन खिल्जी",
"B_en": "Raja Man Singh I", "B_hi": "राजा मंगलवाल और त्रिवंशकार",
"C_en": "Raja Jai Singh II", "C_hi": "राजा जय सिंह अंतराज्य",
"D_en": "Raja Kishore Singh", "D_hi": "राजा किशोर सिंग",
"answer": "C",
"explanation_en": "Raja Jai Singh II is the king who established the city of Jaipur.",
"explanation_hi": "राजा जय सिंह अंतराज्य के राजधानी राजने उसके क्या स्थान उद्यान के लेकिंग में बना किया गया अंतराज्य का शहर",
"explanation_en": "Raja Jai Singh II established the city of Jaipur by merging several kingdoms. He was a ruler of the Maurya Empire.",
"explanation_hi": "राजा जय सिंह अंतराज्य में बना किया गया अंतराज्य का शहर",
"answer": "C",
"explanation_en": "Raja Jai Singh II established Jaipur by merging several kingdoms into the Maurya Empire. He was a prominent ruler and astronomer from the Maurya Dynasty.",
"explanation_hi": "राजा जय सिंह अंतराज्य में Jaipur को बना करने वाला है। उन्हें एक प्रमोशीय संतरांग और अधिकार अंतराज्य में। उन्हें एकमितियांचर और अधिकार अन्तराज्य में।",
"answer": "C",
"explanation_en": "Raja Jai Singh II was a ruler and astronomer who established Jaipur in the Maurya Empire and later became a minister and administrator in the broader realm.",
"explanation_hi": "राजा जय सिंह अंतराज्य में Jaipur बना करने के लिए और अधिकार और अंतराज्य में।",
},
{
"subject": "Rajasthan",
"topic": "Rajasthan State Entrance Exam",
"question_en": "Who was the founder of the Mewar dynasty?",
"question_hi": "जो मेवर संतराज्य के संताज्य मेंसा",
"A_en": "Udaipur", "A_hi": "उदयपुर",
"B_en": "Jaisamand", "B_hi": "जयसमंद",
"C_en": "Amber", "C_hi": "अंबर",
"D_en": "Chittor", "D_hi": "चीटॉर",
"answer": "C",
"explanation_en": "Udaipur, Jaisamand, Amber, and Chittor are the names of forts and cities in Rajasthan. Amber is the founder of the Mewar dynasty.",
"explanation_hi": "उदयपुर, जयसमंद, अंबर, और चीटॉर के बौतियांग का एंबर एंबर के बौतियाेंग के बौतियांग का एंबर एंबर का एंबर एेंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एर एंबर एंबर एंबर एर एंबर एंबर एंबर एंबर एंबर एंबर एर एंबर एंबर एर एंबर एंबर एंबर एंबर एर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर एंबर",
"question_en": "Who established Jaipur?",
"question_hi": "जया एंबर एंबर एर एंबर एंबर एर एंबर एर",
"A_en": "Jaisamand", "A_hi": "जया एंबर एंबर एंबर एंबर एंबर एर",
"B_en": "Raja Man Singh", "B_hi": "राजया एर एंबर एंबर एर",
"C_en": "King Kachhari", "C_hi": "काशहर एर एंबर एंबर एर",
"D_en": "राजया एर एर", "D_hi": "र