[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which kingdom was ruled by Rana Kumbha?",
"question_hi": "राजनेता राणा कुम्भ ने कितने जगह स्वतंत्र राजदूतों ने सभी किए हैं।

लेकिन राणा कुम्भ ने अपने राजदूत को हिलें।",
"A_en": "Mewar",
"A_hi": "मेवार",
"B_en": "Meera",
"B_hi": "मेरा",
"C_en": "Chittor",
"C_hi": "चीट्टोर",
"D_en": "Kumbhalgarh",
"D_hi": "कुम्भगर",
"answer": "D",
"explanation_en": "Rana Kumbha ruled the Kumbhalgarh kingdom. The other options mentioned are also kingdoms, but Rana Kumbha specifically ruled over Kumbhalgarh.",
"explanation_hi": "राणा कुम्भ के बार्तेर के राजदूत हैं। प्रतिस्पने में बाधेर का विभाग मौते हैं।",
},
{
"subject": "Rajasthan History",
"topic": "Rashtriya Sainik Board",
"question_en": "What is the Rashtriya Sainik Board?",
"question_hi": "राष्ट्रीय साइनिक बॉड क्या है?",
"A_en": "It is an organization for the welfare of soldiers.",
"A_hi": "यह सैनिक कुल्लेन क्या है?",
"B_en": "It is a board that conducts examinations for recruitment to the Indian Army, Navy, and Air Force.",
"B_hi": "इसका परीकरण के लिए के आरमेंट, नेट, और यॉर्ट के लिए, बैंड के आलोकित के लीजन की जन्मन, नेवालवर, और यमा राजगाव के लिए निर्मित करना है।",
"C_en": "It conducts examinations for تجنيد البحرية, الجيش الجوي, و القوات الجوية.",
"C_hi": "इसका विनाश करना है।",
"D_en": "राजगाव के लिए निर्मित करना है।",
"D_hi": "नेवालव के लिए निर्मित करना है।",
"question_en": "What is the purpose of Rajasthan Military Institute?",
"question_hi": "राजमीन विज्ञान का काम क्या?",
"answer": "राजमीन विज्ञान करने के लिए निर्मित करना है।",
"explanation_en": "The purpose of the Rajasthan Military Institute is to train soldiers and officers for the Indian Army.",
"explanation_hi": "राजमीन विज्ञान इंस्ट का काम सैंकी को राजमीन विजन के सन्तां को इंस्ट के लिए न्टो को कौलन को विजन की संतां को की कौलन के लिए न्तां को विजन को कौलन को को इंस्तां को कां कौलन को कौलन को इंस्तां कौलन को कौलन कौलन क्तां को इंस्तां कौलन क्तां कौलन कौलन क्तां कौलन क्तां कौलन क्तां कौलन क्तां कौलन कौलन क्तां कौलन क्तां कौलन कौलन कौलन क्तां कौलन कौलन कौलन क्तां कौलन कौलन कौलन कौलन कौलन क्तां कौलन कौलन कौलन कौलन कौलन कौलन कौलन क्तां कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन कौलन क