[
{
"subject": "Rajasthan History",
"topic": "Rajputana Region",
"question_en": "Which among the following rulers belonged to the Rajputana region?",
"question_hi": "सभी विभाग के अधिकांतितां के लिए किस विभाग में राजपूतों की मात्रा है?",
"A_en": "Prithviraj Chauhan",
"A_hi": "प्रिथ्वार्जेश्चन्द्र",
"B_en": "Kingdoms of Marwar",
"B_hi": "मर्वार कांग्रेस",
"C_en": "Kingdoms of Mewar",
"C_hi": "मेवार कांग्रेस",
"D_en": "Shekhawati Region",
"D_hi": "सेखावाटी केंद्र",
"answer": "C",
"explanation_en": "The kingdoms of Mewar, also known as the Shekhawati region, are renowned for their contributions to Rajasthan's history.",
"explanation_hi": "मेवार कांग्रेस, ये राजनी भवन्ति केंद्र का नाम भी एक अर्थ भवन्ति का संस्करण बचना में उपयोग का निवेदार भूमि में संस्करण बचना में मुखनी संस्करण बचना में उपयोग का निवेदार भूमि में संस्करण बचना में उपयोग का निवेदार भूमि में संस्करण बचना में उपयोग का निवेदार भूमि में संस्करण बचना में उपयोग का निवेदार भूमि में संस्करण बचना में उपयोग का निवेदार भूमि में संस्करण बचना में उपयोग का निवेदार भूमि में संस्करण बचना में उपयोग का निवेदार भूमी में संस्करण बचना में उपयोग का निवेदार भूमी में संस्करण बचना में उपयोग का निवेदार भूमी में संस्करण बचना में उपयोग का निवेदार भूमी में संस्करण बचना में उपयोग का निवेदार भूमी में संस्करण बचना में उपयोग का निवेदार भूमी में संस्करण बचना में उपयोग का निवेदार भूमी में संस्करण बचना में उपयोग का निवेदार भूमी में संस्करण बचना में उपयोग का निवेदार भूमी में सं करण बचना में उपयोग का निवेदार भूमी में सं करण बचना में उपयोग का निवेदार भी में करण बचना में उपयोग का निवेदार भी में करण बचना में उपयोग का निवेदार भी में करण बचना में उपयोग का निवेदार भी में करण बचना में उपयोग का निवेदार भी में करण बचना में उपयोग का निवेदार भी में करण बचना में उपयोग का निवेदार भी में का निवेदार भी में करण बचना में उपयोग का निवेदार भी में का निवेदार",
"
]
}
{
"subject": "Rajasthan History",
"topic": "S Rajput Kings",
"question_en": "Which Rajput king ruled Rajasthan before the establishment of the Mewar kingdom?",
"question_hi": "में का निवेदार भी में का निवेदार भी म