[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Famous Forts",
"question_en": "What is the capital of Rajasthan and which famous fort is associated with it?",
"question_hi": "राजस्थान की राजधानी और इसका संबंधित एक खतरनाक क्या है।",
"A_en": "Jaipur",
"A_hi": "जयपुर",
"B_en": "Amber Fort",
"B_hi": "अम्बर फोट",
"C_en": "Mehrangarh Fort",
"C_hi": "मेरनगर फोट",
"D_en": "Hawa Mahal",
"D_hi": "हवा महाल",
"answer": "B",
"explanation_en": "Jaipur, the capital of Rajasthan, is associated with the Amber Fort.\nAmer Fort, also known as Amber Fort, is a famous historical fort located in Jaipur, Rajasthan. It was built by Maharaja Mansingh I in 1592 AD and is known for its beautiful architecture.",
"explanation_hi": "राजस्थान की राजधानी की जावर फोट है।\nएमबी फोट, Amer Fort का सरल तथा इतिहाँ मंगलों में बैन्नों में दिए गए हैं।",
"question_en": "Name the capital city of Rajasthan and the famous fort associated with it?",
"question_hi": "राजस्थान के राजधानी और इसका स्पष्ट और खुशी का संबंध क्या है?",
"answer": "B",
"explanation_en": "The capital city of Rajasthan is Jaipur, and the famous fort associated with it is Amer Fort.\nThe fort was built by Raja Man Singh I in the 16th century and is located in the Amber region near Jaipur.",
"explanation_hi": "राजस्थान के राजधानी है। यह इतिहाँ के राजधानी के सबसाठिक सांत्राणी का संबंध है।",
"question_en": "Which is the capital city of Rajasthan and which is the historical monument associated with it?",
"question_hi": "राजस्थान के प्राचक्षता और इतिहाँ के संत्राणी का संबंध है।",
"answer": "B",
"explanation_en": "The capital city of Rajasthan is Jaipur, and the historical monument associated with it is Amer Fort.\nAmer Fort, also known as Amer Fort, is located near Jaipur and was built by Raja Man Singh I in the 16th century.",
"explanation_hi": "राजस्थान के प्राचक्षता है। इसके संत्राणी का संबंध है।",
"question_en": "Which is the capital city of Rajasthan and what historical monument is associated with it?",
"question_hi": "राजस्थान के प्राचक्षता है। इसके संत्राणी का संत्राणी को क्यामरियाँ है।",
"answer": "B",
"explanation_en": "The capital city of Rajasthan is Jaipur and the historical monument associated with it is Amer Fort.\nAmer Fort, also known as Amer Fort, is a significant monument located near Jaipur and was built by Raja Man Singh I in the 1590s.",
"explanation_hi": "राजस्थान के प्राचक्षता है। इसको संत्राणी का संत्राणिया है।",
"question_en": "What is the capital city of Rajasthan and which historical monument is associated with it?",
"question_hi": "राजस्थान का प्राचक्षता है। इसको संत्राणी का संत्राणी का संत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राी का सांत्राणी का सांत्राणी का सांत्राणी का सांती का सांत्राणी का सांत्राणी का सांती का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्राणी का सांत्