[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which historic palace served as the residence of Maharaja Mansingh I during the construction of Amber Fort?",
"question_hi": "अम्बर के बनें के वर्ग मंसिंग एल के राजधानी के विभाग का एक नवंबर में बनना सहीत वर्ग मंसिंग I के राजधानी के विभाग का एक नवंबर में बनना सहीत, वर्ग मंसिंग I के राजधानी के विभाग का एक नवंबर में बनना सच्चारित, वर्ग मंसिंग I के राजधानी के विभाग का एक नवंबर में बनना सच्चारित, वर्ग मंसिंग I के राजधानी के विभाग का एक नवंबर में बनना सच्चारित, वर्ग मंसिंग I के राजधानी के विभाग का एक नवंबर में बनना सच्चारित, वर्ग मंसिंग I के राजधानी के विभाग का एक नवंबर में बनना सच्चारित, वर्ग मंसिंग I के राजधानी के विभाग का एक नवंबर में बनना सच्चारित, वर्ग मंसिंग I के राजधानी के विभाग का एक नवंबर में बनना सच्चारित, वर्ग मंसिंग I के राजधानी के विभाग का एक नवंबर में बनना सच्चारित, वर्ग मंसिंग I के राजधानी के विभाग का एक नवंबर में बनना सच्चारित, वर्ग मंसिंग I के राजधानी के विभाग का एक नवंबर में बनना",
"answer": "D",
"options_en": [
{
"option_text": "Jaipur",
"option_value": "A",
"explanation_en": "Jaipur is the capital of Rajasthan."
},
{
"option_text": "Alwar",
"option_value": "B",
"explanation_en": "Alwar is a town but not a capital."
},
{
"option_text": "Jodhpur",
"option_value": "C",
"explanation_en": "Jodhpur is the capital of Jodhpur district in Rajasthan."
},
{
"option_text": "Udaipur",
"option_value": "D",
"explanation_en": "Udaipur is a city in Rajasthan but not a capital."
},
{
"option_text": "Ajmer",
"option_value": "E",
"explanation_en": "Ajmer is a town and holy city in Rajasthan."
}
},
"options_hi": [
{
"option_text": "जैया",
"option_value": "ए",
"explanation_hi": "जैया ए होंहर हित, जैया हिर हर हर हांर हर हर हर हर हार हर हर हार हर हर हैया हर हर हार हर हर हर हार हर हर हार हर हार हर हार हर हर हार हर हार हार हर हार हार हार हर हार हार हार हार हार हर हार हार हार हर हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हार हा