[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort was built by Raja Man Singh of Amber?",
"question_hi": "आमरणी के गैरिया के लिए बनाया गया फोट किस राजा के काम करने वाला था।",
"A_en": "Amber Fort",
"A_hi": "आमरणी को।",
"B_en": "Kumbhalgarh Fort",
"B_hi": "कुम्भलगढ़ को।",
"C_en": "Mehrangarh Fort",
"C_hi": "मेरंगार को।",
"D_en": "Jaigarh Fort",
"D_hi": "जयगर को।",
"answer": "C",
"explanation_en": "Mehrangarh Fort was built by Rao Jodhaji, the founder of Jodhpur. The answer is based on the fact that Rao Jodhaji was the ruler of Jodhpur and the fort is located there.",
"explanation_hi": "मेरंगार को। यह सर्वौलनी के संचयों के से बनाया गया है। इस उत्तरानी के संचयों से बनाया गया है।",
},
{
"subject": "Rajasthan History",
"topic": "Rajput Maharajas",
"question_en": "Who was the founder of Mewar dynasty?",
"question_hi": "मेवानी के संचयों के लीला महाराज के संचयों के संचयों के लीला महाराज के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के संचयों के लीला महाराज के लीला महाराज के संचयों के लीला महाराज के लीला महाराज के संचयों के लीला महाराज के लीला महाराज के लीला महाराज के लं के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला महाराज के लीला