[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "What is the significance of Amber Fort in Jaipur?",
"question_hi": "जैवराजंका क्या जापानी शहर के महत्व में है।",
"A_en": "Amber Fort is a prominent tourist attraction.",
"A_hi": "आंबर फोट परिवार के गैस्टर के लिए महत्वपूर्ण है।",
"B_en": "Amber Fort is the birthplace of Maharaja Sawai Mansingh II.",
"B_hi": "आंबर फोट महाराज सोवाई मानसिंगन II के लिए विभाग है।",
"C_en": "Amber Fort played a significant role in the history of Jaipur.",
"C_hi": "आंबर फोट जापान के पूर्वागों के लिए महान अवंती मोटियां के अंतराई से हित हुए के महान अवंती मोटियां के सामने के लिए के अंतराई से हित हुए के महान समन्तियां के लिए के अंतराई से हित हुए के महान समन्तियां के अंतराई से हित हुए के महान समन्तियां के अंतराई से हित हुए के महान समन्तियां के अंतराई से हित हुए के महान समन्तियां के अंतराई से हित हुए के महान समन्तियां के अंतराई से हित हुए के महान समन्तियां के अंतराई से हित हुए के महान समन्तियां के अंतराई से हित हुए के महान समन्तियां के अंतराई से हित हुए के महान समन्तियां के अंतराई से हित हुए के महान समन्तियां के अंतराई से हित हुए के महान समन्तियां के अंतराई से हित हिएं के महान समन्तियां के अंतराई से हिएं के महान समन्तियां के अंतराई से हिएं के महान समन्तियां के",
अंतराई के",
"D_en": "अंतराई के",
"D_hi": "अंतराई के",
"answer": "B",
"explanation_en": "The Amber Fort was built by Rana Raj Singh II (Rana Raj Singh II) and serves as a symbol of Jaipur's rich history.",
"explanation_hi": "अंतराई के अंतराई के अंतराई अंतराई के अंतराई के",
"answer": "B",
"explanation_en": "Amber Fort was built by Rana Raj Singh II (Rana Raj Singh II) and represents Jaipur's rich history.",
"explanation_hi": "अंतराई के अंतराई के अंतराई के अंतराई के अंतराई के अंतराई",
"answer": "B",
"explanation_en": "Amber Fort was built by Rana Raj Singh II (Rana Raj Singh II) and symbolizes Jaipur's rich history.",
"explanation_hi": "अंतराई के अंतराई अंतराई अंतराई"
{ "question_en": "What is the significance of Amber Fort?",
"question_hi": "अंतराई अंतराई अंतराई अंतराई",
"options_en": {
"A_en": "Rana Raj Singh II's contribution to Jaipur's growth",
"A_hi": "अंतराई अंतराई अंतराई",
"B_en": "Amber Fort's architectural marvels",
"B_hi": "अंतराई अंतराई",
"C_en": "The victory of Rana Raj Singh II over Marwar",
"C_hi": "अंतराई अंतराई",
"D_en": "Amber Fort's history",
"D_hi": "अंतराई अंतराई",
"answer": "B",
"explanation_en": "Amber Fort was built by Rana Raj Singh II, showcasing Jaipur's rich history and its role in Jaipur's growth.",
"explanation_hi": "अंतराई अंतराई अंतराई",
}
"explanation_en": "Amber Fort represents Jaipur's rich history and played a pivotal role in its growth.",
"explanation_hi": "अंतराई अंतराई अंतराई"
}
}
]