[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who is responsible for the construction of Chittorgarh Fort?",
"question_hi": "चिट्टोगर की बनीं के लिए कौन सा लोग प्रणाम है।",
"A_en": "Kumbha",
"A_hi": "कुम्भवन",
"B_en": "Prithvi Raj Chauhan",
"B_hi": "पृथ्वी राज चौहान",
"C_en": "Rao Jodha",
"C_hi": "राव जोधा",
"D_en": "Sachin Thakur",
"D_hi": "सचिन थाकूर",
"answer": "C",
"explanation_en": "Chittorgarh Fort was built by Rao Jodha, who was the founder of Mewar region.\nIn Hindi, the explanation would be: चिट्टोगढ़ किया गया उसके प्रतिमान करने वाला उसने चिट्टोगढ़ को बना दी गई थी राजस्थान के भाग के प्रतिमान करने वाले उसने चिट्टोगढ़ को बना दी गई थी।",
"answer": "C",
"explanation_en": "Rao Jodha, the proud builder of Chittorgarh Fort, built the fort during the establishment of the Mewar region.",
"question_en": "Who built Chittorgarh Fort and in which era did it get built?",
"question_hi": "चिट्टोगढ़ को बनाया गया और यहां कैसाठमी पर बना गया गया?",
"question_hi": "चिट्टोगढ़ को बनाया गया और यहां कैसाठमी पर बना गया गया?",
"explanation_hi": "चिट्टोगढ़ी को बनाया गया गया और यहां कैसाठमी पर बना गया गया?",
"question_en": "Who built Chittorgarh Fort and when was it constructed?",
"answer": "चिट्टोगढ़ को बनाया गया गया और यहां कैसाठमी पर बना गया गया?",
"explanation_en": "Chittorgarh Fort was constructed during the Kshatriya period and was built by Rao Jodha.",
"explanation_hi": "चिट्टोगढ़ को कष्ट्री पर बना गया गया गया गया और यहां कैसाठमी पर बना गया गया गया गया गया?",
"question_en": "Which king built the Chittorgarh Fort and when was it constructed?",
"question_hi": "चिट्टोगढ़ की विभिने वाला हुए सता गुजा गुजा गुजा गुजा गुजा गुजा गुजा गुजा गुजा गुजा",
"answer": "C",
"explanation_en": "King Rana Meera Singh (Kumbha) built the Chittorgarh Fort and it was constructed during the Kshatriya period.",
"explanation_hi": "राज्यांगया का कुमबहासिन का बने वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला",
 वाला वाला वाला वाला वाला वाला वाला वाला वाला वाला",
"answer": "B",
"explanation_en": "The Chittorgarh Fort was built by Rana Rawal Khem Singh during the Chauhan dynasty and it was constructed in the वाला वाला वाला वाला वाला",
"question_hi": "चीतरितरतरतरीरतरतरतर",
"answer_hi": "B",
"explanation_hi": "Chittorgarh Fort was built by Rana Rawal Khem Singh during the Chauhan dynasty and it was constructed during the Chauhan period in the वाला वाला वाला",
"answer": "B",
"question_en": "Who constructed the Chittorgarh Fort?",
"question_hi": "चीतरीरतरतरतरतर",
"explanation_en": "Rana Rawal Khem Singh, the ruler of Chittorgarh Fort was constructed in the वाला वाला वाला",
"explanation_hi": "चीतरतरतरतरतरतरतरतरतर",
"answer": "B",
}
]