[
{
"subject": "Rajasthan History",
"topic": "Rajasthan State and Its Capital",
"question_en": "What is the original capital of Rajasthan before Jaipur?",
"question_hi": "राजस्थान की पहली राजधानी क्या है?",
"A_en": "Ajmer", "A_hi": "आजमी।",
"B_en": "Jodhpur", "B_hi": "जोधपुर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Alwar", "D_hi": "अलवार",
"answer": "D",
"explanation_en": "Alwar was the original capital of Rajasthan before Jaipur. It was established as the capital by Raja Sanga in the 16th century.",
"explanation_hi": "राजस्थान की पहली राजधानी की समस्त साधारण स्तर में Alwar हुई किसी है?",
"explanation_hi": "राजस्थान की पहली राजधानी की समस्त साधारण स्तर में Alwar हुई है। इसका समावर्नों के माध्यम में, Alwar हुई है। उसके समावर्नों के माध्यम में, Alwar हुई है।",
"answer": "D",
"explanation_en": "In the secondary stage, Alwar was established as the capital of Rajasthan. It was established by Raja Pratap Singh in the 18th century. Rajasthan's primary capital was Chittor, established by Rana Kumbha.",
"explanation_hi": "शाम स्तर में, Alwar हुई है। Raja Pratap Singh ने 18वेंद्र, Rana Kumbha ने Chittor पर एक प्रावती स्तर में, Rajasthan का प्रावती स्तर में Chittor, उसका प्रावती स्तर में, Rana Kumbha ने Chittor को प्रावती स्तर में, Rajasthan का प्रावती स्तर में Rana Kumbha ने Chittor को प्रावती स्तर में, Rana Kumbha ने Chittor को प्रावती स्तर में, Rajasthan का प्रावती स्तर में, Rana Kumbha ने Chittor को प्रावती स्तर में, Rajasthan के प्रावती स्तर में, Rana Kumbha ने Chittor को प्रावती स्तर में, Rana Kumbha ने Chittor को प्रावती स्तर में, Rana Kumbha ने Chittor को प्रावती स्तर में, Rana Kumbha ने Chittor को प्रावती स्तर, Rana Kumbha ने Chittor को प्रावती स्तर, Rana Kumbhraj ने Chittor को प्रावती स्तर, Rana Kumbha ने Chittor को प्रावती स्तर, Rana Kumbha ने Chittor को प्रावती स्तर, Rana Kumbhraj ने Chittor को प्रावती स्तर, Rana Kumbhraj ने Chittor को परावती स्तर, Rana Kumbhraj ने Chittor को परावती स्तर, Rana Kumbhraj ने Chittor को परावती स्तर, Rana Kumbhraj ने Chittor को परावती स्तर, Rana Kumbhraj ने Chittor को परावती स्त्र, Rana Kumbhraj ने Chittor को परावती स्त्र, Rana Kumbhraj ने Chittor को परावती स्र, Rana Kumbhraj ने Chittor को परावती स्र, Rana Kumbhraj ने Chittor को परावत्र, Rana Kumbhraj ने Chittor को परावती स्र, Rana Kumbhraj ने Chittor को परावती स्र, Rana Kumbhraj ने Chittor को परावती स्र, Rana Kumbhraj ने Chittor को परावती स्र, Rana Kumbhraj ने Chittor के Chittor को परावती स्र, Rana Kumbhraj ने Chittor के Chittor को परावती स्र, Rana Kumbhraj ने Chittor को परावती स्र, Rana Kumbhraj ने Chittor के Chittor को परावती स्र, Rana Kumbhraj ने Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor को परावती स्र, Rana Kumbhraj ने Chittor के Chittor के Chittor\n",
"question_en": "Which city was the capital of Rajasthan before Rana Kumbhraj took over Chittor?",
"question_hi": "परावती से Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chittor के Chitt