[
{
"subject": "Rajasthan History",
"topic": "Rajasthan State Formation",
"question_en": "Which districts were included in the formation of the Rajasthan state?",
"question_hi": "राजस्थान की संरक्षण में केन्द्रधारा को कैसे सूचना कीती जाती है।",
"A_en": "Jaipur, Jodhpur, Udaipur, Alwar, Bharatpur, Bikaner, Sikar, Dausa, Banswara, Kota",
"A_hi": "जयपुर, जोधपुर, उदयपुर, आलवार, बहरतपुर, बिकानेर, सिकार, डॉसा, बांसवारा, कोटा",
"B_en": "Which of the following districts was added to Rajasthan after it was formed?",
"B_hi": "Rajasthan को बनाया गया पूर्वों और अंतर्कों को कैसे संचय की जांचर और एसी के में एक जमाने की जांचर की संचय की एसी के में कैसे संचय की एसी के में एक जमाने की जाने की संचय की एसी के में कैसे संचय की एसी के में एक जमाने की जाने के में कैसे संचय की एसी के में एक जमाने की जाने के में कैसे संचय की एसी के में एक जमाने की जाने के में कैसे संचय की एसी के में कैसे संचय की एसी के में एक जमाने के में कैसे संचय की एसी के में एक जमाने के में कैसे संचय की एसी के में एक जमाने के में कैसे संचय की एसी के में कैसे संचय की एसी के में एक जमाने के में कैसे संचय की एसी के में कैसे संचय की एसी के में एक जमाने के में कैसे संचय की एसी के में एक जमाने कैसे संचय की एसी के में एक जमाने कैसे संचय की एसी के में एक जमाने कैसे संचय की एसटयके में एक जमाने कैसे संचय कैसे में एक जमाने कैसे संचय कैसे एक जमाने एक जमानैसंचयक एक जमाने एक जमाने एक जमाने एक जमाने एक जमाने एक जमाने एक",
"answer": "B",
"explanation_en": "After the merger of Jodhpur, Alwar, Kota, Banswara, Dausa, and parts of Sawai Khera district into Rajasthan, Jodhpur, Alwar, Kota, Banswara, Dausa, and parts of Sawai Khera district added to Rajasthan.",
"explanation_hi": "जमाने एक जमाने एक जमाने एक जमाने एक जमाने एक जमाे एक",
"question_en": "What districts were merged with Rajasthan to form a new state?",
"question_hi": "जमाे एक जमाे एक जमाे एक जमाे एक",
"A_en": "Jodhpur, Alwar, Kota, Banswara, Dausa",
"A_hi": "जमाे एक जमाे एक जमाे एक",
"B_en": "Which part of Sawai Khera district was merged with Rajasthan?",
"B_hi": "जमाे एक जमाे एक जमाे एक",
"C_en": "Which districts were merged with Rajasthan to form a state?",
"C_hi": "जमाे एक जमाे एक",
"D_en": "Which parts of Sawai Khera district were merged with Rajasthan?",
"D_hi": "जमाे एक जमाे एक जमाे एक",
"E_en": "Which region was merged with Rajasthan?",
"E_hi": "जमाे एक जमाे एक",
"question_en": "जमाे एक जमाे एक",
"question_hi": "जमाे एक जमाे एक",
"answer": "B",
"explanation_en": "After the merger of Jodhpur, Alwar, Kota, Banswara, Dausa, and parts of Sawai Khera district came together to form Rajasthan.",
"explanation_hi": "जमाे एक जमाे एक जमाे एक एक",
"question_en": "जमाे एक जमाे एक",
"question