[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort and palace is located in Jaipur?",
"question_hi": "जयपुर में कौन से पसंदगी और मैदान है।",
"A_en": "Amber Fort", "A_hi": "आमर मंदिर",
"B_en": "City Palace", "B_hi": "शामर कांचना",
"C_en": "Hawa Mahal", "C_hi": "हवा महाल",
"D_en": "Gaitor", "D_hi": "गैटर",
"answer": "B",
"explanation_en": "City Palace is located in Jaipur. Amber Fort and Hawa Mahal are also famous tourist attractions in Jaipur, but they are not specifically located in Jaipur.",
"explanation_hi": "जयपुर में शामर कांचना सम्पतित है। आमर मंदिर और हवा महाल भी जयपुर में पसंदगी की जानकारी हैं, लेकिन स्पष्ट गैरी हैं।",
"answer": "B",
"explanation_en": "City Palace is one of the major tourist attractions in Jaipur, Rajasthan, India. Amber Fort and Hawa Mahal are also popular tourist places in Jaipur. Gaitor is a city in Rajasthan, which is not located in Jaipur.",
"explanation_hi": "जयपुर, राजस्थान, भारत, इंडीजन में City Palace एक मुखनाति के एक मुखनाति है। आम्बे फोट और हावा महाल भी जयपुर, राजस्थान, भारत, इंडीजन में पसंदगी के मुखनाति हैं।",
"answer": "B",
"explanation_en": "City Palace is a popular tourist attraction in Jaipur, Rajasthan, India. Amber Fort and Hawa Mahal are also famous tourist places in Jaipur. Gaitor is not located in Jaipur.",
"explanation_hi": "जयपुर, राजस्थान, भारत, इंडीजन में पसंदगी के मुखनाति हैं।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthani Kings and Queens",
"question_en": "Which famous Rajasthani queen is associated with the construction of City Palace?",
"question_hi": "राजस्थान में लचाई के विभिजन की बनाई के लक्ष्मी को City Palace के बनने में ज्ञा के लक्ष्मी को बनाई के लक्ष्मी को City Palace के बनने में ज्ञा को बनाई के लक्ष्मी को City Palace को बनने के लीकेरको बनाई को City Palace के बनने के लक्ष्मीको बनाई को City Palace के बनने के लीकेरको बनाई को City Palace को बनने के लीको बनाई को बनने के लकेरको City Palace को बनने को बनाई को बनने के लको बनने को City Palace को बने को बनाई को बने को City Palace को बने को बने को बने को City Palace को बनने को बने को बने को City Palace को बने को बने को बने को City Palace को बने को बेको बने को City Palace को बने को बने को बने को बने को City Palace को बने को बने को बने को बने को City Palace के के को बे के को बे को City Palace को बने के के को बे के को City Palace के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के",
}
]