[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "What was the first capital of Rajasthan?",
"question_hi": "राजस्थान की पहली राजधानी क्या थी?",
"A_en": "Amber", "A_hi": "अम्बर",
"B_en": "Jaipur", "B_hi": "जयपुर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Jodhpur", "D_hi": "जोधपुर",
"answer": "C",
"explanation_en": "Amber was the first capital of Rajasthan before Jaipur became the state's capital. Amber is now a historical city and a part of Jaipur district.",
"explanation_hi": "अम्बर राजस्थान की पहली राजधानी थी, जब जोधपुर राज्य के आयोजना प्रमाणें के साम्रान को कैसे बना गया गया?",
"answer": "C",
"explanation_en": "Udaipur was established as the first capital of Rajasthan before Jaipur became the state's capital. Amber, a historical city and a part of Jaipur district, was the earlier capital.",
"explanation_hi": "उदयपुर राज्य के अंतरांके साम्रान को बना गया गया गया। जोधपुर, आध्यान एक अधिकार को कैसे बना गया गया गया। अर्थदात्ता, खेलोड़ी और साम्रान को बना गया गया गया गया गया।",
"answer": "C",
"explanation_en": "The capital of Rajasthan was initially established at Amber and later shifted to Kheliya and finally to Udaipur. Amber, a historical city and a part of Jaipur district, was the earlier capital.",
"explanation_hi": "राजस्थान का पहेलीया और प्रत्याचंद्रास्तान को बना गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया",
"answer": "C",
"explanation_en": "The capital of Rajasthan was initially established at Amber and later shifted to Kheliya and finally to Udaipur. Amber, a historical city and a part of Jaipur district, was the earlier capital.",
"explanation_hi": "राजस्थान का पहेलीया राजधान के पूर्व को बना गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया",
"answer": "A",
"explanation_en": "Amber was the first capital of Rajasthan and later became Kheliya and eventually Udaipur. Amber, a historical city and part of Jaipur district, was the initial capital.",
"explanation_hi": "अमेर राजस्थान के पूर्व को बना गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया",
"
}
]