[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "What is the significance of Chittorgarh Fort?",
"question_hi": "चिट्टोगरगढ़ Fort क्या महत्व है।",
"A_en": "It is the largest fort in India.",
"A_hi": "इसका अधिकांत भारत में एक बड़ा कुमारी है।",
"B_en": "It is a symbol of Rajput valor and bravery.",
"B_hi": "इसका महत्व राजपूती की प्रधानिकता और प्रभुती की प्रसारण",
"C_en": "It houses the remains of Chittorgarh Fort.",
"C_hi": "इसमें चिट्टोगढ़ Fort की मौती है।",
"D_en": "It is a popular tourist destination.",
"D_hi": "इसका प्रभुति है।",
"answer_index": 2,
"explanation_en": "Chittorgarh Fort holds great historical and cultural significance in Rajasthan. As a symbol of Rajput valor and bravery, it has become a popular tourist destination. The remains of Rana Kumbha, Rani Padmini, and other historical figures are preserved in this fort.",
"explanation_hi": "चिट्टोगढ़ Fort का आध्याद्वार मति और प्रभुति बंगाँ और राजपूतियाँ की मति और प्रभुति बंगाँ, राजपूतियाँ की मति और प्रभुति बंगाँ, राजपूतियाँ की मति और प्रभुति बंगाँ, राजपूतियाँ की मति, प्रभुति बंगाँ के राजपूति, प्रभुति बंगाँ के राजपूति, प्रभुति बंगाँ के विहितान्ती के लिए।",
"question_en": "What is the significance of Chittorgarh Fort among the rulers of Mewar?",
"question_hi": "चिट्टोगढ़ Fort मेवर्षि के लीकोणें के लिए।",
"options_en": [
{
"option_id": 1,
"option_text": "Home to the Chittorgarh Fort",
"option_en": "मेवर्षि के लीकोणें देते हुए हैं।",
"option_hi": "चिट्टोगढ़ Fort देते हुए होंने के लीकोणें के लीकोणें के लिए हुए होंने के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें के लीकोणें कें के लीकोणें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें कें