[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Capital Changes",
"question_en": "Which city served as the capital of Rajasthan before Jaipur?",
"question_hi": "जैसा राजस्थान सेवानिविचारण के पहले विभिन्न किस शहर था?",
"A_en": "Amer", "A_hi": "इमो",
"B_en": "Udaipur", "B_hi": "उदयपुर",
"C_en": "Jaisamand", "C_hi": "जयसामान्द",
"D_en": "Alwar", "D_hi": "अलवार",
"answer": "C",
"explanation_en": "Before Jaipur became the capital of Rajasthan in 1727, it was Udaipur (Fatehpur) that served as the capital of Mewar kingdom.",
"explanation_hi": "राजस्थान के पहले विभिन्न की आदिवार राजधानी बने, लेकिन पहले मेवाई राजधानी का विभिन्न बने राजधानी बने, मेवाई राजधानियों के बने राजधानी बने, लेकिन मेवाई राजधानी बने राजधानी बने, अल्लों को बैन्ने राजधानी बने राजधानी बने राजधानी बैने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी बने राजधानी",
question_en": "Which city was the capital of Rajasthan before Jaipur became the capital?",
"question_hi": "जैसबने राजधानी बने राजधानी",
"options_en": [
{
"A": "Udaipur",
"B": "Jaisamand",
"C": "Rajsamand",
"D": "Kumbhalgarh",
"E": "Jaipur"
],
"options_hi": [
{
"A": "औड़पुर",
"B": "जैसंमा",
"C": "राजसंमा",
"D": "कंमा",
"E": "जैसंमंमा"
"answer": "E",
"explanation_en": "Udaipur was the capital of Rajasthan before Jaipur became the capital.",
"explanation_hi": "औड़पुर पंमंमा राजसंंमा पंमा राजंमा पंमा राजंमा",
"options_en": [
{
"A": "Gwal",
"B": "Alwar",
"C": "Jodhpur",
"D": "Dushar",
"E": "Udaipur"
"options_hi": [
{
"A": "गवांमा",
"B": "अलुर",
"C": "जंमा",
"D": "अंमा",
"E": "औड़ंमा"
"answer": "B",
"explanation_en": "Alwar (Alwar) was the capital of Rajasthan before Udaipur (Udaipur) became the capital.",
"explanation_hi": "अलुर (अर) तंमांर (औड़ंमा) राजंमा (औड़ंमा) तंर (अलुर) तंर (Alwar) राजंमा (Udaipur) संर (औड़ंर) तंर (Alwar) औड़ंर (Udaipur) तंर (औड़ंर) तंर (Alwar) औड़ंर (Udaipur) तंर (औड़ंर) तंर (Alwar) औड़ंर (Udaipur) तंर (औड़ंर) तंर (Alwar) औड़ंर (Udaipur) औड़ंर (औड़ंर) तंर (Alwar) औड़ंर (Udaipur) तंर (औड़ंर) तंर (Alwar) औड़ंर (Udaipur) तंर (औड़ंर) तंर (Alwar) औड़ंर (Udaipur)",
"तंर (औड़ंर) तंर (Alwar) औड़ंर (Udaipur) तंर (औड़ंर) तंर (Alwar) औड़ंर (Udaipur) तंर (औड़ंर) तंर (Alwar) औड़ंर (Udaipur) तंर (औड़ंर) तंर (Alwar) औड़ंर (Udaipur)",
"तंर (औड़ं