[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Kings and Kingdoms",
"question_en": "Which Rajput clan ruled during the establishment of Mewar Kingdom?",
"question_hi": "मेवाड़ी क्षेत्र के लिए किस Rajput की समुदाय ने संरक्षण किया।",
"A_en": "Rana Kumbha",
"A_hi": "रानी कुम्भ",
"B_en": "Rana Sanga",
"B_hi": "रानी सांघ",
"C_en": "Rana Pratap",
"C_hi": "रानी प्रतप",
"D_en": "Rao Jodha",
"D_hi": "राव जोध",
"answer": "C",
"explanation_en": "Rana Pratap is associated with the establishment of the Mewar Kingdom. He, along with his father Rana Kumbha, fought the famous battle of Haldighati against Mughal Emperor Akbar.\n\nरानी प्रतप में मेवाड़ क्लीन के साथे मेवाड़ के मेवाड़ के लिए आधिकार अक्बर के लिए सम्मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के लिए समेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे के लिए मेवाड़ के बैलिंग सीखे लिए मेवाड़ के बैलिए मेवाड़",
"B_en": "Rana Pratap",
"B_hi": "रान प्रान",
"C_en": "Rana Lakshman",
"C_hi": "रान लेमेवाड़",
"D_en": "Rana Kumar",
"D_hi": "रान कुमेवाड़",
"answer": "C",
"explanation_en": "Rana Lakshman, also known as Rana Lakshman, was a famous Rajput king of Mewar who fought against Mughal emperor Akbar.",
"explanation_hi": "रान लेमेवाड़",
} रान लेमेवाड़ रान लेमेवाड़",
"A_en": "Rana Pratap",
"A_hi": "रान प्रान",
"B_en": "Rana Kumar",
"B_hi": "रान कुमेवाड़",
"D_en": "Rana Chauhan",
"D_hi": "रान लेमेवाड़",
"question_en": "Who was the first ruler of Mewa after the death of Rana Lakshman?",
"question_hi": "रान लेमेवाड़",
"explanation_en": "After Rana Lakshman's death, Rana Lakshman succeeded Rana Pratap as the first ruler of Meowa.",
"explanation_hi": "रान लेमेवाड़", "रान लेमेवाड़",
} रान लेमेवाड़]
] रान लेमवाड़", "रान लेमेवाड़",
रान लेमेवाड़] रान लेमेवाड़",
"question_en": "Who was the first ruler of Rajasthan after Rana Pratap?",
"question_hi": "रान लेमेमवाड़",
"explanation_en": "After Rana Pratap, Rana Pratap succeeded Rana Lakshman as the first ruler of Rajasthan.",
"explanation_hi": "रान लेमेमवाड़", "रान लेमेमेवाड़",
"question_en": "What was the significance of Rana Lakshman in the history of Rajasthan?",
"question_hi": "रान लेमेमेमेमवाड़",
"explanation_en": "Rana Lakshman was a prominent ruler of Mewar and played a vital role in the preservation of Rajasthan's heritage and culture.",
"explanation_hi": "रान लेमेमेमेमेमवाड़",
} रान लेमेमेमेमेमेमवाड़",
"question_en": "Who was the Rajput king who defeated Akbar during the Battle of Haldighi?",
"question_hi": "