[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which ancient city was the capital of Rajasthan before Jaipur?",
"question_hi": "जैसी अभिज्ञानी शहर राजस्थान की राजधानी केंद्रशास्त्री शहर मुख्य प्रश्न है।",
"A_en": "Amber", "A_hi": "अम्बर",
"B_en": "Jhalrapatan", "B_hi": "झैलरापटान",
"C_en": "Pushkar", "C_hi": "पुष्कर",
"D_en": "Ajmer", "D_hi": "अजमेर",
"answer": "D",
"explanation_en": "Ajmer was the capital of Rajasthan before Jaipur. Ajmer Sharif Dargah is also a famous place in Ajmer.",
"explanation_hi": "अजमेर राजस्थान के पुर्व नंबर में राजधाना किया गया था, जबकि Jaipur मैं किया गया है। Jaipur मैं के विश्लेख और कामगढ़ मैं के विश्लेख, मैंने Jaipur को राजधाना की संधि कर दी गई है।",
"D_en": "Jaipur",
"D_hi": "जैपूर",
"answer": "B",
"explanation_en": "Jaipur was established by Maharaja Sawai Jai Singh II in 1727 and became the capital, while Amber was made the seat of the administration.",
"explanation_hi": "जैपूर महाराज़ सैपूर ने 1727 में जापूर के राजधन कर दिया था, जैबर के मैन के संतोष के लिए एम्बर को संतोष का सहाराजधन करवाई, जैबर के संतोष का सहाराजधन करने के लिए एम्बर को सहाराजधन करवाई।",
"answer": "D",
"explanation_en": "Raja Man Singh I of Amer established Jaipur as the capital in 1727 and later Maharaja Sawai Jai Singh II made Amber the capital.",
"explanation_hi": "राजा मन सिंग I of Amer ने Jaipur ko 1727 mein महाराजधन कर दिया था, जो सद्भावन महाराजधन करवाई, जैबर को सद्भावन करवाई।",
},
{
"subject": "Rajasthan",
"topic": "Geography",
"question_en": "Which river is the source of water for Jaipur city?",
"question_hi": "जैपूर श्रेष्टान मध्यवान 2015 के श्रेष्टान मध्यवान 2015 के श्रेष्टान मध्यवान 2015 के श्रेष्टान मध्यवान 2015 के श्रेष्टान मध्यवान 2015 के श्रेष्टान मध्यवान 2015 के श्रेष्टान मध्यवान 2015 के श्रेष्टान मध्यवान 2015 के श्रेष्टान मध्यवान 2015 के श्रेष्टान मध्यवान 2015 के श्रेषेष्टान मध्यवान 2015 के श्रेषेषेषेषेष्टान मध्यवान 2015 केषेषेषेषेषेषेषटान मध्यवान 2015 केषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेषेष