[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Historical Monuments",
"question_en": "Which historical monument is known as \"Sisodia Rani Ka Bagh\" in Udaipur?",
"question_hi": "उदयपुर में \"सिसोदिया रानी का भाग\" क्या है?",
"A_en": "Fateh Prakash Palace",
"A_hi": "फतह प्रकाश कंपन",
"B_en": "Lalgarh Palace",
"B_hi": "लालगढ़ कंपन",
"C_en": "Mukundara Fort",
"C_hi": "मुखंदरा कंपन",
"D_en": "Monsoon Palace",
"D_hi": "माझी कंपन",
"answer": "C",
"explanation_en": "The \"Sisodia Rani ka Bagh\" is a part of Mukundara Fort in Udaipur.\nEnglish Explanation: The \"Sisodia Rani ka Bagh\" is a part of Mukundara Fort in Udaipur. It is a beautiful palace-fort complex built by Maharana Kumbha in the 15th century. Fateh Prakash Palace and Lalgarh Palace are also famous forts in Udaipur but \"Sisodia Rani ka Bagh\" is unique due to its beautiful architecture and location within the fort.",
"explanation_hi": "उदयपुर में \"सिसोड़ी रानी का घर\" एक इतिहान कुम्बान के 15वेंकों में बनी है, जो एक अन्तर्षिता के बहुता का घर है। इसको आधी व्यवस्थान के निवृता का घर है। इसके द्वेष्टा का बहुता का घर है।",
"answer": "C",
"explanation_en": "The \"Sisodia Rani ka Bagh\" is a famous palace built by Maharana Sangita of Udaivilas. It is one of the major attractions of Udaipur.",
"explanation_hi": "उदयविलास के महराना सिसोदी का घर, जो उदयविलास के महराना सिसोदी के का घर, जो उदयविलास के महराना सिसोदी के का घर, जो उदयविलास के महराना सिसोदी के का घर, जो उदयविलास के महराना सिसोदी के का घर",
"answer": "D",
"explanation_en": "The \"Sisodhi ki Kā Bagh\" is a palace built by Maharanā Sīsodhi ka of Udaipur, which is part of Udaipur's Udai Villas. It is not related to Maharanā Sīsodhi ka palace.",
"explanation_hi": "सीसोदी के का घर, उदयपुर में उद्या विलास के का घर, जो उदयपुर में उद्या विलास के का घर, जो उदयपुर में उद्या विलास के का घर है, जो उदयपुर में उद्या विलास के का घर, जो उदयपुर में उद्या विलास के का घर है।",
"question_en": "Which historical monument is popularly known as 'Sisodhi ka Bagh' and located in Udaipur?",
"question_hi": "उदयपुर में के का घर कोका घर किया विलास कोका घर कोका घर कोका घर किया विलास का घर कोका घर कोका घर कोका घर कोका घर कोका घर कोका घर कोका घर कोका घर कोका घर कोका घर कोका घर कोका घर का घर कोका घर कोका घर कोका घर कोका घर का घर का घर का घर कोका घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर का घर",
"
}
"का घर का घर का घर का घर का घर का घर का घर का घर