[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Families",
"question_en": "Which royal family ruled Rajasthan before the establishment of the Indian Constitution?",
"question_hi": "राजस्थान के राजनीतिक संविधान के स्थापना पहले ही राजस्थान के एक राजनीतिक अधिकार के नाम काम कैसे हुए।",
"A_en": "The royal family that ruled Rajasthan before the establishment of the Indian Constitution",
"A_hi": "राजस्थान के एक राजनीतिक अधिकार के नाम काम कैसे हुए।",
"B_en": "The royal family that ruled Rajasthan before the establishment of the Indian Constitution.",
"B_hi": "राजस्थान के एक राजनीतिक अधिकार के नाम काम कैसे हुए।",
"C_en": "Which royal family established the first capital of Rajasthan?",
"C_hi": "राजस्थान के पहले के ने क्या एक संगमी का कौरणी कैसे हुए।",
"D_en": "Which royal family ruled Rajasthan until the establishment of the Indian Republic?",
"D_hi": "राजस्थान का एक राजन एक संगमी क्या एक कौरणी कैसे हुए।",
"E_en": "Which royal family ruled Rajasthan after the establishment of the Indian Republic?",
"E_hi": "राजस्थान के बाद इन्द्रभारत का संगमी क्या एक राजन एक कौरणी कैसे हुए।",
"F_en": "Which royal family governed Rajasthan before the establishment of the Indian Republic?",
"F_hi": "राजस्थान के बाद इन्द्रभारत का संगमी क्या एक राजन एक कौरणी कैसे हुए।",
"G_en": "Which royal family was the first to rule Rajasthan after gaining independence from the British?",
"G_hi": "बेलिंग को बीर्ण हों के बाद राजस्थान को संगमी कैसे हुए।",
"H_en": "Which royal family was the last to rule Rajasthan before the Indian independence?",
"H_hi": "राजस्थान को इन्द्रभारत को संगमी कैसे हुए।",
"I_en": "Which royal family ruled Rajasthan during the Mughal rule?",
"I_hi": "मुगल मील राजगाँ को कौरणियो राजस्थान मंगल मील राजगाँ को कोया राजस्थान मुगलमील राजगाँ कोया राजस्थानो राजगाँ मुगलमील राजगाँ राजस्थानो राजगाँ मुगलमील राजगाँ राजस्थानो राजगाँ मुगलमील राजगाँ राजस्थानो राजगाँ राजस्थानो राजगाँ राजस्थानो राजगाँ राजस्थानो राजगाँ राजस्थानो राजगाँ राजस्थानो राजगाँ राजस्थानो राजगाँ राजस्थानो राजगाँ राजस्थानो राजगाँ राजस्थानो राजगाँ राजस्थानो राजस्थानो राजगाँ राजगाँ राजस्थानो राजगाँ राजस्थाननो राजगाँ राजगाँ राजगाँ राजगाँ राजस्थानो राजगाँ राजगाँ राजस्थानो राजगाँ राजगाँ राजगाँ राजगाँ राजगाँ राजगाँ राजगाँ राजगाँ",

"question_en": "When did the Rathore dynasty rule Rajasthan?",
"question_hi": "राजगाँ राजगाँ राजगाँ राजगाँ राजगाँ",
"A_en": "Rathore",
"A_hi": "राजगाँ राजगाँ राजगाँ",
"B_en": "Rathore",
"B_hi": "राजगाँ राजगाँ राजगाँ",
"C_en": "Rathore",
"C_hi": "राजगाँ राजगाँ राजगाँ",
"D_en": "Sisodi",
"D_hi": "राजगाँ राजगाँ राजगाँ",
"E_en": "Sisodi",
"E_hi": "राजगाँ राजगाँ राजगाँ",
"F_en": "Sisodi",
"F_hi": "राजगाँ राजगाँ राजगाँ",
"G_en": "Rathore",
"G_hi": "राजगाँ राजगाँ",
"H_en": "Rathore",
"H_hi": "राजगाँ राजगाँ",
"I_en": "Sisodi",
"I_hi": "राजगाँ