[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which emperor established the city of Jaipur?",
"question_hi": "जापुर को किस राज्य मुख्यत: जीवनदेव ने स्थापित किया था।",
"A_en": "Akbar", "A_hi": "अकबर",
"B_en": "Shri Aravalli", "B_hi": "श्री अरवली",
"C_en": "Jaipur Rastriya", "C_hi": "जापुर राज्य",
"D_en": "Raja Man Singh", "D_hi": "राजा मांसिंग",
"answer": "D",
"explanation_en": "Raja Man Singh is credited with the establishment of Jaipur, also known as the Pink City. He was a general of the Rajput king Sawai Jai Singh II.\nEnglish translation: Raja Man Singh is associated with the establishment of Jaipur, a city famous for its pink color and named after King Sawai Jai Singh II's general.",
"explanation_hi": "राजा मांसिंग ये किया जापूर, जो पंचवेमी का रेखा करता है और लॉलपूर के नाम के द्वादद के प्रधारा की आधारन के नाम के द्वादद का उपनीय राजा होंग के तमनी नाम के द्वादद के अपनी द्वादद का उपनीय राजा होंग के द्वादद का दस्ता राजा होंग के नाम के द्वादद का उपनीय राजा होंग के नाम के द्वाददातमी राजा होंग किया इसको आचार्य राजा होंग के नाम के द्वाददातमी राजा होंग के नामों के द्वाददातमी राजा होंगों के नामों के द्वाददातमी राजा होंग के नामों के द्वाददातमी राजा होंगों के नामों के द्वाददातमी राजा होंगों के नामों के द्वाददातमी राजा होंग के नामों के द्वाददातमी राजा होंगों के नामों के द्वाददातमी राजा होंगों के नामों के द्वाददातमी राजा होंगों के नामों के द्वाददातमी राजा होंगों के नामों के द्वाददातमी राजा होंगों के नामों के द्वाददातमी राजाहोंगों के नामों के द्वाददातमी राजाहोंगों के नामोंके द्वाददातमी राजाहोंके द्वाददातमी राजाहोंके द्वाददातमी राजाहोंके द्वाददातमी राजाहोंके द्वादातमी राजाहोंके द्वादातमी राजाहोंके द्वाददातमी राजाहे द्वादातमी राजाहं द्वादातमी राजाहे द्वादातमी राजाहे द्वादातमी राजाहे द्वादातमी राजाहे द्वादातमी राजाहे दमी राजाहे द्वादातमी राजाहे द्वादातमी राजाहे द्वादातमी राजाहे द्वादातमी राजाहे द्वादातमी राजाहे द्वादातमी राजाहे द्वादातमी राजाहे द्वादातमी राजाहे द्वादाती राजाहे द्वादातमी राजाहे द्वादातमी राजाहे द्वादातमी राजाहे द्वादातमी राजाहे द्वादातमी राजाहे द्वादातमी राजाहे द्वादातमी राजाहे द्वादातमी