Sure, I can assist you with that. Here are 10 multiple-choice questions on Rajasthan History:

[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort was built by Maharaja Jai Singh II?",
"question_hi": "महाराजा जयसिंह सिंह तथा उनकी घोषणा की प्रमाणें:",
"A_en": "Amber Fort", "A_hi": "एमबर फोट",
"B_en": "Mehrangarh Fort", "B_hi": "मेरंगर फोट",
"C_en": "Kumbhalgarh Fort", "C_hi": "कुमभागलगढ़ फोट",
"D_en": "Jaigarh Fort", "D_hi": "जैगर फोट",
"answer": "C",
"explanation_en": "Kumbhalgarh Fort was built by Rana Kumbha.",
"explanation_hi": "कुमभागलगढ़ फोट कर्मचारी कुमभागलगढ़ का नाम राणा कुम्ब्ह ने बनवाई की।",
},
{
"subject": "Rajasthan History",
"topic": "Early History",
"question_en": "Which ancient city was the capital of Rajasthan before Jaipur?",
"question_hi": "जैसा हितवाई का पूर्व कांकन क्या था?",
"A_en": "Amber (Fort)",
"A_hi": "आमर (कॉन्स)",
"B_en": "Jaipur (City)",
"B_hi": "जैपूर्व (शहर)",
"C_en": "Udaipur (City)",
"C_hi": "उदयपुर (शहर)",
"answer": "B",
"explanation_en": "Jaipur, also known as the 'Pink City', was the capital of Rajasthan before Amber (Fort) and Udaipur (City). Jaipur was founded by Raja Mansingh I in 1727 CE.",
"explanation_hi": "जैपूर किया राजपुर के पंचगिल्बुल्ड की जनगर का नवीन प्रमाणी के ताराजी ने 1727 के बैंक्षदर्शिया में वित्तीन के पंचगिल्बुल्डक्स में वित्तीन के सामरशिया में वित्तीन के बैंक्षदर्शिया में वित्तीन के सामरशिया में वित्तीन के बैंक्षदर्शिया में वित्तीन के सामरशिया में वित्तीन के बैंक्षदर्शिया में वित्तीन के सामरशिया में वित्तीन के बैंक्षदर्शिया में वित्तीन के का सामरशिया में वित्तीन के बैंक्षदर्शिया में वित्तीन के बैंक्षदर्शिया में वितीन के बैंक्षदर्शिया में वितीन के बैंक्षदर्शिया में वितीन के बैंक्षदर्शिया में वितीन के बैंक्षदर्शिया में वितीन के बैंक्षदर्शिया में वें बैंक्षदर्शिया में विगया में बैं विया में बैं विगया में बैं विगया में विगया में बैं विगया में विगया में बैं विगया में विगया में बैं विगया में",
विगया में बैं विगया में बिगया में विगया में विगया में विगया में",
विगया में",
विगया में विगया में विगया में विगया",
विगया मेंविगया में",
विगया में",
विगया में विगया में",
विगया में विगया",
विगया में विगया में",
विगया में विगया",
विगया में",
विगया में",
विगया में",
विगया में",
विगया में",
विगया में",
विगया में",
विगया में",
विगया में",
विगया म