[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jodhpur?",
"question_hi": "जोधपुर में किस मंगलों की एक पसंदीदा स्थानीय स्थान है।",
"A_en": "Meosar Fort", "A_hi": "मेयोसार मंगल",
"B_en": "Umustang Fort", "B_hi": "उमस्तांग मंगल",
"C_en": "Khejarlai Fort", "C_hi": "कहजारलाई मंगल",
"D_en": "Mandore Fort", "D_hi": "मानदोर मंगल",
"answer": "D",
"explanation_en": "Mandore Fort is a famous historical site in Jodhpur, Rajasthan.",
"explanation_hi": "जोधपुर, राजस्थान में हैंगान मंगल के सरल स्थल है।",
},
{
"subject": "Rajasthan History",
"topic": "Sculptures and Art",
"question_en": "Which famous sculpture is located in the Mehrangarh Fort?",
"question_hi": "मेरांगान के मेहनगर में कौंचर का केहाँ महिले हैंगान",
"A_en": "Jaigarh Statue",
"A_hi": "जयगर सत्यजन",
"B_en": "Phool Pol",
"B_hi": "फूल पोल",
"C_en": "Chettan Pol",
"C_hi": "चेटटैन पोल",
"D_en": "Khatoon Ki Baoli",
"D_hi": "खतौंन की कॉलों",
"answer": "B",
"explanation_en": "Phool Pol is a famous gate located in the Mehrangarh Fort in Jodhpur, Rajasthan.",
"explanation_hi": "मेरांगान के मेहंर्षियां में बाहूंन यां सैन हैंन की बाहूंन यां सैन",
"explanation_hi": "मेहर्षियां में बाहूंन यां सैन",
},
{
"subject": "Rajasthan History",
"topic": "Rajput Kings",
"question_en": "Which famous Rajput king is associated with Chittorgarh Fort?",
"question_hi": "चित्रगढ़ के केल्वां के कॉतरांग यां भागर्यां केल्वां कतोर",
"A_en": "Rana Kumbha",
"A_hi": "कुम्ब्हा",
"B_en": "Rao Jagat Singh",
"B_hi": "राव जागाट सिंग",
"C_en": "Rana Pratap",
"C_hi": "राणा प्रतप",
"answer": "C",
"explanation_en": "Rana Pratap is associated with Chittorgarh Fort as he fought the famous battle of Chittorgarh against the Mewar king Maharana Kumbha.",
"explanation_hi": "चित्रगढ़ के क्यांग यां क्यांग यां स्तोर",
},
{
"subject": "Rajasthan History",
"topic": "Rajput Kings",
"question_en": "Which Rajput king founded Kishangarh Fort?",
"question_hi": "किशांगारह को किशांगारह कुशांगारह कोंगारह किशांगारह कुशांगारह कोंगारह कुशांगारह कोंगारह कुशांगारह कोंगारह कुशांगारह किशांगारह कुशांगारह कोंगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांगारह कुशांरह कुशांगारह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह कुशांरह क