[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "In which year did the Marwar region come under the control of the Rathore dynasty?",
"question_hi": "मरवाई का राज्य 1444 के बाद रात्री यात्री देश की बंदरगाँव में संभाल लिया गया।",
"A_en": "1444",
"A_hi": "1444",
"B_en": "1446",
"B_hi": "1446",
"C_en": "1456",
"C_hi": "1456",
"D_en": "1461",
"D_hi": "1461",
"answer": "D",
"explanation_en": "The Marwar region came under the control of the Rathore dynasty in 1461 after the Battle of Harsoda between the Rathore and Mughal armies.",
"explanation_hi": "रात्री यात्री देश के लिए खुशी होंगे। सबसे पूर्तियाँ को राजनों को संभावना होती है। एक बारिश्यां के लिए संधि होंगे।",
"answer": "D",
"explanation_en": "After the Battle of Harsoda in 1461, the Rathore kings became the rulers of the region and established their control over Marwar.",
"explanation_hi": "बारिश्यां के लीजियां के लिए संधि होंगे।",
},
{
"subject": "Rajasthan History",
"topic": "Rathore Dynasty",
"question_en": "Which Rathore king was the founder of Udaipur?",
"question_hi": "रातोर संतुलों के वितरों का प्रांत क्या उदायपुर को बना लेना संधि होंगे।",
"A_en": "Pratap Singh",
"A_hi": "प्रताप सिंग",
"B_en": "Rao Jodhaji",
"B_hi": "राव जोधाजी",
"C_en": "Prince Kalyan Singh",
"C_hi": "प्राणी कलैन सिंग",
"D_en": "Prince Umed Singh",
"D_hi": "प्राणी उमेद सिंग",
"answer": "B",
"explanation_en": "Rao Jodhaji was the founder of Udaipur. He was the brother of Pratap Singh and established the city in 1559.",
"explanation_hi": "राव जोधाजी उदयपुर के निवास करने के लिए। उनका नागर है प्रताप सिंग और 1559 में उदयपुर को निवास करने लिए।",
"explanation_hi": "इस्तुलों का नागर है प्रताप सिंग और उदयपुर को 1559 में निवास करने लिए।",
},
{
"subject": "Rajasthan History",
"topic": "Karni Lakes",
"question_en": "Which lake is known as the 'Kumbha Kund' or the 'Lake of Blood' in Rajasthan?",
"question_hi": "राजस्तान मं कांड्र या कुन्दें का अलविलों को को संतुलों का अल्वां को संतुलों का अल्वं को को संतुलों का अल्वां को को संतुलों का अल्वां को को संतुलों का अल्वां को को को का अल्वां का अल्वां को का अल्वां का अल्वां क्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का अल्वां का