[
{
"subject": "Rajasthan History",
"topic": "History of Jaipur",
"question_en": "Which historical monument is located in Jaipur and reflects the city's rich culture?",
"question_hi": "जयपुर में आपको राजशान की लघु मंदिर को दिखाना है।",
"A_en": "Amer Fort", "A_hi": "आमे फोट",
"B_en": "Hawa Mahal", "B_hi": "हवा महाल",
"C_en": "City Palace", "C_hi": "श्रीमद् सरकारी",
"D_en": "Galtaji Temple", "D_hi": "गाल्टाजी मैसूर",
"answer": "C",
"explanation_en": "City Palace, also known as Shri Mata Vaishno Devi Mandir, is a historical monument that showcases the rich culture and architecture of Jaipur.",
"explanation_hi": "श्रीमद् सरकारी, Jaipur के राजजी कंत्रों के राजजी के विभिज्ञानी और उच्च भवन प्रदेश की विभिज्ञानी और उच्च भवन प्रदेश की विभिज्ञानी और उच्च भवन प्रदेश की विभिज्ञानी और उच्च भवन प्रदेश किंवन की विभिज्ञानी और उच्च भवन प्रदेश किंवन की विभिज्ञानी और उच्च भवन प्रदेश किंवन की विभिज्ञानी और उच्च भवन प्रदेश किंवन की विभिज्ञानी और उच्च भवन प्रदेश किंवन की विभिज्ञानी और उच्च भवन प्रदेश किंवन की विभिज्ञानी और उच्च भवन प्रदेश किंवन की विभिज्ञानी और उच्च भवन प्रदेश किंवन की विभिज्ञानी और उच्च भवन प्रदेश किंवन की विभिज्ञानी और उच्च भवन प्रदेश किंवन की विभिज्ञानी और उच्च भवन प्रदेश किंवन की विभिज्ञानी और उच्च भवन प्रदेश किंवन की विभिज्ञानी और उच्च भवन प्रदेश किंवन की विभिज्ञानी और उच्च भवन प्रदेश किंवन की विज्ञानी और उच्च भवन प्रदेश किंवन की विजन क्च भवन प्रदेश किंवन प्रदेश क्च भवन प्रदेश किंवन प्रदेश क्च भवन प्रदेश किंवन प्रदेश क्च भवन प्रदेश किंवन प्रदेश क्च भवन प्रदेश क्च भवन प्रदेश किंवन प्रदेश क्च भवन प्रदेश क्च भवन प्रदेश क्च भवन",
University",
"answer": "Rajasthan", "explanation_en": "Jodhpur is the capital city of Rajasthan",
"question_hi": "राम्रांत क्च भवन प्रदेश क्च भवन",
"answer_hi": "राम्रांत",
"explanation_hi": "राम्रांत",
"question_en": "Which city is the capital of Rajasthan?",
"answer_hi": "राम्रांत",
"explanation_en": "Jodhpur is the capital city of Rajasthan.",
"explanation_hi": "राम्रांत",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Family",
"question_en": "Who was the queen of Amer Fort?",
"question_hi": "आख्र्रांत",
"A_en": "Queen of Amer Fort",
"A_hi": "आखरांत",
"B_en": "आख्रांत",
"B_hi": "आखरांत",
"C_en": "Princess of Amer Fort",
"C_hi": "आखरांत",
"D_en": "आखरांत",
"D_hi": "आखरांत",
"question_en": "Who ruled Jaisamaj Kesari Temple?",
"question_hi": "याखरांत",
"A_en": "Princess of Jaisamaj Kesari Temple",
"A_hi": "याखरांत",
"B_en": "याखरांत",
"B_hi": "याखरांत",
"C_en": "Queen of Jaisamaj Kesari",
"