[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Famous Historical Places",
"question_en": "What is the capital of Rajasthan and which famous historical places are located here?",
"question_hi": "राजस्थान की राजधानी और इसे मौजूदा इतिहासिक स्थानों",
"A_en": "Jaipur", "A_hi": "जयपुर",
"B_en": "Udaipur", "B_hi": "उदयपुर",
"C_en": "Jodhpur", "C_hi": "जोधपुर",
"D_en": "Ajmer", "D_hi": "अजमेर",
"answer": "B",
"explanation_en": "Jaipur is the capital of Rajasthan, and Udaipur is famous for its historical importance. Other notable historical places in Rajasthan include Jodhpur (Meenasagar ki Rajasthan mein), Ajmer (अजमेर), and Jaisalmer (जयसलमर).",
"explanation_hi": "राजस्थान की राजधानी है जैसालमर, और उदयपुर को इतिहान को एक मेनासागर (मेनासागर) में वर्णी है, अजमेर (अजमेर) में एक इतिहान को एक मेनासागर (मेनासागर) में उपयोगाँवाणी है।",
"A_en": "Jaisalmer (Jaisalmer) is known for its historical importance and is a popular tourist destination.",
"A_hi": "जैसालमेर (जैसालमेर) राजभावाणी है।",
"B_en": "Jodhpur (Jodhpur) is renowned for its Mehrangarh Fort and Umaid Bhawan Palace.",
"B_hi": "जोधुमेर (जोधुमेर) मैराजभावाणी और उमाइड ब्वाणी के बग़नेवाणी से ज्ञानपूर्वाणी के मानवाणी से ज्ञानपूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी के मानवाणी से ज्ञानपूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाणी से ज्ञान पूर्वाण