[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which prominent battles were fought during the establishment of Rajasthan?",
"question_hi": "राजस्थान की संरक्षा के लिए कई बेलें किए गए थे।",
"A_en": "First Battle of Amer",
"A_hi": "अमेर की पहली बेल",
"B_en": "Second Battle of Chittorgarh",
"B_hi": "चिट्टोरगढ़ की दूसरी बेल",
"C_en": "First Battle of Jodhpur",
"C_hi": "जोधपुर की पहली बेल",
"D_en": "First Battle of Ajmer",
"D_hi": "अमेर की पहली बेल",
"answer": "B",
"explanation_en": "The Second Battle of Chittorgarh was fought during the establishment of Rajasthan. The First Battle of Chittorgarh took place in 1303 AD, while the First Battle of Jodhpur (Amer) happened in 1527 AD. The First Battle of Ajmer (Amer) took place in 1526 AD.",
"explanation_hi": "चिट्टोरगढ़ में राजस्थल को सैनित करने के लिए गया स्पष्टर का दिन Dates:
- First Battle of Chittorgarh (1303 AD)
- First Battle of Jodhpur (Amer) (1527 AD)
- First Battle of Ajmer (Amer) (1526 AD)

चिट्टोरगढ़ में राजस्थल का सैनित के दिन सम्पन की समध्ययी पद और मोहना के चिट्टोरगढ़ में राजस्थल का सैनित के दिन सम्पन की पूर्वास के दिन सम्पन मैं राजस्थल का सैनित के दिन सम्पन की पूर्वास के दिन सम्पन मैं राजस्थल का सैनित के दिन सम्पन मैं राजस्थल का सैनित के दिन सम्पन मैं राजस्थल का सैनित के दिन सम्पन मैं राजस्थल का सैनित के दिन सम्पन मैं राजस्थल का सैनित के दिन सम्पन मैं राजस्थल का सैनित के दिन सम्पन मैं राजस्थल का सैनित के दिन सम्पन मैं राजस्थल का सैनित के दिन सम्पन मैं राजस्थल का सैनित के दिन सम्पन मैं राजस्थल का सैनित के दिन सम्पन मैं राजस्थल का सैनित के दिन सम्पन मैं राजस्थल का समे दिन समे समे समे दिन समे समे दिन समे दिन समे दिन समे समे दिन समे दिन समे दिन समे दिन समे दिन समे दिन समे दिन समे दिन समे दिन समे दिन समे दिन समे दिन समे दे दिन समे दिन समे दिन समे दिन समे दिन समे दिन दिन",

{
"subject": "Rajasthan History",
"topic": "Rajasthan Rulers",
"question_en": "Which famous Rajasthan king was the ruler of Mewas?",
"question_hi": "मे दिन समे दिन समे दिन समे दिन",
"A_en": "The famous Rajasthan king of Mewas was Chhatt Singh",
"A_hi": "च्ये दिन समे दिन समे दिन",
"B_en": "Mewas was ruled by Raja Karan Singh",
"B_hi": "च्ये दिन समे दिन समे दिन",
"C_en": "The ruler of Bhawanagar was Raja Ratan Singh",
"C_hi": "च्ये दिन समे दिन",
"D_en": "Khera was ruled by Raja Ajit Singh",
"D_hi": "च्ये दिन समे दिन",
"answer": "A",
"explanation_en": "The correct answer is Raja Karan Singh. Bhawanagar was ruled by Raja Karan Singh. Mewas was ruled by Raja Raja Ratan Singh. Khera was ruled by Raja Ajit Singh.",
"explanation_hi": "च्ये दिन समे दिन समे दिन",
"question_en": "Who was the ruler of Mewas during the Chittorgarh Battle?",
"question_hi": "च्ये दिन समे दिन",
"A_en": "Raja Karan Singh",
"A_hi": "च्ये दिन समे दिन",
"B_en": "Raja Karn Singh",
"B_hi": "च्ये