[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built during the Mewar dynasty?",
"question_hi": "मैवर समुदाय के समय के बार्मिंग में बनाया गया कौन सा फोट?",
"A_en": "Amber Fort", "A_hi": "अमेरिक",
"B_en": "Mehrangarh Fort", "B_hi": "मेहरांगर",
"C_en": "Hawa Mahal", "C_hi": "हावा महाल",
"D_en": "Nahargarh Fort", "D_hi": "नाहरगार",
"answer": "B",
"explanation_en": "Amber Fort and Mehrangarh Fort are famous forts in Rajasthan. However, Mehrangarh Fort was built during the Mewar dynasty, while Amber Fort belongs to the Kachwaha dynasty. Thus, the correct answer is Mehrangarh Fort.",
"explanation_hi": "राजस्थान में बजारूम और मेहरांगर हिल्ली हैं। बजारूम में कचवहां देवती है, पर बजारूम में कचवहां हिल्ली है।",
"answer": "B"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Family",
"question_en": "Which royal family ruled Rajasthan before the establishment of Jaipur as a capital?",
"question_hi": "राजस्थान के राजाओं ने राजस्थान का सांचार्जी का समाधि राजस्थान की राजाओं ने राजस्थान का सांचार्जी के बांध में राजस्थान की राजाओं ने बन्दगंधिमांचार्जी के बांध में राजस्थान की राजाओं ने बन्दगंधिमांचार्जी के बांध में राजस्थान की राजाओं ने बन्दगंधिमांचार्जी के बांध में राजस्थान की राजाओं ने बन्दगंधिमांचार्जी के बांध में राजस्थान की राजाओं ने बन्दगंधिमांचार्जी के बांध में राजस्थान की राजाओं ने बन्दगंधिमांचार्जी के बांध में राजस्थान की राजाओं ने बन्दगंधिमांचार्ज्या के बांध में राजस्थान की राजाओं ने बन्दगंधिमांचार्ज्या के बांध में राजस्थान की राजाओं ने बन्दगंधिमांचार्ज्या के बांध में राजस्थान के बांधिमांचार्ज्या के बांध में राजस्थान के बांध मं राजस्थान के बांध में राजस्थान के बांध में राजस्थान के बांध मं राजस्थान के बांध में राजस्थान के बांध में राजस्थान के बांध में राजस्थान के बांध में राजस्थान के बांध में राजस्थान के बांध में राजस्थान के बां राजस्थान के बांध में राजस्थान के बांध में राजस्थान के बांध में राजसं राजस्थान के बांध में राजस्थान के बां राजस्थान के बां राजस्थान के बां राजस्थान के बां राजस्थान के बांराजस्थान के बां राजस्थान के बां राजे बां राजस्थान के बां राजस्थान के बांराजस्थान के बां राजस्थान के बां राजस्थान के बां राजस्थान के बां राजस्थान के बां राजस्