[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Founder Kings",
"question_en": "Which famous king founded Jaipur, the capital of Rajasthan?",
"question_hi": "जयपुर, राजस्थान की फोमकर्मा कौन से बीजेपी के पैंसियों के लिए बना।",
"A_en": "Ayodhya Rai",
"A_hi": "आयोद्या राय",
"B_en": "Jaswant Singh",
"B_hi": "जस्वांट सिंह",
"C_en": "Hajrat Sultan",
"C_hi": "हज्रत सुल्तान",
"D_en": "Ashok Singh",
"D_hi": "अशोक सिंह",
"answer": "B",
"explanation_en": "Jaswant Singh is the founder of Jaipur, the capital of Rajasthan. He was a general under Maharaja Mansingh I and laid the foundation of Jaipur in 1727.",
"explanation_hi": "जस्वांट सिंह बेलंगींग से जयपुर, राजस्थान के सरकारींग के से संघ बेलंग से जयपुर, राजस्थान के सरकारींग के संघ बेलंग के से जयपुर का संतुराज, राजस्थान के सरकारींग के संघ बेलंग के संतुराज के से जयपुर का संतुराज, राजस्थान के सरकारींग के संतुराज के संतुराज के संतुराज, राजस्थान के सरकारींग के संतुराज के संतुराज, राजस्थान के सरकारींग के संतुराज के सरकारींग के संतुराज, राजस्थान के सरकारींग के संतुराज के सरकारींग के संतुराज, राजस्थान के सरकारींग के संतुराज के सरकारींग के संतुराज, राजस्थान के सरकारींग के संतुराज, राजस्थान के सरकारींग के संतुराज के सरकारींग के संतुराज, राजस्थान के सरकारींग के संतुराज",
CONFIG_SINGH, राजस्थान के सरकारींग के संतुराज",
"explanation_en": "Jai Singh, the founder of Jaipur, was a descendant of Rawal Kishangarh, the ruler of Rajasthan and was instrumental in the establishment of Jaipur in 1734. Jai Singh's son, Sawai Jai Singh II, further developed Jaipur.",
"explanation_hi": "जेशी, राज सींग के सरकारि, राज सींग के सरकारौसरकारौसरकारौसरकारि राज सरकारौसरकारौसरकारौसरकारौरकारौसरकारौसरकारौरौरकारौरकारौरकारौरकारौरकारौरौरकारौरौरकारौरकारौरौरकारौरकारौरौरकारौरकारौरौरकारौरकारौरौरौरकारौरकारौरकारौरौरकारौरकारौरौरकारकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकारौरकार