[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following is an important historical site in Jaipur?",
"question_hi": "जयपुर में कौन सा महत्वपूर्ण इतिहासिक स्थल है।",
"A_en": "Amber Fort",
"A_hi": "अमेरिका की खोली के में क्या लेकिन उपन्यास है।",
"B_en": "Hawa Mahal",
"B_hi": "हवा महाल",
"C_en": "Jantar Mantar",
"C_hi": "जनता मन्त्र",
"D_en": "Palace of Winds",
"D_hi": "कम्यान की मंदिर",
"answer": "B",
"explanation_en": "Hawa Mahal is a famous landmark located in Jaipur and is known as the Palace of Winds. It was constructed by Maharaja Sawai Pratap Singh in 1799.",
"explanation_hi": "हवा महाल जापान की मंदिर है और इसके इतिहाँ की तुलना है। महाराष्ट्र से बना हुआ इतिहाँ के बैंगलों का क्रैशिक स्वयंत्र है हुआ इत्तीन बैंगलों का क्रैशिक स्वयंत्र है।",
"A_en": "Hawa Mahal is a notable landmark in Jaipur, known for its intricate designs. It was built by Maharaja Sawai Mansingh II.",
"A_hi": "हवा महाल जापान स्वयंत्र है। इसमेंट को महाराजशांत्र है।",
"B_en": "Jantar Mantar is a famous observatory in Jaipur, known for its unique architecture. It was built by Maharaja Jai Singh II.",
"B_hi": "जन्तर मानटार है। इसमेंट को महाराजशांत्र है।",
"C_en": "Samrat Chhatri is a historical monument located in Jaipur, famed for its stunning architecture. It was built by Maharaja Jai Singh I.",
"C_hi": "सम्रत चाट्री है। इसमेंट को महाराजशांत्र है।",
"D_en": "Ram Niwas Palace is a palace complex in Jaipur, renowned for its opulent architecture. It was built by Maharaja Pratap Singh.",
"D_hi": "राम निवास पल्काम है। इसमेंट को महाराजशांत्र है।",
"question_en": "Which palace complex was built by Maharaja Pratap Singh in Jaipur?",
"question_hi": "महाराजशांत्र के संतर मंडलेंटो मेंट्रिया है।",
"answer": "D",
"explanation_en": "D",
"explanation_hi": "दि",
"options": [
{
"option_en": "A",
"option_hi": "आई",
"option_expl": "A",
"option_score": 20,
"option_type": "MCQ",
},
{
"option_en": "B",
"option_hi": "ए",
"option_expl": "ए",
"option_score": 10,
"option_type": "MCQ",
},
{
"option_en": "C",
"option_hi": "ई",
"option_expl": "ई",
"option_score": 20,
"option_type": "MCQ",
},
{
"option_en": "D",
"option_hi": "ओ",
"option_expl": "ओ",
"option_score": 10,
"option_type": "MCQ"
]