[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jaipur?",
"question_hi": "जयपुर में कौन सा फोट है?",
"A_en": "Amer Fort", "A_hi": "आमर फोट",
"B_en": "Hawa Mahal", "B_hi": "हवा महाल",
"C_en": "Cenotaph of Sawai Jai Singh", "C_hi": "सवाई जयंसिंग की चित्रों के लिए",
"D_en": "Palace of Winds", "D_hi": "रेखां के लिए",
"answer": "B",
"explanation_en": "Hawa Mahal is a famous landmark located in Jaipur, known for its unique design and architecture.\nHawa Mahal, which means 'Palace of Winds', was built by Maharaja Sawai Pratap Singh in 1592 AD.",
"explanation_hi": "जयंतीय सवाई जयंसिंग के लिए बनने की शामियों के लिए",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthani Kingdoms",
"question_en": "Which kingdom was established by Chauhan Rajput in 10th century?",
"question_hi": "क्या कोशन राज्य 10वेंचर के लिए",
"A_en": "Meena Kesari Rajput",
"A_hi": "मेना केसारी राज्य",
"B_en": "Pratap Singh",
"B_hi": "प्रतप सिंग",
"C_en": "Jait Singh",
"C_hi": "जैट सिंग",
"D_en": "Rao Jodha",
"D_hi": "राव जोधा",
"answer": "D",
"explanation_en": "Jodha, a nobleman from the Rathore clan, established the kingdom of Rajasthan in the 15th century.",
"explanation_hi": "राव जोधा, एक राव शलाबाजा दिल, 15वेंचर के लिए राज्य ने 15वेंचर के लिए राज्य ने बना की तथा प्राक्षर ने बना",
"answer": "D",
"explanation_en": "Rao Jodha, a nobleman from the Rathore clan, established the kingdom of Rajasthan in the 15th century.",
"explanation_hi": "राव जोधा, रात्रोदेसर के शलाबाजाओं ने बना",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Family",
"question_en": "Which Rathore family member ruled Rajasthan during the Mughal rule?",
"question_hi": "राजस्तान के राज्य मुगुल के संतुल के विभाग ने राजस्तान के विभाग में राजस्तान के संतुल के विभाग में राजस्तान के संतुल के विभाग में राजस्तान के संतुल के विभाग में राजस्तान के संतुल के विभाग में राजस्तान के संतंग में राजस्तान के संतुल के विभाग में राजस्तान के संतुल के विभाग में राजस्तान के संतुल के विभाग में राजस्तान के संतुल के विभाग में राजस्तान के संतुल के विभाग में राजस्तान के संतान के विभाग में राजस्तान के संतान के विभाग में राजस्तान के संतान के विभाग में राजस्तान के संतान के विभाग में राजस्तान के संतान के विभाग में राजस्तान के विभाग में राजस्तान के विभाग में राजस्तान के विभाग में राजस्तान के विभाग में राजस्तान के विभाग में राजस्तान के विभाग में राजस्तान के विभाग में राजस्तान के विभाग में राजस्तान के विभाग में राजस्तान के विभाग में राजस्तान के विभाग में राजस्तान के विभाग में राजस्तान के विभाग में राजस्तान के विभाग में राजस्तान के विभाग में राज्तान के विभाग में राजस्तान के विभाग में राज