[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Other Famous Cities",
"question_en": "Which is the capital city of Rajasthan?",
"question_hi": "राजस्थान की राजधानी क्या है?",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Udaipur",
"B_hi": "उदयपुर",
"C_en": "Alwar",
"C_hi": "अलवर",
"D_en": "Jaisalmer",
"D_hi": "जयसालमर",
"answer": "B",
"explanation_en": "Udaipur is the capital city of Rajasthan. However, Jodhpur and Jaisalmer are also important cities in Rajasthan.",
"explanation_hi": "उदयपुर राजस्थान की राजधानी है। लेकिन जोधपुर और जयसालमर की भी राजस्थान में मेहत और महालाई की भी महालाई में मेहत और मेहती की भी मेहत में मेहत और कमान की भी मेहत में मेहत और मेहती की भी मेहत में मेहत के मेहत मेहती भी मेहत मेहत के मेहती भी मेहत मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेही भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी मेहती भी भी मेहती भी मी भी मेहती भी भी मी भी मी भी भी मी भी मी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी",
[objective.objective ","objective_en":"Capital of Rajasthan",
"objective_hi":"राजन मभी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी",
[question_en":"In which year did the Battle of Haldwani take place?",
"question_hi":"कबी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी ?",
"answer":"B",
"explanation_en":"The Battle of Haldwani took place in 1577 AD. It was a major battle fought between Jaisalmer and Mewar.",
"explanation_hi":"हलार भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भी भ