[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which city was the capital of Rajasthan before Jaipur?",
"question_hi": "जैसे बार जापान के राजधानी थी ?",
"A_en": "Udaipur",
"A_hi": "उदयपुर",
"B_en": "Jodhpur",
"B_hi": "जोधपुर",
"C_en": "Ajmer",
"C_hi": "अजमेर",
"D_en": "Alwar",
"D_hi": "अलवर",
"answer": "B",
"explanation_en": "Jodhpur was the capital of Rajasthan before Jaipur. It served as the capital from 1569 until 1818 when Jaipur became the capital.",
"explanation_hi": "जोधपुर राजधानी राजस्थान में 1569 से 1818 तक थी, जबकि जापान केवल 1818 तक राजस्थान के राजधानी बनने वाला था।",
"explanation": "Jodhpur served as the capital of Rajasthan from 1569 to 1818, after which Jaipur became the capital."
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which royal family was associated with the establishment of Mehrangarh Fort?",
"question_hi": "मेरंगार के संतुल समुच्छा को कौन संस्थान के संतुल परिवार के संतुल समुच्छा ने मेरंगार को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल को संतुल के परिवार के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतुल के संतु