[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous palace in Jaipur served as the official residence of the Maharaja?",
"question_hi": "जयपुर में मैहाराजा के अधिकारी का स्वभावी है।",
"A_en": "Hawa Mahal", "A_hi": "हवा महाल",
"B_en": "Amer Fort", "B_hi": "अमेर फोट",
"C_en": "Cenotaph of Maharaja Jai Singh", "C_hi": "महाराजा जैसिंग के संघ",
"D_en": "Galta Ji Temple", "D_hi": "गालता जी मंदिर",
"answer": "B",
"explanation_en": "Hawa Mahal and Amer Fort are both popular tourist attractions in Jaipur, but Amer Fort served as the official residence of the Maharaja. Amer Fort is the chosen answer.",
"explanation_hi": "हवा महाल और अमेर फोट जैसिंग के राजन के घर का एक बेल है। अमेर फोट जैसिंग राजन के घर के राजन के घर मैंचुरी",
"D_hi": "अमेर फोट जैसिंग के घर मैंचुरी",
"answer": "B",
"explanation_en": "Amer Fort served as the official residence of Maharaja Jai Singh. It was built by Maharaja Jai Singh II and is a popular tourist attraction in Jaipur.",
"explanation_hi": "अमेर फोट जैसिंग के घर मैंचुरी",
"question_en": "Which fort was built by Maharaja Jai Singh II and served as his official residence?",
"question_hi": "अमेर फोट जैसिंग के घर मैंचुरी",
"D_en": "Amer Fort",
"D_hi": "अमेर फोट जैसिंग के घर मैंचुरी",
"answer": "B",
"explanation_en": "Amer Fort was built by Maharaja Jai Singh II and served as his official residence. It is also known as the Amer Fort and is a popular tourist attraction.",
"explanation_hi": "अमेर फोट जैसिंग के घर मैंचुरी",
"question_en": "Which fort was built by Maharaja Jai Singh II and served as his official residence?",
"question_hi": "अमेर फोट जैसिंग के घर मैंचुरी",
"D_en": "Amer Fort",
"D_hi": "अमेर फोट जैसिंग के घर मैंचुरी",
"answer": "B",
"explanation_en": "Amer Fort was built by Maharaja Jai Singh II and served as his official residence. It is also known as the Amer Fort and attracts tourists from across the world.",
"explanation_hi": "अमेर फोट जैसिंग के घर मैंचुरी",
"question_en": "Which fort was built by Maharaja Jai Singh II and served as his official residence?",
"question_hi": "अमेर फोट जैसिंग के घर मैंचुरी",
"D_en": "Amer Fort",
"D_hi": "अमेर फोट जैसिंग के घर मैंचुरी",
"answer": "A",
"explanation_en": "Amer Fort is the correct answer as it was built by Maharaja Jai Singh II and served as his official residence.",
"explanation_hi": "अमेर फोट जैसिंग के घर मैंचुरी",
"question_en": "Which fort was built by Maharaja Jai Singh II and served as his official residence?",
"question_hi": "अमेर फोट जैसिंग के घर मैंचुरी",
"D_en": "Amer Fort",
"D_hi": "अमेर फोट जैसिंग के घर मैंचुर फोट जैसिंग के घर मैंचुर फोट जैंग के घर मैंर फैंट जर घर मंचुर फैंट जैंर घर फैंट जर घर फैंट जर घर फैंट जैंर घर फैंट जर घर फैंट जर घर फैंट जर घर फैंट जर घर फैंट जर घर फैंट जर घर फैंट जर घर फैंट जर घर फैंट जर घर फैंट जर फैंट जर घर फैंट जर फैंट जर फैंट जर घर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फैंट जर फै