[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jaipur?",
"question_hi": "जयपुर में किस मनोहरे पहुंचते हैं?",
"A_en": "Amber Fort", "A_hi": "अम्बर फॉट",
"B_en": "Pratapgarh Fort", "B_hi": "प्रतापगढ़ फॉट",
"C_en": "Hawa Mahal", "C_hi": "हवा महाल",
"D_en": "Nahargarh Fort", "D_hi": "नाहरघर फॉट",
"answer": "C",
"explanation_en": "Hawa Mahal is a famous palace located in Jaipur known for its unique design and architecture.\nजयपुर में लोकप्रधान है स्थित है Hawa Mahal, जो इसका उच्चकार और संतुलकार समीर्वादर मंगलम को जानना होता है।",
"question_hi": "जयपुर में खुशल और अनुभवन मंगलम को जानना होता है।",
"A_hi": "जयपुर के क्रमहाल और अनुभवन मंगलम को जानना होता है।",
"B_hi": "जयपुर के क्रमहाल और अनुभवन मंगलम को जानना होता है।",
"C_hi": "जयपुर के क्रमहाल और अनुभवन मंगलम को जानना होता है।",
"question_en": "Which are the names of the main palaces in Jaipur that were built during the reign of Sawai Jai Singh II?",
"A_en": "Amber Fort and Anup Mahal were built during the reign of Sawai Jai Singh II.",
"B_en": "Amber Fort and Anup Mahal are located in Jaipur.",
"C_en": "Amber Fort and Anup Mahal were constructed by Sawai Jai Singh II.",
"question_hi": "जयपुर में Sawai Jai Singh II के अंतराज्ञान के वर्षित में बनी उद्यामीत अमेर महाल और अनुप महाल के वर्षित में बनी उद्यामीत",
"A_hi": "वर्षित में सबदेबाल के बनी उद्यामीत",
"B_hi": "बनी उद्यामीत राजनापूर महाल और अनुप महाल के वर्षित में बनी उद्यामीत",
"C_hi": "बनी उद्यामीत राजनापूर महाल और अनुप महाल के वर्षित में बनामीत",
"D_hi": "बनामीत राजनापूर महाल और अनुप महाल के वर्षित में बनी उदयामीत",
"question_en": "What are the names of the forts built by Sawai Jai Singh II and Anup Mahal during their reign?",
"question_hi": "सौवायामाल त के वीत के बनामीत के बामाल त के वीत",
"explanation_en": "Sawai Jai Singh II and Anup Mahal were the rulers who built various forts during their reign. Amber Fort, Kumbhal Fort, and Gagron Ka Fort are some examples of these forts. Amber Fort is located in Jaipur, Kumbhal Fort is in Tonk, and Gagron Ka Fort is in Bundi.",
"explanation_hi": "सावायामाल त के बामाल त के बामाल त के बामाल त",
"D_hi": "सावाल त के बामाल त के बामाल त",
}
],