[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which Chhatri is located in Udaipur and is a famous tourist attraction?",
"question_hi": "उदयपुर में एक मौलिक ट्यूटरियाँ केंद्र में विभिन्न है।",
"A_en": "Monsoon Palace",
"A_hi": "मॉसियान पॉल",
"B_en": "Saheliyon ki Bari",
"B_hi": "साहिबेनी की बारी",
"C_en": "Fateh Sagar Lake",
"C_hi": "फटहर सागर स्लॉक",
"D_en": "Lalmandir",
"D_hi": "लाल मंदिर",
"answer": "B",
"explanation_en": "Saheliyon ki Bari is a famous garden in Udaipur and is a popular tourist attraction.\nIncorrect options: Monsoon Palace (it is located in Udaipur, not in Jaipur), Fateh Sagar Lake (located in Udaipur), and Lal Mandir (located in Jaipur, not in Udaipur).",
"explanation_hi": "Saheliyon ki Bari उदयपुर में बैचोरी की बारी है और उनके वित्त्राणी संग और उनके वित्त्राणी के स्टेंड कला लेना और उनके शूटर को निष्ट है।",
"",
"",
"",
"",
"",
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who conquered Jodhpur in 1817?",
"question_hi": "जोधुरी को 1817 में किस्ता करने वाला।",
"A_en": "Prince Ran Singh II",
"A_hi": "रानी राजन रानी सिंग सी II",
"B_en": "Prince Bhim Singh II",
"B_hi": "प्रैंक बिम सिंग सी II",
"C_en": "Rao Jodha",
"C_hi": "राव झोधा",
"D_en": "Prince Khawaja Khan",
"D_hi": "प्राखा खान",
"answer": "C",
"explanation_en": "Prince Jodha is known for conquering Jodhpur in 1817 and establishing it as the capital of Marwar.",
"explanation_hi": "राव झोधा के मात्रा मतिलैंक सी के मैंक के आधारन, जो 1817 में जोधपुर से विल्डगावर के मात्रा मैंक के आधारन मैंक के आधारन को 1817 में जोधपुर से विल्डगावर के मात्रा मैंक के आधारन मैंक के आधारन मैंक",
"B_en": "Jaipur",
"B_hi": "जयपुर",
"C_en": "1834",
"C_hi": "1834",
"D_en": "Ladakh",
"D_hi": "लाडाख",
"answer": "C",
"explanation_en": "Prince Raja Man Singh I of Jaipur captured Jodhpur in 1834 and incorporated it into his kingdom.",
"explanation_hi": "जोधपुर के मात्रा राजस्वामितिकर के आधारन मात्रा राजस्वामितिकर के आधारन मात्रा राजस्वामितिकर के आधारन मात्रा राजस्वामिकर के आधारन मात्रा राजस्वामिकर के आधारन मात्रा राजस्वामिकर के आधारन मात्रा राजस्वामिकर के आधारन मात्रा राजस्वामिकर के आधारन मात्रा राजस्वामिकर के आधारन मात्रा राजस्वामिके आधारन मात्रा राजस्वामिके आधारन मात्रा राजस्वामिके आधारन मात्रा राजसन मात्रा राजस्वामिके आधारन मात्रा राजस्वामिके आधारन मात्रा राजसन आधारन मात्रा राजसन मात्रा राजस्वामिके आधारा राजसन मात्रा राजन आधारन राजसन मात्रा राजसन मात्रा राजन मात्रा राजन न मात्रा राजसन मात्रा राजन मात्रा राजन मात्रा राजन राजन",
This is the correct answer (मात्रा राजन मात्रा राजन राजन मात्रा राजन",
"न मात्रा राजन मात्रा राजन",
"A_en": "मात्रा राजन राजन मात्रा राजन",
"A_hi": "मात्रा राजन राजन",
"B_en": "मात्रा राजन",