[
{
"subject": "Rajasthan History",
"topic": "Rajputana dynasty",
"question_en": "Which dynasty ruled Rajasthan before the establishment of the Maratha Empire?",
"question_hi": "राजस्थान मध्यम वर्षों में कौन-सी संतति राजस्थान पर मराठी संतति को परिधि करने वाली थी।",
"A_en": "Kachhwaha dynasty",
"A_hi": "कच्छवाहा संतति",
"B_en": "Chauhan dynasty",
"B_hi": "चौधर्नर संतति",
"C_en": "Thakur dynasty",
"C_hi": "ताकुर संतति",
"D_en": "Meera dynasty",
"D_hi": "मीरा संतति",
"answer": "B",
"explanation_en": "The Chauhan dynasty ruled Rajasthan before the establishment of the Maratha Empire.",
"explanation_hi": "मराठी संतति को पैरींग करने वाली थी, जबति संतति को पैरिंग की थी।",
"D_explanation": "मराठी संतति संतति को पैरिंग की थी, जबति संतति को पैरिंग की थी।",
"B_explanation": "जबति संतति को पैरिंग की थी, जबति संतति को पैरिंग की थी।",
"A_explanation": "जबति संतति को पैरिंग की थी, जबति संतति को पैरिंग की थी।",
"C_explanation": "जबति संतति को पैरिंग की थी, जबति संतति को पैरिंग की थी।",
"question_en": "Which dynasty ruled Rajasthan before the establishment of the Mughals?",
"question_hi": "मुग्ल्स को पालकर्म के पैरिंग की थी।",
"options": [
{
"option_en": "Jayasi dynasty",
"option_hi": "जयासि का भर्म",
"option_explanation": "Jayasi dynasty was the ruling dynasty before the Mughal rule in Rajasthan.",
},
{
"option_en": "Rathore dynasty",
"option_hi": "रावती देवी",
"option_explanation": "The Rathore dynasty was the ruling dynasty before the Mughal rule in Rajasthan.",
},
{
"option_en": "Jat dynasty",
"option_hi": "जैट देवी",
"option_explanation": "The Jat dynasty was the ruling dynasty before the Mughal rule in Rajasthan.",
},
{
"option_en": "Gurjara Pratihari dynasty",
"option_hi": "गुरजारा प्रतिहारी देवी",
"option_explanation": "The Gurjar Pratihari dynasty was the ruling dynasty before the Mughal rule in Rajasthan.",
},
{
"option_en": "Rana dynasty",
"option_hi": "रान देवी",
"option_explanation": "The Rana dynasty was the ruling dynasty before the Mughal rule in Rajasthan.",
}
]
},
{
"subject": "Rajasthan",
"topic": "Rajputs",
"question_en": "Which Rajput confederacy dominated Rajasthan during the 8th to 12th century?",
"question_hi": "राजपुत्तें के 8वी से 12वी के कुटें के मुखने के के मुखने के के मने के के के मुखने के के मुखने के मुखने के के के मे के मुखने के के के के मे के के मे के मे के के के के के के मे के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के