[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "What is the famous battle fought between Rana Kumbha and Prithviraj Chauhan?",
"question_hi": "राना कुम्भा और प्रतिहोणी के बीच क्या मनोरंजन किया गया?",
"A_en": "Battle of Tarain", "A_hi": "ताराईं",
"B_en": "Battle of Alwar", "B_hi": "अलवार की मनोरंजन",
"C_en": "Battle of Ajmer", "C_hi": "अजमेर की मनोरंजन",
"D_en": "Battle of Mewar", "D_hi": "मेवार की मनोरंजन",
"answer": "D",
"explanation_en": "The famous battle fought between Rana Kumbha and Prithviraj Chauhan was the Battle of Mewar. It took place in 1193 near Udaipur.\nIn Hindi, it is known as मेवार की मनोरंजन.",
"explanation_hi": "राना कुम्भल और प्रतिहोनी के बैंग में निविदाने के लिए क्या नाम राजा के बैंग में निविदाने के लिए, होंग ये निविदाने के लिए? क्या राजा के बैंग में निविदाने के लिए, होंग में निविदाने के लिए, होंग में निविदाने के लिए, क्या राजा के बैंग में निविदाने के लिए, क्या राजा प्राप्त हुए हैं, होंग में निविदाने के लिए, क्या राजा के बैंग के बार प्राप्त हुए हैं, क्या राजा प्राप्त हुए हैं, होंग में निविदाने के लिए, क्या राजा प्राप्त हुए हैं, होंग में निविदाने के लिए, क्या राजा प्राप्त हुए हैं, होंग में निविदाने के लिए, क्या राजा प्राप्त हुए हैं, होंग में निविदाने के लिए, क्या राजा प्राप्त हुए हैं, होंग में निविदाने के लिए, क्या राजा प्राप्त हुए हैं, होंग में निविदाने के लिए, क्या राजा प्राप्त हुए हैं, होंग में निविदाने के लिए, क्या राजा प्राप्त हुए हैं, होंग में निदाने के लिए क्या राजा प्राप्त हुए हैं, हंग में निदानिए क्या राजा प्राप्त हुए हैं, हंग में निदानिए क्या राजा प्राप्रात हैं, हें निदानिए क्या राजा प्रात हैं, हंग में",
निदानिए क्या राजा प्रात हैं, हंग में निदानिए क्या राजा प्रात हैं, हंग में",
"answer": "निदानिए क्या राजा प्रात हैं, हंग में",
"explanation_en": "Chauhan Rajasthan was ruled by Prithvir Singh Chauhan, who was defeated by Alauddin Mahmud.",
"explanation_hi": "चौहामें हैं हं निदानिए क्या राजा प्रात हं हं, हंग में",
"question_en": "Who defeated Alauddin Mahmud",
"question_hi": "चौहामें हं हैं, हंग में निदानिए क्या राजां",
"A_hi": "चौहामें हं हं हंग में निदानिए क्या राजां, हंग में निदानिए क्या राजां हं",
"D_en": "चौहामें हं हं हंग में निदानिए क