[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which king created the city of Jaipur?",
"question_hi": "जयपुर के स्थानीय निर्माण किया गया कौन सर था?",
"A_en": "Amar Singh",
"A_hi": "अमरसिंग",
"B_en": "Hawa Mahal",
"B_hi": "हवा महाल",
"C_en": "Rajput clans",
"C_hi": "राजपूत किस्मत",
"D_en": "King Ram Singh I",
"D_hi": "राम सिंग I",
"answer": "D",
"explanation_en": "King Ram Singh I is credited with the creation of Jaipur. He was the founder of the city and its ruler in 1727.\nEnglish: King Ram Singh I is the ruler who established Jaipur in 1727. He founded the city and its kingdom.",
"explanation_hi": "राम सिंग I यूरोजगार और 1727 के दिन इस मुख्यां को राजपूतों का प्राधिकरण करने वाला राम सिंग I के दिन योजनी की मैंनंदा की कलाइने वाला राम सिंग I के दिन के अग्नि के मैने वाले राम सिंग I के दिन के अग्नि के मैने वाले राम सिंग I के दिन अग्नि के मैने वाले राम सिंग I के दिन अग्नि के मैने वाले राम सिंग I के दिन अग्नि के मैने वाले राम सिंग I के दिन अग्नि के मैने वाले राम सिंग I के दिन अग्नि के मैने वाले राम सिंग I के दिन अग्नि के मैने वाले राम सिंग I के दिन अग्नि के मैने वाले राम सिंग I के दिन अग्नि के मैने वाले राम सिंग I के दिन अग्नि के मैने वाले राम सिंग I के दिने वाले राम सिंग I के दिन अग्नि के मैने वाले राम सिंग I के दिन अग्नि के मैने वाले राम सिंग I के दिन अग्नि के मैने वाले राम सिंग I के दिन अग्नि के मैने वाले राम सिंग I के दिन अग्नि के मैने वाले राम सिंग I के दिन अग्नि के मैने राम सिंग I के दिन अग्नि के मैने राम सिंग I के दिनैने राम सिंग I के दिनैने राम सिंग I के दिने राम सिंग I के दिनैने राम सिंग I के दिने राम सिंग I के दिनैने राम सिंग I के दिने राम सिंग I के राम सिंग I के दिने राम सिंग I के दिने राम सिंग I के दिने राम सिंग I के दिने राम सिंग I के राम सिंग I के दिने राम सिंग I के दिने राम सिंग I के सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के राम सिंग I के रा