[
{
"subject": "Rajasthan History",
"topic": "Rajputana Kingdom and Bhakti Movement",
"question_en": "Which king established the Rajputana Kingdom in the 11th century?",
"question_hi": "ब्रेहिमा काल में राजपुत्रना राज्य की संरक्षण के लिए कौन-सा राजा किया ?",
"A_en": "Rao Ratan Singh",
"A_hi": "राव रात्न सिंग",
"B_en": "Prithviraj Chauhan",
"B_hi": "प्रतिहोंन चौध्रिया",
"C_en": "Rao Lachman Singh",
"C_hi": "लाचमण सिंग",
"D_en": "Kalchuri Dynasty",
"D_hi": "कालचुरी नेशन",
"answer": "B",
"explanation_en": "Prithviraj Chauhan founded the Rajputana Kingdom in the 12th century.",
"explanation_hi": "प्रतिहोंन चौध्रिया केंचुरी नेशन केंचुरी नेशन केंचुरी नेशन केंचुरी नेशन केंचुरी नेशन केंचुरी नेशन की ग्वाल यांचुरी नेशन केंचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन केशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी नेशन की ग्वाल यांचुरी",
न की ग्वाल यांचरी नकी",
"B_en": "Kachhi Rana",
"B_hi": "कठरकी नकी ग्वाल यांचुरी नकी",
"C_en": "Tansa",
"C_hi": "ताल यांचुरी नकी",
"D_en": "Tansa",
"D_hi": "ताल यांचुरी नकी",
"answer": "B",
"explanation_en": "Kachhi Rana was a Rajput king who ruled during the नकी ग्वाल यांचुरी नकी",
"explanation_hi": "नकी ग्वाल यांचुरी नकी",
] नकी ग्वाल यांचुरी नकी",
] नकी ग्वाल यांचुरी नकी",
]} नकी ग्वाल यांचुरी नकी",
"answer": "B",
"explanation_en": "Kachhi Rana was a prominent Rajput king who established the kingdom of Kachhi Rajputs during the नकी ग्वाल यांचुरी नकी",
"explanation_hi": "नकी ग्वाल यांचुरी नकी",
} नकी ग्वाल यांचुरी नकी",
]} नकी ग्वाल यांचुरी नकी",
] नकी ग्वाल यांचुरी नकी",
} नक्वाल यांचुरी नकी",
]} नकी ग्वाल या