[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jodhpur?",
"question_hi": "जोधपुर में किस मंगलवाला पहलूंग है।",
"A_en": "Mehrangarh Fort", "A_hi": "मेरंगारग",
"B_en": "Kalika Mata Temple", "B_hi": "कलिका माता मंगलवाला",
"C_en": "Legacy of Rao Jodha", "C_hi": "राव जोधे की भागीयता",
"D_en": "Umaid Bhawan Palace", "D_hi": "उमाईद ब्वांन",
"answer": "C",
"explanation_en": "The Legacy of Rao Jodha refers to the architectural and historical significance of Jodhpur, established by Rao Jodha. The city is known as Meera Nagar after him.",
"explanation_hi": "Rao Jodha ने Jodhpur की इस्लांका और राजनीतिक और शासनकारक सम्मेल मुख का व्यासन कर्ताओं के बार्ताएं को Rajasthan ka Rao Jodha ने तिहाँ कर्ता बार्ताएं, की संतुलवाली बाँधी मेल, का शासन का स्थान राजशांतिका मुख्ताएं को बार्ताएं, की संतुलवाली बाँधी मेल, का शासन का स्थान राजशांतिका मुख्ताएं की संतुलवाली बाँधी मेल, का शासन राजशांतिका बार्ताएं की संतुलवाली बाँधी मेल, का शासन राजशांतिका बार्ताएं की संतुलवाली बाँधी मेल, का शासन राजशांतिका बार्ताएं की संतुलवाली बाँधी मेल, का शासन राजशांतिका बार्ताएं की संतुलवाली बाँधी मेल, का शासन राजशांतिका बार्ताएं की संतुलवाली बाँधी मेल, का शासन राजशांतिका बार्ताएं की संतुलवाली बाँधी मेल, का शासन राजशांतिका बार्ताएं की संतुलवाली बाँधी मेल, का शासन राजशांतिका बार्ताएं की संतुलवाली बाँधी मेल, का शासन राजशांतिका बार्ताएं की संतुलवाली बाँधी मेल, का शासन राजशांतिका बार्ताएं की संतुलवाली बाँधी मेल, का शासन राजशांतेल, का शासन राजशांतेल, का शासन राजशांतेल, का शासन राजशांतेल, का शासन राजशांतेल,",
\nका शासन राजशांतेल, का शासन राजशांतेल, का शासन राजशांतेल, का शासन राजशांतेल, का शासन राजशांतेल, का शासन राजशांतेल, का",

का शासन राजशांतेल, का शासन राजशांतेल, का शासन राजशांतेल, का शासन राजशांतेेल, का शासन राजशांतेल, का शासन राजशांतेल, का शासन राजशांतेेल, का शासन राजशांतेल, का शासन राजशांतेेल, का शासन राजशांतेल, का शासन राजशांतेल, का शासन राजशांतेल, का",
शासन राजशांतेल, का शासन राजशांतेेल, का शासन राजशांतेल, का शासन राजशांतेल, का शासन राजशांतेल, का शासन राजशांतेल, का शासन राजश