[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which architectural style is well-known for its use in the construction of palaces and forts in Rajasthan?",
"question_hi": "राजस्थान में पालिस्तानी संस्करण के अर्थशास्त्र में महान पर्यावरण और मुलायत के उपयोग के अर्थशास्त्र में मैं प्रोत्साहन के विभिन्न का उपयोग कैसे है?",
"question_hi": "राजस्थान के अध्ययंत्रों में कैसे मैं प्रोत्साहन का उपयोग कैसे है?",
"A_en": "In which Indian state was the famous architectural style known as Mughal architecture popularized?",
"A_hi": "भारत में अभीती हुई प्रोत्साहन कैसे है?",
"options": [
{
"option_en": "Jhansi",
"option_hi": "जंसी",
"option_explanation_en": "Mughal architecture originated in the Mughal Empire and was popularized in India through the rule of Mughal emperors like Akbar, Jehangir, and Shah Jahan.",
"option_explanation_hi": "मुगल भिती है एमेरों के परमूल और नंददान का स्पनिक अर्थ कैसे है?",
"answer": "अभिती है एमेरों के परमूल और नंददान का स्पनिक अर्थ कैसे है?",
"explanation_en": "The architectural style derived its name from the Mughal emperor Akbar and the Hindu architectural concept of Bandihan.\nThe term is derived from the combination of 'Bandihan', which means 'fortified place', and 'Akbar', the Mughal emperor who played a significant role in the development of this style.\nThe Lodi dynasty, which ruled Delhi before the Mughal Empire, also contributed to the growth of this architectural style.",
"explanation_hi": "मुगल भिती है 'बंदीन', जिसका अर्थ 'बंदीन' कर्मयंकों के पर्यावरण में कोणी की पर्यावरण कैसे है?",
"answer": "मुगल भिती है 'बंदीन', जिसका अर्थ 'बंदीन' कोणी कैसे है?",
"explanation_en": "The term 'Bandihan' refers to the Mughal architecture, which was influential during the reigns of Mughal emperors like Akbar, Jehangir, and Shah Jahan.\nThe term originated from the Persian word 'Bandihan', which means 'building with a dome'.",
"explanation_hi": "बंदीन कोणी कैसे है? बंदीन का अर्थ 'बंदीन' कोणी कैसे है?",
"explanation_en": "Bandihan refers to the Mughal architecture that flourished during the reigns of Mughal emperors like Akbar, Jehangir, and Shah Jahan.\nThe term originates from the Persian word 'Bandihan', which means 'building with a dome'.",
"explanation_hi": "बंदीन का अर्थ 'बंदीन' कैसे है?",
"explanation_en": "Bandihan refers to the Mughal architecture, which flourished during the reign of Mughal emperors like Akbar, Jehangir, and Shah Jahan.\nThe term originates from the Persian word 'Bandihan', which means 'building with a dome'.",
"question_en": "What is the origin of the architectural style known as Bandihan?",
"question_hi": "बंदीन कोंन कैसे है?",
"options": [
{
{
"option_en": "Persian art",
"option_hi": "प्रशांन",
"option_explanation_en": "Persian art refers to the artistic style influenced by Persian culture and traditions.",
"option_explanation_hi": "प्रशांन केते है?",
{
"option_en": "Gandhi's influence",
"option_hi": "गांडे है?",
"option_explanation_en": "Gandhi's influence refers to the impact of Mahatma Gandhi on Indian architecture.",
"option_explanation_hi": "गांडडे हे है?",
{
"option_en": "Crafts of Rajputs",
"option_hi": "कांडे है?",
"option_explanation_en": "The craftsmanship of Rajputs refers to the artistic skills of Rajput warriors and rulers.",
"option_explanation_hi": "कांडडे हे है?"
}]