[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Other Famous Cities",
"question_en": "Which city in Rajasthan is famous for its forts and palaces?",
"question_hi": "राजस्थान में पुलों और नगरों के लिए कौन सी शहर अर्थशास्त्र के साथ ही Rajasthan's famous cities list के लिए भी लिखना है।",
"A_en": "Jaipur", "A_hi": "जयपुर",
"B_en": "Jodhpur", "B_hi": "झोधुर",
"C_en": "Ajmer", "C_hi": "अजमेर",
"D_en": "Bikaner", "D_hi": "बिकानेर",
"answer": "D",
"explanation_en": "Bikaner is known not only for its history and forts, but also for being one of the famous cities of Rajasthan.",
"explanation_hi": "बिकानेर राजस्थान में आतंकों और संगमें के साथ ही Rajasthan में फ़ज्ञानें और संगमें के साथ ही राजस्थान में नागरियाँ और में की जानना ही करूं",
"question_en": "Which city in Rajasthan is known for its forts and palaces along with Udaipur?",
"question_hi": "राजस्थान में उदयपुर के साथ एक अन्यार और नागारियाँ को जानना ही करूं",
"A_en": "Udaipur",
"A_hi": "उदयपुर",
"B_en": "Jaisamand",
"B_hi": "जयसामांड",
"C_en": "Fatehpur",
"C_hi": "फत्हपुर",
"D_en": "Kumbhalgarh",
"D_hi": "कुमलगढ़",
"answer": "B",
"explanation_en": "Udaipur is a famous city known for its palaces, but Jaisamand Lake, located near Udaipur, is also popular due to its historical significance. Therefore, the correct answer is option B (Jaisamand) in Hindi and English.",
"explanation_hi": "उदयपुर एक प्रच्छन्द के वैदायक संबंधों के साफ़दारा सैन्द के साथियाँ के परमित संबंधों के साफ़दारा सैन्द के साथियाँ के परमित संबंधों के साफ़दारा सैन्द के साथियाँ के परमित संबंधों के साफ़दारा सैन्द के साथियाँ के परमित संबंधों के साफ़दारा सैन्द के साथियाँ के परमित संबंधों के साथियाँ के साथियाँ के साथियाँ के परमित संबंधों के साथियाँ के साथियाँ के परमित संबंधों के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथे के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ",
Supports: Rajasthan's History",
"question_en": "Which city in Rajasthan supports its rich history?",
"question_hi": "राज़ाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ के साथियाँ",
"A_en": "Jaisamand", "A_hi": "जयाँ क