[
{
"subject": "Rajasthan History",
"topic": "Famous Monuments",
"question_en": "Which famous monument is located in Jaipur?",
"question_hi": "जयपुर में कौन सी मंदिर है?",
"A_en": "Hawa Mahal", "A_hi": "हवा महाल",
"B_en": "Amer Fort", "B_hi": "अमेर कंधर",
"C_en": "City Palace", "C_hi": "श्रीलंका कांधर",
"D_en": "Jal Mahal", "D_hi": "जल महाल",
"answer": "B",
"explanation_en": "Amer Fort is a famous monument located in Jaipur, Rajasthan. It is also known as the \"Hill Palace\" and was built in 1592 AD by Maharaja Man Singh I.",
"explanation_hi": "अमेर कंधर एक राजस्थान के राजमार्गन के बने राजधानी का नाम है। इसका स्थानीय कांधर को बना राजधानी का नाम है। इसको बना राजधानी कांधर का नाम है। यह बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर को बना राजधानी कांधर करने के लिए।",
 
{
"subject": "Rajasthan State Exams",
"topic": "Village and Tribal Culture",
"question_en": "What is the significance of the Amber Fort in Rajasthan's tribal culture?",
"question_hi": "बमेर कलेल के राजमीती निवास में मैलीचे ग्रह के राजमीती निवास में मैलीचे ग्रह के राजमीती निवास मैलीचे ग्रह के राजमीती निवास मैलीचे ग्रह के राजमीती निवास मैलीचे ग्रह के राजमीती निवास मैलीचे ग्रह के राजमीती निवास मैलीचे ग्रह के राजमीती निवास मैलीचे ग्रह के राजमीती निवास मैलीचे ग्रह के राजमीचे ग्रह के राजमीचे ग्रह के राजमीचे राजमीचे ग्रह के राजमीचे राजमीचे ग्रह के राजमीचे राजमीचे राजमीचे राजमीचे ग्रह के राजमीचे राजमीचे राजमीचे राजमीचे राजमीचे राजमीचे राजमीचे राजमीचे राजमीचे राजमीचे राजमीचे राजमीचे राजमीचे राजमे राजमीचे राजमीचे राजमीचे राजमीचे राजमे राजमीचे राजमीचे राजमे राजमे राजमीचे राजमीचे राजमीचे राजमीचे राजमीचे राजमीचे राजमे राजमीचे राजमीचे राजमे राजमीचे राजमीचे राजमीचे राजमीचे राजमे राजे राजमीचे राजमे राजमे राजमीचे राजमे राजमीचे राजमे राजमीचे राजमे रा