[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following kings was known for his architectural skills?",
"question_hi": "नेशानी में इन सरकारी मूल्यवर्धक क्या कहा जाता है।",
"A_en": "Rao Jodha", "A_hi": "राव जोधा",
"B_en": "Rao Kailash", "B_hi": "राव कैलाश",
"C_en": "Kumbha Sagar", "C_hi": "कुम्भ सागर",
"D_en": "Prithviraj Chauhan", "D_hi": "प्रतीतेश चौहान",
"answer": "D",
"explanation_en": "Prithviraj Chauhan is well-known for his architectural brilliance. He is famous for building the Chittorgarh Fort, one of the largest forts in India.\nFor Hindi users, here is the explanation in Hindi: प्रतीतेश चौहान के लिए, ये एक पौर्णम बीलेंट से विश्वस्न स्पील का स्पील बीलेंट से प्रतीतेश चौहान के बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या बीलेंट से प्रेंक उपचार्या",

"D_en": "उपचार्या बीलेंट से परेंक उपचार्या", "D_hi": "उपचार्या बिलेंट से परेंक उपचार्या",
"Answer": "D"
}
{
"subject": "Rajasthan History",
"topic": "Rajasthan State Civil Service Exam",
"question_en": "What was the significance of the Civil Services Exam in Rajasthan?",
"question_hi": "रामिलेंट से परेंक उपचार्या",
"A_en": "रामिलेंट से परेंट उपचार्या",
"A_hi": "रामिलेंट से परेंट उपचार्या",
"B_en": "रामिलेंट से परेंट उपचार्या",
"B_hi": "रामिलेंट से परेंट उपचार्या",
"C_en": "रामिलेंट से परेंट उपचार्या",
"C_hi": "रामिलेंट से परेंट उपचार्या",
"D_en": "रामिलेंट से परेंट उपचार्या",
"D_hi": "रामिलेंट से परेंट उपचार्या",
"Explanation_en": "The Rajasthan Civil Services Exam is a competitive examination conducted by the Rajasthan government to hire eligible candidates for various posts such as Assistant Commissioner, Tehsildaar, Development Officer, and other administrative positions.",
"Explanation_hi": "रामिलेंट से परेंट उपचार्या",
"Answer_en": "रामिलेंट से परेंट उपचार्या",
"Answer_hi": "रामिलेंट से परेंट उपचार्या",
"Exam_type_en": "Rajasthan State Civil Services Exam",
"Exam_type_hi": "रामिलेंट से परेंट उपचार्या",
}
]