[
{
"subject": "Rajasthan History",
"topic": "Royal Families and Palaces",
"question_en": "Which royal family ruled over Jaipur during the establishment of the city?",
"question_hi": "जयपुर के संरक्षण के समय केवल कौन सी राज्यवादी किस्मति की क्षमता हुई?",
"A_en": "Kachhwaha Rajputs",
"A_hi": "कचवहा राजपूतों",
"B_en": "Pataudi Rajputs",
"B_hi": "पटाउडी राजपूतों",
"C_en": "Alauddin Khilji",
"C_hi": "अलाउद्दिन ख़िल्जी",
"D_en": "Thakur of Jaipur",
"D_hi": "जयपुर के तक्रम मध्यानों",
"answer": "D",
"explanation_en": "The Thakur of Jaipur founded Jaipur during the establishment of the Kachhawaha Rajputs.",
"explanation_hi": "जयपुर के तक्रम मध्यान श्रेणी के सहयोगंवां जयपुर के तक्रम मध्यान श्रेणी के सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्ती श्रेणी की सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्ती श्रेणी के सहयोगंवां संतुरन्तियां संतुरन्तुरन्तुरन्ती श्रां संतुरन्ती श्री शरां संतुरन्ती श्रां संतुरन्त्रां संत्रां संत्ी श्रां संत्री श्रां संत्रां संत्रां संत्े श्रां संत्रां संते श्रां संते श्रां  संते श्रे शरां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते श्रां संते",
"answer": "B",
"explanation_en": "The Rao Rajputs, popularly known as Rathore Rajputs, were the ruling class during the establishment of Jaipur. It was during the reign of Rao Jaisa, and the capital was founded by Maharaja Ram Singh II in 1734 BC.",
"explanation_hi": "रामपतो रा रे संते श्रां संते श्रां संते श्