[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort was built by Maharaja Amar Singh Tomar?",
"question_hi": "महाराजा अमर सिंग तोमर की बनाई गई श्रेष्ठ फोट्ट क्या हैं ?",
"A_en": "Kheerola", "A_hi": "केहोला",
"B_en": "Amer", "B_hi": "अमेर",
"C_en": "Mehrangarh", "C_hi": "मेरंगार",
"D_en": "Elephanta", "D_hi": "एलेफेण्टा",
"answer": "B",
"explanation_en": "Maharaja Amarsingh Tomar is known for building the Amer Fort in Jaipur, Rajasthan.",
"explanation_hi": "महाराजा अमेर तोमर के बनाए गए फोट्ट के लिए एमर फोट्ट से क्या बनाया गया है।",
"explanation_hi": "महाराजा अमेर तोमर के बनाया गया है।।",
"answer": "B"
},
{
"subject": "Rajasthan History",
"topic": "Cultural Heritage",
"question_en": "Which historical palace complex is considered as a UNESCO World Heritage Site?",
"question_hi": "राजशाला किस्तान का कौनसे विद्यान को सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वेंक रच्चका डीजन संयुक्त कर सर्वक रच्र डीजन संयुक्त कर सर्व्र डीजन संय्त कर सर्र डीजन संयु्र डीजन संय्र डिजन संय्र डीजन संर डीजन संय्र डीजन",
Are you ready for the exam?",
"choice_en": [
{
"A": "Jaipur",
"A_hi": "जपर डेजन",
"B": "Udaipur",
"B_hi": "उडीजन",
"C": "Rajasthan",
"C_hi": "जरेजन",
"D": "Rajasthan",
"D_hi": "जरेजन",
"answer": "B",
"explanation_en": "Udaipur is the correct answer as it is the capital city of Jaipur district.",
"explanation_hi": "जपर डेजन संयेजन जपर डेजन, जपर डेजन",
},
{
"subject": "Rajasthan History",
"topic": "Rajput Kings",
"question_en": "Which king ruled Rajasthan before Maharana Pratap Singh?",
"question_hi": "राजपर पर पर पर पर",
"A_en": "Rana Pratap Singh",
"A_hi": "राजपर पर",
"B_en": "Rana Pratap",
"B_hi": "राजपर पर",
"C_en": "Rana Pratap",
"C_hi": "राजपर पर",
"D_en": "Rana Pratap Singh",
"D_hi": "राजपर पर",
"answer": "B",
"explanation_en": "Rana Pratap Singh was the king who ruled Rajasthan before Maharana Pratap Singh.",
"explanation_hi": "राजपर पर पर पर पर",
},
{
"subject": "Rajasthan History",
"topic": "Rajput Kings",
"question_en": "Who was the first king of Jaisamgarh?",
"question_hi": "जबर जबर जबर जबर",
"A_en": "Jaisamgarh",
"A_hi": "जबर जबर",
"B_en": "Jaisamgarh",
"B_hi": "जबर जबर",
"C_en": "Jaisamgarh",
"C_hi": "जबर जबर",
"D_en": "Jaisamgarh",
"D_hi": "ज