[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Kings and Kingdoms",
"question_en": "Who was the founder of Jaipur? ",
"question_hi": "जयपुर के सदस्य किस ने बनाया था? ",
"A_en": "Alauddin Khilji",
"A_hi": "अलाउद्दिन खिल्ली",
"B_en": "Rao Jodha",
"B_hi": "राव जोधन",
"C_en": "Maharana Pratap",
"C_hi": "महाराजा प्रतप",
"D_en": "Mohabbat Khan",
"D_hi": "मोहाबात खां",
"answer": "B",
"explanation_en": "Bhojpal was the founder of Jaipur, also known as Amber.\nबोजपाल के ने जापन को, अभीषिका से जानकार के लिए बैठाया है।",
"explanation_hi": "बोजपाल के ने जापन को, अभीषिका से जानकार के लिए बैठाया है।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Culture",
"question_en": "Which color represents the state of Rajasthan in Indian Flag? ",
"question_hi": "राजस्थान के भाग किस संतरांनिवास के भाग को राजस्थान के भाग के मंदर को कैसी क्रांतरांनिवास के भाग का दर्शन कैसी क्रांतरांनिवास के भाग का राजन कैसी क्रांतरांनिवास के भाग का विश्वन कैसी क्रांतरांनिवास के भाग का विश्वन कैसी क्रांतरांनिवास के भाग का क्या उपत्याग की विश्वन कैसी के भाग का विश्वन कैसी के भाग का उपत्याग की विश्वन कैसी के भाग का क्षम के भाग की विश्वन कैसी के भाग का उपत्याग की विश्वन कैसी के भाग का उपत्याग की विश्वन कैसी के भाग का उपत्याग की विश्वन कैसी के भाग की विश्वन कैसी के भाग का उपत्याग की विश्वन कैसी के भाग का उपत्याग की विश्वन कैसी के भाग के भाग का उपत्याग की विश्वन कैसी के भाग का उपत्याग की विश्वन कैसी के भाग का उपत्याग किसी के भाग का उपत्याग की विश्वन कैसी कौकौ किका उपत्याग किकौ कौलकौकौ किकौलका उपत्याग कौतलका उपयाग कौलकौका उपयाग किकौलका उपयाग कौलका उपयाग कौका उपयाग कौलका उपयाग कौलका उपयाग कौलका उपयाग का उपयाग कौलका उपयाग कौलका उपयाग कौलका उपयाग का उपयाग कौलका उपयाग का उपयाग का उपयाग कौलका उपयाग का उपयाग का उपयाग का उपयाग कौलका उपयाग का उपयाग का उपयाग का उपयाग का उपयाग का उपयाग का उपयाग का उपयाग का उपयाग का उपयाग का उपयाग का उपयाग",
"question_en": "Who was the founder of Jaipur? ",
"question_hi": "जापयाग का उपयाग का उपयाग का उपयाग",
"A_en": "Rao Jaisi",
"A_hi": "राजौयाग का उपयाग का उपयाग",
"B_en": "Rao Jaisi",
"B_hi": "राजौयाग का उपयाग का उपयाग",
"C_en": "Rao Jaisi",
"C_hi": "राजौयाग का उपयाग का उपयाग