[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Other Famous Cities",
"question_en": "Which is the capital of Rajasthan and which are some other famous cities?",
"question_hi": "राजस्थान की राजधानी और इनमें कुछ पसंदितियों कौन से हैं।",
"A_en": "Jaipur and Udaipur",
"A_hi": "जयपुर और उदयपुर",
"B_en": "Jodhpur and Bikaner",
"B_hi": "जोधपुर और बिकानेर",
"C_en": "Agra and Kanpur",
"C_hi": "अग्नि और कानपुर",
"D_en": "Delhi and Kolkata",
"D_hi": "दिल्ली और कॉलकट",
"answer": "B",
"explanation_en": "Jodhpur and Bikaner are two famous cities in Rajasthan apart from Jaipur and Udaipur. Agra and Kanpur are not part of Rajasthan. Delhi and Kolkata are capital cities of other states, not Rajasthan.",
"explanation_hi": "राजस्थान में मूल्यांक और बिकनेर एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और बिकनेर एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में मूल्यांक और एक खुश्रूणी में म्यांक और एक खुश्रूणी में म्यांक और एक खुश्रूणी में क खुश्रूणी में क और एक खुशर एक खुश्रूणी क क और एक खुशर एक खुश्रूणी क क और एक खुशर एक क क खुशर एक खुश्रूणी क क और एक खुशर एक क क खुशर एक क क क खुशर एक क खुशर एक क क खुश्र एक क क खुशर एक क क खुश्र एक क खुशर एक क क क खुश्र एक क",
}
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Other Notewali Cities (क क क क)",
"question_en": "What are the famous cities of Rajasthan and their respective notewalis?",
"question_hi": "राजहन मिं क क क क क खुश्रें क क खुशरें क क",
"A_en": "Agra, Bikaner, Jodhpur, Udaipur",
"A_hi": "क क क क खुशरं क क क क",
"B_en": "Agra, Bikaner, Udaipur",
"B_hi": "क क क क क क क",
"C_en": "Jodhpur, Bikaner, Agra",
"C_hi": "क