[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which emperor's reign marked the establishment of Mughal rule in Rajasthan?",
"question_hi": "राजस्थान की मुगल नेत्रता के मार्क में किस सिंह की आधार पर निर्माण हुआ?",
"A_en": "Aurangzeb",
"A_hi": "औरंगजेब",
"B_en": "Akbar",
"B_hi": "अभरम",
"C_en": "Shah Jahan",
"C_hi": "शाहजाहाँ",
"D_en": "Firanghi",
"D_hi": "फ़ीरंगी",
"answer": "B",
"explanation_en": "Akbar is known for laying the foundation of Mughal rule in Rajasthan. Aurangzeb, Shah Jahan, and Firanghi are other emperors associated with the Mughals, but the establishment of Mughal rule in Rajasthan is primarily attributed to Akbar.",
"explanation_hi": "अभरम राजस्थान मुगल नेत्रता के मार्क में कोणति के प्रधानियों के विभाग में प्रधानों, अर्थियों को क्या लाभागों के मार्क में कोणति को प्रधानों के विभागों के मार्क में कोणति को प्रधानों के मार्क में कोणति को प्रधानों के विभागों में कोणति को प्रधानों के मार्क में कोणति को प्रधानों के विभागों में कोणति को प्रधानों के विभागों में कोणति को प्रधानों के विभागों में कोणति को प्रधानों के विभागों में कोणति को प्रधानों के विभागों में कोणति को प्रधानों के विभागों में कोणति को प्रधानों के विभागों में कोणति को प्रधानों के विभागों में कोणति को प्रधानों के विभागों में कोणति को प्रधानों के विभागों में कोणति को प्रधानों के विभागों में को प्रधानों के विभागों में कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति",

"A_en": "Akbar",
"A_hi": "अकोणति",
"B_en": "Jaipur",
"B_hi": "कोणति",
"C_en": "Ajmer",
"C_hi": "कोणति",
"D_en": "Jodhpur",
"D_hi": "कोणति",
"answer": "A",
"explanation_en": "Akbar, also known as Akbar, was the founder of the Mughal empire and the capital of Rajasthan during his era. Jaipur, Ajmer, and Jodhpur were the capitals of three princely states during Mughal rule, while Jodhpur was a prominent city.",
"explanation_hi": "अकोणति, अकोणति कोणति कोणति",
}
]