[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following is a significant battlefield in Rajasthan?",
"question_hi": "राजस्थान में कौन से परिस्थितियों में महत्वपूर्ण मृत्युटर कोण्टेक्टर के विभागीय एक उपेक्षा संकेतों के विभागीय है।",
"A_en": "Battle of Saragarhi",
"A_hi": "सरागांगर",
"B_en": "Chittorgarh Fort",
"B_hi": "चीटीगर कंट्रो",
"C_en": "Meos",
"C_hi": "मेघों",
"D_en": "Jaipur",
"D_hi": "जैपूर",
"answer": "A",
"explanation_en": "The Battle of Saragarhi is a significant event in Rajasthan history, involving a group of 21 Sikh soldiers defending a British outpost against a much larger Afghan army in 1897. It is a part of the Frontier Gandaki Campaign in Jammu and Kashmir region. The answer is A - Battle of Saragarhi.",
"explanation_hi": "सरागांगर एक राजभारत के ऑन्लाइन एंट पोस्ट से जायक अफगानी आरमों को कमित करने के लीडर, विभिज्ञान, इन्सारखियांगर एर्न एंट पोस्ट से योग्राम आरमों का एक्सारखियांगर एर्न पोस्ट",
"question_en": "Which battle marks the bravery of the soldiers from the Gorkha Army in the Indian Army?",
"question_hi": "गोर्कचा आरमों के से यांगर एर्न पोस्ट",
"A_en": "Battle of Saragarhi",
"A_hi": "सरागरि बास्ट",
"B_en": "Battle of Khel Gaon",
"B_hi": "खेल गाँव",
"C_en": "Battle of Bhangarh",
"C_hi": "बहंगरह",
"D_en": "Battle of Aluwa",
"D_hi": "अलुवा बास्ट",
"answer": "A",
"explanation_en": "The Battle of Saragarhi is a notable battle where 21 Gorkha soldiers from the Indian Army defended a single post against a vast army of Afghans in 1897. It is considered a symbol of bravery.",
"explanation_hi": "सरागरि बास्ट योगेंट में 1897 में एफ़गान के एक बास्ट को एलरेंट में 21 गोर्क आरमियांट को एलरेंट में एफ़गान के एलरेंट में 1897 में एफ़गान के एलरेंट में एफगान के एलरेंट में एफगान को एलरेंट को एफगान के एलरेंट में 1897 में एफगान को एलरेंट में एफगान को एलरेंट में 1897 में एफगान को एलरेंट में 1897 में एफगान को एलरेंट में को एफगान को एलरेंट में 1897 में एफगान को एलरेंट में 1897 में एफगान को एलरेंट में 1897 में एफगान को एलरेंट में एफगान को एलरेंट में 1897 में एफगान को एलरें एफगान को एलरें 1897 एफगान को एलरें एफगान को एलरें 1897 एफगान को एलरें",

एफगान को एलें 1897 एफगान को एलरें एफगान को एलें 1897 एफको एलरें",
एफगान को एलरें 1897 एफरें",
एफगान को एलें 1897",
एफरें",
एफरें 1897 एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें 1897",
एफरें",
एफरें 1897",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरें",
एफरे