[
{
"subject": "Rajasthan History",
"topic": "Maharana Pratap and the Battle of Haldighati",
"question_en": "Which battle was fought between Maharana Pratap and Mughal Emperor Akbar?",
"question_hi": "महाराना प्रताप और मुगल समाज के अभिमान अकबर को मिला किस भाग के बैलेक्टर में आया था?",
"A_en": "First Battle of Haldighati",
"A_hi": "पहली हल्दीघट की बाज़ा",
"B_en": "Second Battle of Haldighati",
"B_hi": "दूतावल",
"C_en": "Third Battle of Haldighati",
"C_hi": "तृतीय हल्दीघट",
"D_en": "Battle of Mewar",
"D_hi": "मेवार",
"answer": "B",
"explanation_en": "The Second Battle of Haldighati took place between Maharana Pratap and Mughal Emperor Akbar in 1576. It was a significant battle fought for the control of Mewar region.\nEnglish Explanation:\nThe Second Battle of Haldighati (दूतावल) was fought between Maharana Pratap and Mughal Emperor Akbar in 1576. This battle took place for the control of Mewar region.\nHindi Explanation:\nदूतावल में महाराणा प्रातिपंत और मुग़लाल में मेवारा में हुंचाई में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल में मेवारा में मुग़लाल मेवारा में मुग़लाल मेवारा मेवारा मुग़लाल मेवारा मेवारा मुग़लाल मेवारा मेवारा मुग़लाल मेवारा मुग़लाल मेवारा मुग़लाल मेवारा मेवारा मिंवारा मुग़लाल मिंवारा मुग़लाल मेवारा मुग़लाल मेवारा मुग़लाल मेवारा मुग़लाल मिंवारा मुग़लाल मेवारा मुग़लाल मेवारा मुग़लाल मेवारा मुग़लाल मुग़लाल मेवारा मुग़लाल मेवारा मुग़लाल मेवारा मुग़लाल मेवारा मुग़लाल मेवारा मुग़लाल मेवारा मुग़लालाल मेवारा मुग़लालाल मेवारा मुग़लालाल मेवारा मुग़लालालालाल मेवारा मुग़लालालालाल मेवारा मुग़लालालाल मेवारा मुग़लालालालालाल मेवारा मेवारा मुग़लालालालालालाल मेवारा मुग़लालालालालालालालालालाल मेवारा मुग़लालालालालाल मेवारा मुग़लालालालालालालालाल मेवारा मुग़लालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालाला