[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous king is associated with the construction of Amber Fort?",
"question_hi": "अम्बर के बनाने के लिए पहले कौन सा महत्वपूर्ण राजा था?",
"A_en": "Harshavardhan",
"A_hi": "हर्षवर्धन",
"B_en": "Amber",
"B_hi": "अम्बर",
"C_en": "Rai Singh",
"C_hi": "राइज सिंह",
"D_en": "Pratap Singh",
"D_hi": "प्रताप सिंह",
"answer": "C",
"explanation_en": "Amber Fort was built by Rai Singh, a famous king of Jaipur. He was the builder of this iconic monument.",
"explanation_hi": "जैपूर की बनाई के लिए Rai Singh, Jaipur के मैं मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार",
का मैं एक अन्यार",
"answer": "D",
"explanation_en": "The famous Rana Lal Singh, also known as Rana Lal Singh, was a prince of Jaipur who is famously known for his role in the construction of Hawa Mahal and City Palace in Jaipur.",
"explanation_hi": "जैं एक अन्यार का मैं एक अन्यार का मैं एक अन्यार, का मैं एक अन्यार का मैं एक अन्यार",
"answer_hi": "जैं एक अन्यार का मैं एक अन्यार",
"question_