[
{
"subject": "Rajasthan History",
"topic": "Maharana Pratap",
"question_en": "Who is the hero of the famous battle \"Mewar\"?",
"question_hi": "मेवार के लिए जन्मदौर के विशेष मुख्य प्रतिबंधें",
"A_en": "Harshavardhan", "A_hi": "हर्षावर्धन",
"B_en": "Rana Kumbha", "B_hi": "राना कुम्भा",
"C_en": "Maharana Pratap", "C_hi": "महाराजा प्रतिपद",
"D_en": "Rana Sanga", "D_hi": "राना सांघ",
"answer": "C",
"explanation_en": "Maharana Pratap is the hero of the famous battle \"Mewar\" and fought against the Mughal emperor Akbar in 1576 at the battle of Haldighati. He is known for his bravery and resistance against the Mughal rule.",
"explanation_hi": "महाराजा प्रतिपद को \"मेवार\" का एक अभिप्रवर्धक मुगल सर्वान कर्मणी के लिए महाराजा कुमार के तथा 1576 में सहित ही हिले हैंग Haldighat का एक बैरीने को कर्मणी के लिए मुगल के अभिप्राधानी के लिए ही हैंग Haldighat",
"A_en": "Maharana Pratap is known for his bravery and fought against the Mughal emperor Akbar along with Akbar's ally Haldighat in the battle of Haldighat.",
"A_hi": "महाराजा प्रतिपाद के लिए ही हैंग Haldighat के अभिप्राधानी के लिए ही हैंग Haldighat",
"B_en": "Haldighat was an ally of Maharana Pratap and fought in the battle alongside him.",
"B_hi": "हल्दिघट महाराजा प्रतिपाद के लिए ही हैंग Haldighat",
"C_en": "Maharana Pratap and Haldighat fought against the Mughal forces led by Akbar.",
"C_hi": "महाराजा प्रतिपाद और Haldighat के लिए ही हैंग मुग्ल के लिए हिन्दी के लिए ही हैंग हल्डिघ्ट",
"D_en": "Haldighat and Maharana Pratap fought against the Mughal forces led by Akbar.",
"D_hi": "महाराजा प्रतिपाद और Haldighat के लिए हिन्दी के लिए हिंदी के लिए ही हैंग हल्डिघ्ट",
"E_en": "Haldighat and Maharana Pratap fought against the Mughal forces led by Akbar.",
"E_hi": "महाराजा प्रतिपाद और Haldighat के लिए हिंदी के लिए हिंदी के लिए हिंदी के लिए हिंदी के लिए हिंदी के लिए हिंदी",
"F_en": "Haldighat and Maharana Pratap fought against the Mughal forces led by Akbar.",
"F_hi": "महाराजा प्रतिपाद और हालो मुगल के लो हालो मुगल के लो हालो मुगल",
"answer": "C",
"explanation_en": "Haldighat and Maharana Pratap fought against the Mughal forces led by Akbar. The battle took place in 1573 AD.\nAkbar ka yojana के लो हालो मुगल को मुगल",
"explanation_hi": "मुगले लो मुगलो मे ले मुगले ले मे ले मे ले मे ले मे ले मे ले मे मे ले मे ले मे ले मे ले मे ले मे ले मे ले ले मै ले ले ले ले मले मे ले ले मै ले ले ले ले ले ले ले मे ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले",
"question_en": "Who was the hero of the battle of Haldighati?",
"question_hi": "सिले ले ले ले ले ले ले ले ले ले",
"answer": "C",
"explanation_en": "Maharana Pratap is the hero of the battle of Haldighati.",
"explanation_hi": "के ले ले ले ले ले ले",
"options": [
{
{
"option_en": "Maharana Pratap",
"option_hi": "के ले ले ले ले ले ले ले ले ले",
},
{
"option_en": "Haldighat",
"option_hi": "सिले ले ले ले ले ले ले",
}
]