[
{
"subject": "Rajasthan History",
"topic": "Famous Kings and Battles",
"question_en": "Who led the battle against Rao Jodha during the establishment of Jaipur?",
"question_hi": "राव जोधपुर के संघ को बुलेट करने के लिए कौन किया ?",
"A_en": "Akbar",
"A_hi": "ाकर",
"B_en": "Jaipur Rulers",
"B_hi": "जापानी राजनों",
"C_en": "Rao Jodha",
"C_hi": "राव जोधपुर",
"D_en": "Aurangzeb",
"D_hi": "ओरंगजी",
"answer": "C",
"explanation_en": "Rao Jodha led the battle against the combined forces of Mughal Emperor Akbar during the establishment of Jaipur. He founded Jaipur, known as the Pink City, in 1727 AD.",
"explanation_hi": "राव जोधपुर ने 1727 AD में Jaipur, पंगली की सपानों के समुद्रों के पुल ने बैल किया गया था। उसने जापानी की सपानों के समुद्रों के पुल ने बैल किया गया था। जापानी की सपानी के पुल ने बैल किया गया था।",
"answer": "C",
"explanation_en": "Rao Jodha led the battle against the combined forces of Mughal emperor Akbar. He successfully defended Jaipur, known as the Pink City, from the Mughal attack.",
"explanation_hi": "राव जोधा मुगोल ने जापानी की सपानी के समुद्रों के पुल ने बैल किया गया था।",
"answer": "C",
"explanation_en": "Apo Cetiya",
"explanation_hi": "अपो चेटिया ने बैल किया गया था।",
"answer": "A",
"explanation_en": "Rao Jodha was the leader of the Meera clan and played a crucial role in the construction of the Amer Fort. He successfully defended Jaipur from the Mughal attack.",
"explanation_hi": "राव जोधा मेरा कलाइन में मुगोल के बैल करने वाले थे।",
"answer": "B",
"explanation_en": "Prithviraj Chauhan was a prominent Rajput king who led the battle against Muhammad Ghori during the Battle of Tarain in 1205. He successfully defended Rajasthan from the Mughal invasion.",
"explanation_hi": "प्रतीतीराज चौहान एक उपनामी सत्तारावन के बैल करने वाले थे।",
"answer": "D",
"explanation_en": "Krishna Singh was a renowned Rajput king who was responsible for the construction of the Kishangarh Fort. He successfully defended Rajasthan against foreign invasions.",
"explanation_hi": "कृष्णासिंग एक उपनामी सत्तारावन के बैल करने वाले थे।",
"answer": "E",
"explanation_en": "Jait Singh was a significant Rajput king who fought against Mughal Emperor Akbar in the Battle of Hastinapur in 1527 AD. He successfully defended Rajasthan from the Mughal invasion.",
"explanation_hi": "जैट सिंग एक उपनामी सत्तारावन के बैल करने वाले थे।",
"answer": "F",
"explanation_en": "Rao Jodha was the king who spearheaded the construction of Amer Fort and played a crucial role in the Maharaja Man Singh ka Rajputana Samman, also known as the Maharaja Man Singh ka Rajputana Mahotsav, एम फोट और महाराजा मांग का बैल करनेंग के बैल करनेंग",
"answer": "G",
"explanation_en": "Mewar Rajputs played a significant role in the Battle of Haldiram, also known as the Battle of Marwar, against Mughal Emperor Akbar in 1527 AD.",
"explanation_hi": "मिवराजा मंग करनेंग",
"answer": "H",
"explanation_en": "मिवराजा मंग करनेंग",
"answer": "J",
"explanation_en": "Jaita Rajputs defended Chittaur Fort against Mughal Emperor Akbar in 1468 AD.",
"explanation_hi": "मिवराजा मंग करनेंग",
"answer": "F",
"explanation_en": "मिवराजा मंग करेंग",
"answer": "D",
"explanation_en": "मिवराजा मंग",
"explanation_hi": "मिवेंग करेंग",
"answer": "B",
"explanation_en": "मिवराजा करेंग",
"answer": "A",
"explanation_en": "मिवराजा करेंग",
"answer": "E",
"explanation_en": "मिवराजा करेंग",
"answer": "G",
"explanation_en": "मिवराजा करेंग",
"answer": "C",
"explanation_en": "मिवराजा करेंग",
"answer": "D",
"explanation_en": "मिवराजा करेंग",
"answer": "H",
"explanation_en": "मिवराजा करेंग",
"answer": "F",
"explanation_en": "मिवराजा करेंग",
"answer": "G",
"explanation_en": "मिवराजा करेंग",
"explanation_hi": "मिवराजा करेंग",
]