[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Historical Kings",
"question_en": "Which king of Rajasthan founded the city of Jaipur?",
"question_hi": "राजस्थान के राजधानी के लेखक कौन उसके विभागीय समर्थन है ?",
"A_en": "Amber Rajput",
"A_hi": "अमेर",
"B_en": "Harshavardhan",
"B_hi": "हर्षवर्धन",
"C_en": "Rao Jodha",
"C_hi": "रॉय जोधा",
"D_en": "Kumbha",
"D_hi": "कुम्भा",
"answer": "C",
"explanation_en": "Rao Jodha is known as the founder of Jaipur, also known as Pink City. He built the city during the rule of Raja Mansingh I in 1727 CE.",
"explanation_hi": "रॉय जोधा जयपुर के निर्माण करने वाला है। वहाँ 1727 का मंगलवाल (पंघाल) के अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल के अधिकार मैंगलवाल का पंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिविद्वांदी का अधिकार मैंगलवाल की गतिवांदी का अधिकार मैंगलवाल की गतिवांदी का अधिकार मैंगलवाल की गतिवांदी का अधिकार मैंगलवाल की गतिवांदी का अधिकार मैंगलवाल की गतिवांदी अधिकार मैंगलवाल की गतिवांदी का अधिकार मैंगलवाल की गतिकार मैंगलवाल का अधिकार मैंगलवाल की गतिवाल का अधिकार मैंगलवाल का अधिकार मैंगलवाल का अधिकार मैंगलवाल का अधिकार मैंगल का अधिका मैंगलवाल का अधिकार मैंगलवाल का अधिकार मैंगलवाल का अधिकार मैंगलवाल का अधिकार मैंगलवाल का अधिकार मैंगलवाल का अधिकार मैंगलवाल का अधिकार मैंगलवाल का अधिकार मैंगलवाल का अधिकार मैंगलवाल",
]
"answer": "मैंगलवाल का अधिकार मैंगलवाल",
"explanation_en": "Rao Jaisa Singh was the founder of Jaipur. Jaipur is named after him. He was a prominent Rajput king who established the city during the reign of Maharawal Rao Jaisa Singh.",
"explanation_hi": "राजयंगलव