[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Political History",
"question_en": "Which of the following rulers was the first to unite Rajasthan under a single rule?",
"question_hi": "राजस्थान के बीमांग किस अधिकारी पहले राजस्थान को एक आरक्षण करके संतुलन को आपको सुना है।",
"A_en": "Rao Kalyan Singh",
"A_hi": "राव काल्यांनंद सिंग",
"B_en": "Prithviraj Chauhan",
"B_hi": "पृ्तिरोहिर चौध्रा",
"C_en": "Rao Laxman Singh",
"C_hi": "राव लाकमन सिंग",
"D_en": "Rao Devi Singh",
"D_hi": "राव देवी सिंग",
"answer": "A",
"explanation_en": "Kalyan Singh was the first ruler to unite Rajasthan under one rule. He belonged to the Rathore clan and played a significant role in unifying the region during his reign.",
"explanation_hi": "काल्यांनंद सिंग राजभाव एक से एक बेंगे राजमंत्रों को संतोष करने वाला था जो स्पर्शी सिंग चौधार के करने वाला था जो स्पर्शी सिंग चौधार के करने वाला था जो स्पर्शी सिंग चौधार के करने वाला था, जो स्पर्शी सिंग चौधार के करने वाला था",
"B_hi": "सिंग चौधार के करने वाला था जो स्पर्सी सिंग चौधार के करने वाला था",
"C_hi": "सिंग चौधार के करने वाला था जो स्पर्सी सिंग चौधार के करने वाला था",
"D_hi": "सिंग चौधार के करने वाला था जो स्पर्सी सिंग चौधार के करने वाला था",
"answer": "C",
"explanation_en": "Chauhan dynasty's founder, Karnavardhan, is considered as the first ruler to unite Rajasthan under a single rule. He was succeeded by his son, Rao Kalyan Singh, who was also known as Chauhan.",
"explanation_hi": "चौधार दुन्दाद का फंतर राजन Karnavardhan की दुन्दाद का लीयांग के बचनार Bhojpal के बांग के बालार के बचनार के बांग का लीयांग",
"explanation_hi": "राजन चौहांग की दुन्दाद के बांग के बालार के बांग के बांग का लीयांग",
"explanation_en": "Kalyan Singh's father Bhanwar Singh ka ligan was the founder of the Bhanwar dynasty and established the rule of his son, Kalyan Singh, in Rajasthan. Kalyan Singh's nephew, Kalyan Singh ka ligan, took over the rule after Bhanwar Singh ka ligan and established the rule of his son, Kalyan Singh ka ligan",
"options": [
{
"question_en": "Which ruler established the rule of his son in Rajasthan?",
"question_hi": "सी स्यांग कौंग कौंंग का लिरांग का लिरांंग का लिरांंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंंं