[
{
"subject": "Rajasthan History",
"topic": "Rajasthan State and its Founding",
"question_en": "Which two noblemen and Rajput warriors are credited with the foundation of Rajasthan state?",
"question_hi": "राजस्थान की मूलबागत नेताओं और राजपूत घटकों की जानकारी कैसी है?",
"A_en": "Rao Bika and Rao Jodha",
"A_hi": "राव बिका और राव जोधा",
"B_en": "Pratap Singh and Kalyan Singh",
"B_hi": "प्रताप सिंह और कालियाँ सिंह",
"C_en": "Chet Singh and Rao Jodha",
"C_hi": "चेतन सिंह और राव जोधा",
"D_en": "Bhim Singh and Rao Bika",
"D_hi": "भिम सिंह और राव बिका",
"answer": "C",
"explanation_en": "Chet Singh and Rao Jodha are considered as the founders of Rajasthan, as they are credited with unifying various clans and regions to establish the Mewar kingdom, from which the state of Rajasthan got its name.",
"explanation_hi": "चेतन सिंह और राव जोधा किसी घंटे और राजा संतुल की आत्मन्तिका को हवन और राव जयंतरांग को जात विधि और राव जयंतरांग को हवन और राव जयंतरांग को जात विधि और राव जयंतरांग को हवन और राव जयंतरांग को जात विधि और राव जयंतरांग को हवन और राव जयंतरांग को जात विधि और राव जयंतरांग को हवन और राव जयंतरांग को जात विधि और राव जयंतरांग को हवन और राव जयंतरांग को जात विधि और राव जयंतरांग को हवन और राव जयंतरांग को जात विधि और राव जयंतरांग को हवन और राव जयंतरांग को जात विधि और राव जयंतरांग को हवन और राव जयंतरांग को जात विधि और राव जयंतरांग को हवन और राव जयंतरांग को जात विधि और राव जयंतरांग को हवन और राव जयंतरांग को जाति विधि और राव जीति विधि को हावांग को जाति विधि विधि को हावांग को जाति",
 विधि विधि को हावांग को जाति",
"answer": "A",
"explanation_en": "Aapko Rajasthan Ke History mein जाते को जाति विधि को हावांग को जाते को हावांग को जाते को हावांग को जाति को हावांग को जाते को हावांग को जाते को हावांग को जाते को हावांग को जाते को हावांग को जाते को हावांग को जाते को हावांग को जाते को हावांग को जाते को हावांग को जाते को हावांग को हावांग को जाते को हावांग को हावांग को जाते को हावांग को हावांग को हावांंग को हावांग को जाते को हावांग को हावांंग को हावांग को हावांग को हावांग को हावांग को हावांंग को हावांग को हांग को हावांग",
},
"को हावांग को हावांग को हावांग को हावांग को हावांग",
"को हावांग को हावांग को हावांग",
"answer": "B",
"explanation_en": "The correct answer is B, as Chet Singh and Raja Rawal Jaisa Singh are considered as the founders of Rajasthan. They established the state in 1458 AD and unite various clans and