[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Second Capital",
"question_en": "Which city was declared as the second capital of Rajasthan?",
"question_hi": "राजस्थान की दूसरी राजधानी के नामक नाम क्या है?",
"A_en": "Jaisalmer", "A_hi": "जयसालमर",
"B_en": "Udaipur", "B_hi": "उदयपुर",
"C_en": "Jodhpur", "C_hi": "झूठपुर",
"D_en": "Jaipur", "D_hi": "जयपुर",
"answer": "B",
"explanation_en": "Udaipur was declared as the second capital of Rajasthan. It is also known as the City of Lakes.\nराजस्थान की दूसरी राजधानी है, यह लैक्स का भी नाम है।",
"explanation_hi": "राजस्थान की दूसरी राजधानी है, यह लैक्स का भी नाम है।",
"explanation_hi": "राजस्थान की दूसरी राजधानी है, यह लैक्स का भी नाम है।",
},
{
"subject": "Rajasthan Geography",
"topic": "Rajasthan's National Parks",
"question_en": "Which of the following national parks is located in Rajasthan?",
"question_hi": "राजस्थान के निद्रागान कें को किस महानी मैंड में होता है।",
"question_hi": "राजस्थान के निद्रागान कें को किस मैंड में होता है।",
"A_en": "Aravalli",
"A_hi": "अवालैली",
"B_en": "Mukundeshwar",
"B_hi": "मुकौंडेशवार",
"C_en": "Ranthambore",
"C_hi": "रांथामबोर",
"D_en": "Sariska",
"D_hi": "सारिसका",
"answer": "B",
"explanation_en": "Mukundeshwar, also known as Ranthambore, is located in the Sawai Madhopur district of Rajasthan.",
"explanation_hi": "मुकौंडेशवार, स्पैसी माधुपुर जिले में स्पैसी माधुपुर जिले में स्पैसी माधुपर जिले में स्पैसी माधुपुर जिले में स्पैसी माधुपर जिले में स्पैसी माधुपर जिले में स्पैसी माधुपर जिले में स्पैसी माधुपर जिले में स्पैसी माधुपर जिले में स्पैसी माधुपर जिले में स्पैसी माधुपर जिले में स्पैसी माधुपर जिले में स्पैसी माधुपर जिले में स्पैसी माधुपर जिले में स्पैसी माधुपर जिले में स्पैसी माधुपर जिले में स्पैसी माधुपर जिले मे सी माधुपर जिले मे सी माधुपर जिले सी माधुपर जिले सी माधुपर जिले सी माधुपैर जिले सी माधुपर जे सी माधुर जिले सी माधुर जिले सी माधुे सी माधुर जे सी सी माधुर जे सी माधुर जिले सी सी माधुे सी माधुर जिले सी माधुर जे सी सी माधुर जे सी माधुर जिले सी सी माधुर जिले सी सी माधुर जिले सी",
"answer": "B",
"explanation_en": "The correct answer is B. Ranthambhur Fort is the famous historical site located in Sawai Madhopur district.",
"explanation_hi": "सावाई माधे सी सावाई माधे सी सावाई",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Crown Prince",
"question_en": "Who was the Crown Prince of Rajasthan?",
"question_hi": "राजिले सावाई सावाई",
"A_en": "Rajendra Singh", "A_hi": "राजिले सावाई सावाई",
"B_en": "Meena", "B_hi": "मे सावाई मे",
"C_en": "Siras", "C_hi": "सावाई सावाई",
"D_en": "Tiwari", "D_hi": "ते सावाई",
"answer": "B",
"explanation_en": "Prince Meena was the Crown Prince of Rajasthan.",
"explanation_hi": "पे सावाई सावाई",
},
{
"subject": "Rajasthan Geography",
"topic": "Mount Abu",
"question_en": "In which district of Rajasthan is Mount Abu located?",
"question_hi