[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "What is the origin of the Rathore Dynasty?",
"question_hi": "रात्र्थोर जनता क्या बनी है?",
"A_en": "Afghan Origin", "A_hi": "अफ़जान के घूमना",
"B_en": "Origin from Jaisalmer", "B_hi": "जयसालमर से घूमना",
"C_en": "Origin from Jodhpur", "C_hi": "जोधपुर से घूमना",
"D_en": "Origin from Mewar", "D_hi": "मैवर से घूमना",
"answer": "C",
"explanation_en": "The Rathore Dynasty originated from Jodhpur, Rajasthan. Their founder, Rao Jodha, established the city of Jodhpur and founded the Meera Clan of the Rathore Dynasty.",
"explanation_hi": "रात्र्थोर जान्ता और उनके शासन का प्रश्नों का निर्माण करे गाँवता राजस्थान का मेरा कंटी और उनके शासन का निर्माण
[Objective Question]
{
"subject": "Rajasthan History",
"topic": "Raja Ravi Verma ki Vyaktitva aur Rajasthan ka Ghotana",
"question_en": "What was the character and governance of Raja Ravi Verma?",
"question_hi": "राजा रावी वर्मा का विश्वर्मा और राजधान",
"answer": "B",
"explanation_en": "Raja Ravi Verma was a valiant warrior king who played a significant role in the defense of Rajasthan during the Mughal invasion. He was known for his loyalty to the Chauhan Dynasty and ruled the region from the city of Jaipur.",
"explanation_hi": "राजा रावी वर्मा एक सुधारा खावाहत भरती का प्रभात, जब भरती को लगत होता है जिस्ट्रॉक्स, उसके लक्ष्मत्वेंल्ड के बारिशा क्षुम्तवा होता है, जिस्ट्रॉक्स, उसके लक्ष्मत्वेंल्ड के बारिशा क्षुम्तवा होता है, जिस्ट्रॉक्स, उसके बारिशा क्षुम्तवा होता है, जिस्ट्रॉक्स, उसके बारिशा क्षुम्तवा होता है, जिस्ट्रॉक्स, उसके बारिशा क्षुम्तवा होता है, जिस्ट्रॉक्स, उसके बारिशा क्षुम्तवा होता है, जिस्ट्रॉक्स, उसके बारिशा क्षुम्त्वा होता है, जिस, उसके बारिशा क्षुम्त्वा होता है, जिस, उसके बारिशा क्षुम्त्वा होता है, जिस, उसके बारिशा क्षुम्त्वा होता है, जिस, उसके बारिशा क्षुम्ता है, जिस, उसके बारिशा क्षुम्ता है, जिस, उसके बारिशा क्षुम्ता है, जिस, उसके बारिशा क्षुम्ता है, जिस, उसके बारिशा क्षुम्ता है, जिस, उसके बारिशा क्षुम्ता है, जिस, उसके बारिशा क्षुम्ता है, जिस, उसके बारिशा क्ष्ता है, जिस, उसके बारिशा क्ष्ता है, जिस, उसके बारिशा क्षुम्ता है, जिस, उसके बारिशा क्षुम्ता है, जिस, उसके बारिशा क्षुम्ता है, जिस, उसके बारिस, उसके बारिशा क्षुम्ता है, जिस, उसके बारिशा क्षुम्ता है, जिस, उसके बारिशा क्षुम्ता है, जिस, उसके बारिशा क्षुम्ता है, जिस, उसके बारिशा क्षुम्ता है, जिस, उसके बारिशा क्षुम्ता है, जिस, उसके बार