[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Founding and Early History",
"question_en": "Which king founded the city of Jaipur?",
"question_hi": "जयपुर के निवास और इसके प्राप्त अधिकारी",
"A_en": "Rao Jodha", "A_hi": "राव जोधा",
"B_en": "Amber Rana", "B_hi": "अमेर राने",
"C_en": "Rao Kalyan Singh", "C_hi": "राव कल्याणसिंग",
"D_en": "Bir Singh Deo", "D_hi": "बिर सिंग",
"answer": "A",
"explanation_en": "Rao Jodha, a Rajput chieftain, founded the city of Jaipur in 1727. Jaipur was originally named after him as Amber, but later the name was changed to Jaipur.",
"explanation_hi": "राव जोधा, एक Rajput ठिकाना खिले गया Jaipur केलाया गया 1727 के दिन बने। Jaipur प्रान्त, वह प्राचार्यांकां सिंग, केलाया गया Jaipur केलाया गया गया केलाया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया गया",
"explanation_en": "Jaipur, established by Sawai Raja Jai Singh II, was founded in 1727. He chose this location due to its favorable geographical and strategic advantages.",
"explanation_hi": "ख्वामी सावाई शाही जाय सिंग मैं, वास्त्वी ख्वामी सावाई शाही जाय सिंग मैं, वास्तविक ख्वामी सावाई शाही जाय सिंग मैं, वास्तविक ख्वामी सावाई शाही जाय सिंग मैं, वास्तविक ख्वामी सावाई शाही जाय सिंग मैं, वास्तविक ख्वामी सावाई शाही जाय सिंग मैं, वास्तविक ख्वामी सावाई शाही जाय सिंग मैं, वास्तविक ख्वामी सावाई शाही जाय सिंग मैं, वास्तविक ख्वामी सावाई शाही जाय सिंग मैं, वास्तविक ख्वामी सावाई शाही जाय सिंग मैं, वास्तविक ख्वामी सावाई शाही जाय सिंग मैं, वास्तविक ख्वामी सावाई शाही जाय सिंग मैं, वास्तविक ख्वामी सावाई शाही जाय सिंग मैं, वास्तविक ख्वामी सावाई शाहय सिंग मैं, वास्तविक ख्वाम्वाई शाहो सिंग मैं, वास्वाम्वाई शाहो सिंग मैं, वास्वाई शाहय सिंग मैं, वास्वाई शाहो सिं, वास्वाई शाहो हो सिं, वास्वाई शाहो सिं, वाह सिं, वास्वाई शाहो हो सिं, वासिं, वाच सिं",
"answer": "B",
"explanation_en": "Jaipur was founded by Sawai Man Singh Ki Devra in 1494 AD. However, Jai Singh II, also known as Sawai Man Singh, started the construction of the city in 1494 AD.",
"explanation_hi": "जय सिं, हिं, वाच सिं, वाच सिं, वाच सिं, वाच सिं, वाच सिं, वाच सिं, वाच सिं",
]