[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jodhpur?",
"question_hi": "जोधपुर में प्रमोट कौन सा प्रसिद्ध है।",
"A_en": "Mehrangarh Fort", "A_hi": "मेरनगर",
"B_en": "Kheerwa Fort", "B_hi": "खीरवा तटवाल",
"C_en": "Lalgarh Fort", "C_hi": "लालघर तटवाल",
"D_en": "Umaid Bhawan Palace", "D_hi": "उमेद बहान",
"answer": "B",
"explanation_en": "Kheerwa Fort is a famous fort located in Jodhpur.",
"explanation_hi": "खीरवा तटवाल जोड़ने वाला मैं जोड़ने वाला जोड़ने वाला मैं जोड़ने वाला जोड़ने वाला मैं जोड़ने वाला जोड़ने वाला मैं जोड़ने वाला जोड़ने वाला मैं जोड़ने वाला जोड़ने वाला मैं जोड़ने वाला जोड़ने वाला मैं जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोडोड़ने वाला जोडोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला",
"answer": "Jodhpur",
"explanation_en": "Jodhpur is a historical city in Rajasthan.",
"explanation_hi": "जोड़ने वाला जोड़ने वाला जोड़ने वाला जोड़ने वाला",
"explanation_hi": "Jodhpur is a historical city in Rajasthan.",
},
{
"subject": "Rajasthan History",
"topic": "Nayagarh Fort",
"question_en": "What was the name of the famous fort located in Jaisam"
"question_hi": "जोड़ने वाला जोड़ने वाला",
"A_en": "Nayagarh Fort", "A_hi": "जोड़ने वाला जोड