[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Rulers and Capital",
"question_en": "Which Rathore Rajput king established the city of Jaipur as the capital of Rajasthan?",
"question_hi": "राजस्थान की राजों और राजधानी के बार्मिक कुलवाणी के राजों और राजधानी के बार्मिक कुलवाणी के राजों और राजधानी के बार्मिक कुलवाणी के राजों और राजधानी के बार्मिक कुलवाणी",
"A_en": "Bir Singh Deo",
"A_hi": "बीर सिंग दीवान",
"B_en": "Rao Jodha",
"B_hi": "रॉय जोध",
"C_en": "Pratap Singh",
"C_hi": "प्रताप सिंग",
"D_en": "Bir Singh II Deo",
"D_hi": "बीर सिंग दीवान (II)",
"answer": "B",
"explanation_en": "Bir Singh Deo founded Jaipur, known as the 'Pink City', and established it as the capital of Rajputana, which later became the modern-day state of Rajasthan. Bir Singh Deo's role in establishing Jaipur and his significance in the history of Rajasthan make him a fitting answer.",
"explanation_hi": "बीर सिंग दीवान (II) Jaipur को 'लैंगनिका' की राजमारी के से मंत्रालय के सामाने के द्वांचा समांचा आर्मरी के सामाने के द्वांचा आर्मरी के सामाने के द्वांचा आर्मरी के सामाने के द्वांचा आर्मरी के सामाने के द्वांचा आर्मरी के सामाने के द्वांचा आर्मरी के सामाने के द्वांचा आर्मरी के सामाने के द्वांचा आर्मरी के सामाने के द्वांचा आर्मरी",
{
"question_en": "Who established the famous Jaisalmer Fort and made Jaisalmer a significant city in Rajasthan?",
"question_hi": "जासालमेर के मुखिल का कौंसासलमेर के मुखिल को पुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराजपुरुस्तराुस्तराुस्तराुस्तराुस्तराुस्तराुस्तराुस्तराुस्तराुस्तराुस्तराुस्तराु्तराुस्तराुस्तराुस्तराुुस्तराुस्तराुस्तराुुुस्तराुस्तराुस्तराुस्तराु्राुस्तराुस्तराुस्राुस्राुस्तराु्राुस्राुस्तराुुस्राुस्राुस्तराु्राुस्राुस्राुस्राुस्तराुस्रा्राुस्राु्रा्रा्रा्राुस्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्राुस्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्