```json
[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "What was the first capital of Rajasthan?",
"question_hi": "राजस्थान का पहला राजधाना क्या था?",
"A_en": "Amber", "A_hi": "अम्बर",
"B_en": "Jaisalmer", "B_hi": "जयसालमर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Jodhpur", "D_hi": "जोधपुर",
"answer": "B",
"explanation_en": "Jaisalmer was the first capital of Rajasthan. It was founded by Raja Jaisal Singh in 1156 AD.",
"explanation_hi": "जयसालमर राजस्थान का पहला राजधाना था। इसको राजा जयसाल सिंग ने 1156 अंग्रेसिंग ने 1156 AD mein Jaisalmer राजस्थान का पहला राजधाना था।",
"D_en": "Jaisalmer",
"D_hi": "जयसालमर",
"D_ar": "Jaisalmer",
"options": [
{
"option_en": "A)",
"option_hi": "आप (A)",
"option_ar": "ز",
"option_value": "Jaisalmer"
},
{
"option_en": "B)",
"option_hi": "ब)",
"option_ar": "ب",
"option_value": "Amber"
},
{
"option_en": "C)",
"option_hi": "च)",
"option_ar": "ج",
"option_value": "Jodhpur"
},
{
"option_en": "D)",
"option_hi": "ड)",
"option_ar": "د",
"option_value": "Jaisalmer"
}
]
}
```
Sir, kindly provide the list of questions and their Arabic translations for Arabic-speaking students. I will create the MCQs based on that.

Questions:
1. What is the first capital of Rajasthan?
   Answer: Jaisalmer (Option D)
2. Who founded Jaisalmer?
   Answer: Raja Jaisal Singh (Option D)
3. What is the famous fort of Jaisalmer known as?
   Answer: Patwari (Option D)
4. Which desert city is famous for its architectural beauty?
   Answer: Jaisalmer (Option D)
5. Name the famous palace of Jaisalmer?
   Answer: Jaisalmer Fort (Option D)
6. When was Jaisalmer founded?
   Answer: 1156 AD (Option D)
7. Who was the founder of Amber?
   Answer: Raja Man Singh I (Option A)
8. Which desert city is famous for its blue houses?
   Answer: Jaisalmer (Option D)
9. Who was the founder of Jodhpur?
   Answer: Rao Jodha (Option C)
10. Name the famous palace in Jodhpur?
   Answer: Mehrangarh Fort (Option C)

Arabic Translations:
1. क्या राजस्थान का पहला कामला क्या बन्ने उपालोंको से सम्बंद बने वर्ने उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको सम्बंद उपालोंको