[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Chieftaincies and Establishment of Jaipur",
"question_en": "Which city was the capital of Mewar before Jaipur was made the capital of Rajasthan?",
"question_hi": "मेवार के बाद जैगपुर को राजस्थान के राजधानी बनाया गया, कौन सी शहर मेवार के बाद जैगपुर की राजधानी।",
"A_en": "Udaipur",
"A_hi": "उदयपुर",
"B_en": "Pushkar",
"B_hi": "पुष्कर",
"C_en": "Amber",
"C_hi": "अंबे",
"D_en": "Kota",
"D_hi": "कोटा",
"answer": "C",
"explanation_en": "Amber was the capital of Mewar after Udaipur. Amber, also known as Amer, is a city located near Jaipur. Udaipur was the capital before Jaipur became the capital of Rajasthan.",
"explanation_hi": "उदयपुर मेवार के बाद जैगपुर राजस्थान के विभिज्ञान कोश प्राधीन के विभिज्ञान कोश प्राधीन के विभिज्ञान कोश प्राधिकार, कोश प्राधीन के विभिज्ञान कोश प्राधीन के विभिज्ञान कोश प्राधीन के विभिज्ञान कोश प्राधिकार, कोश प्राधीन के विभिज्ञान कोश प्राधिकार, कोश प्राधीन के विभिज्ञान कोश प्राधिकार, कोश प्राधीन के विभिज्ञान कोश प्राधिकार, कोश प्राधिकार, कोश प्राधिकार के विभिज्ञान कोश प्राधिकार, कोश प्राधिकार, कोश प्राधिकार के विभिज्ञान",

"question_en": "Who was the founder of Jaipur?",
"question_hi": "जैगपुर के निर्मान कौने करेंगें?",
"option_A": "Prince Sampati",
"option_B": "Prince Mansingh I",
"option_C": "Prince Jai Singh II",
"option_D": "Prince Sawai Jai Singh",
"option_E": "Raja Ram Singh",
"answer": "C",
"explanation_en": "Jai Singh II was the founder of Jaipur. He founded Jaipur in 1727 CE and named it after his father, Sawai Jayaji Rao.\n(Source: History of Jaipur: https://jaipur.in/jaipur-history/)",
"explanation_hi": "जैगपुर के निर्मान के विभिज्ञान कौने करेंगें?\nजैगपुर के निर्मान के विभिज्ञान कौने करेंगें? जैगपुर के निर्मान के विभिज्ञान कौने करेंगेंग्बगांगेंगेंगेंगबैगेंगेंगेंगेंगांगेंगेंगेंगेंगांगेंगेंगेंगांगेंगेंगेंगेंगेंगांगेंगेंगेंगेंगांगेंगेंगबेंगेंगेंगांगेंगेंगेंगांगेंगेंगेंगंगांगेंगेंगेंगांगेंगेंगेंगांगेंगेंगेंगांगेंगेंगेंगेंगेंगांगेंगेंगेंगेंगेंगांगेंगेंगेंगांगेंगेंगांगेंगेंगेंगेंगांगांगेंगेंगेंगांगेंगेंगांगेंगांगेंगेंगांगांगेंगेंगांगांगेंगांगेंगांगेंगेंगांगांगेंगांगांगेंगांगेंगांगेंगेंगांगेंगेंगांगेंगेंगांगेंगेंगांगांगांगेंगेंगांगांगेंगेंगांगेंगांगेंगेंगांगेंगांगांगेंगेंगेंगांगांगेंगेंगांगांगेंगेंगांगांगेंगेंगांगेंगें