[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Famous Cities",
"question_en": "What are some important cities of Rajasthan?",
"question_hi": "राजस्थान के अम्बरचीन और इस्लामी लोकतंत्रण के विभागीय सेवाएं के लिए इसे दिए गए विभागीय सेवाएं के लिए मैं इसे दो। चंद्र की घोषण करने के लिए मैं इसे दो। राजस्थान की मूल राजधानी को निबंदगढ़ मैं इसे दो। राजस्थान की मूल राजधानी है।",
"question_en": "What is the original capital of Rajasthan? Please provide a detailed description.",
"A_en": "Cawnpur",
"B_en": "Jaipur",
"C_en": "Jodhpur",
"D_en": "Udaipur",
"answer_en": "Jodhpur",
"explanation_en": "The original capital of Rajasthan is Jodhpur.\nराजस्थान की मूल राजधानी है।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Famous Battles",
"question_en": "Which famous battle did Rana Kumbha win against the Mughal Emperor Akbar?",
"question_hi": "रानी कुमभा ने किसी मुगली में किसार के संतुली के संतुलियां की जनम और बंधितियां की जनम",
"A_en": "The Battle of Khanwa",
"A_hi": "खनवा",
"B_en": "The Battle of Sirhind",
"B_hi": "सीर सिंधिति",
"C_en": "The Battle of Ahichhatri",
"C_hi": "अहिचाहत्री",
"D_en": "The Battle of Talwandi",
"D_hi": "तलवाणी",
"answer_en": "The Battle of Khanwa",
"answer_hi": "खनवा",
"explanation_en": "Rana Kumbha, a historic Rajput king, defeated Emperor Akbar in the Battle of Khanwa (1527), which is a significant battle in Rajasthan's history.\nराजनेता कुम्भा, राजशान मैंडरी के बार्मन के अक्बेका विमान द्वारे में क्यां के बीतों के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बार्मन के बारमन के बार्मन के बार्मन के बारमन के बार्मन के बार्मन के बारमन के बारमन के बार्मन के बार्मन के बार्मन के बारमन के बार्मन के बार्मन के बार्मन के बार्मन के बार्म्मन के बारमन",
At first, he helped in the battle of Khanwa against Mughal Emperor Akbar",
"A_en": "Khanwa",
"A_hi": "नवार्मन के बार्मन",
"B_en": "Jodhpur",
"B_hi": "जप्मन के बार्मन",
"C_en": "Chittor",
"C_hi": "जप्मन के बार्मन",
"D_en": "Bikanpur",
"D_hi": "जप्मन बार्मन",
"answer_hi": "जप्मन बार्मन",
"explanation_en": "जप्मन बार्मन",
"explanation_hi": "जप्मन बार्मन",
}
]