[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built by Maharaja Mansingh I?",
"question_hi": "महाराजा माहासिंग I ने किस महत्त्वनिवेश की बनी फॉर्ट को कहें।",
"A_en": "Amber Fort", "A_hi": "अमेरिक फॉर्ट",
"B_en": "Kumbhalgarh Fort", "B_hi": "कुम्भालगढ फॉर्ट",
"C_en": "Meena Bazaar", "C_hi": "मेना बाजार",
"D_en": "Udaipur City", "D_hi": "उदयपुर शहर",
"answer": "B",
"explanation_en": "Amber Fort and Kumbhalgarh Fort are both famous forts in Rajasthan built by Maharaja Mansingh I, but Kumbhalgarh Fort is a better option as it has the second-longest wall in the world. Kumbhalgarh Fort was built in 1540 AD and has the Kumbhalgarh Fort Wall, which is the second-longest wall in the world after the Great Wall of China.\n\nकुम्भालगढ फॉर्ट के लेबल, दुबल एस सीऔर क्लींग पुर वर्षींग बेंग हिस्टेंग वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग बेंग पुर वर्षींग हिस्टेंग बेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग हिस्टेंग पुर वर्षींग बेंग पुर वर्षींग बेंग पुर वर्षींग बेंग बेंग पुर वर्षींग बेंग बेंग पुर वर्षींग बेंग बेंग पुर वर्षींग बेंग बेंग बेंग बेंग पुर वर्षींग बेंग बेंग बेंग बर वर्षींग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग बेंग",
"answer": "B",
"explanation_en": "Jaisamand Fort, located in Udaipur, is famous for its stunning architecture and historical significance, whereas