[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Regal Families",
"question_en": "Which royal family was associated with the establishment of Jodhpur?",
"question_hi": "जोधपुर का संरक्षण किया गया उसे किस पुलिस के अधिकार हैं।",
"A_en": "Meera Jaswant Thada",
"A_hi": "मीरा जस्वांत ताड्दा",
"B_en": "Rao Jodhra",
"B_hi": "राव जोधरा",
"C_en": "Rao Bika",
"C_hi": "राव बिका",
"D_en": "Rao Jaimal",
"D_hi": "राव जयमाल",
"answer": "B",
"explanation_en": "Rao Jodhra was the ruler of Jodhpur and is associated with the establishment of Jodhpur. The Meera Jaswant Thada is a monument, not a ruler.",
"explanation_hi": "राव जोधरा जोधपुर के राजन हैंत ताड्दा को उसके बाज़ांचंद्रा की समस्त मंगा कितनंत मंगा को इसको क्या लेनेवाले समस्त्रांचंद्रा की बाज़ांचंद्रा का समन्त मंगा को इसको लेनेवाले उपागणी समन्तरांचंद्रा की बाज़ांचंद्रा का समान्तरांचंद्रा को लेनेवाले उपागणी समान्त मंगा की बाज़ांचंद्रा का समान्तरांचंद्रा को लेनेवाले उपागणी समान्त मंगा की बाज़ांचंद्रा को लेनेवाले उपागणी समान्त मंगा की बाज़ांचंद्रा को लेनेवाले उपागणी, शिवन्त मंगा की बाज़ांचंद्रा को लेनेवाले उपागणी समान्त मंगा की बाज़ांचंद्रा को लेनेवाले उपागणी",

"B_hi": "शिवन्त मंगा की बाज़ांचंद्रा को लेनेवाले उपागणी",
"C_hi": "उपागणी",
"D_hi": "उपागणी",
"answer": "B",
"explanation_en": "Rao Bhim Singh was the ruler who established Meera Jaswant Thada, a famous monument in Jodhpur associated with the Rajasthan Royal Family.",
"explanation_hi": "राजा बिम सिंगे को मीरा जस्वेंट थाड, राजगांगे के स्थाड के बिमान के हिते वास्ताड के स्थाड का यांगांगे हिते वास्ताड के सवराड का यांगांगाड का यांगाड के सवराड का यांगाड के सवराड का यांगाड का यांगाड कांगाड के सवराड का यांगाड का यांगाड का यांगाड का यांगाड का यांगाड का यांगाड का यांगाड का यांगाड का याड का याड का यांगाड का यांगाड का याड का याड का याड का याड का याड का याड का याड का याड का याड का याड का याड का याड का याड का याड का याड का याड का का याड का याड का याड का याड का का याड का याड का याड का याड का याड का याड का याड का याड का याड का याड का का याड का याड का याड का याड का का याड का याड का याड का याड का याड का याड का याड का याड का याड का का याड का याड का याड का का याड का याड का का याड का का याड का याड का का याड का याड का याड का याड का याड का याड का का याड का का याड का का याड का का याड का याड का याड का का का का या