[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who was the first Rana of Mewar?",
"question_hi": "मेवर की पहली रणा किस मूल्य हुई?",
"A_en": "Udai Singh", "A_hi": "उदाइ सिंग",
"B_en": "Rana Kumbha", "B_hi": "राना कुम्भ",
"C_en": "Pratap Singh", "C_hi": "प्रताप सिंग",
"D_en": "Rana Lakha", "D_hi": "राना लकहा",
"answer": "B",
"explanation_en": "Udai Singh II was the founder of Udaipur and the first Rana of Mewar. He succeeded his father Rana Kumbha in 1531 AD and established the city of Udaipur as his capital.",
"explanation_hi": "उदाइ सिंग II उदयपुर और मेवर की पहली राना थी। उन्निर पति के पति राना कुम्ब के बाज़ा होंगे चौरान सिंग II के लिए उदयपुर और मेवर की पहली राना थी। उन्निर पुरे चौरान कुम्ब के बाज़ा होंगे उदयपुर और मेवर की पहली राना थी। उन्निर पुरे चौरान कुम्ब के बाज़ा होंगे उदयपुर और मेवर की पहली राना थी। उन्निर पुरे चौरान कुम्ब के बाज़ा होंगे उदयपुर और मेवर की पहली राना थी। उन्निर पुरे चौरान कुम्ब के बाज़ा होंगे उदयपुर और मेवर की पहली राना थी। उन्निर पुरे चौरान कुम्ब के बाज़ा होंगे उदयपुर और मेवर की पहली राना थी। उन्निर पुरे चौरान कुम्ब के बाज़ा होंगे उदयपुर और मेवर की पहली राना थी। उन्निर पुरे चौरान कुम्ब के बाज़ा होंगे उदयपुर और मेवर की पहली राना थी। उन्निर पुरे चौरान कुम्ब के बाज़ा होंगे उदयपुर और मेवर की पहली राना थी। उन्निर पुरे चौरान कुम्ब के बाजा हंगे उदयपुर और मेवर की पहली राना थी",
|
\n उन्निर | पहली",
"answer": "B",
"explanation_en": "Udai Singh II was the first Rana of Mewar. He succeeded Rana Udai Singh II and established Udaipur as his capital.",
"explanation_hi": "उदयपुर मेवर मेवर की राना थी उन्नर | पहली",
}
{
"subject": "Rajasthan History",
"topic": "Mewar and Chittor",
"question_en": "What was the original capital of Mewar?",
"question_hi": "मेवर मेवर मेवर | Chittor",
"A_en": "Chittor",
"A_hi": "मेवर मेवर मेवर | Chittor",
"B_en": "Jaipur",
"B_hi": "जाप्र मेवर | Chittor",
"C_en": "Ranthambh",
"C_hi": "राना केवर मेवर | Chittor",
"D_en": "जपॊर मेवर | Chittor",
"D_hi": "गेवर मेवर | Chittor",
"answer": "B",
"explanation_en": "The capital of Mewar was initially Ranthambh, but later Chittor was made as its capital.",
"explanation_hi": "जपॊर मेवर मेवर | Chittor",
"explanation_en": "The capital of Mewar was Ranthambh, but later Chittor was selected as its capital.",
"explanation_hi": "गेवर मेवर मेवर | Chittor",
} 
]