[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Kings and Kingdoms",
"question_en": "Which king established the city of Udaipur?",
"question_hi": "उदयपुर कौन सा जानवरी ने बनाया था?",
"A_en": "Rana Kumbha",
"A_hi": "राना कुम्भा",
"B_en": "Raja Ravi Varma",
"B_hi": "राजा राववर्मा",
"C_en": "Rao Jodha",
"C_hi": "रावण झोद्ध",
"D_en": "Rao Jaisamand",
"D_hi": "रावण झिसमांड",
"answer": "C",
"explanation_en": "Rao Jodha is the king who established the city of Jodhpur."
},
{
"subject": "Rajasthan History",
"topic": "Royal Families",
"question_en": "Which royal family ruled during the Mughal period?",
"question_hi": "मुगोल परिवार के विभाग में कौन संतोष करते थे।",
"A_en": "Ajmer Pratap Singh",
"A_hi": "अजमेर प्रतपिंग",
"B_en": "Todarmal Sisodia",
"B_hi": "तोदमाल सिसोडिया",
"C_en": "Jait Singh",
"C_hi": "जैत सिंग",
"D_en": "Kachwaha Rajputs",
"D_hi": "कचवाहा राज्यपुत्रों",
"answer": "B",
"explanation_en": "During the Mughal period, Todarmal Sisodiya of the Kachwaha Rajputs ruled in Ajmer."
},
{
"subject": "Rajasthan History",
"topic": "Royal Families",
"question_en": "Which Rana ruled Meena Kingdom?",
"question_hi": "मेना क्षमा क्षुद्रावती राजन कौमांने मेना क्षमा क्षुद्रावती के राजन लौमांने मेना क्षमा क्षुद्रावतीयांने मेना क्षमा केषुद्रावतीयांने मेना क्षमा केषुद्रावतीयांने मेना क्षमा केषुद्रावतीयांने मेना क्षमा केषुद्रावतीयां ने मेना क्षमा केषुद्रावतीयांने निवास केषुद्रावतीयांने निवास केषुद्रावतीयांने निवास केषुद्रावतीयांने निवास केषुद्रावतीयां ने निवास केषुद्रावतीयां ने निवास केषुद्रावतीयां ने निवास केषुद्रावतीयां ने निवास केषुद्रावतीयां ने निवास केषुद्रावतीयां ने निवास केषुद्रावतीयां ने निवास केषुद्रावतीयां ने निवास केषुद्रावतीयां ने निवास केषुद्रावतीयां ने ने निवास केषुद्रावतीयां ने ने ने ने निवास केषुद्रावतीयां ने ने ने ने ने ने ने ने ने ने ने ने निवास केषुद्रावतीयां ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने",
"
}
] ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने ने",
"
"question_en": "Who ruled Rajput Rajasthan during the Chauhara period?",
"question_hi": "चुरका ने ने ने ने ने ने ने ने ने ने ने",
"A_en": "Rao Jaisi",
"A_hi": "रावती ने ने ने ने ने ने ने ने ने ने ने",
"B_en": "Rao Jaisi",
"B_hi": "रावती ने ने ने ने ने ने ने ने ने ने ने",
"C_en": "Rao Jaisi",
"C_hi": "रावती ने ने ने ने ने ने ने ने ने",
"D_en": "Rao Jaisi",
"D_hi": "रावती ने ने ने