[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "What is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी क्या है?",
"A_en": "Bikaner",
"A_hi": "बीकानेर",
"B_en": "Jodhpur",
"B_hi": "जोधपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Jaipur",
"D_hi": "जयपुर",
"answer": "D",
"explanation_en": "Jaipur is the capital of Rajasthan. It was founded by Maharaja Sawai Jai Singh II in 1727 and is also known as the Pink City for its use of pink sandstone in its architecture.",
"explanation_hi": "जयपुर राजस्थान की राजधानी है। महाराज़य सावाई जैवानी सिंग अंकुर दिया करने के लिए पंगींग कर्ना महाराज़य सावाई सिंग अंकुर दिया करने के लिए पंगींग कर्ना महाराज़य सावाई सिंग अंकुर दिया करने के लिए पंगींग कर्ना महाराज़य सावाई सिंग अंकुर दिया करने के लिए पंगींग कर्ना महाराज़य सावाई सिंग अंकुर दिया करने के लिए पंगींग कर्ना महाराज़य सावाई सिंग अंकुर दिया करने के लिए पंगींग कर्ना महाराज़य सावाई सिंग अंकुर दिया करने के लिए पंगींग कर्ना महाराज़य सावाई सिंग अंकुर दिया करने के लिए पंगींग कर्नए।",
},
{
"subject": "Rajasthan",
"topic": "Rajasthan's Capital Before Sawai Jai Singh II",
"question_en": "What was the capital of Rajasthan before Sawai Jai Singh II?",
"question_hi": "सवाई जैज़ीन सी पहले राजस्थान का कौन उपहित था।",
"A_en": "Udaipur",
"A_hi": "उदायपुर",
"B_en": "Jodhpur",
"B_hi": "जोधपुर",
"C_en": "Jaisamand",
"C_hi": "जैसामनद",
"D_en": "Alwar",
"D_hi": "अलौर",
"answer": "B",
"explanation_en": "Before Sawai Jai Singh II, Jodhpur was the capital city of Rajasthan.",
"explanation_hi": "सीवाई जैजीन ने बार राजस्थान के खैने बार राजस्थान के खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैनैैने खैने खैने खैनैने खैने खैने खैने खैने खैनैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैनैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैनैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैने खैन