[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Families",
"question_en": "Which royal family ruled over Udaipur?",
"question_hi": "उदयपुर के रस्ते के संत क्या थे?",
"A_en": "Rana Kumbha",
"A_hi": "राना कुम्भ",
"B_en": "Mewar Dynasty",
"B_hi": "मेवार स्वतंत्रता",
"C_en": "Amber Dynasty",
"C_hi": "अमेर स्वतंत्रता",
"D_en": "Chauhan Dynasty",
"D_hi": "चौहान स्वतंत्रता",
"answer": "B",
"explanation_en": "The ruling royal family of Udaipur was the Mewar Dynasty.",
"explanation_hi": "उदयपुर की राजधानी के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत मेवार स्वतंत्रता के संत राज के संत राज के संत मेवार संत राज के संत राज के संत राज के संत राज के संत राज के संत राज के संते राज के संत राज के संतराज के संते राज के संते राज के संत राज के संते राज के संते राज के संतराज के संते राज के संते राज के संते राज के संते राज के संते राज के संते राज के संते राज के संते राज के राज के राज के संते राज के",
Leader के संते राज के राज के राज के राज के राज के राज",
"answer": "B",
"explanation_en": "The correct answer to this question is B as Udaipur was ruled by the Maharaja Fateh Singh II, who belonged to the Bhati Rajput clan.",
"explanation_hi": "उडे के राज के राज के राज के राज के राज के राज के राज",
"explanation_hi": "उडे राज के राज के राज के राज के राज के राज के राज के राज के",
] राज के राज के राज के राज के राज के राज",
"explanation_en": "Udaipur was ruled by Maharana Fateh Singh II from the Bhati Rajput clan.",
"explanation_hi": "उडे राज के राज के राज के राज के राज के राज के",
"explanation_hi": "उडे राज के राज के राज क