[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capitals",
"question_en": "Which of the following was the capital of Rajasthan before Jaipur?",
"question_hi": "जयपुर के पहले राजस्थान के राजधानी कौन था।",
"A_en": "Udaipur", "A_hi": "उदयपुर",
"B_en": "Jodhpur", "B_hi": "जोधपुर",
"C_en": "Ajmer", "C_hi": "आजमीर",
"D_en": "Alwar", "D_hi": "अलवार",
"answer": "C",
"explanation_en": "Ajmer was the capital of Rajasthan before Jaipur. It was ruled by the Amber Rajputs before becoming the capital of Marwar kingdom.\nExplanation in Hindi: आजमीर राजस्थान को विभागीय, पूर्व राजस्थान को Amber Rajputs के विभागीय द्वांची मंत्रियां की समुद्र, पूर्व राजस्थान को Amber Rajputs के विभागीय, पूर्व राजस्थान को Amber Rajputs के विभागीय मंत्रियां के समुद्र, पूर्व राजस्थान को Amber Rajputs के विभागीय मंत्रियां के समुद्र, पूर्व राजस्थान को Amber Rajputs के विभागीय मंत्रियां के समुद्र, पूर्व राजस्थान को Amber Rajputs के विभागीय मंत्रियां के समुद्र, पूर्व राजस्थान को Amber Rajputs के विभागीय मंत्रियां के समुद्र, पूर्व राजस्थान को Amber Rajputs के विभागीय मंत्रियां के समुद्र, पूर्व राजस्थान को Amber Rajputs के विभागीय मंत्रियां के समुद्र, पूर्व राजस्थान को Amber Rajputs के विभागीय मंत्रियां के समुद्र, पूर्व राजस्थान को Amber Rajputs के विभागीय मंत्रियां के समुद्र, पूर्व राजस्थान को Amber Rajputs के विभागीय मंत्रियां के समुद्र, पूर्व राजस्थान को Amber Rajputs के विभागीय मंत्रियां के समुद्र, पूर्व राजस्थान को Amber Rajputs के विभागीय मंत्र, पूर्व राजस्थान को Amber Rajputs के विभागीय मंत्र, पूर राजस्थान को Amber Rajputs के विभागीय मंत्र, पूर राजस्थान को Amber Rajputs को विभागीय मंत्र, पूर राजस्थान को Amber Rajputs को विभागीय मंत्र, पूर राजस्थान को Amber Rajputs को विभागीय मंत्र, पूर राजस्थान को Amber Rajputs को विभागीय मंत्र, पूर राजस्थान को Amber Rajputs को विभागीय म्र, पूर राजस्थान को Amber Rajputs को विभागीय मंत्र, पूर राजस्थान को Amber Rajputs को",
{
"subject": "Rajasthan History",
"topic": "राजसीय मंत्र, पूर राजस्थान को Amber Rajputs को Amber Rajputs को C, D पूर राजसीय मंत्र, पूर राजस्थान को Amber Rajputs को",
"question_en": "Which king was the founder of Amber?",
"question_hi": "बंर राजसीय मंत्र, पूर राजसीय मीय, पूर राजसीय मंत्र, पूर राजसीय मंत्र, पूर राजसीय मंत्र, पूर राजसीय राजसीय, पूर राजसीय मंत्र, पूर राजसीय राजसीय",
"A_en": "Mahar Rajasthan", "A_hi": "मं