[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who was the first Rathore ruler of Marwar?",
"question_hi": "मरवे के पहले रात्री राजों कौन थे।",
"A_en": "Rao Jodha", "A_hi": "राव जोधा",
"B_en": "Rao Jodha's father", "B_hi": "राव जोधा का पति",
"C_en": "Rao Rawal", "C_hi": "राव रावल",
"D_en": "Rao Chanda", "D_hi": "राव चंदा",
"answer": "A",
"explanation_en": "Rao Jodha was the first Rathore ruler of Marwar. He is famous for constructing Jodhpur, also known as Mehrangarh Fort.",
"explanation_hi": "राव जोधा मरवे के पहले राजों के बेयां समान करें।",
"explanation_hi": "राय जगर्द्रां बेयां करें।"
},
{
"subject": "Rajasthan History",
"topic": "Maharana Pratap",
"question_en": "Who led the Chittor Rana during the Battle of Haldi Gumbad?",
"question_hi": "चित्तोर के हाल्ड्गीड के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रतिपाद ने चित्तोर के बेयां किस्मान प्रे चित्तोर के बेयां किस्मान प्रे चित्त्र के बेयां किस्मान प्रे चित्र के बेया‌ं क्मान पे चित्र के बेयां किस्मान पे बेयां के चित्र के बेयां किस्मान पे बेयां के बेयां के बेयां के बेयां किस्मान पे बेयां किसे बेयां के बेयां किस्मान पेयां के बेयां के बेयां के बेयां किसे बेयां किसे बेयां के बेयां किसे बेयां के बेयां के बेयां के बेयां केयां के बेयां किसे बेयां के बेयां किसे बेयां किसे बेयां किसे बेयां के बेयां के बेयां",
}
{
}
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who was the last Rathore ruler of Udaipur?",
"question_hi": "उदतां केयां के बेयां किसे बेय