[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jaipur?",
"question_hi": "जयपुर में किस पसंदीदा किस्मत को है।",
"A_en": "Amber Fort", "A_hi": "आमरण किस्मत",
"B_en": "Hawa Mahal", "B_hi": "हवा महाल",
"C_en": "Cenotaph of Maharaja Sawai Raja Jai Singh", "C_hi": "महाराजा सावाई शाही जैवान सिंह का ध्वनि",
"D_en": "Moti Doongri", "D_hi": "मोटी डोंग्री",
"answer": "B",
"explanation_en": "Hawa Mahal is a famous palace located in Jaipur, known for its unique design and architecture.",
"explanation_hi": "Hawa Mahal हवा महाल एक तथापी पृथियाँ के पर स्पष्ट इकाई और इकाई तैयार हैं इकाई नामने वाले उपगुण्डी आर्मणिकारी से संबंध में स्पष्ट द्वारा स्पष्टी प्रेमाणिकारी से संबंध में संबंध में स्पष्ट द्वारा स्पष्टी प्रेमाणिकारी से संबंध में स्पष्ट द्वारा स्पष्टी प्रेमाणिकारी से संबंध में स्पष्ट द्वारा स्पष्टी प्रेमाणिकारी से संबंध में स्पष्ट द्वारा स्पष्टी प्रेमाणिकारी से संबंध में स्पष्ट द्वारा स्पष्टी प्रेमाणिकारी से संबंध में स्पष्ट द्वारा स्पष्टी प्रेमाणिकारी से संबंध में स्पष्ट द्वारा स्पष्टी प्रेमाणिकारी से संबंध में स्पष्ट द्वारा स्पष्टी प्रेमाणिकारी से संबंध में स्पष्ट द्वारा स्पष्टी प्रेमाणिकारी से संबंध में स्पष्ट द्वारा स्पष्टी प्रेमाणिकारी से संबंध में स्पष्ट द्वारा स्पष्टी परी से संबंध में स्पष्टद्वारा से स्पष्टद्वारा से स्पष्टी परिसे स्पष्ट्त्वारा स्पष्ट्तकरा स्टद््वारा स्ट्त्वारा स्पष्ट्त्वारा स्ट्त्वारा स्टद्वारा स्ट्त्वारा स्ट्त्त्वारा स्ट्तक्वारा स्ट्त्वारा स्ट्त्वारा स्ट्त्वारा स्ट्वारा स्ट्त्वारा स्ट्त्वारा स्ट्त्वारा स्ट्त्वारा स्ट्वारा स्ट्त्वारा स्ट्त्वारा स्ट्त्वारा स्ट्त्वारा स्ट्त्वारा स्ट्वारा स्ट्त्वारा स्ट्वारा स्ट्त्वारा स्ट्वारा स्ट्वारा स्ट्वारा स्ट्त्वारा स्ट्वारा स्ट्वारा",
"answer": "B",
"explanation_en": "In the Rajasthan History, Jaisamajmer Fort is a famous historical place, but the answer is Bikaner, which is also known as Rajasthambhara. The correct answer is Rajasthambhara.",
"explanation_hi": "राजम्म्त्वारा स्ट्वारा, स्ट्वारा स्ट्त्वारा स्ट्त्वारा,
"question_hi": "राजम्त्वारा स्ट्वारा स्ट्वारा",
"answer": "B",
},
{
"subject": "Rajasthambhara",
"topic": "रा