[
{
"subject": "Rajasthan History",
"topic": "Rashtriya Madhyamik Siksha Mandal",
"question_en": "What is the Rashtriya Madhyamik Siksha Mandal?",
"question_hi": "राष्ट्रीय मध्यम शिक्षण मंडल",
"A_en": "Rajasthan State Board of Secondary Education",
"A_hi": "राजस्थान राज्य मध्यम शिक्षण बोर्ड",
"B_en": "Rajasthan Vyapam",
"B_hi": "राजस्थान व्यापीम",
"C_en": "National Council for Educational Research and Training",
"C_hi": "भारतीय सचिव और प्रश्न कलाकरण और प्रश्न सहायता आधारणा (भारत)",
"D_en": "Rajasthan Education Board",
"D_hi": "राजस्थान शिक्षण बोर्ड",
"answer": "D",
"explanation_en": "The Rashtriya Madhyamik Shiksha Mandal is responsible for secondary education in India, while the Rajasthan Education Board is responsible for primary and secondary education in Rajasthan. Rajasthan Vyapam is a commission for professional education in Rajasthan. The National Council for Educational Research and Training focuses on educational research and training. Therefore, the correct answer is the Rajasthan Education Board (D).",
"explanation_hi": "राजस्थान शिक्षण बोर्ड को भारतीय मात्राई शिक्षित प्रदेश को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक्षक को भारतीय मात्राई शिक को भारतीय मात्राई शिक को भारतीय मात्राई शिक को भारतीय मात्राई शिक को भारतीय मात्राई शिक को भारतीय मात्राई शिक को भारतीय मात्राई शिक को भारतीय मात्राई शिक को भारतीय मात्राई शिक क भारतीय मात्राई शिक क भारतीय मात्राई शिक क भारतीय मात्राई शिक भारतीय मातीय शिक भारतीय मातीय शिक भारतीय मातीय शिक भारतीय मातीय शिक भारतीय मातीय शिक भारतीय शिक भारतीय मातीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय शिक भारतीय श