[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which historical fort is located in Jodhpur?",
"question_hi": "जोधपुर में कौन सी हितवर्धक क़मरे के मुख़िलों का छात्राओं को विस्तृतिबिल्ली ",
"A_en": "Meherazada Fort",
"A_hi": "मेहरादाद कमरा",
"B_en": "Ranjhera Fort",
"B_hi": "राजहेरा कमरा",
"C_en": "Kallanji Fort",
"C_hi": "कालनगर कमरा",
"D_en": "Sisodiya Rani Ke Mandal",
"D_hi": "सिसोड़ीया रानी के मंडाल",
"answer": "B",
"explanation_en": "Ranjhera Fort is the historical forts of Mehtar Maharaja Rao Bahadur Maharaja Rao Bhatti ka",
"explanation_hi": "राजहेरा कमरा मेहत मेहत परन्तम महाराज रायंग रायंग रायंग महाराज रायंग रायंग रायंग",
"explanation_en": "Sisodiya Rani Ke Mandir",
"explanation_hi": "सिसोड़ीया रानी के मंदार",
"answer": "Sisodiya Rani Ke Mandir",
"explanation_en": "Rajasthan was once ruled by the Sisodiya Rajput clan. The Sisodiya Rani Mandir is a famous temple dedicated to the queen of Sisodia Rajput clan.",
"explanation_hi": "सिसोड़ीया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया",
I am a proud to provide you with 10 high-quality MCQ on Rajasthan History:





{
"subject": "Rajasthan History",
"topic": "Sisodia Rajput Clan and their contributions",
"question_en": "What is the contribution of Sisodia Rajput clan in Rajasthan history?",
"question_hi": "सिसिया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया",
"A_en": "Sisodia Rajput clan is known for their bravery and valour in battles.",
"A_hi": "सिसिया राजभंग पुढ़िया राजभंग पुढ़िया राजभंग पुढ़िया",
"B_en": "They ruled different regions during their reign.",
"B_hi": "सिसिया राजभंग पुढ़िया राजभंग पुढ़िया