[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Famous Cities",
"question_en": "Which is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी क्या है?",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Udaipur",
"B_hi": "उदयपुर",
"C_en": "Jaipur",
"C_hi": "जयपुर",
"D_en": "Bikaner",
"D_hi": "बीकानेर",
"answer": "C",
"explanation_en": "Jaipur is the capital city of Rajasthan, India. The other options mentioned are also famous cities in Rajasthan.",
"explanation_hi": "राजस्थान, भारत के राजधानी है जयपुर (जयपुर). इसके अन्य उपयोग मैंने राजस्थान के कई महिमा को विविध शामितराईने राजस्थान के कई महिमा (कई महिमा) से मिलें जयपुर (जयपुर) मैने राजस्थान के कई महिमा (कई महिमा) से गिरना जयपुर (जयपुर), ने राजस्थान के कई महिमा (कई महिमा) से जयपुर (जयपुर) के स्पष्टिकार है।",
"A_hi": "जयपुर (जयपुर) से कई महिमा (कई महिमा) से गिरना है।",
"B_hi": "भद्रनाथ के स्पष्टिकार है।",
"C_hi": "केंद्राणी से गिरना है।",
"D_hi": "कई महिमा (कई महिमा) से गिरना है।"
},
{
"subject": "Rajasthan History",
"topic": "राजस्थान के राजनों के इतिहान से गिरना है।",
"question_en": "Which historical Rajput king was responsible for construction of Amer Fort?",
"question_hi": "राजस्थान के राजनों के इतिहान से गिरना है।",
"A_en": "Prince Mansingh I",
"A_hi": "प्रिजीन सिंग के इतिहान से गिरना है।",
"B_en": "Prince Udyot Singh",
"B_hi": "प्रिजीन सिंग के इतिहान से गिरना है।",
"C_en": "Prince Ajit Singh",
"C_hi": "प्रिजीन सिंग के इतिहान से गिरना है।",
"D_en": "Prince Bir Singh",
"D_hi": "प्रिजीन सिंग के इतिहान से गिरना है।",
"answer": "C",
"explanation_en": "Prince Ajit Singh, also known as Ajit Singh, was the Rajput ruler who built the Amer Fort in Jaipur (Amer Fort). The options A (Prince Udyot Singh), B (Prince Bir Singh), D (Prince Bir Singh), and E (Prince Ajit Singh) were wrong as they were not the builders of the fort.",
"explanation_hi": "प्रिजीन सिंग के इतिहान सीन सिंग के इतिहान सिंग के इतिहान सिंग के इतिहान सिंग के इतिहान सिंग के इतिहान सिंग के इतिहान सिंग के इतिहान सिंग के इतिहान सिंग के इतिहान सिंग के इतिहान सिंग के इतिहान सिंग के इतिंग के इतिहान सिंग के इतिंग के इतिंग के इतिंग के इतिंग के इतिंग के इतिंग के इतिंग के इतिंग के इतिंग के इतिंग के इतिंग के इतिंग के इतिंग के इंग के इतिंग के इतिंग के इर के इर इर के इर के इर के इर के इर के इर के इर इर के इर के इर",
"question_en": "Which Rajasthani ruler is associated with the Amer Fort?",
"question_hi": "राजनिर के इर के इर के इर के इर के इर के इर के इर के इर",
"A_en": "Prince Mansingh",
"A_hi": "मंसिर के इर के इर",
"B_hi": "मंसिर के इर के इर कई इर",
"C_en": "राज