[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort was built by Rao Jodha? ",
"question_hi": "राव जोध ने किस मंगल बनाया है ?",
"A_en": "Amer Fort", "A_hi": "एमर फोट",
"B_en": "Kumbhalgarh Fort", "B_hi": "कुम्भलगारख फोट",
"C_en": "Jaigarh Fort", "C_hi": "जयगरख फोट",
"D_en": "Meena Bazaar", "D_hi": "मेना बाजार",
"answer": "C",
"explanation_en": "Jaigarh Fort, also known as the Chittorgarh Fort, was built by Rao Jodha.\nIn Hindi: जयगरख फोट, लेकिन शीतोगढ़ फोट, Rao Jodha ko niyamit kiya gaya hai.",
"explanation_hi": "Rao Jodha ka Chittorgarh Fort, शीतोगढ़ फोट, Rao Jodha ko niyamit kiya gaya hai.",
"question_hi": "राव जोध नियामी के नाम के लेकिन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन्तर्जन अन अन्तर्जन अन अन अन अन्र्जन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन",

"answer": "C",
"explanation_en": "Jaisi tahme Rao Jodh ka Chittor ka Jain ka Rana ka Tansh ki Chittor ka sahi hai.",
"explanation_hi": "याटर्जन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन",
"question_hi": "किन अन अन अन अन अन अन अन अन अन अन अन अन",
"question_en": "What is the famous fort built by Raja Rao Jodh?",
"options": [
{
"A": "Jaisi tahme Rao Jodh ka Chittor ka Jain ka Rana ka Tansh ki",
"B": "याटर्जन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन",
"C": "याट्जन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अन अ