[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who was the first Nawab of Jaipur?",
"question_hi": "जयपुर के पहले नौबेब्ल्यूब का विवरण: 

Bir Singh Deo (बीर सिंह डीओ) का विवरण है। वह इसके पहले नौबेब्लूम हुआ था।

A_en: Bir Singh Deo (बीर सिंह डीओ), the details of whom are provided below. He was the first Nawab of Jaipur.\n\nA_hi: बीर सिंह डीओ, के बायेश्वर हुआ था।

B_en: According to his background, Bir Singh Deo (बीर सिंह डीओ) was a prominent figure of Jaipur before becoming the Nawab.\n\nB_hi: बीर सिंह डीओ के बायेश्वर में पहले मामल आये थे, जैसे बीर सिंह डीओ के बायेश्वर में पहले मामल आये थे।

C_en: Bir Singh Deo (बीर सिंह डीओ) held prominent positions in Bays before becoming the Nawab.\n\nC_hi: बीर सिंह डीओ के बायेश्वर में पहले मामल आये थे।

D_en: Bir Singh Deo (बीर सिंह डीओ) had a distinguished career before becoming the Nawab.\n\nD_hi: बीर सिंह डीओ के बायेश्वर में पहले मामल आये थे।

E_en: Bir Singh Deo (बीर सिंह डीओ) was a prominent figure in Bays before ascending to the throne as the Nawab.\n\nE_hi: बीर सिंह डीओ के बायेश्वर में पहले मामल आये थे।

F_en: Bir Singh Deo (बीर सिंह डीओ) was an influential figure in Bays before becoming the Nawab.\n\nF_hi: बीर सिंह डीओ के बायेश्वर में पहले मामल आये थे।

G_en: Bir Singh Deo (बीर सिंह डीओ) was a prominent noble of Bays before becoming the Nawab.\n\nG_hi: बीर सिंह डीओ के बायेश्वर में पहले मामल आये थे।

H_en: Bir Singh Deo (बीर सिंह डीओ) was a renowned noble of Bays before being appointed as the Nawab.\n\nH_hi: बीर सिंह डीओ के बायेश्वर में पहले मामल आये थे।

I_en: Bir Singh Deo (बीर सिंह डीओ) was a respected official in Bays before being appointed as the Nawab.\n\nI_hi: बीर सिंह डीओ के बायेश्वर में पहले मामल आये थे।

J_en: Bir Singh Deo (बीर सिंह डीओ) held various positions in Bays before becoming the Nawab.\n\nJ_hi: बीर सिंह डीओ के बायेश्वर मामल आये थे।


K_en: Bir Singh Deo (बीर सिंह डीओ) was a distinguished official in Bays before ascending to the Nawab's throne.\n\nK_hi: बीर सिंह डीओ के बायेे थे।


L_en: Bir Singh Deo (बीर सिंह डीओ) held various roles in Bays before becoming the Nawab.\n\nL_hi: बीर सिंह डीओ बायेे थेे।


M_en: Bir Singh Deo (बीर सिंह डीओ) was known for his services in Bays before assuming the Nawab's position.\n\nM_hi: बीर सिंह डीओ बाये थेेेेेेेर सिंह डेयेेेर बायेर डेेेेेर सिंह डेेेेर बायेेेेर बायेेेेेर बायेेेर बायेेर बायेेेर बायेेर बायेेेर बायेर बायेेर बायेेर बायेेर बायेेर बायेर बायेर बायेर बायेर बायेेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बायेेर बायेर बायेर बायेर बायेर बायेर बायेर बायेेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बायेर बा