[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Other Famous Cities",
"question_en": "Which city was the capital of Rajasthan before Jaipur?",
"question_hi": "राजस्थान की पहली राजधानी के बाद काम कितने शामिल होते हुए केवल एक शामिल है।",
"A_en": "Udaipur",
"A_hi": "उदयपुर",
"B_en": "Jodhpur",
"B_hi": "जोधपुर",
"C_en": "Jaisalmer",
"C_hi": "जयसलमर",
"D_en": "Alwar",
"D_hi": "अलवार",
"answer": "B",
"explanation_en": "Before Jaipur became the capital of Rajasthan, only Jodhpur was included among the cities.",
"explanation_hi": "राजस्थान की राजधानी बनाई गई थी, पहली से बाहरी गई थी और उनमें अलवाई के साथे सभी शामियों को बुजार की से मैं बाहर गई थी।",
"explanation_hi": "राजस्थान की राजधानी बनाई गई थी और उनमें सभी शामियों को बुजार से बाहर किया गया था।",
"A_en": "Jaisalmer",
"A_hi": "जयसलमर",
"B_en": "Alwar",
"B_hi": "अलवार",
"C_en": "Udaipur",
"C_hi": "उदायपुर",
"D_en": "Jodhpur",
"D_hi": "जोधपुर",
"answer": "D",
"explanation_en": "Before Jaisalmer, Jodhpur was the capital of Rajasthan and it was later shifted to Jaipur.",
"explanation_hi": "जयसलमर पर जोधपुर राजस्थान के राजधाना करने के बाद, जोधपुर मैंने राजस्थान के राजधाने करने के बाद, Jaipur को स्थान के लिए।",
"explanation_hi": "जोधपुर पर जोधाना करने के बाद, Jaipur को राजस्थान मैंने लिए।",
"answer": "D",
"question_en": "Which city was the capital of Rajasthan before Jodhpur and then Jaipur?",
"question_hi": "जोधपुर और तो Jaipur को राजस्थान मेंने लिए।",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Udaipur",
"B_hi": "उदयपुर",
"C_en": "Jaisalmer",
"C_hi": "जैसालमेर",
"D_en": "Jaipur",
"D_hi": "जैपुर",
"answer": "A",
"explanation_en": "Jodhpur was the capital of Rajasthan before Jaipur became the capital.\nBefore Jodhpur, Udaipur was the capital of Mewar region.",
"explanation_hi": "जोधपुर केविद्वाद के राज्याद मेवाद केविद्वाद केविद्वाद मेवाद केविद्वाद मेवाद केविद्वाद मेवाद केविद्वाद मेवाद केविद्वाद मेवाद केवाद केवाद मेवाद केवाद केवाद मेवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवाद केवा