[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which event marked the establishment of the Mewar Kingdom?",
"question_hi": "मेवार क्षेत्र के संरक्षण के लिए कौन-सा घटना की गई थी।",
"A_en": "The Battle of Haldighati",
"A_hi": "हल्दीघट",
"B_en": "The Battle of Amber",
"B_hi": "अमेर",
"C_en": "The Chittor Fortification",
"C_hi": "चिट्टोर बास्त्र",
"D_en": "The Battle of Marwar",
"D_hi": "मेवार घटना",
"answer": "D",
"explanation_en": "The correct answer is D (The Battle of Marwar), as it marked the establishment of the Mewar Kingdom in 1526 during the reign of Rana Pratap.",
"explanation_hi": "मेवार घटना (ठंडा) 1526 में राणा प्रतिमान के राज़काल में मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल में मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल में मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल में मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल में मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल में मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल में मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल में मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल में मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल में मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल में मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल में मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल में मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल में मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल मेवार घटना (ठंडा) के तथा प्रधानमंद राज़काल मिवार घटना (ठंडा) के तथा प्रधानमंद राज़काल मिवार घटना (ठंडा) के तथा प्रधानमंद राजकाल मिवार घटना (ठंडा) के तथा प्रधानमंद राजकाल मिवार घटना (ठंडा) के तथा प्रधाना",
Writing ठडा के तथा प्रधानमंद राजकाल मिवार घटनमंडा",ठडा के प्रधाना (ठे तथा प्रधानमंडा)",ठडा के प्रधाना",ठे तथा प्रधाना",ठडा के प्रधाना (ठडा)",ठडा के प्रधाना",ठडा के प्रधाना ठडाके प्रधाना",ठे प्रधाना",ठडा के प्रधाना ठडा",ठडा के प्रधाना",ठे प्रधाना ठडा",ठडा के प्रधाना",ठडा के प्रधाना",ठडा के प्रधाना",ठे प्रधाना",ठडा के प्रधाना",ठडा के प्रधाना",ठे प्रधाना",ठडा के प्रधाना",ठडा के प्रधाना",ठडा के प्रधाना",ठे प्रधाना",ठडा के प्रधाना",ठे प्रधाना",ठे प्रधाना",ठे प