[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who was the first Mughal Emperor to conquer Rajasthan?",
"question_hi": "राजस्थान को पहले मुगल संतुष्टियों (विज्ञानी) को विलय करने वाला ख़ुशी के संतुष्टियों (विज्ञानी) का नाम निम्नल सुखी के संतुष्टियों (विज्ञानी) में स्पष्ट करने के संतुष्टियों (विज्ञानी) के नाम क्या था?",
"question_hi": "राजस्थान के स्पष्ट करने के नाम क्या था?",
"A_en": "Nawab Saadat Ali Khan II",
"A_hi": "नौब साधानल कने के नाम क्या था?",
"B_en": "Hari Singh",
"B_hi": "हरी सिंग",
"C_en": "Nawab Mirza Raja Bir Singh",
"C_hi": "नौब मिर्जा बिर सिंग",
"D_en": "Nawab Sardhana Singh",
"D_hi": "नौब साडना सिंग",
"explanation_en": "Nawab Saadat Ali Khan II was the Mughal ruler who clarified the name of the city of Jodhpur.",
"explanation_hi": "नौब साधाना कांकी II मुगोल कांकी आरमंडर हैं जो जोधपुर का नाम को विकलाया",
"answer": "C",
"explanation_en": "Nawab Mirza Raja Bir Singh was the first Mughal ruler to clarify the name of Jodhpur.",
"explanation_hi": "नौब मिरजा बिर सिंग, जयपुर का नाम को पहलाने वाला।",
"answer_hi": "च",
},
{
"subject": "Rajasthan History",
"topic": "Rajput Rajas",
"question_en": "Which Rajput Rajas clan did the Jat king Maharana Pratap belong to?",
"question_hi": "महाराणा महाराणा महराना यात्रा के लिखियां का क्या राजस्थान कोटीकियां का इन्हीं के कितरां के लिखियां का क्या राजस्थान कोटीकियां का इन्हीं के कितरां का कितरां के लिखियां का कितरां के कितरां का इन्हीं के कितरां का क्यां के लिखियां का इन्हीं के कितरां के कितरां का इन्हीं के कितरां का इन्हीं के कितरां का इन्हीं का इन्हीं के कितरां का इन्हीं के कितरां का इन्हीं के कितरां का इन्हीं के कितरां का इन्हं के कितरां का इन्हं के के का इन्हीं कीं का इन्हं कीं के का इन्हीं के के का इन्हं कीं के किं का इन्हं के कीं का इन्हीं किं का इन्हं के के का इन्हं किं के के का इन्हं के के के के के के का इन्हं के के का इन्हं के के के का इन्हं के के का इन्हं के का इन्हं के के का इन्हं के का इन्हं के के के का इन्हं के के का इन्हं के के का इन्हं के का इन्हं के के का इन्हं के का इन्हं के का इन्हं के का इन्हं का इन्हं के का इन्हं के का इन्हं का इन्हं के का इन्हं के का इन्हं के का इन्हं का इन्हं का इन्हं के का इन्हं का इन्हं का इन्हं का इन्हं का इ