[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Families",
"question_en": "Which royal family ruled Jodhpur?",
"question_hi": "जोधपुर के राज्यों में कौन सी राजी समाज करते थे।",
"A_en": "Rathore",
"A_hi": "रातौर",
"B_en": "Thakur",
"B_hi": "ठाकुर",
"C_en": "Bhawani",
"C_hi": "भावानी",
"D_en": "Kachwaha",
"D_hi": "काचवाहा",
"answer": "D",
"explanation_en": "The Kachwaha family ruled Jodhpur. They were the ruling family of the Meena Rajput clan and established the Rathore dynasty in Rajasthan.",
"explanation_hi": "जोधपुर के कलहा समाज संत के राज्य में राजने करने वाले थे। उन्हें राजपुर के मेने कलहा समाज संत के राजने करने वाले थे। उन्हें राजपुर के मेने कलहा समाज संत के राजने करने वाले थे। उन्हें राजपुर मेने कलहा समाज संत के राजने करने वाले थे। उन्हें राजपुर मेने कलहा समाज संत के राजने करने वाले थे। उन्हें राजपुर मेने कलहा समाज संत के राजने करने वाले थे। उन्हें राजपुर मेने कलहा समाज संत के राजने करने वाले थे।",
"question_hi": "राजपुर मेने कलहा समाज संत के राजने करने वाले थे। उन्हें राजपुर मेने कलहा समाज संत के राजने करने वाले थे।",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Thakur",
"B_hi": "थाकर",
"C_en": "Bhati",
"C_hi": "भाती",
"D_en": "Mewar",
"D_hi": "मीवार",
"answer_en": "Jodhpur",
"answer_hi": "जोधपुर",
"explanation_en": "Jodhpur, also known as Jodhpur, was ruled by the Kachwaha Rajput clan, which was a part of the Kachwaha branch of the Rathore clan. They were the descendants of Rao Jogi, a Rajput warrior and founder of the Kachwaha dynasty.",
"explanation_hi": "जोधपुर, जीवन के संत के एक उद्यार मनूदर और उसे बातियार मेलक मीन के एक क़तर, उसे भटियार मेलक़मीन के बातियार मीन के भटियार मीन के बाटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार मीन के भटियार के भटियार मीन के भटियार के भटियार मीन के भटियार के भटियार के भटियार मीन के भटि