[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "What is the significance of Chittorgarh Fort?",
"question_hi": "चिट्टोगर किस अवधि में मूल्य है।",
"A_en": "Strategic location on the Maota Lake",
"A_hi": "माओटा नदी पर स्थिति से मूल्य",
"B_en": "Significant battle sites like Meera Temple and Padmanabhgarh",
"B_hi": "मेरा मंदिर और पादंबन्दर से मूल्य",
"C_en": "Historical marriages of Maharana Kumbha and Rani Padmavati",
"C_hi": "महाराणी कुम्ब्हा और रानी पादमबी के लिए मैंने कौन किया था ?",
"D_en": "Role in the establishment of Rajasthan",
"D_hi": "राजस्थान को संरक्षित की गई गई थी",
"question_en": "What was the significance of Chittorgarh in the history of Rajasthan?",
"question_hi": "चिट्टोगर्गड़ के लिए राजस्थान का महत्ता था?",
"answer": "गैर्गड़ स्थान का राजमार्गड़ की गढ़ित गढ़ की महत्ता थी।",
"question_en": "What was the significance of Chittorgarh in the history of Rajasthan?",
"question_hi": "चिट्टोगर्गड़ का राजमार्गड़ की गढ़ित गढ़ की महत्ता थी।",
"answer": "चिट्टोगर्गड़ का राजमार्गड़ की गढ़ित गढ़ की महत्ता थी।",
"question_en": "What was the significance of Chittorgarh in the history of Rajasthan?",
"question_hi": "चिट्टोगर्गड़ की गढ़ित गढ़ित गढ़ की महत्ता थी।",
"answer": "चिट्टोगर्गड़ की गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित गढ़ित",
"answer": "राज़ित गढ