[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous palace was built during the reign of Maharaja Surajmal of Bikaner?",
"question_hi": "बीकानेर महाराज़ शुराज़माल के राज़ियां में खोजने के लिए जानेवाला पुलिसबोर्ड",
"A_en": "Karni Fort",
"A_hi": "कार्नी फोट",
"B_en": "Lalgarh Palace",
"B_hi": "लालगर्ह पाली",
"C_en": "Samode Palace",
"C_hi": "सामोद पाली",
"D_en": "Karni Mausoleum",
"D_hi": "कार्नी मौसोलेम",
"answer": "B",
"explanation_en": "Lalgarh Palace was built during the reign of Maharaja Sir Sayajirao III of Baroda.\nलालगर्ह पाली के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी के राजनी",
波वाले के राजनी",
"answer": "B",
"explanation_en": "The Birla Mausam is a famous palace in Jaipur, Rajasthan, which was built during the reign of Maharaja Sawai Jai Singh II. The palace is known for its architecture and is a popular tourist attraction.\nबीरलाल मौसाॐ।।",
"explanation_hi": "बीरलाल मौसाॐ। बॉॐल मौसाल बौसाॐल, बौॐल मौसाॐल बौसाॐल, बौसाॐल बौसाॐल बौसाॐल",
"question_en": "What is the famous palace built during the reign of Maharaja Sawai Jai Singh II in Jaipur?",
"question_hi": "जैैसोैसैोसैैसाैसैैसल ैैसैसٚैैसैसाैसाैैैसैसाैैसैसाैसाैैसाैसाैैसल ैसाैसाैैसाैैसाैैसाैसाैसाैसाैैसाैसाैसाैसाैसाैैसाैैसाैसाैसाैसाैसाैैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसासाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाैसाै