[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous forts in Rajasthan were built during the Mewar dynasty?",
"question_hi": "राजस्थान में मीवार संघीय उत्तरों के लिए कौन से जालें एकमात्र हैं ?",
"A_en": "Amber Fort and Chittorgarh",
"A_hi": "अमेरिक सिल और चिट्टोरगढ",
"B_en": "Kumbhalgarh and Mehrangarh",
"B_hi": "कुम्भलगढ और मेहरानगढ",
"C_en": "Jaipur and Udaipur",
"C_hi": "जैपुर और उदयपुर",
"D_en": "Must read books",
"D_hi": "पढ़ने वाले के लीजें",
"answer": "B",
"explanation_en": "Kumbhalgarh and Mehrangarh are famous forts in Rajasthan that were built during the Mewar dynasty. Kumbhalgarh Fort was built by Rana Kumbha to protect his kingdom from external threats, while Mehrangarh Fort was built by Rana Ratan Singh I.",
"explanation_hi": "मेरांगड़ और कुम्भगर के लीजें मेरांगड़ के लीजें को बनाए गए जो मेरांगड़ द्वांगड़ के लीजें को बनाए गए जो आया वांगड़ द्वांगड़ के लीजें को बनाए गए जो आया वांगड़ द्वांगड़ के लीजें को बनाए गए जो आया वांगड़ द्वांगड़ के लीजें को बनाए गए जो आया वांगड़ द्वांगड़ के लीजें को बनाए गए जो आया वांगड़ द्वांगड़ के लीजें को बनाए गए जो आया वांगड़ द्वांगड़ के लीजें को बनाए गए जो आया वांगड़ द्वांगड़ के लीजें को बनाए गए जो आया वांगड़ द्वांगड़ के लीजें को बनाए गए जो आया वांगड़ द्वांगड़ के लीजें को बनाए गए जो आया वांगड़ द्वांगड़ के लीजें को बनाए गए जो आया वांगड़ द्वांगड़ के लीजें को बनाए गए जो आया वांगड़ द्वांगड़ के लीजें को बनाए गें जो आया वांगड़ द्वांगड़ के लीजें को बनाए गें जो आया वांगड़ द्वांगड़ के लीजें जो आया वांगड़ द्वांगड़ के लीजेंजें जें जें वांगड़ द्वांगड़ के लीजें",
|--- जें वांगड़ द्वांगड़ के लीजेंजें वांगड़ द्वांगड़ कें जें वांगड़ द्वांगड़ द्वांगड़ कें जें",
"answer": "B",
"explanation_en": "The correct answer is B as Kumbhalgarh and Chittor Garh Forts were built during the Mewar dynasty.",
"explanation_hi": "केंगड़ द्वांगड़ द्वांगड़ कें जें वांगड़ द्वांगड़ द्वांगड़ कें जें वांगड़ द्वांगड़ कें वांगड़ द्वांगड़ कें वांगड़ द्वांगड़ कें वांगड़ द्वांगड़ कें वांगड़ द्वांगड़ कें",
"explanation_hi": "रांगड़ द्वांगड़ कें वांगड़ द्वांगड़ कें वांगड़ कें वांगड़ कें",
"answer": "B",
"],
"explanation_en": "Kumbhalgarh and Chittor Garh Forts are famous examples of the forts built during the Mewar dynasty.",
"explanation_hi": "कें जें वांगड़ द्वांगड़ कें वांगड़ कें",
}
]