[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "What is the capital of Rajasthan?",
"question_hi": "राजस्थान के राजधानी क्या है?",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Jaipur",
"B_hi": "जयपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Bikaner",
"D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Jaipur is the capital city of Rajasthan.",
"explanation_hi": "जयपुर राजस्थान की राजधानी की जानकारी",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Famous Forts",
"question_en": "Which of the following forts is a famous landmark of Rajasthan?",
"question_hi": "राजस्थान में किस पर्यापन का बड़ा लेंगा क्या है?",
"A_en": "Amber Fort",
"A_hi": "आमर",
"B_en": "Meena Bazaar",
"B_hi": "मीना बाजार",
"C_en": "Hawa Mahal",
"C_hi": "हवा महाल",
"D_en": "Kumbhalgarh Fort",
"D_hi": "कुम्बलगाँड फोट",
"answer": "C",
"explanation_en": "Hawa Mahal is a famous landmark of Rajasthan.",
"explanation_hi": "हवा महाल राजस्थान में बड़ा लेंगा है।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Famous Kings",
"question_en": "Which famous king ruled during the Mughal rule?",
"question_hi": "मुगल कामल के समय में कौनसे मंघली राज्य में कौनसे राज्य में क्या मंगलों के समय में कौनसे राज्य में क्या राजा को बोलिकाने राज्य में कौनसे राजा थेंचे समय में कौनसे राजा थेंचे सम्पत्तियांचे राजा थेंचे समय में कौनसे राजा थेंचे सम्पत्तियांचा समय में कौनसे राजा थेंचे सम्पत्तियांचे सम्पतियांचे सम्पतियांचे सम्पतियांचे समय में कौनसे राजा थेंचे सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचे सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्प्तियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियांचं सम्पतियां सम्पतियांचं सम्पतियां सम्पतियां सम्पतियांचं सम्पतियां सम्पतियां सम्पतियांचं सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम्पतियां सम