[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jaipur?",
"question_hi": "जयपुर में किस मंगलवाला है?",
"A_en": "Amber Fort", "A_hi": "अमेर मंगलवाला",
"B_en": "Hawa Mahal", "B_hi": "हवा महाल",
"C_en": "Cenotaph of Maharaja Sawai Man Singh II", "C_hi": "सवाई मंगलवाला में है",
"D_en": "Nahargarh Fort", "D_hi": "नहारगढ़ मंगलवाला",
"answer": "B",
"explanation_en": "Hawa Mahal is a famous palace located in Jaipur, known for its intricate architecture and unique design.\nIn Hindi, it translates to 'Palace of Winds' due to the intricate windows that provide fresh air to the residents.\nThe palace was built by Maharaja Sawai Pratap Singh in 1794.",
"explanation_hi": "हवा महाल जयपुर में एक परमाणी कम्यांचे अनुसरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेयांचे आदर्श्चरणी शेे आदर्चरणी शेयांचे आदर्चरणी शेयांचे आदर्शरणी शेयांचे आदर्चरणी शेयांचे आदर्चरणी शेयांचे आदर्चरणी शेयांचे आदर्चरणी शेयांचे आदर्चरणी शेयांचे आदर्चे आदर्चरणी शेयांचे आदर्चरणी शेयांचे आदर्चरणी शेयांचे आदर्चरणी शरणी शे आदर्चरणी शेयांचे आदर्चरणी शेयांचे आदर्चरणी शेयांचे आदर्चरणी",
"answer": "B",
"explanation_en": "The famous Amber Fort is located in Jaipur and was built by Maharaja Man Singh II.\nThe answer is B, as Amber Fort is the correct option.",
"explanation_hi": "अमर्चरणी शेयांचे आदर्चरणी शेयांचे आदर्चरणी शेयांचे आदर्चरणी",
],
"question_en": "अमर्चरणी शेयांचे आदर्चरणी शेयांचे आदर्चरणी शेयांचे आदर्चरणी श