[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous forts and palaces in Rajasthan were built during the reign of Maharaja Jai Singh II?",
"question_hi": "महाराजा जयसिंह अल्लाह ने किस महत्वपूर्ण मंगलों और प्रधानताओं को बनाई गई क्या नगरपालिकाओं के रूप से बनाई गई हैं?",
"A_en": "Amber Fort, Kumbhalgarh Fort, Mehrangarh Fort, Umaid Bhawan Palace, and Hawa Mahal.",
"A_hi": "ओमस्तानी, कुमभागाम फोट, मेहरांगार फोट, उमाई ब्वाँ पलाकाई और हाउ मेहरानी.",
"B_en": "Amber Fort, Kumbhalgarh Fort, Mehrangarh Fort, Umaid Bhawan Palace and Hawa Mahal.",
"B_hi": "ओमस्तानी, कुमभागाम फोट, मेहरांगार फोट, उमाई ब्वाँ पलाकाई और हाउ मेहरानी.",
"C_en": "Amber Fort, Kumbhalgarh Fort, Mehrangarh Fort, Umaid Bhawan Palace, and Hawa Mahal.",
"C_hi": "ओमस्तानी, कुमभागाम फोट, मेहरांगार फोट, उमाई ब्वाँ पलाकाई और हाउ मेहरानी.",
"D_en": "Amber Fort, Kumbhalgarh Fort, Mehrangarh Fort, Umaid Bhawan Palace, and Hawa Mahal.",
"D_hi": "ओमस्तानी, कुमभागाम फोट, मेहरांगार फोट, उमाई ब्वाँ पलाकाई और हाउ मेहरानी.",
"E_en": "Amber Fort, Kumbhalgarh Fort, Mehrangarh Fort, Umaid Bhawan Palace, and Hawa Mahal.",
"E_hi": "ओमस्तानी, कुमभागाम फोट, मेहरांगार फोट, उमाई ब्वाँ पलाकाई और हाउ मेहरानी.",
"F_en": "Amber Fort, Kumbhalgarh Fort, Mehrangarh Fort, Umaid Bhawan Palace and Hawa Mahal.",
"F_hi": "ओमस्तानी, कुमभागाम फोट, मेहरांगार फोट, उमाई ब्वाँ पलाकाई और हाउ मेहरानी.",
"question_en": "Which of the following forts and palaces were built during the rule of the Rathore dynasty?",
"question_hi": "यहाँ से संगत बस्तानी के काशमानी को रातौर द्वांगार वांगत मंगार को रातौर द्वांगार मंगार को रातौर द्वांगार मंगार को रातौर द्वांगार मंगार को रातौर द्वांगार मंगार को रातौर द्वांगार मंगार को रातौर द्वांगार मंगार को रातौर द्वांगार मंगार को रातौर द्वांगार मंगार को रातौर द्वांगार मंगार को रातौर द्वांगार मंगार को रातौर द्वांगार मंगार को रातौर द्वांगार को रातौर द्वांगार को रातौर द्वांगार को रातौर द्वांगार को रातौर द्वांगार को रातौर द्वांगार को रातौर द्वांगार को रातौर द्वांगार को रातौर द्वांगार को रातौर द्वांगार को रातौर द्वांगार को रातौर द्वांगार को रातौर द्वांगार को रातौर कौर द्वांगार कौर रातौर द्वांगार को रातौर कौर कौर रातौर कौर द्वांगार कौर रातौर कौर कौर द्वांगार कौर कौर कौर रातौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर कौर क