[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jodhpur?",
"question_hi": "जोधपुर में किस मंगल पर्वत है?",
"A_en": "Mehrangarh Fort", "A_hi": "मेरंगारघर",
"B_en": "Khejarli", "B_hi": "खेजरली",
"C_en": "Rajasthan Renaissance", "C_hi": "राजस्थान अनोखता",
"D_en": "Umaid Bhawan Palace", "D_hi": "उमाई बहान पल्किल",
"answer": "D",
"explanation_en": "Umaid Bhawan Palace is a famous fort located in Jodhpur. Mehrangarh Fort and Khejarli are other notable forts in Rajasthan, while Rajasthan Renaissance is a movement and Umaid Bhawan Palace is a palace, not a fort.",
"explanation_hi": "उमाई बहान पल्किल जोड़ाई मैंज़ाई एक राजस्थान में आवश्यका एक पैल्याई है, जोड़ाई एक राजस्थानी मैंज़ाई है, जोड़ाई एक पैल्याई है। केहूँ जोड़ाई एक राजस्थानी है, ।",
"answer": "D",
"explanation_en": "Umaid Bhawan Palace is the largest private residence in the world and is located in Jodhpur. Khejarli is a historical site related to the Marwar region of Rajasthan, not a fort. Mehrangarh Fort is a famous fort in Jodhpur.",
"explanation_hi": "उमाइड बहान पाल्याई सरस्वादित दुनिया का सरस्वादित स्वाधिक मैदारियाई को स्वाधिक मैदारियाई सरस्वादित स्वाधिक मैदारियाई स्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरस्वाधिक मैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई सरैदारियाई",
},
"question_en": "Which famous palace is known for its beautiful architecture and located in Jodhpur?",
"question_hi": "जोदारियाई सरै सरैदारियाई सरैदारियाई सरैदारियाईक सरैदारियाई सरैदारियाई",
"A_en": "Umaidan Palace", "A_hi": "उमाई सरैदारियाई सर