[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Historical Places",
"question_en": "Which historical fort is located in Jodhpur?",
"question_hi": "जोधपुर में कौन सा हित्त्वान क्षेत्र है।",
"A_en": "Mehrangarh Fort", "A_hi": "मेरंगरखा",
"B_en": "Kheechan Fort", "B_hi": "केचंद",
"C_en": "Sisodiya Rani Kamani", "C_hi": "सिसोदीया राजनी कमानी",
"D_en": "Jaswant Thada", "D_hi": "जस्वांट थाडा",
"answer": "D",
"explanation_en": "Jaswant Thada is a historical monument located in Jodhpur, known for its intricate marble carvings.\nSisodiya Rani Kamani and Kheechan Fort are located in other parts of Rajasthan.",
"explanation_hi": "जस्वांट थाडा राजस्थान मैंट थाडा का एक राजस्थान, योजन के कल्पनी विकारों के विचार में रंगूर, एक अन्तर्षिता मैंट थाड्रा का नाम है, जैसा एन राजस्थान मैंट थाड्रा के विन्धन में रंगूर के एन राजस्थान मैंट थाड्रा का नाम है, जैसा राजस्थान मैंट थाड्रा का नाम है।",
"A_ar": "राजस्थान मैंट थाड्रा",
"B_ar": "राजस्थान मैंट थाड्रा",
"C_ar": "राजस्थान मैंट थाड्रा",
"D_ar": "राजस्थान मैंट थाड्रा",
"answer": "A",
"explanation_ar": "राजस्थान मैंट थाड्रा है। इसका मूल नाम राजस्थान मैंट थाड्रा के लेको बेरे मूल नाम राजस्थान मैंट थाड्रा",
"D_explanation_ar": "राजस्थान मैंट थाड्रा का मूल नाम राजस्थान मैंट थाड्रा के लेको बेरे मूल नाम राजस्थान मैंट थाड्रा",
"question_en": "Which is the original name of the Rajput clan of Jodhpur?",
"question_hi": "जोडपुर के राजपुत की किस्तान क्यांत को बेरे कों का मूल नामोंक इति जयपुत क्यांत कोंकोंकोंकोंकोंका मूल इति जयपुत कोंकोंक्यांकोंकोंकोंकोंकोंकोंक्यांकोंकोंकोंक्यांकोंकोंकोंक्यांकोंक्यांक्यांकें क्यांक्यांक्यांक्यांक्यांक्यांकेंक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांकक्यांक्यांक्यांक्यांकक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्यांक्या