[
{
"subject": "Rajasthan History",
"topic": "Rajputana Army",
"question_en": "Which of the following Rajputana armies was famous for its cavalry expertise?",
"question_hi": "राजपूता युद्धिकरणों में उल्लेखित कौन-सा खुश्यापूर में खुशी के लिए खुशी कामतली प्रमाणों में उल्लेखित थे?",
"A_en": "The Khilji dynasty",
"A_hi": "खिल्जी संतता",
"B_en": "The Rana dynasty",
"B_hi": "राणा संतता",
"C_en": "The Tughlaq dynasty",
"C_hi": "तुलक",
"D_en": "The Mughal Empire",
"D_hi": "मुगल संतता",
"answer": "B",
"explanation_en": "The Rana dynasty was famous for its cavalry expertise during the medieval period in Rajasthan. The Ranas were known for their skill in horseback riding and battle tactics, making them effective warriors.",
"explanation_hi": "राणा संतता राजदूतों का नाम मध्यराजशान में मध्यराजशान की उत्तरराजशान में मेरा गैरज़शान का उच्चारज़शान में मध्यराजशान का उच्चारज़शान में मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान मेरा गैरज़शान का उच्चारज़शान का उचारज़शान का उच्चारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उचारज़शान का उ