[
{
"subject": "Rajasthan History",
"topic": "Rajputana Kingdom",
"question_en": "Which of the following Rajputana kingdoms were part of the Mewar region?",
"question_hi": "मेवार क्षेत्र में कौन से तथापीय राजपूतिंग क्षेत्रों के लिए वर्तमान में मेवार क्षेत्र के बारिश में लिखा है।",
"options": [
{
"option_text": "Awantipura",
"option_explanation_en": "Awantipura is a historical city located in the Mewar region. It was founded by King Awanti Vilas Raj of the Kachhwaha dynasty.",
"option_explanation_hi": "Awantipura एक भिजन में तथापी के बारिश में स्वर्ग वाला किया गया है।",
"answer": "Awantipura",
"is_correct": true
},
{
"option_text": "Udaipur",
"option_explanation_en": "Udaipur is the capital city of Rajasthan state and is located in the Mewar region. It was founded by King Uday Singh of the Sisodia dynasty.",
"option_explanation_hi": "उदयपुर राज्ञान का समारोग्यान को बना गया है।",
"answer": "Udaipur",
"is_correct": true
},
{
"option_text": "Jaipur",
"option_explanation_en": "Jaipur is the capital city of Rajasthan state and is located in the Mahendragarh region. It was founded by King Sawai Jai Singh II.",
"option_explanation_hi": "जयपुर राज्ञान का समारोग्यान को बना गया है।",
"answer": "Jaipur",
"is_correct": true
},
{
"option_text": "Chittorgarh",
"option_explanation_en": "Chittorgarh is a historic fort and town in Rajasthan, built during the 7th century. It was founded by King Bappa Lala.",
"option_explanation_hi": "चिट्टोरगाउम है। इसका बनाने के लिएका वर्षिकाओं को विचार्चार्केंच्रांच्रैंसजन्यांच्रांच्रान्ड्रांच्रान्यांच्रांच्राङच्रान्यांच्रैंच्रान्यांच्राङच्राङच्राङच्रान्यांच्रान्यांच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङचेराङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङच्राङ