[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Families",
"question_en": "Which royal family ruled Jodhpur?",
"question_hi": "जोधपुर के राज्य के राजधानी के वर्ग क्या थे।",
"A_en": "Meghraj",
"A_hi": "मेघजी",
"B_en": "Rathore",
"B_hi": "रातौर",
"C_en": "Bhati",
"C_hi": "भाटी",
"D_en": "Jhalori",
"D_hi": "झालोरी",
"answer": "B",
"explanation_en": "The royal family that ruled Jodhpur is Rathore. The Rathore clan was led by Maharaja Jagdev Singh, who was known as Rao Bika Ji after becoming a ruler. The Rathores are one of the prominent Rajput clans in Rajasthan and played a significant role in the history of the region.",
"explanation_hi": "Jodhpur ki Rājyā kā rajāyon ka karigar Rāthor hain. Rāthore clan me Maharaja Jagdev Singh, ruler bādha diye toh Rao Bika Ji रावणी के नाम से जानने करने की महानगावने के विभिजन मैं श्रेणी की पूर्वागत के में शाहित के ने श्रेणी के विभिजन के शाहित के विभिजन मैं शाहित के पूर्वागत के शाहित के विभिजन मैं शाहित के श्रेणी के पूर्वागत के शाहित के विभिजन मैं शाहित के श्रेणी के पूर्वागत के शाहित के विभिजन मैं शाहित के श्रेणी के पूर्वागत के विभिजन मैं शाहित के श्रेणी के पूर्वागत के विभिजन मैं शाहित के श्रेणी के पूर्वागत के विभिजन मैं शाहित के श्रेणी के पूर्वागत के विभिजन मैं शाहित के श्रेणी के पूर्वागत के विभिजन मैं शाहित के श्रेणी के पूर्वागत के विभिजन मैं शाहित के श्रेणी के पूर्वागत के विभिजन मैं शाहित के श्रेणी के विभिजन मैं शाहित के श्रेणी के विभिजन मैं शाहित के श्रेणी के विभिजन मैं शाहित के श्रेणी के विभिजन मैं शाहित के श्रेणी के विभिजन मैं शाहित के श्रेणी के विभिजन मैं शाहित के श्रेणी के विभिज्रन सिरन मैं शाहित के श्रेणी के विभिजन सिरन सिरे के शाहित के विभिज्रे सिरे हिरे के विभिजन सिरे के के विभिरे हिरे किरे के विभिजन सिरे के हिरे के विभिजे के के हिरे के के के के के हिरे के के के के हिरे के के के के किरे के के के के के के के के के किरे किरे के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के Rajasthan के के के के के के के के के के के के क