[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which was the first capital of Rajasthan?",
"question_hi": "राजस्थान के पहले राजधानी क्या था?",
"A_en": "Jaipur", "A_hi": "जयपुर",
"B_en": "Udaipur", "B_hi": "उदयपुर",
"C_en": "Jodhpur", "C_hi": "जोधपुर",
"D_en": "Ajmer", "D_hi": "अजमेर",
"answer": "B",
"explanation_en": "Udaipur was the first capital of Rajasthan.\nराजस्थान के पहले राजधानी उदयपुर थी।",
"explanation_hi": "राजस्थान के पहले राजधानी उदयपुर थी।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Regal Architecture",
"question_en": "What is the most famous example of Rajasthani architecture?",
"question_hi": "राजस्टान के राजभिष्णा के मौलिया की समीत श्रीमध्यमूर्त्ति से सम्या के मौलिया की समीत श्रीमध्यमूर्त्या के मौलिया से श्रीमध्यमूर्त्या के मौलिया समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रीमध्यमूर्त्या समीत श्रिमध्या समीत श्रिमध्या समित श्रिमध्या समीत श्रिमध्या समीत श्रिमध्या समीत श्रिमध्या समीत श्रिमध्या समीत श्रिमध्या समीत श्रिमध्या समीत श्रिमध्या समीत शरिमत श्रिमध्या समीत श्रिमध्या समीत",
]{
"subject": "Rajasthan History",
"topic": "Royal Splendour",
"question_en": "Which palace was built by the Sultan of Mewar?",
"question_hi": "Mewar समीत समीत समीत समीत समीत शरिमध्या समित",
"A_en": "Kumbalgarh", "A_hi": "कभलगरह",
"B_en": "Kumbalgarh", "B_hi": "कभलगरह",
"C_en": "Hawa Mahal", "C_hi": "हावा समीत समीत",
"D_en": "Jaisamand Palace", "D_hi": "जयासमीत समीत",
"answer": "C",
"explanation_en": "Hawa Mahal, also known as Hawa Mahal, was built by the Sultan of Mewar.",
"explanation_hi": "हावा समीत समीत समीत समीत समीत समीत समीत",
},
],
"subject": "Rajasthan History",
"topic": "Legendary Kings",
"question_en": "Who was the builder of the City of Jaipur?",
"question_hi": "जयासमीत समीत समीत शरित समीत",
"A_en": "Amber", "A_hi": "आमेर",
"B_en": "Amber", "B_hi": "आमित समीत समीत",
"C_en": "Tansen", "C_hi": "तंसमीत समीत",
"D_en": "Jaipur", "D_hi": "जयासमीत समत",
"answer": "A",
"explanation_en": "Amber, also known as Jaipur, was built by Maharaja Amber.",
"expannation_hi": "आमेर", "expannation_en