[
{
"subject": "Rajasthan History",
"topic": "Rajput Kings",
"question_en": "Which Rajput king is considered the founder of Mewar?",
"question_hi": "मेवार के संस्थान को कौन से राज्य क्षेत्र के संस्थान का संतुष्ट है।",
"A_en": "Rao Jodha", "A_hi": "राव जोधा",
"B_en": "Bappa Rawal", "B_hi": "बापा राव",
"C_en": "Harshavardhan", "C_hi": "हर्षवर्धन",
"D_en": "Rao Bika", "D_hi": "राव बिका",
"answer": "B",
"explanation_en": "Bappa Rawal is considered the founder of Mewar, as he established the kingdom of Mewar in the 11th century.\n\nEnglish answer: Bappa Rawal",
"explanation_hi": "11वेंद्र मेवार के संतुष्ट है कि उन्नीस वर्षों में मेवार के संतुष्ट है कि उन्नीस वर्षों में मेवार के संतुष्ट है कि उन्नीस वर्षों में मेवार सम्मान में उन्नीस वर्षों में मेवार सम्मान में उन्नीस वर्षों में मेवार सम्मान",
"A_en": "Rao Bika",
"A_hi": "राव बिका",
"B_en": "Rao Devi",
"B_hi": "राव दी",
"C_en": "Rao Anci",
"C_hi": "राव अंची",
"D_en": "Bhopal Singh",
"D_hi": "भोपाल सिंग",
"answer": "D",
"explanation_en": "In the year 1334 AD, Bhopal Singh established the rule of Mewar after defeating Rao Bika and Rao Devi.\nEnglish explanation:\nIn १३३४ बीस ईया, भोपाल सिंग ने मेवार के लिए मेली और राव दी को प्रधान बढ़ाई और राव दी को मेली के लिए मेवार के लिए मेली को प्रधान बढ़ाई और राव दी को मेली के लिए मेवार के लिए मेली को प्रधान बढ़ाई और राव दी को मेली के लिए मेवार के लिए मेली को प्रधान बढ़ाई और राव दी को मेली के लिए मेवार के लिए मेली को प्रधान बढ़ाई और राव दी को मेली के लिए मेवार के लिए मेली को प्रधान बढ़ाई और राव दी को मेली के लिए मेवार के ली को प्रधान बढाई और राव दी को मेवार के ली को परधान बढाई और राव दी को मेवार को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को पर राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधान बढाई और राव दी को परधा