[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which historical site is associated with the famous Marwar Sultanate?",
"question_hi": "मर्वाई सत्तारापुर के सभी स्थल क्या है।",
"A_en": "Amber Fort", "A_hi": "अमेरिका किस सभी स्थल है।",
"B_en": "Jaigarh Fort", "B_hi": "जैगरहाल के सभी स्थल है।",
"C_en": "Meena Bazaar", "C_hi": "मेना बाजार के सभी स्थल है।",
"D_en": "Samode Haveli", "D_hi": "समोद हावेल के सभी स्थल है।",
"answer": "B",
"explanation_en": "Jaigarh Fort is the combined site of Amber Fort and Nahargarh Fort.",
"explanation_hi": "जैगरहाल के सभी स्थल है। Nahargarh Fort aur Amer Fort ka samarthan है।",
},
{
"subject": "Rajasthan History",
"topic": "Queens of Rajasthan",
"question_en": "Which queen of Rajasthan was well known for her contributions to the state's development?",
"question_hi": "राजस्थान को उन पुराणी महरूंगमेंगमेंगे को सभी प्रीति है।",
"A_en": "Princess Karni",
"A_hi": "कारणी पुराणी है।",
"B_en": "Princess Ummed Bhagwan",
"B_hi": "उमेद भाग्मन पुराणी है।",
"C_en": "Princess Bhanwas",
"C_hi": "बहानवास पुराणी है।",
"D_en": "Princess Durgi",
"D_hi": "धुर्गी पुराणी है।",
"answer": "B",
"explanation_en": "Princess Bhanwas is known for her contributions to the development of Rajasthan.",
"explanation_hi": "प्रीति बहानवास ने राजस्थान के विकास को विकासता के विभागे में महिंदी सहमानि प्रेमरी के विभागों में महिंदी सहमानी प्रेमरी के विभागों में महिंदी सहमानि प्रेमरीयां के विभागों में महिंदी सहमानी प्रेमरीयां के विभागों में महिंदी सहमानि प्रेमरीयाँ के विभागों में महिंदी सहमानी प्रेमरीयाँ के विभागों में महिंदी सहमानी प्रेमरीयाँ के विभागों में महिंदी सहमानी प्रेमरीयाँ के विभागों में महिंदी सहमानी प्रेमरीयाँ के विभागों में महिंदी सहमानी प्रेमी के विभागों में मी सहमानी के विभागों मी सहमानी के विभागों मी सहमानी के विभागों मी के विभागों मी के विभागों मी के विभागों मी के विभागों की के विभागों मी के विभाी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागे के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागे के विभागी के विभागी के विभागे के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के विभागी के