[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous palace in Jaipur was completed in 1799?",
"question_hi": "जयपुर में 1799 के सालों में पूरा हुआ हुआ है।",
"A_en": "Amer Fort", "A_hi": "आमर दरबाजी",
"B_en": "Hawa Mahal", "B_hi": "हवा महाल",
"C_en": "Cenotaph of Maharaja Sawai Jai Singh II", "C_hi": "महाराजा सवाई जयसिंगी द्वारा श्रमिका",
"D_en": "Palace of Winds", "D_hi": "वाहनों का मंगल",
"answer": "B",
"explanation_en": "The Hawa Mahal is a famous palace in Jaipur that was completed in 1799.",
"explanation_hi": "Jaipur mein 1799 के सालों में पूरा हुआ है।",
"explanation": "यह एक नामी निवर्तीना है।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Independence",
"question_en": "When did Rajasthan become independent from Mughal Empire?",
"question_hi": "अर्थां क्या राज्य 1947 में अमेरूस मुग्ल जमीन के निवर्तीना है।",
"A_en": "1947",
"A_hi": "1947",
"B_en": "1945",
"B_hi": "1945",
"C_en": "1931",
"C_hi": "1931",
"answer": "A",
"explanation_en": "Rajasthan gained independence from the Mughal Empire in 1947.",
"explanation_hi": "राज्य मुग्ल जमीन के पूर्वासना है।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthani Culture",
"question_en": "What is the origin of Rajasthani folk art?",
"question_hi": "राजस्थान मैनेवार क्या मानून निवर्तीना है।",
"A_en": "Rajasthani Folk Music",
"A_hi": "राजस्थान भीमैनेवार",
"B_en": "Rajasthani Folk Dance",
"B_hi": "राजस्थान कालाशी",
"C_en": "Rajasthani Folk Painting",
"C_hi": "राजस्थान मैनेवार",
"D_en": "Rajasthani Folk Literature",
"D_hi": "राजस्थान बचनार",
"answer": "B",
"explanation_en": "Rajasthani folk dance, Bansuri, is the origin of Rajasthani folk art.",
"explanation_hi": "राजस्थान कालाशी, राजस्थान बचनार",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Independence",
"question_en": "What was the date of Rajasthan's independence from British rule?",
"question_hi": "राजस्थान भारत के बुरिशियान की सत्तान भारत के बुरिशियान के बारबारिशियान की सत्तान भारतियान के बारबारिशियान की सत्तान भारतियान के बारबारिशियान की सत्तान भारतियान के बारबारिशियान भारतियान की सत्तान भारतियान की सत्तान भारतियान की सत्तान भारतियान की सत्तान भारतियान की सत्तान भारतियान की सत्तान भारतियान की सत्तान भारतियान की सत्तान भारतियान की सत्तान भारतियान की सत्तान भारतियान की सत्तान भारतियान की सत्तान भारतियान की सत्तान भारतियान की सत्तान भारतियान की सत्तान भारत्तान की सतान भारतियान भारत्तान भारतियान भारत्तान की सत्तान भारत्तान भारत्तान भारतियान भारतियान भारतान भारत्तान भारत्तान भारत्तान भारत्तान भारत्तान भारत्तान भारत्तान भारत्तान भारत्तान भारतान भारत्तान भारत्तान भारत्तान भारतान भारत्तान भारत्तान भारत्तान भारत्तान भारत्तान भारत्तान भारत्तान भारत्तान भारतान भारत्तान भारत्तान भारत्तान भारत्तान भारत्तान भारत्तान