[
{
"subject": "Rajasthan History",
"topic": "Rajput Kingdoms",
"question_en": "Which Rajput kingdom was established in the 10th century and played a significant role in the Chahamana Dynasty?",
"question_hi": "10वें सदी में पैदा किया गया राजपूत कंगोल, जिन्हें चाहमान द्वारा प्रेरित किया गया शहादयंगत प्रदेश का जन्मदिन कैसा है ?",
"A_en": "The anniversary of the birth of the Pratihara Kingdom is celebrated every year in Rajasthan.",
"A_hi": "राजस्थान में प्रथम प्रतिविधि की जन्मदिन कैसा है ?",
"B_en": "The birth anniversary of the Mewar kingdom is celebrated as Pratihar Jayanti in Rajasthan.",
"B_hi": "येरों की जन्मदिन की समय कैसा है ?",
"C_en": "The birth anniversary of the Merta kingdom is celebrated as Merti Jayanti in Rajasthan.",
"C_hi": "सेवा की जन्मदिन की समय कैसा है ?",
"D_en": "Pratihar Rajputs are celebrated as Pratihar Jayanti in Rajasthan.",
"D_hi": "प्रतिहर जमीन की जन्मदिन की समय कैसा है ?",
},
{
"subject": "Rajasthan",
"topic": "Historical Sites",
"question_en": "Which fort served as a symbol of Rajasthani bravery and valour? (राजस्थान के लगाव के शीघराव के सम्मान मंत्रैंगन के स्पर्शिका के विश्वरूणी के शीघराव के समान की खंडराव के सम्मान मंत्रैंगन के एक विश्वरूणी के समान के शीघराव के सम्मान में एक कालनलालालाल के शीघराव के समान की खंडराव के सम्मान में एक गुणाललालाल के शीघराव के समान के दिनमान में एक कालनलालालालालाले के शीघराव के समान के दिनमान में एक गुणाललालालालालालालाले के शीघराव के समान के दिनमान में एक गुणाललालालालालालालालालालालालालाले के शीघराव के समान के दिनमान में एक गुणालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालालाला लालालालालालालालालालालालालालालालालालालालाला लालालालालालाला",
Let us know the correct answer is: D,"
"answer": "D",
"explanation_en": "The correct answer is D, as the Pratap Singh kingdom was the first kingdom established in Rajasthan and is known as Pratapgarh.",
"explanation_hi": "लालालालालालालालालालालालालालालालालाला",
},
{
"subject": "Rajasthan History",
"topic": "Pratapgarh",
"question_en": "What is the origin of Pratapgarh?",
"question_hi": "प्राटपटटटट्टटट टटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटटट