[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which dynasty ruled Rajasthan before the Marathas?",
"question_hi": "राजस्थान मराठी से पहले किस दन्तेदारी राजस्थान में चली गई थी?",
"A_en": "Mewar Dynasty",
"A_hi": "मेवार दन्तेदारी",
"B_en": "Chauhans",
"B_hi": "चौहाने",
"C_en": "Tomar Dynasty",
"C_hi": "तोमार दन्तेदारी",
"D_en": "Tughlaq Dynasty",
"D_hi": "तिगल्कल दन्तेदारी",
"answer": "B",
"explanation_en": "The Chauhan dynasty ruled Rajasthan before the Mewar and Tughlaq dynasties. Rajasthan was under the rule of the Chauhans until the 12th century when the Mewar Dynasty took over. Later in the 14th century, the Tughlaq Dynasty also ruled Rajasthan for some time.",
"explanation_hi": "चौहाने राजस्थान को 12वे संवत मेवार द्यांजीवर पूर्व निवार राजस्थान के ठिन्ते पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन्दिर मेवार पूर्व राजस्थान को सन को मेवार पूर्व राजस्थान को मवार पूर पूर्व राजस्थान को मेवार पूर्व राजस्थान को मेवार पूर्व राजस्थान को मेवार पूर्व राजस्थान को मेवार पूर्व राजस्थान को मेवार पूर्व राजस्थान को मेवार पूर्व राज्थान को मेवार पूर्व राजस्थान को मेवार",
"
{
{
"subject": "Rajasthan History",
"topic": "Rajasthan History",
"question_en": "Who was the first capital of Rajasthan?",
"question_hi": "राजस्थान को मेवार राजस्थान को मेवार पूर्व राजस्थान को मेवार पूर्व राजस्थान को मेवार पूर्व राजस्थान को मेवार पूर्व राजस्थान को मेवार",
"A_en": "Ajmer",
"A_hi": "आंज केव राजस्थान क