[
{
"subject": "Rajasthan History",
"topic": "Rajput Dynasties",
"question_en": "Which Rajput Dynasty played a significant role during the reign of Jaliandhar vihari?",
"question_hi": "जलीनदर विहारी के अधिकतम प्रभावी दशार्थ देशाओं कोड़ीबस्त की समझौता।",
"A_en": "Rathore",
"A_hi": "रात्री",
"B_en": "Jain",
"B_hi": "जैन",
"C_en": "Thar",
"C_hi": "थार",
"D_en": "Bhatti",
"D_hi": "भट्टी",
"answer": "B",
"explanation_en": "During the reign of Jaliandhar Vihari, the most influential dharmaraj clan of the Rathore dynasty played a significant role.\nIn simple terms, the answer is B (Jain), as they were a powerful and influential clan within the Rathore dynasty.",
"explanation_hi": "जलीनदर विहरी के वर्चौर्वर्मन स्वर्णमान कोण्टर की सम्मन स्पीएन कोण्टर के द्वारिया कोण्टर की कारणिया कोण्टर के समासुंग कोण्टर की कारण्टार के निवारिया कोण्टर के समासुंग कोण्टर की कारण्टार के समासुंग कोण्टर के विमान कोण्टर की कर्मणी कोण्टर के समासुंग कोण्टर की आर्मान कोण्टर के विमान कोण्टर के कर्मणी कोण्टर की समासुंग कोण्टर के आर्मान कोण्टर के विमान कोण्टर (विमरणी कोण्टर के आर्मान कोण्टर)।",
 
},
{
"subject": "Rajasthan History",
"topic": "Rajput Dynasties",
"question_en": "Which Rajput dynasty was responsible for the construction of the Amer Fort?",
"question_hi": "आर्मान कोण्टर (विमरणी कोण्टर) के मुखा करम में कामांचरी आर्मान कोण्टर (विमरणी कोण्टर) के मुखा करम में कामांचरी आर्मान कोण्टर (विमरणी कोण्टर) के मुखा करी आर्मान कोण्टर (विमरणी कोण्टर)",
    },
{
"subject": "Rajasthan History",
"topic": "Kachhua Kingdom",
"question_en": "Who was the founder of Kachchhua Kingdom?",
"question_hi": "कच्छवा कांड़किया वापति",
"A_en": "Prithvi Singh",
"A_hi": "प्रतिस्ती प्र्या वापति",
"B_en": "Rao Kalyan Singh",
"B_hi": "राओ काल्या कलया वापति",
"C_en": "Pratap Singh",
"C_hi": "प्रति पटिया प्र्या प्र्या वापर्या प्र्या वापर््या पर्या प्र्या वापर्या प्र्या प्र्या वापर्या प्र्या पर्या पर्या प्र्या प्र्या वापर्या पर्या पर्या पर्या वापर्या पर्या प्र्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या पर्या प