[
{
"subject": "Rajasthan History",
"topic": "Rajputana Army and Battles",
"question_en": "Which army of Rajputana region participated in the Battle of Haldighati fought in 1576?",
"question_hi": "1576 में हल्दीघर के बैलेट में कौन सा राजपुत्रणा की गैरिया के लिए खुद को पसंदीदे के लिए खुद को पसंदीदे के लिए खुद को पसंदीदे",
"options": [
{
"option_en": "Army of Mewar",
"option_hi": "मेवार",
"A_en": "Mewar army",
"A_hi": "मेवार",
"correct_answer": "A"
},
{
"option_en": "Army of Marwar",
"option_hi": "मर्वार",
"A_en": "Marwar army",
"A_hi": "मर्वार",
"correct_answer": "B"
},
{
"option_en": "Army of Mewar and Marwar",
"option_hi": "मेवार और मर्वार",
"A_en": "Mewar and Marwar army",
"A_hi": "मेवार और मर्वार",
"correct_answer": "C"
}
]
},
{
"subject": "Rajasthan History",
"topic": "Characteristics of Rajasthan",
"question_en": "What is the unique feature of Rajasthan in terms of geographical location?",
"question_hi": "राजस्थान के कैलेन्ट के स्वरून का कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्तर में कैलेन्ट की विस्र में कैलें कैलेन्ट की विस्र में कैलेन्ट की विस्र में कैलेन्ट कैलेन्ट कैलें कैलेन्ट कैलेन्ट कैलें कैलेन्ट कैलेन्ट कैलें कैलेन्ट कैलें कैलें कैलें कैलेन्ट कैलेन्ट कैलें कैलें कैलें कैलेन्ट कैलें कैलें कैलें कैलें",
"options": [
{
{
"option_en": "Sindhi",
"option_hi": "सिलें",
"A_en": "Sindhi",
"A_hi": "सिलें",
"correct_answer": "C"
},
{
{
"option_en": "Arya",
"option_hi": "अरि",
"A_en": "Arya",
"correct_answer": "D"
},
{
"option_en": "Bhag Singh",
"option_hi": "भिलें",
"A_en": "Bhag Singh",
"correct_answer": "B"
}
]
}
]