[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Historical Kings and Cities",
"question_en": "Which king established the city of Udaipur?",
"question_hi": "उदयपुर के लोकांत्रिक राजा और श्रेष्ठां",
"A_en": "Pratap Singh", "A_hi": "प्रताप सिंह",
"B_en": "Arya Samaj", "B_hi": "आर्य सामाज",
"C_en": "Laxminarayan", "C_hi": "लक्ष्मणनराज",
"D_en": "Ajmer Sharif", "D_hi": "अजमेर शरीफ",
"answer": "C",
"explanation_en": "Laxminarayan, also known as Bappa Laxmi, is the legendary king who established the city of Udaipur in Rajasthan. The correct answer is Laxmi Narayan (लक्ष्मणनराज)",
"explanation_hi": "राजस्थान में Udaipur को स्थानी राजदारों के बाप लक्ष्मणनराज के आधी राजदार सिंह के विसाधार सिंह ने Udaipur को स्थानी राजदार स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंह ने Udaipur को स्थानी राजदार सिंहने Udaipur को स्थानी राजदार सिंहने Udaipur को स्थानी राजदार सिंहने Udaipur को स्थानी राजदार सिंहने Udaipur को स्थानी राजदार सिंहने Udaipur को स्थानी राजदार सिंहे Udaipur को स्थानी राजदार सिंहने Udaipur को स्थानी राजदार सिंहने Udaipur को स्थानी राजदार सिंहने Udaipur को स्थानी राजदार सिंहे Udaipur को स्थानी राजदार सिंहने Udaipur को स्थानी राजदार सिंहे Udaipur को स्थानी राजदार सिंहने Udaipur को स्थानी राजदार सिंहने Udaipur को स्थानी राजदार सिंहने क्थानी राजदार सिंहने Udaipur क्थानी राजदार सिंहने Udaipur क्थानी राजदार सिंहने Udaipur क्थानी राजदार सिंहने Udaipur क्थानी राजदार सिंहनी राजदार सिंहने Udaipur क्थानी राजदार सिंहने Udaipur क्थानी राजदार सिंहने Udaipur क्थानी राजदार सिंहनी राजदार सिंहने Udaipur क्थानी राजदार सिंहने Udaipur क्था