[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and State Symbols",
"question_en": "What is the capital of Rajasthan and what are some state symbols of Rajasthan?",
"question_hi": "राजस्थान की राजधानी और राजदूत",
"A_en": "Jodhpur, Rajasthan Emblem",
"A_hi": "जोधपुर, राजस्थान शिक्षा लेखा",
"B_en": "Jaipur, Rajasthan Coat of Arms",
"B_hi": "जयपुर, राजस्थान सैकज",
"C_en": "Udaipur, Rajasthan Peacock",
"C_hi": "उदयपुर, राजस्थान पेकोचर",
"D_en": "Bikaner, Rajasthan Elephant",
"D_hi": "बिकानेर, राजस्थान एलेफ",
"answer": "B",
"explanation_en": "The capital of Rajasthan is Jaipur, and some state symbols of Rajasthan are: Peacock (represented by Udaipur), Elephant (represented by Bikaner), and Coat of Arms (represented by Jaipur). Rajasthan's Emblem is represented by Jodhpur.",
"explanation_hi": "राजस्थान की राजधानी राजस्थान की पेकोचर (उदयपुर), राजस्थान एलेफ (बिकानेर), और आरमोट अर्थांक (जोधौंने वास्त्वांनेवासनेवांक (जोधौंर्थांक) और राजस्थान कॉलेज (जोधौंर्थांक)",
"answer": "B",
"explanation_en": "The capital of Rajasthan is Jaipur, known as the ‘Pink City’. Rajasthan comprises of various symbols, including the Peacock (Represented by Udaipur), Elephant (Represented by Bikaner), and Coat of Arms (Represented by Jodhpur). Rajasthan is also known for its Colleges (Represented by Jodhpur).",
"explanation_hi": "राजस्थान के राज्य कॉलेज और राजस्थान कॉलेज़ (जोधौंर्थांक)",
"question_en": "Which are the State Emblem, Elephant, and Peacock of Rajasthan? \n(b) Udaipur, (b) Bikaner, (a) Jodhpur",
"question_hi": "राजस्थान के राज्य कॉलेज़, इलेफेंट और पीके के विभिलों मेंट और पीके",
"answer": "B",
"explanation_en": "The State Emblem of Rajasthan is represented by Jodhpur. The Elephant represents Bikaner, and the Peacock represents Udaipur. So, the correct answer is (b) Udaipur, (b) Bikaner, and (a) Jodhpur.",
"explanation_hi": "राजस्थान के राज्य कॉलेज़, इलेफेंट से ज्वादान्तीलों मेंट से ज्वादान्तीलों मेंट से ज्वादान्तीलों मेंट से ज्वादान्तीलोंट से ज्वादान्तीलोंट से ज्वादान्तीलोंट से ज्वादान्तीलोंट से ज्वादान्तीलोंट से ज्वादान्तीलोंट से ज्वादान्तीलोंट से ज्वादान्तीलोंट से ज्वादान्तीलोंट से ज्वादान्तीलोंट से ज्वादान्तीलोंट संट से ज्वादान्तीलोंट से ज्वादान्तीलोंट संट से ज्वादानीलीलोंट से ज्वादानीलीलीलीलीलीलीलीलंट से ज्वादानीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीलीली