[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous palace in Jaipur was built by Maharaja Jai Singh II?",
"question_hi": "जयपुर महाराजा जयसिंह सिंह द्वारा बनाया गया एक फ़ोंकरे के नाम क्या है।",
"A_en": "Hawa Mahal",
"A_hi": "हावा महाल",
"B_en": "Amer Fort",
"B_hi": "अमेर फोर्ट",
"C_en": "Cenotaph of Maharaja Sawai Mansingh II",
"C_hi": "सवाई सावाई मानसिंह द्वारा को बनाया गया एक फ़ोंकरे के नाम क्या है।",
"D_en": "Palace of Winds",
"D_hi": "रावणी फोन्करे",
"answer": "D",
"explanation_en": "The Palace of Winds, also known as Hawa Mahal, was built by Maharaja Sawai Mansingh II in Jaipur, Rajasthan. It is a five-storied building with a unique design that allows the wind to enter the palace through its many windows. This palace is a popular tourist attraction.",
"explanation_hi": "महाराजा सावाई मांसिंह, जयपुर, राजस्थान में यह एक बीस संतुल बिन्हिंदी दीनी के नाम क्या है।",
"answer": "B",
"explanation_en": "The City Palace of Udaipur, also known as Lake Palace, was built by Maharana Udai Singh II in Udaipur, Rajasthan. It is a large palace complex built overlooking Lake Pichola. This palace is also a popular tourist attraction.",
"explanation_hi": "उदयपुर महराना उदयनी के नाम क्या है।",
"answer": "A",
"explanation_en": "Mansingh ki Raja Maharana Pratap ki rājā मांसिंगोनी के नाम क्या है।",
"explanation_hi": "मांसिंगोनी के नाम क्या है।",
"answer": "C",
"explanation_en": "The City Palace of Udaipur, also known as the Lake Palace, was built by Maharana Udai Singh II overlooking Lake Pichola. This palace is a blend of Rajasthani and Mughal styles of architecture.",
"explanation_hi": "उदयपुर मैंसिंगोनी के नाम क्या है।",
"answer": "B",
"explanation_en": "Monsoon Palace, also known as the City Palace of Udaipur, was built by Maharana Udai Singh II. It is located next to Lake Pichola and combines Rajasthani and Mughal architectural styles.",
"explanation_hi": "मांसिंगोनी के नाम क्या है।",
"answer": "D",
"explanation_en": "Meena Bhavan, also known as the City Palace of Udaipur, was built by Maharana Udai Singh II. It is situated on the banks of Lake Pichola and is an example of Rajasthani and Mughal architectural styles.",
"explanation_hi": "मेना भवान, उदयपुर के नाम क्या है।",
"answer": "E",
"explanation_en": "Kirti Stambh, also known as the City Palace of Udaipur, was built by Maharana Udai Singh II. It stands tall and is an example of Rajasthani and Mughal architectural styles.",
"explanation_hi": "कीर्ति स्टेंब, उदयपुर के नाम क्या है।",
"answer": "F"
]