[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous ruler of Rajasthan was known for his architectural contributions?",
"question_hi": "राजस्थान में कौन से अपने आरचीजनों के लिए जाने के लिए जाने के लिए जाने के लिए जाने के लिए जाने के लिए जाने के लिए जाने के लिए जाने के लिए जाने के लिए जाने के लिए",
"question_hi": "राजस्थान में कौन से लोगों के लिए, जाने के लिए, जाने के लिए",
"A_en": "Who was the ruler of Mewar during the reign of Rana Kumbha?",
"A_hi": "मेरा रानी कुब्ह के अंगलों के लिए",
"B_en": "Which famous fort is situated in Udaipur?",
"B_hi": "उदायपुर में कौरम्यां के लिए",
"C_en": "Which Mughal Emperor was responsible for the construction of the Mehrangarh Fort?",
"C_hi": "मेरंगार के लिए कौरम्या अंगलों के लिए",
"D_en": "Which ruler laid the foundation of the City Palace in Jaipur?",
"D_hi": "जायपुर के लिए कौरम्या अंगलों के लिए",
"E_en": "Which of the following kings established the Amer Fort?",
"E_hi": "अयांमेया अंगलों के लिए",
"F_en": "Which queen ruled during the reign of Rao Jodha?",
"F_hi": "राव योदह का विभागी कौरम्या अंगलों के लिए",
"G_en": "Who was the builder of the City Palace in Jaipur?",
"G_hi": "जायपुर के लिए कौरम्या अंगलों के लिए",
"H_en": "Which Mughal emperor established the Fatehpur Sikri?",
"H_hi": "फटहरन सिक्री के लिए",
"I_en": "Which famous queen of Jaipur is associated with the construction of the Hawa Mahal?",
"I_hi": "जायपुर मैंगल के लिए",
"J_en": "Which era did the Bundi ruler Rao Khushal Singh belong to?",
"J_hi": "बुंदी के राजन राउंज कुषल सिंग के लिए",
"K_en": "Which Mughal emperor was responsible for the construction of the City Palace at Jaisalmer?",
"K_hi": "जाएसलमेर के लिए",
"L_en": "Which historical monument is associated with the rulers of Jodhpur?",
"L_hi": "जोध्र के लिए",
"M_en": "Which emperor was responsible for the construction of the Amer Fort?",
"M_hi": "अर्मैर के लिए",
"N_en": "Which 18th century ruler of Jaipur is known for the construction of the Hawa Mahal?",
"N_hi": "जाएसलमेर के लिए",
"O_en": "Which famous queen is associated with the construction of the Chittorgarh Fort?",
"O_hi": "झीट्रोगढ़र के लिए",
"P_en": "Which Mughal emperor established the City Palace in Jaisalmer?",
"P_hi": "जाएसलमेर के लिए",
"Q_en": "Which medieval ruler built the Amber Fort?",
"Q_hi": "अरमैर के लिए",
"R_en": "Which historical figure is associated with the Birla Mandir?",
"R_hi": "बिला मांडन के लिए",
"S_en": "Which Mughal emperor is known for the construction of the Jain Temple?",
"S_hi": "जाएमैर के लिए",
"T_en": "Which ruler built the Chitta Fort?",
"T_hi": "झीटामैर के लिए",
"U_en": "Which ruler built the Amber Fort?",
"U_hi": "अरमैर के लिए",
"W_en": "Which dynasty was responsible for the construction of the City Palace?",
"W_hi": "झीटामैर के लिए",
"X_en": "Which queen is associated with the construction of the Ranthambh fort?",
"X_hi": "झीटारमैर के लिए",
"Y_en": "Which Maurya ruler built the Amer Fort?",
"Y_hi": "अरमैर के लिए",
"Z_en": "Which emperor built the Chittorgarh Fort?",
"Z_hi": "झीटारमैर के लिए",
"AA_en": "Which king was responsible for the construction of the Amber Fort?",
"AA_hi": "अरमर के लिए",
"BA_en": "Which emperor constructed the Amber Palace?",
"BA_hi": "झीटार के लिए",
"BB_en": "Which king built the Amer Fort?",
"BB_hi": "अरमीटार के लिए",
"BC_en": "Which king constructed the Amer Palace?",
"BC_hi": "अरमैर के लिए",
"BD_en": "Which Mughal emperor built the Chittorgarh Fort?",
"BD_hi": "अरमीटार के लिए",
"BE_en": "Which Maharana built the Amer Fort?",
"BE_hi": "अरमीटार के लिए",
"BF_en": "Which ruler built the Amer Palace?",
"BF_hi": "अरमीटार के लिए अरमे लिए",
"CG_en": "Which Rajput king built the Amer Fort?",
"CG_hi": "अरमीटार के लिए",
"CH_en": "Which ruler constructed the Amer Palace?",
"CH_hi": "अरमीटार के लिए",
"DG_en": "Which ruler built the Amer Fort?",
"DG_hi": "अरमीटार के लिए",
"DH_en": "Which Hindu king built the Amer Fort?",
"DH_hi": "अरमीटार के लिए",
"DI_en": "Which ruler built the Amer Palace?",
"DI_hi": "अरमिए",
"DJ_en": "Which Hindu king constructed the Amer Fort?",
"DJ_hi": "अरमीटार के लिए",
"DL_en": "Which ruler founded the Amer Fort?",
"DL_hi": "अरमीटा