[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Famous Monuments",
"question_en": "What is the capital of Rajasthan and which famous monument is located in Jaipur?",
"question_hi": "राजस्थान की राजधानी और जापनी में प्रतिष्ठित में से एक में जापनी में स्थित एक में स्थित है।",
"A_en": "Jaipur",
"A_hi": "जापनी",
"B_en": "Amer Fort",
"B_hi": "आमे",
"C_en": "Hawa Mahal",
"C_hi": "हावा महाल",
"D_en": "Central Museum",
"D_hi": "प्राधिकारी",
"answer": "B",
"explanation_en": "The capital of Rajasthan is Jaipur, and the famous monument located in Jaipur is Amer Fort (Amer Fort). Amer Fort, also known as Amer Fort, is a historic palace situated on a hilltop and is one of the most visited tourist attractions in Jaipur.",
"explanation_hi": "राजस्थान के राजधानी है जापनी, जापनी में स्थित एक भाषा कालय है। जापनी के हिली पहली होते हैं एम एम स्थित है। यहां एम एम का एम देते हैं एम, यहां एम एम देते हैं एम एम स्थित है।",
"answer": "B",
"explanation_en": "The capital of Rajasthan is Jaipur, and the famous monument located in Jaipur is Amer Fort (Amer Fort). The Amer Fort, also known as Amer Fort, is a historical palace situated on a hilltop and attracts tourists from all over the world.",
"explanation_hi": "राजस्थान के राजधानी है जापुर, और जापुर में आर एम एम (आर एम एम देते हैं आर एम एम (आर एम एम देते हैं आर एम एम (आर एम एम देते हैं आर एम एम (आर एम एम देते हैं आर एम एम (आर एम एम देते हैं आर एम एम (आर एम एम देते हैं आर एम एम (आर एम एम देते हैं आर एम एम (आर एम एम देते हैं आर एम एम (आर एम एम देते हैं आर एम एम (आर एम एम देते हैं आर एम एम (आर एम एम देते हैं आर एम एम (आर एम एम एम देते हैं आर एम एम (आर एम एम एम एम देते हैं आर एम एम एम (आर एम एम एम देते हैं आर एम एम एम (आर एम एम एम एम एम (आर एम एम एम एम)",
	
"explanation_en": "The capital of Rajasthan is Jaipur, and one of the famous monuments in Jaipur is Amer Fort (Amer Fort). Amer Fort is a historical palace situated on the top of a hill and attracts tourists from across the world.",
"explanation_hi": "राजमा नानन राजमा नान नन नानननानाननान नान।",
"A_en": "Amer Fort",
"A_hi": "आर एम",
"B_en": "Jaipur",
"B_hi": "राजमा नाननानननन।",
"C_en": "Hawa Mahal",
"C_hi": "हावा नानानननननन।",
"D_en": "Rajasthan",
"D_hi": "राजमा ननननननननननन।",
"answer": "D",
"explanation_en": "Rajasthan is the state and Jaipur is its capital. Jaipur is a popular city in Rajasthan, and one of its famous monument is Rajasthan",
"explanation_hi": "राजमा नाननननननननन।",
"A_en": "Rajasthan",
"A_hi": "राजमा नानननननननननन।",
"B_en": "Jaisa",
"B_hi": "राजमा नाननननननननननननन।",
"C_en": "Rajasthan",
"C_hi": "राजमा नाननननन।",
"D_en": "Jaipur",
"D_hi": "राजमा नाननननन।",
"answer": "D",
"explanation_en": "Jaipur is the capital city of Rajasthan and Amer Fort is a famous monument located in Jaipur.",
"explanation_hi": "राजमा नानननननननननननननन।",
"A_en": "Jaisa",
"A_hi": "राजमा नानननननननन।",
"B_en": "Jaipur",
"B_hi": "राजमा नानन।",
"C_en": "Jaisa",
"C_hi": "राजमा नानननननननन।",
"D_en": "Rajasthan",
"D_hi": "राजमा नानननननन।",
"answer": "D",
"explanation_en": "Jaipur is the capital state of Rajasthan and Amer Fort is a famous monument located in Jaipur.",
"explanation_hi": "राजमा नानननननननननन।"
] राजमा नाननननननन।",
"A_en": "Jaisa",
"A_hi": "राजमा नाननननननननन।",
"B_en": "Jaisa",
"B_hi": "राजमा नाननननननन