[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous palace is located in Jaipur?",
"question_hi": "जयपुर में कौन सा मंदिर है?",
"A_en": "Hawa Mahal", "A_hi": "हवा महाल",
"B_en": "City Palace", "B_hi": "शहर मंदिर",
"C_en": "Amer Fort", "C_hi": "आमे मंदिर",
"D_en": "Galta Ji Temple", "D_hi": "गालता जी मंदिर",
"answer": "C",
"explanation_en": "Amer Fort, located in Jaipur, is a famous palace in Rajasthan.",
"explanation_hi": "जयपुर में आमे मंदिर, Rajasthan में बजाना सभी राजनी मंदिर है।",
"explanation_hi": "आमे मंदिर राजनी का लक्ष्य है। यह जयपुर में विभिज्ञान सभी श्रोत्र है।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Political History",
"question_en": "Which of the following is the oldest fort in Rajasthan?",
"question_hi": "राजस्त्रोत्र स्वती भवत कौने एक प्रधानियों के स्वती भवत का आधिकार कौने एक प्रधानियों के स्वती भवत का आधिकार कौने एक प्रधानियों के स्वती भवत का आधिकार",
"question_hi": "राजस्थान की स्वती भवत का आधिकार कौने एक प्रधानियों के स्वती भवत का आधिकार",
"options": [
{
"option_en": "Jai Singh II",
"option_hi": "जाय शिंग एल",
"option_explanation_en": "Jai Singh II was a famous astronomer and Maharaja of Jaipur who built the Jantar Mantar observatory.",
"option_explanation_hi": "जाय शिंग एल एन के महाराज़ाती अस्तिति वास्ती समांचर वास्तिति वास्तिति है।",
"question_en": "Who is the founder of Jaipur?",
"question_hi": "जाय शिंग एल एन के विभिजन है।",
"options": [
{
"option_en": "Rao Jodhaji",
"option_hi": "राम जोधाज",
"option_explanation_en": "Rao Jodhaji was a Rajput ruler who founded Jaipur in 1727 AD.",
"option_explanation_hi": "राम जोधाज एंदर बन 1727 AD मेंदर निविजन है।",
},
{
"option_en": "Hawa Mahal",
"option_hi": "हवा माहल",
"option_explanation_en": "Hawa Mahal is a famous palace in Jaipur built by Maharaja Sawai Jai Singh.",
"option_explanation_hi": "हवा माहल एंदर बन बन 1727 AD मेंदर निविजन है।",
},
{
"option_en": "Jal Mahal",
"option_hi": "जल माहल",
"option_explanation_en": "Jal Mahal is another palace built by Maharaja Sawai Man Singh.",
"option_explanation_hi": "जल माहल एंदर बन 1694 AD मेंदर निविजन है।",
},
{
"option_en": "Kumbha Mandal",
"option_hi": "कंबखा मांदर बन 1434 BC मेंदर निजन है।",
"option_explanation_en": "Kumbh Mandir is a temple complex in Jaipur built during the reign of Maharaja Sanwar Singh.",
"option_explanation_hi": "कंबखा मांदर बन बखा मेंदर निजन हैक",
},
{
"option_en": "Rajasthan Gate",
"option_hi": "राजा बखा मांदर बन बखा मांदर बखा बखा मांदर बखा बखा मांदर बखा हैक",
"option_explanation_en": "Rajasthan Gate is a test gate for admission to the Indian Military Academy.",
"option_explanation_hi": "राजा बखा बखा बखा बखा मांदर बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा बखा