[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous palace is located in Jaipur?",
"question_hi": "जयपुर में कौन सा पल्की आसन्द्रनाथगढ़ का एक अनुमानित स्थल है।",
"A_en": "Amer Fort",
"A_hi": "आमे मंदिर",
"B_en": "Hawa Mahal",
"B_hi": "हावा महाल",
"C_en": "Cenotaph of Maharaja Jai Singh",
"C_hi": "महाराजा जैसिंग के घर्षी का",
"D_en": "Chand Baori",
"D_hi": "चंद बाभर",
"answer": "B",
"explanation_en": "Hawa Mahal is a famous palace located in Jaipur.",
"explanation_hi": "हावा महाल राजमार्जुआ के विशेष पुलिस्तान के मुख्यांक का",
},
{
"subject": "Rajasthan History",
"topic": "Maharana Pratap",
"question_en": "Who is the real hero of the battle of Haldighati?",
"question_hi": "हल्डिगटी के मोहन कौन सत्तांकी निवासी है?",
"A_en": "Pratapsinh",
"A_hi": "प्रतापसिंग",
"B_en": "Chittor Singh",
"B_hi": "चिट्टोर सिंग",
"C_en": "Sangram Singh",
"C_hi": "संगरम सिंग",
"D_en": "Jai Singh",
"D_hi": "जै सिंग",
"answer": "C",
"explanation_en": "Sangram Singh is considered the real hero of the battle of Haldighati.",
"explanation_hi": "संगरम सिंग को हालडिगटी के घाटे में सच्छता मैन सिंग",
},
{
"subject": "Rajasthan History",
"topic": "Rajput History",
"question_en": "Which Rajput king was the founder of Jodhpur?",
"question_hi": "जोधपुर के सत्तामान कौंचा है ?",
"A_en": "Rao Jodhmal",
"A_hi": "राओ झोधमाल",
"B_en": "Rao Jaimal",
"B_hi": "राओ जयमाल",
"C_en": "Rao Kriparam",
"C_hi": "राओ क्रीपांपम",
"D_en": "Rao Bika",
"D_hi": "राओ बिका",
"answer": "B",
"explanation_en": "Rao Jaimal was the founder of Jodhpur. He was one of the generals who played a crucial role in the Battle of Tal Chhapar.",
"explanation_hi": "राओ झयमाल जोधपुर के बनवाल को लिखने के लिखने में सिखना को लिखने को लिखना में सिखने को लिखने को लिखने को लिखना को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लिखने को लाने को लाने को लाने को लाने को लाने को लाने को लाने को लाने को लाने को लाने को लाने को लाने को लाने को लाने को लाने को लाने को लाने के को लाने को लाने को लाने को लाे को लाने के को लाे को लाे को लाे को लाे को लाे के के को लाने को लाे के को लाे को लाे के को लाे के को लाे के को लाे को लाे के को लाे के को लाे को लाे के के के को लाे के को लाे को लाे के के के के को लाे को लाे के के के के के के के के के के के",
के के के के",
},
"answer": "B",
"explanation_en": "Rao Jaisi, a Rajput king, is the correct answer.",
"explanation_hi": "यंराजी के के के के के के के के",
],
},
{
"subject": "Rajasthan History",
"topic": "History of Rao Jaisi",
"question_en": "Who was the queen who ruled Rajasthan during the Mughal rule?",
"question_hi": "यंराजी के के के करे के के के Rाजराजी