[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort was built by Maharaja Jaswant Singh II in Jodhpur?",
"question_hi": "महाराजा जस्वानेश सिंह एकमात्रा के लिए जो दिल्ली की मुख्य त्रिकोण के नामक मंदिर और इसे बनाया गया था।",
"A_en": "Mehrangarh Fort",
"A_hi": "मेहरांगार त्रिकोण",
"B_en": "Umaid Bhawan Palace",
"B_hi": "उमाईद ब्वांनी",
"C_en": "Fateh Prakash Palace",
"C_hi": "फाटेहिप्रकाश पाली",
"D_en": "Sahara Fort",
"D_hi": "साहारा त्रिकोण",
"answer": "A",
"explanation_en": "Mehrangarh Fort is a famous fort built by Maharaja Jaswant Singh II in Jodhpur, Rajasthan. It was constructed in the 16th century and is a significant historical monument.",
"explanation_hi": "मेहनगार त्रिकोण एक महाराष्ट्र में जोड़वाणी के संतुलक में बनाई करने वाला गर्मन जिला के में जिला के बनाई करने वाला एनियाँं जोड़वाणी",
"A_en": "Mehrangarh Fort",
"A_hi": "मेहरांगार त्रिकोण",
"B_en": "Jaswant Thada",
"B_hi": "जासवंत त्रिकोण",
"C_en": "Chand Baori",
"C_hi": "चांद बाउरी",
"D_en": "Pratap Vilas Palace",
"D_hi": "प्रातप विलास पालीस",
"answer": "B",
"explanation_en": "Jaswant Thada is a marble memorial built in memory of Maharaja Mansingh II and is located in Udaipur, Rajasthan. It is a popular tourist attraction and was built by Maharaja Jaswant Singh II.",
"explanation_hi": "जासवंत त्रिकोण एक मार्मंड मेर्जोंसौंस प्राणिसी निवास का मेंटरन और उदायपुर, राजस्थान मेंटरन के निवास के लिएसौंस पालीसी निवासका मेंटरन (उदायपुर, राजस्थान मेंटरन के निवासका मेंटरन (उदायपुर, राजस्थान मेंटरन के निवासका मेंटरन",
"D_en": "उदायपुर, राजस्थान मेंटरन के निवासका मेंटरन",
"D_hi": "उदायपुर, राजस्थान मेंटरन के निवासका मेंटरन",
"question_en": "Which palace built by Maharaja Jaswant Singh II is a part of Udaipur, Rajasthan's monumental heritage?",
"question_hi": "महाराज्य जड़ सी का मेंटरन के निवासका मेंटरन",
"answer": "B",
"explanation_en": "Maharaja Jaswant Singh II built the Man Sagar Lake (also known as Lake Palace) which is a part of Udaipur, Rajasthan's monumental heritage.",
"explanation_hi": "महाज़ जड़ सका मेंटरन के निवासका मेंटरन",
"D_en": "उद्य जड़ सका मेंटरन",
"D_hi": "उद्य जड़ सका मेंटरन",
"explanation_en": "उद्य जड़ सका मेंटरन",
"explanation_hi": "उद्य जड़ सका मेंटरन",
},
"question_hi": "उद्य जड़ सका मेंटरन",
"question_en": "What is the famous palace built by Maharaja Jaswant Singh II in Jodhpur, Rajasthan?"
}
]