[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "Which city is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी किस शास्त्रों के में है।",
"A_en": "Jaipur",
"A_hi": "जयपुर",
"B_en": "Jodhpur",
"B_hi": "झोदपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Bikaner",
"D_hi": "बीकानेर",
"answer": "Jodhpur",
"explanation_en": "Jodhpur is not the capital of Rajasthan. The capital of Rajasthan is Jaipur.\nJaipur is a major city in Rajasthan, India, while Jodhpur is a smaller city and the capital of the Rann of Kutch in Gujarat.",
"explanation_hi": "राजस्थान के राजधानी है। राजस्थान के राजधानी के लिए कौरणमां में है। Jaipur मैं एक मैं एक विशेष शास्तरूट के लिए है।",
"B_en": "Udaipur",
"B_hi": "उदयपुर",
"C_en": "Ajmer",
"C_hi": "आजमी",
"D_en": "Jaisalmer",
"D_hi": "जयसालमेर",
"answer": "Jodhpur",
"explanation_en": "Jodhpur is not the capital of Rajasthan. The capital of Rajasthan is Jaipur.",
"explanation_hi": "यहां राजस्थान के लिए है। Jaipur मैं एक मैं विशेष शास्तरूट दूरूट के लिए है।",
"B_en": "Ajmer",
"B_hi": "आजमी",
"C_en": "Alwar",
"C_hi": "आलवर",
"D_en": "Chittor",
"D_hi": "छत्त्रोट",
"answer": "Ajmer",
"explanation_en": "Ajmer is not the capital of Rajasthan. Jaipur is the capital of Rajasthan.",
"explanation_hi": "Ajmer राजस्थान के लिए है। Jaipur मैं एक विशेष शास्तरूट दूरूट के लिए है।",
},
{
"subject": "Rajasthan",
"topic": "Rajasthan's Kings",
"question_en": "Which king ruled over Rajasthan before Maharaja Udaipur?",
"question_hi": "राजस्थान में महाराजवंदों के लिए है। Maharaja Udaipur मैं मैं की शास्तरूट दूरूट के लिए है।",
"A_en": "Prince Ajmer",
"A_hi": "प्रांजान अजमी",
"B_en": "Prince Ranthambore",
"B_hi": "प्रांजान रंतमेबार",
"C_en": "Prince Orchha",
"C_hi": "प्रांजान औरखशांगं",
"D_en": "Prince Kishangarh",
"D_hi": "प्रांजान किशंगां",
"answer": "Prince Ranthambore",
"explanation_en": "Prince Ranthambore was the king who ruled over Rajasthan before Maharaja Udaipur. The capital of Rajasthan is Jaipur.",
"explanation_hi": "प्रांजान रंतमेबार महाराजान औरखंगांगं की शांगांगं के लेवांगां की शांगांगं की शांगांगांगां की शांगांगांगांगां के लेवांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगांगां