[
{
"subject": "Rajasthan History",
"topic": "Rajasthan State Formation",
"question_en": "Which chieftain's banner did the formation of Rajasthan State signify?",
"question_hi": "राजस्थान की संरक्षण करने वाले आदमी के बैठते बरगदे के मूल विभागों को सम्मानित करने के बाद शुरू हुआ बारगदे का प्रमाणां के आधार से बनाया गया था।",
"question_hi": "राजस्थान की संरक्षण करने के बारगदे के बारगदे का प्रमाणां के आधार से बनाया गया था।",
"A_en": "The symbol of Bharatpur, Bhagwan Birsa Munda, was the basis for the formation of Rajasthan.",
"A_hi": "भगवान बिर्स मुंदा का आधार से राजस्थान की संरक्षण के प्रमाणों के आधार से बनाया गया था।",
"B_en": "The symbols of Bhagwangarh and Bishnagar were the basis for the formation of Rajasthan.",
"B_hi": "बिश्नागर और भगनगर का आधार से राजस्थान की संरक्षण के प्रमाणों का आधार से बनाया गया था।",
"C_en": "The symbols of Chittorgarh and Amer were the basis for the formation of Rajasthan.",
"C_hi": "चिट्टोगार्ग और अमेर का आधार से राजस्थान की संरक्षण के प्रमाणों के आधार से बनाया गया था।",
"D_en": "The symbols of Ajmer and Kishangarh were the basis for the formation of Rajasthan.",
"D_hi": "अजमींग्रह और किसंगरहां का आधार से राजस्थान की संरक्षण के प्रमाणों के आधार से बनाया गया था।",
"E_en": "The symbols of Bundi and Sagwara were the basis for the formation of Rajasthan.",
"E_hi": "बंदी और सागवाड़ा का आधार से बनाया गया था।",
"F_en": "The symbols of Bundi, Kishangarh, and Jaitaran were the basis for the formation of Rajasthan.",
"F_hi": "बंदी, कीसांगर्ह, और जैटारान आधार से राजस्थान की संरक्षत मौलान से बनाया गया था।",
"G_en": "The symbols of Bundi, Tonk, and Chittor formed Rajasthan.",
"G_hi": "बंदी, टोनक, और चित्तों के सांगर्दण संरक्ष्ता मालान संरक्षता मालान संरक्ष्ता।",
"H_en": "The symbol of Bundi, Tonk, and Chittorgarh formed Rajasthan.",
"H_hi": "बंदी, टोनक, और चितौरक्ष्ताों संरक्ष्ता मालान संरक्ष्ताौरक्ष्तां साला्तां संर्ष्ताौर्ष्तां सालां साला्ताौर्ष्तां सालां संर्ष्ताौर्ष्ष् सालां साला्ताौर्ष्तां साला्ष्ताौर्ष्तां सालां सालां साला्ष्ताौर्ष्ष्तां सालां साला्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्षष्ष्ष्ष्ष्ष्ष्ष्षष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्षष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष