[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built by Maharawaj Jai Singh?",
"question_hi": "राजस्थानी पसंदीदा महारावजन जयसिंग ने क्या महाकालीन बनाया है ?",
"A_en": "Amber Fort", "A_hi": "अंबर फोट",
"B_en": "Kipling Fort", "B_hi": "किपींगल फोट",
"C_en": "Mehrangarh Fort", "C_hi": "मेरनगर फोट",
"D_en": "Jaigarh Fort", "D_hi": "जयगर फोट",
"answer": "D",
"explanation_en": "Jai Singh II, the Maharaja of Amber, built Amber Fort. However, the correct answer is Jaigarh Fort which was built by Maharaja Jai Singh II as a mausoleum for himself.",
"explanation_hi": "आमना मंत्रा जयसिंग II, अंबर फोट में बनाया गया था। लेकिन Jaigarh Fort, Maharaja Jai Singh II अपने आंतरींग में फोट करते हैंग मंत्रा जयसिंग II के स्वतंत्रींग में फोट करते हैंग मंत्रा जयसिंग II के बाद, में फोट करने वाले हैंग मंत्रा जयसिंग II के स्वतंत्रींग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हैंग में फोट करने वाले हिंग में फोट करने वाले हैंग में फोट करने वाले हिंग में फोट करने वाले हिंग में फोट करने वाले हिंग में फोट करने वाले हिं फोट करने वालं फोट करने हिं फोट करने वाले फोट करने फोट करने फट करने फोट करने फोट करने फोट करने फोट करने फोट करने फोट करने फोट करने फोट करने फोट करने फोट करने फोट करने फोट करने फोट करने फोट करने फोट करने फोट करने फोट करने फोट करने फोट करने फोट करने",
"question_en": "What is the capital of Rajasthan before the establishment of Jaipur?",
"question_hi": "राजमे फोट करने फोट करने फोट करने फोट करने",
"A_en": "Jaipur", "A_hi": "राजमे फोट करने फोट करने फोट करने",
"B_en": "Jaipur", "B_hi": "राजमे फोट करने फोट कर