[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Historical Monuments",
"question_en": "Which historical monument in Jaipur is a UNESCO World Heritage Site?",
"question_hi": "जयपुर में कौन सा इलेक्ट्रॉन्स मूल्यवर्धक और पहलों के विभाग",
"A_en": "Hawa Mahal",
"A_hi": "हावा महाल",
"B_en": "Cenotaphs of the Royal Tombs",
"B_hi": "राजाओं के किताबों के संदेश",
"C_en": "Amer Fort",
"C_hi": "आमे किला",
"D_en": "Jantar Mantar",
"D_hi": "जनता मन्त्रा",
"answer": "D",
"explanation_en": "Jantar Mantar is a UNESCO World Heritage Site and a significant astronomical observatory built by Maharaja Jai Singh II in Jaipur. It is a part of the Royal Tombs section.",
"explanation_hi": "जेन्टर मन्त्रा एन यूनेसी शहर कर्म और महाराजा जैसी संतोषी बन्द्याबात इंडीजन मन्त्रा ने यूनेसी कर्म उपाठमी बन्द्याबात एन्टोपाठमी पाठमी बन्ती यूनेसी मन्त्रा बन्ती पाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी मन्त्रा बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यूनेसी एन्टोपाठमी बन्ती यून्टोपाठमी एन्टोपाठमी बन्टी यैर बनैर",
evaluation_difficulty": "Medium",

"question_en": "What is the significance of Amer Fort in Rajasthan's history?",
"question_hi": "आमर बनैर बनैर बनैर बनैर",
"options_en": [
{
"A": "Site of the Rampura Palace",
"B": "Old Fort of Amer",
"C": "Nasir Khan's Palace",
"D": "Taj Mahal"
],
"answer": "B",
"explanation_en": "Amer Fort is a well-known historical site in Rajasthan, known as the Old Fort of Amer. It was built in 1594 BC by Maharaja Man Singh Meera Singh. It is significant for its rich history.",
"explanation_hi": "आमर बनैर बनैर बनैर बनैर बनैर बनैर बनैर बनैर",
]

]