[
{
"subject": "Rajasthan History",
"topic": "Rajputana",
"question_en": "Which of the following is NOT a state in Rajputana?",
"question_hi": "राजपुत्राणा में कौन-सा नहीं है?",
"A_en": "Gujarat", "A_hi": "गुजरात",
"B_en": "Madhya Pradesh", "B_hi": "मध्यप्रदेश",
"C_en": "Haryana", "C_hi": "हरियाणा",
"D_en": "Chandigarh", "D_hi": "चंद्रगढ़",
"answer": "D",
"explanation_en": "Chandigarh is the capital of Haryana and not a state in Rajputana.",
"explanation_hi": "चंद्रगढ़, Haryana के निवास नहीं, राजपुत्राणा में।",
"question_hi": "राजपुत्राणा में क्या निवास नहीं?"
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which historical battle fought during the Mughal-Rajput Wars?",
"question_hi": "मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगोल-राजपुत्राणा के मुगे मुगोल-राजपुत्राणा के मुगे मुगे मुगोल-राजपुत्राणा के मुगे मुगे मुगे मुगे मुगे मे मुगे मुगे मे मुगे मुगे मुगे मे मे मुगे मुगे मुगे मुगे मे मुगे मे मे मे मुगे मे",
"answer": "B",
"explanation_en": "The Battle of Haldwani took place between Jaipur and Jaisalpur in 1734 AD.",
"explanation_hi": "हलद्वाणा एडे मे मे मे मे मे मे मे मे मे मे",
"question_en": "What event took place between Jaipur and Jaisalpur in 1734 AD ?",
"question_hi": "जे मे मे मे मे मे मे मे मे मे मे",
"A_en": "B",
"A_hi": "जे मे मे मे मे मे मे",
"B_en": "The Battle of Haldwani",
"B_hi": "जे मे मे मे मे मे",
"C_en": "The Battle of Hanumangar",
"C_hi": "जे मे मे मे मे",
"answer": "B",
"explanation_en": "The Battle of Hanuman Garhi took place between Jaipur and Jaisal