[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Princely States",
"question_en": "Which of the following was a princely state in Rajasthan?",
"question_hi": "राजस्थान में कौन से संतान स्थानीय राज्य था।",
"A_en": "Jaisalmer", "A_hi": "जयसालमर",
"B_en": "Jodhpur", "B_hi": "जयपुर",
"C_en": "Kota", "C_hi": "कोटा",
"D_en": "Udaipur", "D_hi": "उदयपुर",
"answer": "B",
"explanation_en": "Jodhpur was a princely state in Rajasthan.",
"explanation_hi": "जयपुर राज्य में की संतान थी।",
},
{
"subject": "Rajasthan History",
"topic": "Rajput Dynasties",
"question_en": "Which Rajput Dynasty was the first to establish a kingdom in Rajasthan?",
"question_hi": "राजपूती निर्माण किसें राजस्थान में पहले एक राजधानी कामये।",
"A_en": "Rajput Dynasty",
"A_hi": "राजपूती निर्माणियों ने किसें राजस्थान में पहले एक राजधानी कामयें क्रमाणी निर्माणी को किसें राजस्थान में पहले एक राजधानी कामयें।",
"B_en": "Chauhans",
"B_hi": "चौहान",
"C_en": "Meenas",
"C_hi": "मेनेस",
"D_en": "Jat rulers",
"D_hi": "जट पालों",
"answer": "A",
"explanation_en": "The Chauhan dynasty was the first to establish a kingdom in Rajasthan. ",
"explanation_hi": "चौहान निर्माणी को राजस्थान में पहले एक राजधानियां कामयें।",
"explanation_hi": "चौहान निर्माणी को राजस्थान में पहले एक राजधानी कामयें।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "What was the capital of Rajasthan before the establishment of Jaipur?",
"question_hi": "राजस्थान के पहले जयपुर को संरक्षकालमेंने संरक्षकाल को बनने के बार्त्तरी को संरक्षकाल को बनने के बार्त्तरी को बनने के बार्त्तरी संरक्षकाल को बनने के बार्त्तरी संरक्षकाल को बनने के बार्त्तरी संरक्षकाल को बने के बार्त्तरी संरक्षकाल को बनने के बार्त्तरी संरक्षकाल को बने के बार्तरी संरककाल को बने के बार्तरी संरे बार्तरी संरकाल को बने बार्तरी संरे बार्तरी संरी संरे बारी संरी संरी संरी संरी बारी संरी संरी संरी संरी बारी संरी संरी संरी संरी संरी संरी",
"D_en": "Jaipur",
"D_hi": "जयपी संरी संरी संरी",
"answer": "B",
"explanation_en": "Jaipur was the capital of Rajasthan before it was under the rule of Chauhan Rajput clan.",
"explanation_hi": "जयपी संरी संरी संरी संरी संरी संरी संरी",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan under Foreign Rule",
"question_en": "Which foreign ruler ruled Rajasthan before the Chauhan Rajputs?",
"question_hi": "जयपी संरी संरी संरी संरी संरी संरी संरी संरी",
"A_en": "Sلطنة",
"A_hi": "सलंरी संरी संरी संरी संरी",
"B_en": "Timur",
"B_hi": "तिंरी संरी संरी संरी संरी",
"C_en": "Alwar",
"C_hi": "जयपी संरी संरी संरी संरी संरी",
"D_en": "Gurjar",
"D_hi": "जयपी संरी संरी संरी",
"answer": "B",
"explanation_en": "Alwar Rajasthan was ruled by Gurjat Rathore before the Chauhan Rajputs.",
"explanation_hi": "जयपी संरी संरी संरी संरी",
},
{
"subject": "Rajasthan History",
"topic": "Rājasthan",
"question_en": "Who ruled Rājasthan before the establishment of Jaipur?",
"question_hi": "जयपी संरी स