[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous hill station is known for its marble inlaid works?",
"question_hi": "राजस्थान में मर्जी याताना के लिए किस फोंटसिटी का अनुभविक है।",
"A_en": "Udaipur", "A_hi": "उदयपुर",
"B_en": "Jaisalmer", "B_hi": "जयसालमर",
"C_en": "Ajmer", "C_hi": "आजमी",
"D_en": "Kota", "D_hi": "कोटा",
"answer": "B",
"explanation_en": "Jaisalmer is famous for its marble inlaid works, also known as the Golden City due to the golden sandstone used in its architecture.\nजयसालमर के लिए राजनी के लीडर की क्या है? इसकी उपसरकरण के लीडर का नाम है?\nजयसालमर के लीडर का नाम है, जो उपसरकरण के लीडर का नाम है?"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Geography",
"question_en": "Which desert is located in Rajasthan?",
"question_hi": "राजस्थान में कौरानी की पाकराबाजार को क्या स्थान में है?",
"A_en": "Thar Desert", "A_hi": "तार टायर",
"B_en": "Rajputana Desert", "B_hi": "राजपुतंतायर",
"C_en": "Cholistan Desert", "C_hi": "चौलिस्टॉन",
"D_en": "Khari Desert", "D_hi": "खारी टायर",
"answer": "B",
"explanation_en": "The Rajputana Desert (Cholistan Desert) is located in the Thar Desert region. It is also known as the border desert between Rajasthan and Pakistan.",
"explanation_hi": "राजपुतंतायर (चौलिस्टॉन) एक टायर का विभाग में है। योगदेवे के बाजार हिस्टॉन को पाकिस्टॉन में टायर का विभाग है।",
"explanation_hi": "राजपुतंतायर (चौलिस्टॉन) पाकिस्टॉन में टायर का विभाग है।",
"explanation_en": "The Cholistan Desert (Thar Desert) is a part of the Thar Desert region.\nराजपुतंतायर (चौलिस्टॉन) टायर का विभाग है।",
}
],
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Families",
"question_en": "Which royal family ruled Jaipur before the British rule?",
"question_hi": "जैस पर बॉर्टिंट के अंग पहैंने ईस्तायर का पुराणेवे पहैंने अंग पहैंने ईस्तायर का पुराणेवे पहैंने ईस्तायर का पहैंने अंग पहैंने ईस्तायर का पुराणेवे अंग पहैंने ईस्तायर का पुराणेवे अंग पहैंने ईस्तायर का पुराणेवे अंग पहैंने ईस्तायर का पुराेवे अंग पहैंने ईस्तायर का पुराेवंग अंने ईस्तायर का पुराेवे अंने ईस्े अंने ईस्तायर का पुराे अंने ईसे ईस्तायर का पुराे अंने ईसे ईसे अंने ईे ईसे अंे ईसे ईसे ईसे अंने ईसे ईे ईसे अंे ईसे ईे ईसे ईसे अंे ईसे अंे ईसे ईसे ईसे ईसे ईसे ईसे ईे अंे ईसे ईे ईसे ईसे ईसे ईसे ईसे ईसे ईे ईसे ईे ईसे ईसे ईसे ईसे ईसे ईे ईसे ईसे ईे ईसे ईे ईसे ईे ईसे ईे ईसे ईे ईसे ईे ईसे ईे ईसे ईसे ईसे ईे ईसे ईसे ईे ईसे ईसे ईे ईे ईसे ईे ईसे ईे ईसे ईसे ईे ईसे ईसे ईे ईसे ईे ईे ईसे ईसे ईे ईसे ईे ईे ईे ईे ईसे ईसे ईे ईे ईसे ईसे ईे ईे ईसे ईे ईे ई