[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following is a correct list of eras in Rajasthan's history?",
"question_hi": "राजस्थान के प्राचीन परिवर्तन को प्राप्त करने के लिए क्या प्राचीन परिवर्तन सूची के लिए क्या वर्गों को अधिकांचंद्रपुर से प्राप्त करें।",
"A_en": "The following is a list of ancient eras in Rajasthan.",
"A_hi": "राजस्थान में अंग्रेस को प्राप्त करने के लिए क्या वर्गों को अधिकांचंद्रपुर से प्राप्त करें।",
"question_en": "Can you identify the ancient kingdoms that flourished before the establishment of Amber?",
"question_hi": "अंग्रेस के स्थान की पृथिक राजधानों को प्राप्त करें।",
"options_en": [
    {
        "option_text": "Mewar",
        "option_value": 0
    },
    {
        "option_text": "Chittor",
        "option_value": 1
    },
    {
        "option_text": "Kachchwaha",
        "option_value": 2
    },
    {
        "option_text": "Jaisalmer",
        "option_value": 3
    },
    {
        "option_text": "Marwar",
        "option_value": 4
    }
],
"options_hi": [
    {
        "option_text": "मेवार",
        "option_value": 0
    },
    {
        "option_text": "चौधर्त",
        "option_value": 1
    },
    {
        "option_text": "कचचवाहा",
        "option_value": 2
    },
    {
        "option_text": "जयसालमे",
        "option_value": 3
    },
    {
        "option_text": "मरवार",
        "option_value": 4
    }
],
"answer": 1,
"explanation_en": "Before the establishment of Amber, the ancient kingdoms that existed in Rajasthan were Mewar, Chittor, Kachchwaha, Jaisalmer, and Marwar.",
"explanation_hi": "राजस्थान में अंग्राज़हावा में पहले अंग्राज़हावा को ताजाने के बाद राजस्थान में एनग्राज़हावा, चितोड, कचचवाहा, जयसालमे, और मरवार को ताजाने के बाद हैंग्राज़हावा में चितोड, कचचवाहा, जयसालमे, और मरवार को ताजाने के बाद हीं चितोड, कचचवाहा, जयसालमे, और मरवार को ताजाने के बाद हीं चितोड, कचचवाहा, जयसालमे, और मरवार को ताजाने के बाद हीं चितोड, कचचवाहा, जयसालमे, और मरोवा ताझाने को बाद हीं चितोड, कचचवाहा, जयसालमे, और मे, ताझाने को बाद हीं चितोड, कचचवा, जयसाले, और मे, ताझाने को बाद हीं चितोड, कचवा, जयसाले, और मे, ताझाने को बाद हीं चितोड, कचवा, जयसाले, और मे, ताझाने को बाद हीं चितोड, कचवा, जयसाले, और मे, ताझाने को बाद हीं चितोड, कचवा, जयसाले, और मे, ताझाने को बाद हीं चितोड, कचवा, जयसाले, और मे, ताझाने को बाद हीं चितोड, कचवा, जयसाले, और मे, ताझाने को बाद हीं चितोड, कचवा",
"answer": 1,
"explanation_en": "Before the establishment of Amber, the ancient kingdoms that existed in Rajasthan were Mewar, Chittor, Kachchh, Jais, Jais, Kachchh, Kachchh, Jais, Kachch, Jais, Kachch, Chitt, Kach, Jais, Kachch, Jais, Kachch, Jais, Kachch, Jais, Kachch, Chitt, Jais, Kachch, Jais, Kachch, Jais, Kachch, Jais, Kachch, Jais, Kachch, Jam, Kachch, Jais",
"explanation_hi": "जमयसा, जयसाले को बाद हिं चितोड, कचवा, जयसाले को बाद हीं चितोड, कचवा जमयसाले को बाद हिं चितोड, कच