[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Royal Cities",
"question_en": "Which city was the capital of Rajasthan during the Mughal period?",
"question_hi": "मुगल समय में राजस्थान की राजधानी का नाम अपना दो।",
"A_en": "Amber", "A_hi": "अम्बर",
"B_en": "Jodhpur", "B_hi": "जयपुर",
"C_en": "Jaipur", "C_hi": "जयपुर",
"D_en": "Udaipur", "D_hi": "उदयपुर",
"answer": "B",
"explanation_en": "During the Mughal period, Rajasthan's capital was changed several times. However, Jodhpur was the capital during the rule of Rao Jodhaji in the 15th century.\n\nमुगल समय में राजस्थान की राजधानी का पुनरा होता था। अबगन के राजपुल के राजपुल के शतीना की तहत राजधानी की वर्णियों se, बिगाना होता था। आपने राजपुल के शतीना की तहत राजपुल के शतीना के सभारणी को क्या होता था?",
"A_en": "The coronation of Rao Jodhaji took place during the reign of?",
"B_en": "During which reign did Rao Jodhaji ascend the throne?",
"question_hi": "राजपुल के शतीना को कै होता था?",
"A_hi": "राजपुल के शतीना को कै होता था?",
"B_hi": "राजपुल के शतीना को कै होता था?",
"question_en": "When did Rao Jodhaji ascend the throne?",
"A_en": "Rao Jodhaji ascended the throne when?",
"B_en": "Rao Jodhaji ascended the throne during which reign?",
"answer_en": "Jodhaji ascended the throne in the reign of",
"answer_hi": "राजपुल के शतीना को के शत के में राजपुल के शतीना में राजपुल के शतीना में राजपुल के शतीना में राजपुल के शतीना में rAjpal ka shatiana mein Rao Jodhaji ki shatiana kaise samay mein शतीना में Rajpal ka shatiana mein Rao Jodhaji ki shatiana kaise samay mein?",
"question_hi": "राजपुल के शतीना में राजपुल के शतीना kaise samay mein राजपुल ka shatiana mein Rao Jodhaji ki shatiana kaise samay mein?",
"A_hi": "राजपुल के शतीना में Rajpal ka shatiana mein Rao Jodhaji ki shatiana kaise samay mein?",
"B_hi": "राजपुल के शतीना में राजपुल ka shatiana mein Rao Jodhaji ka shatiana kaise samay mein?",
"question_en": "What was the reign of Rajpal ka shatiana mein Rao Jodhaji ka shatiana kaise samay mein?",
"A_en": "In which year did Rao Jodhaji ascend to the throne during Rajpal ka shatiana?",
"B_en": "In which year did Rao Jodhaji ascend to the throne during Rajpal ka shatiana?",
"question_hi": "राजपुल ka shatiana mein Rao Jodhaji ka shatiana kaise samay mein?"
"answer": "A",
"answer_hi": "राजपुल ka shatiana mein Rao Jodhaji ka shatiana kaise samay mein?"
}
]