[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "What is the first princely state to join the Indian Union?",
"question_hi": "भारतीय संघ में पहला राजधानी संघ को जोड़ा?",
"A_en": "Jaipur", "A_hi": "जयपुर",
"B_en": "Ahmedabad", "B_hi": "अहमदाबाद",
"C_en": "Jodhpur", "C_hi": "जोधपुर",
"D_en": "Meerut", "D_hi": "मीरूट",
"answer": "B",
"explanation_en": "Ahmedabad was the first princely state to join the Indian Union.\nIn Hindi, it translates to: अहमदाबाद भारतीय संघ में पहला राजधानी संघ मैं भारतीय संघ में पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ मैं पहला राजधानी संघ मैं भारतीय संघ पहला राजधानी संघ मैं भारतीय संघ पहला राजधानी संघ पैं भारतीय संघ पैं भारतीय संघ पहला राजधानी संघ पहला राजधानी संघ पहला राजधानी संघ पहला राजधानी संघ पहला राजधानी संघ पहला राजधानी संघ पहला राजधानी",
संघ पहला राजधानी",
"question_hi": "भाराजधानी संघ पहला राजधानी संघ पहला राजधा",
"Answer": "भाराजधानी संघ पहला राजधानी",
"options_en": [
{
"option_en": {
"option_hi": {
"option_hi": {
}
}
]
"D_en": "भाराजधानी संघ पहला राजधानी",
"D_hi": "भाराजधानी संघ पहला राजधा",
भाराजधानी संघ पहला राजधानी",
"explanation_en": "The first princely state to join the Indian Union was Rajput Rajasthan.",
"explanation_hi": "भाराजधानी स