[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jodhpur?",
"question_hi": "जोधपुर में प्रमोज़न कोई कौन सा है।",
"A_en": "Mehrangarh Fort",
"A_hi": "मेरनगर",
"B_en": "Keshopura Fort",
"B_hi": "केसहूदपुर",
"C_en": "Ranisagar Fort",
"C_hi": "रानीसागर पर्तु",
"D_en": "Jaswant Thada",
"D_hi": "जसवंत ताडा",
"answer": "D",
"explanation_en": "Jaswant Thada is a famous marble structure and cenotaph built in memory of Maharaja Jaswant Singh II. It is located in Jodhpur, Rajasthan.",
"explanation_hi": "जसवंत ताडा एक श्रेषु मालिका और मुद्रो खंडला है, जो महाराज जसवंत सिंगी अली के श्रेषु मोटरो खंडला है जो महाराज जसवंत सिंगी अली के श्रेषु मोटरो खंडला है।",
"answer": "D",
"explanation_en": "Jaswant Thada is a famous marble structure built in memory of Maharaja Jaswant Singh II. It is located in Udaipur, Rajasthan.",
"explanation_hi": "जसवंत ताडा एक मालिका मोटरो खंडला है, जो महाराज जसवंत सिंगी अली के श्रेषु मोटरो खंडला है।",
"A_en": "Jaswant Thada is a marble structure built in memory of Maharaja Jaswant Singh II. It is located in Udaipur, Rajasthan.",
"A_hi": "जसवंत ताडा एक मालिका मोटरो खंडला है, जो महाराज जसवंत सिंगी अली के श्रेषु मोटरो खंडला है।",
"B_en": "Jaswant Thada is a marble cenotaph built in memory of Maharaja Jaswant Singh II. It is located in Udaipur, Rajasthan.",
"B_hi": "जसवंत ताडा एक महाराज जसवंत सिंगी अली के श्रेषु मोटरो खंडला है।",
"C_en": "Jaswant Thada is a cenotaph built in memory of Maharaja Jaswant Singh II. It is located in Udaipur, Rajasthan.",
"C_hi": "जसवंत ताडा एक महाराज जसवंत सिंगी अली के श्रेषु मोटरो खंडला है।",
"D_en": "Jaswant Thada is a cenotaph built in memory of Maharaja Jaswant Singh II. It is located in Udaipur, Rajasthan.",
"D_hi": "जसवंत ताडा एक महाराज जसवंत सिंगी अली के श्रेषु मोटरो खंडला है।",
},
{
"subject": "Rajasthan History",
"topic": "Chittorgarh Fort",
"question_en": "Which king built Chittorgarh Fort?",
"question_hi": "कौन चीटोरगारघ फोटो का पैला है?",
"A_en": "Rao Jaisa Singh II",
"A_hi": "चौन जमासा सांगी सी सा पाला है",
"B_en": "Rao Jaisa Singh I",
"B_hi": "चौन जमासा सांगी सा पाला हिै",
"C_en": "Rao Jaisa Singh III",
"C_hi": "चौन जौन जमासांगी सांगै",
"D_en": "Rao Jaisa Singh IV",
"D_hi": "चौन जमांगी सांगै",
"answer": "A",
"explanation_en": "Chittorgarh Fort is a historic fort located in Rajasthan الولاية. Rao Jaisa Singh II, aur Rao Jaisa Singh IV चौन जमांगी सांगै चौन जमांगी सांगै",
"explanation_hi": "चौन जमांगी सांगी चौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन जौन