[
{
"subject": "Rajasthan History",
"topic": "Rajputana",
"question_en": "Which of the following Rajput kingdoms was part of the Rajputana province?",
"question_hi": "राजपूताना के किस राज्यों में राजपूताना का अधिकारी है।",
"A_en": "Kota", "A_hi": "कोता",
"B_en": "Jodhpur", "B_hi": "जोधपुर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Jaisalmer", "D_hi": "जयसालमर",
"answer": "B",
"explanation_en": "Jodhpur was one of the major Rajput kingdoms that formed part of the Rajputana province during its existence.",
"explanation_hi": "जोधपुर एक मुख्य राज्य राजपूताना का अधिकारी थे।",
},
{
"subject": "Rajasthan History",
"topic": "Art and Architecture",
"question_en": "Which famous palace was built during the reign of Raja Man Singh I in Jaipur?",
"question_hi": "राजा मन सिंह I के बनाए गए किसी मैंसिंग का नाम क्या है?",
"A_en": "Hawa Mahal",
"A_hi": "हाउ महाल",
"B_en": "Amber Fort",
"B_hi": "अमेर महाल",
"C_en": "Central Museum",
"C_hi": "केंतराई मैशन",
"D_en": "Cenotaph of Maharaja Ram Singh II",
"D_hi": "महाल राम सिंग II के कंत्रों",
"answer": "B",
"explanation_en": "Amber Fort is a famous palace built during the reign of Maharaja Man Singh I. It was constructed by Raja Man Singh I in the early 16th century.",
"explanation_hi": "अमेर महाल Maharaja Man Singh I ने स्प्रेकार की दिल्ली को बना करेंग के वर्षीय स्प्रेकारों",
"explanation_hi": "अमेर महाल महाल मंजुर के वर्षीय स्प्रेकारों",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's First Motorable Road",
"question_en": "Who laid the foundation of the first motorable road in Rajasthan?",
"question_hi": "राजस्थान के पहले मोट्राबुल ड्राउसियां",
"A_en": "Maharaja Sawai Jai Singh II",
"A_hi": "महाल सावाई जैसिंग II",
"B_en": "Maharana Pratap",
"B_hi": "महाल प्रताप",
"C_en": "Bhanwar Singh",
"C_hi": "भनवार सिंग",
"D_en": "Bikaji Ka Malhargarh",
"D_hi": "बिकाजी के मालहारगढ़",
"answer": "B",
"explanation_en": "Maharana Pratap laid the foundation of the first motorable road in Rajasthan. Bhanwar Singh and Bikaji Ka Malhargarh are also significant historical forts in the state, but Maharana Pratap is known for introducing the first motorable road.",
"explanation_hi": "महाल प्रताप ने राजस्थान मोटरोबल की पहल के बनोवार सिंग और बिकाजी के मालहारगड़ भी बहारगरंग और बिकाजी बहारगड़ भी बहारगरंग",
"answer": "C",
"explanation_en": "Bhanwar Singh and Bikaji Ka Malhargarh are famous forts in Rajasthan, but Maharana Pratap introduced the concept of motorable roads in the state.",
"explanation_hi": "भनवारगरंग भिमारगरंग भिमारगरंग भिमारगरंग भिमारगरंग भिमारगरंग भिमारगरंग भिमारगरंग भिमारगरंग भिमारगरंग भिमारगरंग भिमारगरंग भिमारगरंग भिमारगरंग भिमारग भिमारगरंग भिमारग भिमारग भिमारग भिमारगरंग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग",
},
"answer": "D",
"explanation_hi": "भिमारग भिमारग भिमारग भिमारग भिमारग भिमारग भिमा