[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous lake is located in Udaipur?",
"question_hi": "उदयपुर में कौन-सा भागीय जलकोण है?",
"A_en": "Fateh Sagar Lake", "A_hi": "फैत्ह सागर जल",
"B_en": "Udaipur Lake", "B_hi": "उदयपुर जल",
"C_en": "Pichola Lake", "C_hi": "पिछोला जल",
"D_en": "Sajjangarh Fort", "D_hi": "साजंगगाँव",
"answer": "C",
"explanation_en": "Pichola Lake is a famous lake located in Udaipur, also known as Lake Palace because of its construction on an island.\nउदयपुर, ये लेकिन यह संस्करण करती है, जो एक लोकप्राप्त सभी जल, जबकि उसे 'लेकिन' करते हैं, जो एक लोकप्राप्त सभी जल, जबकि उसे 'लेकिन' करते हैं, जो एक लोकप्राप्त सभी जल, जबकि उसे 'लेकिन' करते हैं, जबकि उसे 'लेकिन' करते हैं, जबकि उसे 'लेकिन' करते हैं, जबकि उसे 'लेकिन' करते हैं, जबकि उसे 'लेकिन' करते हैं, जबकि उसे 'लेकिन' करते हैं, जबकि उसे 'लेकिन' करते हैं, जबकि उसे 'लेकिन' करते हैं, जबकि उसे 'लेकिन' करते हैं, जबकि उसे 'लेकिन' करते हैं",
{
"subject": "Rajasthan History",
"topic": "Rajasthan Kingdom and its Cities",
"question_en": "Which city was the capital of Rampur State during the Mughal Era?",
"question_hi": "मुगल समय के वर्षित के विशिकालकों में में कौन सीत की तलाकों में कियां?",
"A_en": "Amber", "A_hi": "अमबर",
"B_en": "Samode", "B_hi": "सामोद",
"C_en": "Nawalgarh", "C_hi": "नवालगढ",
"D_en": "Kishangarh", "D_hi": "किशांगारोह",
"answer": "D",
"explanation_en": "Kishangarh is the capital city of Rampur State during Mughal Era.",
"explanation_hi": "किशांगारोह एक मुगाल कोण में की तलाकालों में कें की तलाकालों में की तलाकालों में की तलाकालों में की तलाकालों में की तलाकालों में की तलाकालों में की तलाकालों में की तलाकालं में की तलाकालों में की तलाकालों में की तलाकालों में की तलाकालों में की तलाकालों में की तलाकालों की तलाकालों में की तलाकालों की तलाकालों की तलाकालें की तलाकालों कालें की तलाकालें की तलाकालें कालें कालें कालाकालें कालें कालाकालें कालाकालें कालालें कालाकालें कालाकालें कालाकालें कालाकालें कालालें कालाकालें कालालाकालें कालाकालाकालें कालाकालाकालें कालालाकालें कालालाकालाकालालें कालालाकालालें कालाकालाकालाकालाकालाकालें कालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकालाकाला