[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort was built by Maharaja Rao Jodha?",
"question_hi": "महाराजा राउ जोधा ने किस महत्त्वनाथ किया?",
"A_en": "Amer Fort", "A_hi": "अमर किला",
"B_en": "Kumbhalgarh Fort", "B_hi": "कुम्बलगढ़ किला",
"C_en": "Meena Bazaar", "C_hi": "मेना बाजार",
"D_en": "Jaigarh Fort", "D_hi": "जैगर्हा किला",
"answer": "B",
"explanation_en": "Amer Fort and Kumbhalgarh Fort are both famous forts in Rajasthan, but Kumbhalgarh Fort is more historically significant as it was built by Maharaja Rao Jodha of the Meera Rajput clan.",
"explanation_hi": "आमेरा किला और कुम्बलगढ़ किला हैं, लेकिन कुम्बलगर्हा किला में राजा राव जोधा के मेरा किला में बनाया गया है।",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Culture",
"question_en": "What is the traditional dance form of Rajasthan?",
"question_hi": "राजस्थान के मनोरा का संविधि क्या है?",
"A_en": "Ghoomar",
"A_hi": "गोमार",
"B_en": "Gujari",
"B_hi": "गुजरार",
"C_en": "Haveli Dance",
"C_hi": "हावेली डांस",
"answer": "Ghoomar",
"explanation_en": "Ghoomar is a traditional dance form popular in Rajasthan. It originated in the Jaisalmer district and is performed by women wearing typical Jaisalmeri dress.",
"explanation_hi": "गोमार राजस्थान के ट्रान्स्टरियाँ का",
"D_explanation": "हावेली डांस की आत्मान और विजान के प्रतीक्षमानों और विजान के प्रतीक्षमानों के अतिमानों के प्रतीक्षमानियों के प्रतीक्षमानों के अतिमानों के अतिमानों के प्रतीक्षमानियों के अतिमानों के प्रतीक्षमानियों के अतिमानों के प्रतीक्षमानों के अतिमानों के प्रतीक्षमानों के अतिमानों के प्रतीक्षमानों के अतिमानों के प्रतीक्षमानों के अतिमानों के प्रतीनियों के अतिमानों के प्रतीनियों के अतिमानियों के प्रतीनियों के अतिमानियों के प्रतीनियों के अतिमानियों के प्रतीनियं के अतिमानियं के प्रतीनियं के अतिमानियों के अतिमानियं के अतिमानियं के प्रतीनियं के अतिमानियों के अतिमानियं के प्रतीनियं के अतिमानियं के अतिमानियं के अतियं के अतिमानियं के अतियं के अतिमानियं के अतियं के अतिमानियं के अतियं के अतिमानियं के अतिमानियं के अतिमानियं के अतिमानियं के अतिमानियं के अतिमानियं के अतिमानियं के अतिमानियं के अतिमानियं",
"
},
{
"subject": "Rajasthani Language",
"topic": "के अतिमानियं",
"question_en": "List the famous fort in Jaisammer?",
"question_hi": "जमनियं के अतिमानियं के अतिमानियं के अतिमानियं",
"A_en": "Amer Fort", "A_hi": "अतिमानियं के अतिमानियं के अतिमानियं",
"B_en": "Kumbhalgarh", "B_hi": "के अतिमानियं के अतिमानियं",
"C_en": "Kumbhalgarh", "C_hi": "के