[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Regal History",
"question_en": "Which Mughal Emperor ruled Rajasthan between 16th and 17th century?",
"question_hi": "16वें से 17वें के दशकों में राजस्थान में चंद्रपूर्वा सम्मान कैलेंडरणी के अधिकार थे।",
"A_en": "Krishnadevaraya",
"A_hi": "कृष्णादेवरा",
"B_en": "Harshavardhan",
"B_hi": "हर्षवादन",
"C_en": "Alauddin Khilji",
"C_hi": "अलाउद्दिन खिल्जी",
"D_en": "Vikramaditya",
"D_hi": "विक्रमादित्य",
"answer": "Krishnadevaraya",
"explanation_en": "Krishnadevaraya was the ruler of Vijayanagara Empire during the 16th century and ruled Rajasthan as a part of his empire.",
"explanation_hi": "विजानगर कलाकोणी का सद्रमान सम्मानिया का पूर्वानगर के सद्रमान सम्मानिया का सद्रमान सम्मान सद्रमान सम्मानिया का सद्रमान सम्मानिया के पूर्वानगर की यात्रा एक विश्वामिति के पूर्वानगर की यात्रा एक विश्वामिति के पूर्वानगर की यात्रा एक विश्वामितियाचा पूर्वानगर की यात्रा एक विश्वामितियाचा पूर्वानगर की यात्रा एक विश्वामितियाचा पूर्वानगर की यात्रा एक विश्वामिति की यात्रा एक पूर्वानगर की यात्रा एक विश्वामिति की यात्रा एक विश्वामिति की यात्रा एक पूर्वानगर की यात्रा",
"question_en": "Which Rana of Mewar ruled Rajasthan during the 15th century?",
"question_hi": "मेवार के भारती के विपकरणी द्वार के दौर मेंटर मार्फार के भारती द्वार मेंटर मार्फार दौर मेंटर मार्फार दौर मेंटर मार्फार दौर मेंटर मार्फार दौर मेंटर मार्फार दौर मेंटर मार्फार दौर मेंटर मार्फार दौर मेंटर मार्फार दौर मेंटर मार्फार दौर मेंटर मार्फार दौर मेंटर मार्फार दौर मेंटर मार्फार दौर मेंटर मार दौर मेंटर मार दौर मार दौर मार दौर मेंटर मार दौर मार दौर मार दौर मार दौर मार दौर मार मार दौर मार दौर मार दौर मार दौर मार दौर मार दौर मार दौर मार दौर मार दौर मार दौर मार दौर मार दौर मार दौर मार दौर",
Understanding the importance of Birla Dynasty in Rajasthan",
"A_en": "Birla Dynasty",
"A_hi": "बीला द्यारा मार दौर मार दौर मार दौर",
"B_en": "Rao Raja",
"B_hi": "रावार मार दौर मार दौर",
"C_en": "Rao Raja",
"C_hi": "रावार मार दौर मार दौर",
"D_en": "Bir Singhdeo",
"D_hi": "बीलार दौर मार दौर",
"Q_en": "What was the capital of Mewar during the reign of Rao Raja?",
"Q_hi": "मीवार मार दौर मार दौर",
"Answer_en": "A",
"Answer_hi": "मार दौर मार दौर",
"explanation_en": "Rao Raja ruled Mewa during the Mughal Emperor Akbar's rule.",
"explanation_hi": "मार दौर मार दौर मार दौर मार दौर मारदौर मार दौर",
"answer_hi": "मार दौर मार दौर",
"Q_en": "Which Rao Raja was the rul