[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built by Raja Ratan Singh of Kachhwaha clan?",
"question_hi": "राजस्थान में राजा रात्तिंदा संघ के कलन्दा के लिए बनाया गया एक अंग्रेज़ी में: राजा रात्तिंदा के लिए बनाया गया एक अंग्रेज़ी में किया गया वहाँ मैंने बनाया है: ",
"A_en": "Amer Fort",
"A_hi": "अमेर कलकती",
"B_en": "Kumbhalgarh Fort",
"B_hi": "कुम्भलगढ़",
"C_en": "Moti Mahal",
"C_hi": "मोटी महाल",
"D_en": "Meena Bazaar",
"D_hi": "मेना बाजार",
"answer": "C",
"explanation_en": "Moti Mahal is the palace built by Maharana Kumbha of Mewar dynasty for his wife Rani Padmavati.",
"explanation_hi": "महाराणी पदवती के स्वामी के लिए के लिए महाराणी पदवती के लिए के लिए महाराणी पदवती",
},
{
"subject": "Rajasthan History",
"topic": "Rashtrapati of Mewar Dynasty",
"question_en": "Which Rashtrapati belonged to the Mewar Dynasty and ruled from Amber Fort?",
"question_hi": "मेवार संत को एमेर के देता और एमेर का बैंग्राउत्तम मेवार को संत और सूर्य के देता के बिजनस्वामिता को सूर्य के देता के बिजनस्वामिता को सूर्य के देता के बिजनस्वामिता को सूर्य के देता के बिजनस्वामिता को सूर्य के देता के बिजनस्वामिता को सूर्य के देता के बिजनस्वामिता को सूर्य के देता के बिजनस्वामिता को सूर्य के देता के बिजनस्वामिता को सूर्य के देता के बिजनस्वामिता को सूर्य के देता के बिजनस्वामिता को सूर्य के देता के बिजनस्वामिता को सूर्य के देता के बिजनस्वामिता को सूर्य के देता को सूर्य के बिजनस्वामिता को सूर्य के बिजनस्वामिता को सूर्य के बिजनसिता को सूर्य के बिजनसिता को सूर्य के बिजनसिता को सूर्य के बिजनसिता को सिता के बिजनसिता को सूर्य के बिजनसिता को सूर्य के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता",
"question_en": "Which Rajput king built the Amer Fort?",
"question_hi": "पता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता के बिजनसिता",
"A_en": "Amer Fort",
"A_hi": "अमिजनसिता के बि