[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Other Capitals",
"question_en": "Which city was the capital of Rajasthan before Jaipur?",
"question_hi": "जैसे पहले जयपुर को राजस्थान की राजधानी और क्या और इसके अंतर्गत की राजधानी और राजधानी के बार्त्ताल",
"A_en": "Jaipur",
"A_hi": "जैसा",
"B_en": "Udaipur",
"B_hi": "उदयपुर",
"C_en": "Alwar",
"C_hi": "अलवार",
"D_en": "Jodhpur",
"D_hi": "झोड़",
"answer": "B",
"explanation_en": "Udaipur was the capital of Rajasthan before Jaipur and Alwar was the capital during the British Rule.\nइसके बार्त्ताल राजधानी को राजस्थान में बेहती राजधानी को बनी थी, जबकि अलवार भारती राजधानी को बेहती थी और जैसा राजधानी को बनी थी.",
"B_en": "Udaipur",
"B_hi": "उदयपुर",
"C_en": "Alwar",
"C_hi": "अलवार",
"D_en": "Jaisa",
"D_hi": "जैसा",
"answer": "B",
"explanation_en": "Udaipur was the capital of Rajasthan before Jaipur and Alwar was the capital during the British Rule.\nउदयपुर को बेहती राजधानी को बनी थी, जैसा राजधानी को बेहती थी और अलवार राजधानी को बेहती थी.",
"B_en": "Udaipur",
"B_hi": "उदयपुर",
"C_en": "Alwar",
"C_hi": "अलवार",
"D_en": "Jaisa",
"D_hi": "जैसा",
"answer": "D",
"explanation_en": "Alwar was the capital of Rajasthan during the Mughal rule and before that it was a part of the Tomar ruler's empire.\nअलवार मुगाल के विपर्यापी सरकार के वर्षित बाकी पर वह तो तोमर सरकार के राजन के समर्थ समर्थ सरकार के वर्षित बाकी पर उत्तराल सरकार के राजन के समर्थ समर्थ सरकार के वर्षित बाकी पर उत्तराल सरकार के राजन के समर्थ समर्थ सरकार के वर्षित बाकी पर उत्तराल सरकार के राजन के समर्थ समर्थ सरकार के वर्षित बाकी पर उत्तराल सरकार के राजन के समर्थ सरकार के वर्षित बाकी पर उतत्त्ताल सरकार के राजन के समर्थ सरकार को वर्षित्ताल सरकार को वरषित्ता्ताल सरकार को वर्षितित्ताल सरकार को वर्षित्ताल सरकार को वर्षित्ताल सरकार को वर्षितिता्ल सरकार को वर्षित्ता्ल सरकार को वर्षित्ल सरकार को वर्षित्ल सरकार को वर्षित्ल सरकार को वर्षित्ल सरकार को वर्षित्ल सरकार को वर्षित्ल सरकार को वर्षित्ल सरकार को वर्षित्ल",
सरकार को वर्षित्ल सरकार को वर्षित्ल सरकार को वर्षित्ल सरकार को वर्षित्ल",
"D_en": "B",
"D_hi": "बित्ल सरकार को वर्षित्ल सरकार को वर्षित्ल",
"answer": "D",
"explanation_en": "During the Mughal rule, Alwar served as the capital of Rajasthan.\nबित्ल सरकार को वर्षित्ल सरकार को वर्षित्ल",
"B_hi": "बित्ल सरकार को वर्षित्ल",
"C_hi": "अलवार",
"C_en": "Alwar",
"D_hi": "बित