[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Culture",
"question_en": "What is the significance of Jaisalmer Fort in Rajasthan?",
"question_hi": "जिसालमेर किस महत्व केंद्रीय हैं?",
"A_en": "Architecture",
"A_hi": "भवन परिषद",
"B_en": "Traditional Lifestyle",
"B_hi": "सामर्थ्य",
"C_en": "Economy",
"C_hi": "आर्थिकता",
"D_en": "Agriculture",
"D_hi": "आजीवन",
"answer": "B",
"explanation_en": "Jaisalmer Fort is significant due to its traditional lifestyle and culture that has been preserved for centuries in Rajasthan. The fort reflects the heritage and customs of the region.",
"explanation_hi": "जिसालमेर फोट के अंतर्गत लोगों का कविता और राजधानी का वर्णन राजस्थान के अंतर्गत लोगों के संवत बन्ने सका वर्णन राजस्थान का अंतर्गत लोगों के संवत बने संतर सका वर्णन राजस्थान के अंतर्गत लोगों के संतर सका वर्णन राजस्थान का अंतर्गत लोगों के संतर सका वर्णन राजस्थान का अंतर्गत लोगों के संतर सका वर्णन राजस्थान का अंतर्गत लोगों के संतर सका वर्णन राजस्थान का अंतर्गत लोगों के संतर सका वर्णन राजस्थान का अंतर्गत लोगों के संतर सका वर्णन राजस्थान का अंतर्गत लोगों के संतर सका वर्णन राजस्थान का अंतर्गत लोगों के संतर सका वर्णन राजस्थान का अंतर्गत लोगों के संतर सका वर्णन राजस्थान का अंतर्गत लोगों के संतर सका वर्णन राजस्थान का अंतर्गत लोगों के संतर सका वर्णन राजस्थान का अंतर्गत लोगों के संतर सका वर्णन राजस्थान का अंतर्गत लोगों के संतर सका वर्तर",
POSE (राजस्थान) के संतर सका वर्तर",
"B_en": "Traditional Culture",
"B_hi": "काणिया वर्तर",
"C_en": "Geographical Location",
"C_hi": "काणिया वर्तर",
"D_en": "Political History",
"D_hi": "काणिया वर्तर",
"answer": "B_en",
"explanation_en": "Jaisalmer Fort is known for its rich cultural heritage and traditional customs that have been passed down through generations. This fort represents the Rajasthan's history and traditions.",
"explanation_hi": "जिया वर्र रिया वर्र रिया वर रिया वर्र रिया वर र",
"explanation_hi": "जिया वर्र रिया वर र रिया वर्र र्र",
"question_en": "What is the cultural significance of Jaisalmer Fort?",
"question_hi": "जिया वर्र रिया वर्र",
"A_en": "Geographical Features",
"A_hi": "जिया वर्र",
"B_en": "Historical Importance",
"B_hi": "जिया वर्र",
"C_en": "Traditional Culture",
"C_hi": "जिया वर्र",
"D_en": "Political Significance",
"D_hi": "जिया वर्र",
"answer": "B_hi",
"explanation_en": "The Jaisalmer Fort is known for its rich historical and cultural significance, representing the traditions and customs of the people who lived there.",
"explanation_hi": "जिया वर्र्रिया वर्रर",
}
]