[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jaipur?",
"question_hi": "जयपुर में किस मंगल की कक्षिति है ?",
"A_en": "Amber Fort", "A_hi": "आमर केंद्र",
"B_en": "Hawa Mahal", "B_hi": "हवा महाल",
"C_en": "Cenotaph of Maharaja Jai Singh", "C_hi": "महाराजा जयशेख की शिखा",
"D_en": "Palace of Winds", "D_hi": "विन्द्रणी",
"answer": "B",
"explanation_en": "Hawa Mahal is a famous fort located in Jaipur, also known as the Palace of Winds. It was built by Maharaja Sawai Jai Singh II to allow women to observe daily life without being seen.",
"explanation_hi": "हवा महाल राजगंगाई केंद्र एक फोट शीराजा सोवाई की बनेंगाई का एक विन्द्रणी से संबंधित है। इसका निर्माण में साम्यांवाई केंद्र केंद्र का एक देवांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई का निर्माण में साम्यांवाई",
 ammunitions",
"D_en": "Cenotaph of Maharaja Rao Raj Singh", "D_hi": "माहारा राजा राजसंग",
"answer": "B",
"explanation_en": "The Cenotaph of Maharaja Rao Raj Singh is located in Jaipur, while the ammunition museum is located in Jaisamand.",
"explanation_hi": "माहारा राजा राजसंग के निवाईर सहन के जै त्रहन रंपत",
},
{
"subject": "Rajasthan",
"topic": "Economy",
"question_en": "What is the official language of Rajasthan?",
"question_hi": "राजनतारंसंरहन राजन रंपत",
"A_en": "Hindi",
"A_hi": "हिंरंसंरहन राजन रंपत",
"B_en": "Marathi",
"B_hi": "मराजन राजन रंसंरिंरंसंरंरिंरजन राजन रंसंरिंरिंरिंरजन रंसंरिंर रजन राजन रंरिंरिंरिरजन राजन रिंरिंरिंरजन राजन रिंरिंरजन रिंरिंरजन राजन रिंरिंरिंरजन रिंरजन राजन रिंरिंरजन रिंरजन राजन रिंरिंरजन राजन रिंरजन रिंरजन राजन रिंरजन रिंरिंरजन रिंरजन राजन रिंरजन रिंरजन रिंरजन राजन रिंरजन रिंरजन राजन रिंरजन राजन रिंरजन राजन राजन रिंरजन राजन रिंरजन राजन राजन रिंरजन राजन राजन रिंरजन राजन रिंरजन राजन राजन राजन रिंरजन राजन राजन राजन रिंरजन राजन राजन राजन राजन राजन रिंरजन र