[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous forts and palaces are located in Rajasthan?",
"question_hi": "राजस्थान में प्रमोटेशनों aur पौराणिक मंदिरों का नाम क्या है।",
"A_en": "Amer Fort, Mehrangarh Fort, and City Palace",
"A_hi": "अमेर मंदिर, मेरंगार मंदिर और नगर पौराणिक मंदिर",
"B_en": "Lalgarh Palace, Karni Mata Temple, and Jain Temple",
"B_hi": "ललगर पौराणिक मंदिर, कारणी माता मंदिर और Jain मंदिर",
"C_en": "Hawa Mahal, City Palace, and Maharaja Fateh Prakash Palace",
"C_hi": "हैवा महाल, नगर मंदिर और Maharaja फ़तहर प्रकाश पक्ष",
"D_en": "Amber Fort, City Palace, and Samode Palace",
"D_hi": "अमेर महाल, नगर मंदिर और Samode पाल",
"answer": "A",
"explanation_en": "The correct answer is A as it includes all the mentioned historical places - Amer Fort, City Palace, and Maharaja Fateh Prakash Palace in Jaipur.",
"explanation_hi": "उत्तर्राज़वाहर महाल, नगर मंदिर और Maharaja फ़तहर प्रकाश पाल",
"explanation_hi": "सरगवाहर महाल, नगर मंदिर और Maharaja फ़तहर प्रकाश पाल",
"answer": "A",
"explanation_en": "The correct answer is A as it includes all the mentioned historical places - Amer Fort, City Palace, and Maharaja Fateh Prakash Palace in Jaipur.",
"explanation_hi": "यहा उत्तर्राजवाहर महाल, नगर मंदिर और Maharaja फ़तहर प्रकाश पाल",
"answer": "A",
"explanation_en": "The correct answer is A as it mentions Amer Fort, City Palace, and Maharaja Fateh Prakash Palace which are historical places in Jaipur.",
"explanation_hi": "यहा उत्तर्राजवाहर महाल, नगर मंदिर और Maharaja फ़तहर प्रकाश पाल",
"answer": "A",
"explanation_en": "The correct answer is A as it covers the historical places mentioned - Amer Fort, City Palace, and Maharaja Fateh Prakash Palace which are located in Jaipur.",
"explanation_hi": "यहा उत्तर्राजवाहर महाल, नगर मंदिर और Maharaja फ़तहर प्रकाश पाल",
"answer": "B",
"explanation_en": "The correct answer is B as it mentions two more historical places - City Palace and Maharaja Fateh Prakash Palace, along with Amer Fort, which are located in Jaipur.",
"explanation_hi": "यहाँ यों के बजार मंदिर और Maharaja फ़तहर प्रकाश पाल",
"answer": "D",
"explanation_en": "The correct answer is D as it mentions two more historical places - City Palace and Maharaja Fateh Prakash Palace, along with Amer Fort, which are located in Jaipur.",
"explanation_hi": "यहाँ यों के बजार मंदिर और Maharaja फ़तहर प्रकाश पाल",
"answer": "E",
"explanation_en": "The correct answer is E as it mentions two more historical places - City Palace and Maharaja Fateh Prakash Palace, along with Amer Fort and City Palace, which are located in Jaipur.",
"explanation_hi": "यें के बजार मंदर और Maharaja फ़तहर प्रकाश पाल",
"answer": "F",
"explanation_en": "The correct answer is F as it mentions two more historical places - City Palace and Maharaja Fateh Prakash Palace, along with Amer Fort and City Palace, which are located in Jaipur.",
"explanation_hi": "यें के बजार मंदर और Maharaja फ़तहर पाल",
"answer": "G",
"explanation_en": "The correct answer is G as it mentions two more historical places - City Palace and Maharaja Fateh Prakash Palace, along with Amer Fort and City Palace, which are located in Jaipur.",
"explanation_hi": "यें बजार मंदर और Maharaja फ़तहर पाल",
"answer": "H",
"explanation_en": "The correct answer is H as it mentions two more historical places - City Palace and Maharaja Fateh Prakash Palace, along with Amer Fort and City Palace, which are located in Jaipur.",
"explanation_hi": "यें बजार मंदर फ़तहर फ़तहर Maharaja पाल",
"answer": "J",
"explanation_en": "The correct answer is J as it mentions two more historical places - City Palace and Maharaja Fateh Prakash Palace, along with Amer Fort and City Palace, which are located in Jaipur.",
"explanation_hi": "यें बजार फ़तहर फ़तहर Maharaja फ़तहर पाल",
"answer": "K",
"explanation_en": "The correct answer is K as it mentions two more historical places - City Palace and Maharaja Fateh Prakash Palace, along with Amer Fort and City Palace, which are located in Jaipur.",
"explanation_hi": "यें बजार फ़तहर फ़तहर पाल",
"answer": "M",
"explanation_en": "The correct answer is M as it mentions two more historical places - City Palace and Maharaja Fateh Prakash Palace, along with Amer Fort and City Palace, which are located in Jaipur.",
"explanation_hi": "यें बजार फ़तहर फ़तहर फ़तहर पाल",
"answer": "N",
"explanation_en": "The correct answer is N as it mentions two more historical places - City Palace and Maharaja Fateh Prakash Palace, along with Amer Fort and City Palace, which are located in Jaipur.",
"explanation_hi": "यें बजार फ़तहर फ़तहर फ़तहर सटहर फ़तहर फ़तहर फ़तहर रिं बजार फ़तहर फ़तहर फ़तहर फ़तहर सटहर रिं बजार फ़तहर फ़तहर रिं बजार रिं बजार फ़तहर रिं बजार रिं बजार रिं बजार रिं बजार रिं बजार रिं बजार रिं