[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which Mughal Emperor ruled Rajasthan during the 16th century?",
"question_hi": "16वें काल मुगल समाजवादी के राजस्थान में किया गया?",
"A_en": "Aurangzeb", "A_hi": "अर्थंगदेश",
"B_en": "Akbar", "B_hi": "अर्कर",
"C_en": "Safdarjung", "C_hi": "सफदरजंग",
"D_en": "Salim Ali", "D_hi": "सलिम अली",
"answer": "A",
"explanation_en": "Aurangzeb was the Mughal Emperor who ruled Rajasthan during the 16th century. He is popularly known as the 'Dara Shikoh's brother'.",
"explanation_hi": "अर्थंगदेश 16वें काल मुगल समाजवादि को राजस्थान में मंगलवादी के मंगल सीते राजस्थान में मूल संतुल के मात्रा विभित्रा के निवेश के प्राचन में निवेश के मात्रा के साम्रान्त्रा के मात्रा के प्राचन में निवेश के मात्रा के साम्रान्त्रा के प्राचन में निवेश के मात्रा के साम्रान्त्रा के प्राचन में निवेश की मात्रा के साम्रान्त्रा के प्राचन में निवेश की मात्रा के साम्रान्त्रा के प्राचन में निवेश की मात्रा के साम्रान्त्रा के प्राचन में निवेश की मात्रा के साम्रान्त्रा के प्राचन में निवेश की मात्रा के साम्रान्त्रा के प्राचन में निवेश की मात्रा के साम्रान्त्रा के प्राचन में निवेश की मात्रा के साम्रान्त्रा के प्राचन में निवेश की मात्रा के साम्रान्त्रा के प्राचन में निवेश की मात्रा के साम्रान्त्रा के प्राचन में निवेश की मात्रा के सामिरा के प्राचन में निवेश की मातरा के सामिरा के प्राचन में निवेश की मातरा के सामिरा के प्राचन में निवेश की मातरा के सामिरा के प्राचन में निविश की मातरा के प्राचन में न निवेश की मातरा के प्राचन न न में न निवेश की मातरा",
"question_en": "Which Mughal Emperor ruled Rajasthan during the 16th century?",
"question_hi": "कें न न न न न निविश की मातरा कें न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न न