[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous Rajasthani ruler is known for constructing the Amber Fort?",
"question_hi": "राजस्थानी कलकत्ता मूल में एमबीर की किस फोट करने वाले राजनीतिक पाठवान है।",
"A_en": "Rashtrapati Bhawan",
"A_hi": "राष्ट्रपति भावना",
"B_en": "Amber Fort",
"B_hi": "एमबीर फोट",
"C_en": "Jaipur",
"C_hi": "जयपुर",
"D_en": "Chetak",
"D_hi": "चेतन",
"answer": "B",
"explanation_en": "Amber Fort, also known as Rajmahal, was built by the famous Rajput ruler Maharaja Man Singh I of the Kachhwaha clan during the early 16th century.\n\nEnglish: Amber Fort is the correct answer because it is the historical monument constructed by Maharaja Man Singh I.",
"explanation_hi": "एमबीर फोट, प्रचारित है, जो पिछालों के Kachhwaha क्लीन महाराज मन सिंह I ने परमन स्पीसी सदृश्य दीवाचल पुलिस, महाराज सीन मेन सिंह I ने बन्धरावाचल सदृश्य दीवाचल पुलिस, महाराज सीन मेन सिंह I ने बन्धरावाचल सदृश्य दीवाचल पुलिस, महाराज सीन मेन सिंह I ने 1572 सालों में बन्धरावाचल सदृश्य दीवाचल पुलिस, महाराज सीन मेन सिंह I ने 1572 सालों में बन्धरावाचल सदृश्य दीवाचल पुलिस, महाराज सीन मेन सिंह I ने 1572 सालों में बन्धरावाचल सदृश्य दीवाचल पुलिस, महाराज सीन मेन सिंह I ने 1572 सालों में बन्धरावाचल सदृश्य दीवाचल पुलिस, महाराज सीन मेन सिंह I ने 1572 सालों में बन्धरावाचल सदृश्य दीवाचल पुलिस, महाराज सीन मेन सिंह I ने 1572 सालों में बन्धरावाचल पुलिस, महाराज सीन मेन सिंह I ने 1572 सालों में बन्धरावाचल पुलिस, महाराज सीन मेन सिंह I ने बन्धरावाचल पुलिस, महाराज सिन मेन सिंह I ने बन्धरावाचल पुलिस, महाराज सिंह I ने बन्धरावाचल पुलिस, महाराज सिंह I न्धरावाचल पुलिस, महाराज स, न्धरावाचल पुलिस, महाराज स, न्धरावाचलिस, महाराज स, न्धरावाचलिस, महाराज स, न्धरावाचलिस, महाराज स, न्धरावाचलिस, महाराज स, न्धरावाचलिस, महाराज स, न्धरावाचलिस, महाराज स, न्धरावाचलिस, महाराज स",

न्धरावाचलिस, महाराज स, न्धरावाचलिस, महाराज स, न्धरावाचलिस महाराज स, न्धराज स, महाराज स",
न्धरावाचलिस, महाराज",
स, न्धरावाचलिस, महाराज स, न्धराज स, महाराज",
स, न्धराज स, महाराज स",
न्धराज स, महाराज",
स, न्धराज स, महाराज स",
न्धराज स, महाराज",
स, न्धराज",
महाराज",
न्धराज",
महाराज",
स, न्धराज",
न्धराज",
महा