[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous battle took place between Maharana Pratap and Akbar?",
"question_hi": "महाराना प्रताप और अकबर के बीच कौन सी परमाणु मुख्य घाटी होई।",
"A_en": "Ajmer",
"A_hi": "अजमेर",
"B_en": "Mewar",
"B_hi": "मेवार",
"C_en": "Meera",
"C_hi": "मीरा",
"D_en": "Chittorgarh",
"D_hi": "चित्रगढ",
"answer": "D",
"explanation_en": "The famous battle that took place between Maharana Pratap and Akbar was fought at Chittorgarh.\nIn Hindi, it can be explained as: महाराणु मुख्य घाटी होई।",
"explanation_hi": "महाराणु मुख्य घाटी होई।"
},
{
"subject": "Rajasthan History",
"topic": "राजनी संतरागां और संतराई स्वामी के पहले बचाया गया गोलियां?",
"question_en": "What was the first battle won by Rana Pratap and Maharana Bikramji?",
"question_hi": "राजनी संतरां और महाराणी के पहले बचाया गोलियां के पहले बचाया गोलियां?",
"A_en": "The battle of Haldighati",
"A_hi": "हल्दीगढीगढी",
"B_en": "The Battle of Karauli",
"B_hi": "काराली घुट",
"C_en": "The Battle of Ajmer",
"C_hi": "अजमेर घट",
"D_en": "The Battle of Chittorgarh",
"D_hi": "चिट्टोरगढों घुट",
"answer": "D",
"explanation_en": "The correct answer is D. The Battle of Chittorgarh was the first battle won by Rana Pratap and Maharana Bhimsen against Akbar.\nIn Hindi: राजनी प्रतप और महाराणि बिहमें को कौरागर घुट पहला विपुर और महाराणि बिहमें को अकौर घुट पहला विपुर और महाराणि बिहमें को अकौर घुट पहला विपुर और महाराणि बिहमें को अकौर घुट पहला विपुर और महाराणि बिहमें को अकौर घुट पहला विपुर और महाराणि बिहमें को अकौर घुट पहला विपुर और महाराणि बिहमें को अकौर घुट पहला विपुर और महाराणि बिहमें को अकौर घुट पहला विपुर और महाराणि बिहमें को अकौर घुट पहला विपुर और महाराणि बिहमें को अकौर घुट पहला विपुर और महाराणि बिहमें को अकौर घुट पहला विपुर और महाराणि बिहमें कौर घुट पहला विपुर और महाराणि बिहमें कौर घुट पहला विपुर और महाराणि बिहमें कौर घुट पहला विपुर और महाराणि बिहमें कौर घुट पहला विपि में कौर घुट पहुर महाराणि बिहमें कौर घुट पहला बिहें कौर घुट पहला बि में कौर घट पहला बिहमें",
Supports कौर घुट पहला बिहें कौर घुट पहला बिहें कौर घुट पहला बिहें कौर घट पहला बिहें कौर घट पहला बिहें कौर घुट पहला बिहें कौर घुट पहला बिहें",
"answer": "D",
"explanation_en": "The Battle of Haldighati is a reference to the famous battle fought between Rana Pratap and Akbar. Akbar's army was defeated at Haldighati.",
"explanation_hi": "जामाराणि बिहर घुट पहला बिहें कौर घुट पहला बिहें कौर घुट पहला बिहें",
}
]