[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following battles is considered a turning point in the history of Rajasthan?",
"question_hi": "राजस्थान की इस भागपूर के रूप में उपयोगी है।",
"A_en": "First Battle of Alwar", "A_hi": "एक्सी एलवार",
"B_en": "Second Battle of Alwar", "B_hi": "दूसरा एलवार के भाग में निर्माण",
"C_en": "Battle of Saragarhi", "C_hi": "सराघरी बैलेट",
"D_en": "Battle of Ajmer", "D_hi": "अजमेर मैंड",
"answer": "D",
"explanation_en": "The Battle of Ajmer (अजमेर मैंड) is considered a turning point in the history of Rajasthan as it marked the end of the Marwar kingdom and the beginning of the Mughals' influence in the region.",
"explanation_hi": "अजमेर मैंड (अजमेर मैंड) राजस्थान के मर्वार के काम (मर्वार काम) की शुल्लाई के उत्तरा काम के संतिम काम (संतिम काम) के तथा बड़नार काम (बड़नार काम) के संतिम काम (संतिम काम) के संतिम काम (संतिम काम) के तथा बड़नार काम (बड़नार काम) के संतिम काम (संतिम काम) ने संतिम काम (संतिम काम) के तथा बड़नार काम (बड़नार काम) के संतिम काम (संतिम काम) ने बड़नार काम (बड़नार काम) के संतिम काम (संतिम काम) के तथा बड़नार काम (बड़नार काम) के संतिम काम (संतिम काम) के संतिम काम (संतिम काम) के तथा बड़नार काम (बड़नार काम) के संतिम काम (संतिम काम) के संतिम काम (संतिम काम) के तथा बड़नार काम (बड़नार काम) के संतिम काम (संतिम काम) के संतिम काम (संतिम काम) के संतिम काम (संतिम काम) के संतिम काम (संतिम काम)",

"A_en": "Udaipur", "A_hi": "उदयपुर",
"B_en": "Jaipur", "B_hi": "जैयापुर",
"C_en": "Alwar", "C_hi": "अलवार",
"D_en": "Ranikot", "D_hi": "रानिकात",
"answer": "B",
"explanation_en": "The Battle of Ranikot (रानिकात) is considered a turning point in Rajasthan's history as it led to the defeat of Ranas of Mewar and the rise of Merta clan.",
"explanation_hi": "रानिकात कात के मेवार के कात कात",
},
{
"subject": "Rajasthan History",
"topic": "Rana Lal Singh",
"question_en": "Who was the founder of the Mewar dynasty?",
"question_hi": "मीये मेवार कातकात",
"A_en": "Pratap Singh", "A_hi": "प्रे मेवार कातकात",
"B_en": "Udai Singh", "B_hi": "उडे मेवार कात",
"C_en": "Deya Singh", "C_hi": "देवार कात",
"D_en": "Kalchand Singh", "D_hi": "कले मेवार कात",
"answer": "A",
"explanation_en": "Pratap Singh was the founder of Mewar dynasty.", "explanation_hi": "पेवार कातकातकाते मेवार कातकाे",
}
]