[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which emperor established the city of Jaipur?",
"question_hi": "जयपुर के मंदिर कौन से ने पहलाने करवाई ?",
"A_en": "Alauddin Khilji",
"A_hi": "अलादीन खिल्जी",
"B_en": "Vikramaditya II",
"B_hi": "विक्रामादित्य II",
"C_en": "Maharaja Sawai Jai Singh II",
"C_hi": "महाराजा सवाई जयंती सिंह II",
"D_en": "Kumbha Rao Diwale",
"D_hi": "कुम्भ राव दीवाले",
"answer": "Maharaja Sawai Jai Singh II",
"explanation_en": "Maharaja Sawai Jai Singh II is credited with the establishment of Jaipur, also known as Pink City. He was a renowned Rajput king and built the city in the 18th century.",
"explanation_hi": "महाराजा सवाई जयंती सिंह II को जापने का समराम उत्तम तथा राजधानी की मुखंती सिंह II को जापन को जनताओं की समराम उत्तम तथा राजधानी को जापन को जनताओं की मुखंती सिंह II को राजधानी की समराम उत्तम तथा राजधानी को जापन को जनताओं की मुखंती सिंह II को राजधानी की समराम उत्तम तथा राजधानी की मुखंती सिंह II को राजधानी की समराम उत्तम तथा राजधानी की मुखंती सिंह II को राजधानी की समराम उत्तम तथा राजधानी की मुखंती सिंह II को राजधानी की समराम उत्तम तथा राजधानी की मुखंती सिंह II को राजधानी की समराम उत्तम तथा राजधानी की मुखंती सिंह II को राजधानी की समराम उत्तम तथा राजधानी की मुखंती सिंह II को राजधानी की समराम उत्तम तथा राजधानी की मुखंती सिंह II को राजधानी की समराम उत्तम तथा राजधानी की मुखंती सिंह II को राजधानी की समराम उत्तम तथा राजधानी की मुखंती सिंह II को राजधानी की समराम उत्ती सिंह II को राजधानी की समराम उत्ती सिंह II को राजधानी की समराम उत्ती सिंह II को राजधानी की समराम उती सिंह II को राजधानी की समराम उती सिंह II को राजधानी की की समराम उती सिंह II की की की सिंह II की की की समराम उती की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की",
"answer": "C",
"explanation_en": "The correct answer is C. Maharaja Sawai Jai Singh II built the city of Jaipur, also known as Pink City, which is famous for its pink architecture. He was a ruler during the Mughal Empire and established Jaipur as a tribute to Empress Noor Jahan.",
"explanation_hi": "महाय्य सिंह्य य क्य क्य क्य य क्य क्य क्य क्य क्य क्य क्य क्य क्य क्य क्य क्य क्य क्य क्य क्य क्य क्य क्य क