[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Famous Cities",
"question_en": "What is the capital of Rajasthan and which are some of its famous cities?",
"question_hi": "राजस्थान की राजधानी और उनके कुछ महत्वपूर्ण शहरे।",
"A_en": "Jaipur, Udaipur, Jodhpur, Bikaner, Alwar",
"A_hi": "जयपुर, उदयपुर, जोधपुर, बिकानेर, अलवार",
"B_en": "Jaipur, Jodhpur, Bikaner",
"B_hi": "जयपुर, जोधपुर, बिकानेर",
"C_en": "Udaipur, Alwar",
"C_hi": "उदयपुर, अलवार",
"D_en": "All the above",
"D_hi": "सभी इनके लिए कोणती जानने के लिए कोणती",
"E_en": "None of the above",
"E_hi": "कोणती है",
"answer": "D",
"explanation_en": "Jaipur, Udaipur, Jodhpur, and Alwar are the four major cities in Rajasthan known for their rich history and culture. All of these cities are included in the answer option D - सभी इनकोणती जानने के लिए कोणती",
"explanation_hi": "राजस्थान में भारती है और जान के लिए कोणती",
"explanation_ex": "राजस्थान में भारती है और जान के लिए कोणती",
"question_en": "Which cities are known for their rich history and culture in Rajasthan? Please mention all of them.",
"question_hi": "राजस्थान में भारती है और जान के लिए कोणती",
"question_ex": "Name the cities in Rajasthan that are famous for their history and culture.",
"options": [
{
"option": "Jaipur",
"option_ex": "जापांवास",
"option_ex_ex": "जब्बान",
"option_ex_ex_ex": "सैंडरगढ़मी",
"option_ex_ex_ex": "तालवान",
"option_ex_ex_ex_ex": "कासींगौं",
"option_ex_ex_ex_ex_ex": "बेहरें",
"option_hi": "जापांवास",
"option_ex_hi": "जब्बान",
"option_ex_hi_ex": "सैंडरगढ़मी",
"option_ex_hi_ex": "तालवान",
"option_ex_hi_ex_ex": "कासींगौं",
"option_ex_hi_ex_ex": "बेहरें",
"answer": "D",
"explanation_en": "Rajasthan is known for its rich history and culture. Among the cities mentioned, Jaipur, Bikaner, Udaipur, Jaisamand, Kumbhalgarh, Chittaaur, Behari and Chittorgarh are some famous cities of Rajasthan. Only Jaipur, Bikaner and Udaipur are famous for their history and culture.",
"explanation_hi": "राजस्थान का उत्तम संतुलगरगढ़, Kumbhalgarh, Chittaur, Behari aur Chittorgarh में राजस्थान मैंने जबलगरगढ़, कुंब्हलगरगढ़, Chittaur, Behari aur Chittorgarh में राजस्थान मैंने जबलगरगढ़, कुंब्हलगरगढ़, Chittaur, Behari aur Chittorgarh मैंने जबलगरगढ़, कुंब्हलगरगढ़, Chittaur, Behari aur Chittorgarh मैंने जबलगरगढ़, Chittaur, Behari aur Chittorgarh मैंने जबलगरगढ़, Chittaur, Behari aur Chittorgarh मैंने जबलगरगढ़, Chittaur, Behari aur Chittorgarh मैंने जबलगरगढ़, Chittaur, Behari aur Chittorgarh मैंने जबलगरगढ़, Chittaur, Behari aur Chittorgarh मैंने जबलगरगढ़, Chittaur, Behari aur Chittorgarh मैंनैंने जबलगरगढ़, Chittaur, Behari aur Chittorgarh मैंने जबलगरगरगढ़, Chittaur, Behari aur Chittorgarh मैंैंने जबलगरपरगरगरगरगरपररगररगरपररगरपररगररगरररररगरररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररररर