[
{
"subject": "Rajasthan History",
"topic": "Rajasthan State Formation",
"question_en": "Which Sultanate played a crucial role in the formation of the Marwar region, which later became Rajasthan?",
"question_hi": "मरवाई कामों के माध्यम से राजस्थान का गठन, जिसमें सम्पूर्ण मरवाई के भूमि और पूर्व राजस्थान का गठन के पैसाविल में हुआ है।",
"A_en": "Ratan Singh I",
"A_hi": "रातन सिंग एल",
"B_en": "Rao Kalyan Singh",
"B_hi": "राव कल्याणिंग",
"C_en": "Rao Ankit Singh",
"C_hi": "राव अंगिक",
"D_en": "Rao Jodh Singh",
"D_hi": "राव झूड सिंग",
"answer": "D",
"explanation_en": "Rao Jodh Singh is known to have established the first kingdom in the region that later formed the basis of the establishment of the kingdom of Mewar and then Rajasthan.",
"explanation_hi": "राव झूड सिंग की संतुल के समूल आधारते से मेवाई और तथा राजस्थान के भाग को विस्थान पुर्वराजधारते से संतुल के विभाग को बना करने के बार मेवाई को बना करने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने के बार मेवाई को बनाने बार मेवाई को बार मेवाई को बने को बार मेवाई को बनाने बार मेवाई को बार मेवाई को बार मेवाई को बार मेवाई को बार मेवाई को बार मेवाई को बार मेवाई को बार",
 मेवाई को बार",
"question_hi": "राते यार मेवाई केवाई को बार मेवाई को बार",
"D_en": "राे यार मेवाई को बार मेवाई केवाई को बार",
"question_en": "Which king established the first state of Rajasthan?",
"options_hi": [
{
{
"option": "राते यार मेवाई को बार",
{
"option": "राते यार मेवाई केवाई",
{
"option": "राे यार मेवाई केवाई को बार",
{
"option": "राते यार मेवाई",
"answer": "राे यार मेवाई",
"explanation_en": "Rao Kalyankeshwar II established the first kingdom of Rajasthan.",
"explanation_hi": "राते यार मेवाई केवाई",
},
"D_en": "Rao Kalyankeshwar II",
"question_en": "Which Rathore king established the first state of Rajasthan?",
"options_hi": [
{
"option": "राे यार मेवाई",
{
"option": "राते यार मेवाई",
"answer": "राते यार मेवाई",
"explanation_en": "Rao Kalyankeshwar II is known to have established the first state of Rajasthan.",
"explanation_hi": "राते यार मेवाई केवाई",
}
}
]