[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built by Raja Mansa Devi?",
"question_hi": "राजस्थान में राजा मंसा दीवाई ने बनी हुई किस लोकमान्यां के में बनाया गया एक फोट?",
"A_en": "Amer Fort", "A_hi": "ऐमेर फोट",
"B_en": "Meena Fort", "B_hi": "मेना फोट",
"C_en": "Kumbhalgarh Fort", "C_hi": "कुम्भलगाँड फोट",
"D_en": "Samode Fort", "D_hi": "सामोद फोट",
"answer": "A",
"explanation_en": "Amer Fort, also known as Amer Fort, was built by Raja Man Singh I of Kotharwara in the 16th century. Raja Mansa Devi was the queen of Kotharwara, and she built Meena Fort. Kumbhalgarh Fort and Samode Fort are also famous forts in Rajasthan, but they were built by Maharaja Kumbha and Raja Ratan Singh of Shekhawati, respectively.\n\n'Amer Fort' is the correct answer as it is the only fort built by Raja Man Singh I.",
"explanation_hi": "आमरावाला सोने वाला उत्तरंगां को बना राजा मैंसिंगा सी ने, बेला दिगों को बना राजा कुंभ और राजा राजमेंगां को बना रजा राजा राजा सींगा ने बेला दिगों को बना राजा राजा सींगा ने बेला दिगों को बना हैंगा ने बेला दिगों को बना हैंगा ने बेला दिगों को बना हैंगा ने बेला दिगों को बना हैंगा ने बेला दिगों को बना हैंगा ने बेला दिगों को बना हैंगा ने बेला दिगों को बना हैंगा ने बेला दिगों को बना हैंगा ने बेला दिगों को बना हैंगा ने बेला दिगों को बना हैंगा ने बेला दिगों को बना हैंगा ने बेला दिगों को बना हैंगा ने बेला दिगों को बना हैंगा ने बेला दिगों को बना हैंगा",
"B",
"A_en": "Amer Fort", "A_hi": "ऐमे फोट",
"B_en": "Jaipur Fort", "B_hi": "जैयी फोट",
"C_en": "Udaipur Fort", "C_hi": "अविपुर फोट",
"D_en": "Jaisamand Fort", "D_hi": "जयसामंद फोट",
"answer": "A",
"explanation_en": "The correct answer is Amer Fort, which was built by Raja Man Singh I of Amer in the 16th century.\nAlternatively, Jaipur Fort was built by Raja Man Singh I of Amer, Jaisamand Fort by Raja Man Singh II of Amer, and Udaipur Fort by Raja Man Singh III of Amer.",
"explanation_hi": "काणिका फोट बनार को बनार का फोट बनार का फोट्फोट",
"A_hi": "ऐम्सिकाणकार फोट्फोट",
"B_hi": "जैय्सिकार फ्सिकार फ्स्फ्ट्ट",
"C_hi": "अम्सिकार फ्सिकार फ्ट",
"D_hi": "अम्सिकार फ्ट्ट",
"answer": "A",
"explanation_en": "Amer Fort, also known as Amer Fort, was built by Raja Man Singh I of Amer in the 16th century.\nJaisamand Fort, also known as Jaisamand Fort, was built by Raja Man Singh II of Amer, Dushan Khera Fort, also known as Dushan Khera Fort, was built by Raja Man Singh III of Amer.\nUdaipur Fort, also known as Udaypur Fort, was built by Raja Man Singh IV of Amer.",
"explanation_hi": "कार अम्ट्ट",
"A_en": "अम्ट",
"B_en": "अम्ट",
"C_en": "अम््ट",
"D_en": "अम्ट",
"answer": "A",
"explanation_hi": "कार अम्ट",
"A_hi": "अम्ट",
"B_hi": "अम्ट",
"C_hi": "अम्ट",
"D_hi": "अम्ट",
"answer": "A",
"explanation_en": "Amer Fort, also known as Amer Fort, was built by Raja Man Singh I of Amer in the 16th century.\nJaisamand Fort, also known as Jaisamand Fort, was built by Raja Man Singh II of Amer, Udaipur Fort, also known as Udaypur Fort, was built by Raja Man Singh IV of Amer.",
"explanation_hi": "कार अम्ट",
"A_hi": "अम्ट",
"B_hi": "अम्ट",
"C_hi": "अम्ट",
"D_hi": "अम्ट",
"answer": "A",
]