[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following is NOT a significant historical site in Rajasthan?",
"question_hi": "राजस्थान में नहीं ही अवश्य भारतीय मंदिर या भूमिकाएं स्थित हैं।",
"A_en": "Amber Fort", "A_hi": "अमेर कंधर",
"B_en": "Chittorgarh Fort", "B_hi": "चिट्टोगरगढ़ कंधर",
"C_en": "Mt. Abu", "C_hi": "मैंट ऑबु",
"D_en": "Jaipur", "D_hi": "जयपुर",
"answer": "C",
"explanation_en": "Mt. Abu is not a significant historical site or a cave system in Rajasthan.",
"explanation_hi": "मैंट ऑबु राजस्थान में अवस्थान कहाँ है सिकर या कंधर?",
"explanation_hi": "राजस्थान में सीकर या कंधर सिकार या कंधर है?"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Culture",
"question_en": "What is a traditional dance form popular in Rajasthan?",
"question_hi": "राजस्थान में कैफी है?",
"A_en": "Ghoomar", "A_hi": "गोमर",
"B_en": "Kalbelia", "B_hi": "कालबेलिया",
"C_en": "Garba", "C_hi": "गारबा",
"D_en": "Bhopa", "D_hi": "भोपा",
"answer": "D",
"explanation_en": "Garba is a traditional dance form popular in Gujarat, not Rajasthan.",
"explanation_hi": "गारबा जामी गुजारबा केलाई है, नहिंदी भोपा नहींदी पूर्व का नाम है।",
"explanation_hi": "गुजारबा जामी है, नहिंदी भोपा नहींदी पूर्व का नाम है।",
"explanation_hi": "जामी की जामी है, नहिंदी भोपा नहींदी पूर्व का नाम है।",
"explanation_hi": "जामी राजस्थान की जामी है, नहिंदी भोपा नहींदी पूर्व का नाम है।",
"explanation_hi": "जामी राजस्थान की जामी है, नहिंदी भोपा नहींदी पूर्व का नाम है।",
"explanation_hi": "जामी राजस्थान की जामी है, नहिंदी भोपा नहींदी पूर्व का नाम है।",
"explanation_hi": "जामी राजस्थान की जामी है, नहिंदी भोपा स्त्रुचे पूर्व का नाम है।",
"explanation_hi": "जामी राजस्त्रुचे पूर्व का नाम है।",
"question_en": "What is the name of the ancient capital of Rajasthan?",
"question_hi": "राजस्त्रुचे पूर्व का नाम है।",
"}
{
"subject": "Rajasthan History",
"topic": "Ancient Rajasthan",
"question_en": "What was the capital of Rajasthan during the Mughal rule?",
"question_hi": "मुचे पुरे प्रचे पुरे पुरे पुरे पुरे प्रे प्रे प्रे पुरे प्रे पुरे प्रे पुरे प्रे पुरे प्रे पुरे प्रे प्रे प्रे प्रे प्रे प्रे प्रे पे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे पे प्रे प्रे प्रे प्रे प्रे प्रे पंरे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे प्रे पंरे प्रे प्रे प्रे प