[
{
"subject": "Rajasthan History",
"topic": "Early History of Rajasthan",
"question_en": "Which dynasty ruled Rajasthan before the Rajputs?",
"question_hi": "राजस्थान में राजपूतों से पहले से कौन सी धर्मनिता राजस्थान में चाली थी ?",
"A_en": "Mewar Dynasty",
"A_hi": "मेवार धर्मनिता",
"B_en": "Chauhans",
"B_hi": "चौधरन",
"C_en": "Todi",
"C_hi": "तोड़ी",
"D_en": "Gurjara Pratiharas",
"D_hi": "गुरज़ारा प्रतिहर",
"answer": "D",
"explanation_en": "The Gurjara Pratiharas ruled Rajasthan before the Mewar and Chauhan dynasties. They were a powerful medieval Indian kingdom that controlled parts of Rajasthan, Gujarat, and Haryana.",
"explanation_hi": "गुरज़ारा प्रतिहर (Gurjara Pratiharas) राजस्थान को Mewar और Chauhan धर्मनों से पहले से राजमा को विमान की संतरां की स्थानों से बाद में मूर्ति से संतरां की स्थानों से बाद में मूर्ति से संतरां की स्थानों से बाद में मूर्ति से बाद में संतरां की स्थानों से बाद में मूर्ति से बाद में संतरां की स्थानों से बाद में मूर्ति से बाद में संतरां की स्थानों से बाद में आकांक्षता।",
},
{
"subject": "Rajasthan History",
"topic": "Dynasties of Rajasthan",
"question_en": "Which dynasty ruled Rajasthan before the Mughals?",
"question_hi": "मुगलों से पहले राजस्थान को बेखता के निमान्तित होगी।",
"A_en": "Kachhwahas",
"A_hi": "कचवाह",
"B_en": "Tarangas",
"B_hi": "तारंगा",
"C_en": "Meera Dynasty",
"C_hi": "मीर निमान्तित हैं",
"D_en": "Todi",
"D_hi": "तोड़ी",
"answer": "B",
"explanation_en": "The Tarangas dynasty ruled Rajasthan before the Kachhwahas, Meera dynasty and Todis. The Tarangas dynasty was established in the 11th century and was the first ruling dynasty of Rajasthan.",
"explanation_hi": "Tarangas धर्मन्तित होगी ते केवाहाँ, मीर धर्मन्तित होगी ते तोड़ित होगी।",
"explanation_hi": "तो धर्मन्तित होगी ते केवाहाँ, मीर धर्मन्तित होगी तो धर्मन्तित होगी ते तो धर्मन्तित होगी ते केवाहाँ",
},
{
"subject": "Rajasthan History",
"topic": "Mewar Dynasty",
"question_en": "Who ruled Mewar province during the 12th century?",
"question_hi": "मीवाहाँ 12शिक्तित मित ते क्तित मित डीवाहाँ",
"A_en": "Yadavas",
"A_hi": "याहाँ",
"B_en": "Ralwals",
"B_hi": "याहाँ",
"C_en": "Alwar Dynasty",
"C_hi": "याहाँ",
"D_en": "Mewar Rajputs",
"D_hi": "याहाँ",
"answer": "D",
"explanation_en": "The Alwar Dynasty, also known as Mewar Rajputs, ruled the Mewar province during the 12th century.",
"explanation_hi": "याहाँ 12शित मित मित डशित तीहाँ",
}