[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Famous Kings and Palaces",
"question_en": "Which famous king of Rajasthan built the Amber Fort?",
"question_hi": "राजस्थान के पसंदीदा राजधानी यहां किस राज्य के बीमा विभाग का बना।",
"A_en": "Prince Mansingh I", "A_hi": "मंसिंग अल्लाह",
"B_en": "Prince Sawai Man Singh I", "B_hi": "सावाई मन सिंग एल",
"C_en": "Kumbha Rao Diwali", "C_hi": "कुम्भ राव दीवाली",
"D_en": "Prince Rao Ganga", "D_hi": "राव गणगाँ",
"answer": "B",
"explanation_en": "Prince Sawai Man Singh I, also known as Sawai Man Singh II, is famous for building the Amer Fort in Jaipur, Rajasthan. He was a general of the Mughal Emperor Akbar and later became the ruler of Jaipur after the death of Emperor Akbar. The Amer Fort, also known as Amer Fort, is a part of the Rajasthan's heritage and attracts tourists from all over the world.",
"explanation_hi": "सावाई मन सिंग एल, अल्लाह से सुनिया में सम्पनी कर्मणिक तथ्या में ज्ञान कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में कुर्म्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्मणिक तथ्या में सम्पनी कर्में सम्पनी कर्मणी कर्में सम्पनी कर्में सम्पनी की कर्मणिक कर्मी कर्में सम्पनी कर्मी कर्मी कर्मणिक",
 कर्मी कर्मी क कर्मी क की कर्मी कर्मी क कर्मी क कर्मी कर्मी कर्मी क कर्मी कर्मी क कर्मी क कर्मी कर्मी क कर्मी क कर्मी",
"question_hi": "कर्मी कर्मी कर्मी क कर्मी क कर्मी कर्मी क कर्मी क कर्मी क कर्मी",
"options_en": [
{
"option_en": {
"option_hi": "कर्मी कर्मी कर्मी",
"option_hi": "कर्मी कर्मी कर्मी",
"option_explanation_en": "Jaipur",
"option_hi": "कर्मी कर्मी",
"option_explanation_hi": "क कर्मी कर्मी",
"option_explanation_hi": "कर्मी कर्मी",
"answer": "B",
"option_explanation_hi": "कर्मी कर्मी",
"option_explanation