[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous palace is located in Jaipur?",
"question_hi": "जयपुर में पसंदीदा पाली किसे प्रतिबिम्ब है?",
"A_en": "Hawa Mahal",
"A_hi": "हवा महाल",
"B_en": "Amer Fort",
"B_hi": "अमेर फॉर्ट",
"C_en": "Cenotaph of Maharaja Sawai Man Singh II",
"C_hi": "शाही महाराज सवाई मंसूल सीनोटपन महाराज सोवाई मंसूल सीनोटपन",
"D_en": "Nahargarh Fort",
"D_hi": "नहारगढ़ फॉर्ट",
"answer": "B",
"explanation_en": "Amer Fort is a famous palace located in Jaipur, Rajasthan.",
"explanation_hi": "अमेर फॉर्ट, राजस्थान में जयपुर में रहता है।",
},
{
"subject": "Rajasthan History",
"topic": "Major Festivals of Rajasthan",
"question_en": "What are some important festivals celebrated in Rajasthan?",
"question_hi": "राजस्थान में कैसे महंगी प्रदर्शन हों को जानना चाहिए।",
"A_en": "Gangaur Festival",
"A_hi": "गांगौर विषय",
"B_en": "Karni Temple Festival",
"B_hi": "काननी मेंग",
"C_en": "Pushkar Fair",
"C_hi": "पुष्टिका विषय",
"D_en": "Jeet Singh Rathore ki Mahal",
"D_hi": "जीट सिंग राथोरे की माहाल",
"answer": "C",
"explanation_en": "Pushkar Fair is an important festival celebrated in Rajasthan. This fair is held annually at Pushkar, a holy town near Ajmer.",
"explanation_hi": "पुष्का विषय, Rajasthan mein आजमी के नवीं मुल्यांविषय, महाल को सलोंचा स्पूस्का विषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांविषयोंका मुल्यांका मुल्यांविषयोंका मुल्यांविषया मुल्यांका मुल्या मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्यांका मुल्या