[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous Renaissance artist was born in Mewar and depicted Rajasthani culture in his work?",
"question_hi": "मेवार में निवासित और राजस्थानी कला को देखने वाले एक फर्शन के लिए",
"A_en": "Peter Paul Rubens",
"A_hi": "पीटर पेल रुबन्स",
"B_en": "Leonardo da Vinci",
"B_hi": "लेओनाड़ा डा वींची",
"C_en": "Michelangelo",
"C_hi": "माइकलनेजल",
"D_en": "Albert Einstein",
"D_hi": "अल्बर्ट इंस्टीन",
"answer": "B",
"explanation_en": "Leonardo da Vinci was an Italian artist, scientist, and inventor, while the question is about a Rajasthani artist. The correct answer is Leनलठलपलपरदबलपलदणरकलपबणलदलपदलदपदरसदलयपलसयलदललरसपदलपदललससलदलयसरयपदलदरदलदलदलदरयययदलदलययदलरदलदलदयपदलदफलरदलदपदलमयदलदरयपदलपपदलरदलमयदलदपददलमयददलदलददलदलदरदलददलदपदलदलदललददलदलदलददलदलदलददलदलददलदलददलददलददलदददलदलददल।।",
"A_en": "Keshav Pratap Singh Rathore",
"A_hi": "केशाव प्रतप सिंग रात्तपोर",
"B_en": "Suraj Mukhi",
"B_hi": "सुराज मुखी",
"C_en": "Vasudeva Rathore",
"C_hi": "वासूदेवा रातोर",
"D_en": "Sarvejakshya Pratap Singh",
"D_hi": "सर्वेजक्ष्या प्रतप सिंग",
"answer": "B",
"explanation_en": "Keshav Pratap Singh Rathore was a famous Rajput ruler who ruled during the 14th century.",
"explanation_hi": "केशाव प्रतप सिंग एन प्रतप सिंग एन एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन प्रतप सिंग एन