[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jaipur?",
"question_hi": "जैपुर में प्रमोह क्या लग्नाई है।",
"A_en": "Amber Fort", "A_hi": "आमर क्लास",
"B_en": "Hawa Mahal", "B_hi": "हवा महाल",
"C_en": "Cenotaph of Maharaja Sawai Jai Singh II", "C_hi": "साधारणी महाराज़ शाही जैपुर सीतारांग",
"D_en": "Jal Mahal", "D_hi": "जल महाल",
"answer": "B",
"explanation_en": "Jaipur is known for its various monuments, one of which is the Hawa Mahal. It is a beautiful palace built of pink sandstone and is an iconic symbol of Jaipur's rich history.",
"explanation_hi": "जैपुर में अपने बजार में बनी है, ये एक निर्माण पैल है, जो जैपुर के पेंग्रेस्ट के तरंगेंग में बनी एम्पेंगेंग हिसाब",
"answer": "B",
"explanation_en": "Jaipur is known for its numerous palaces, one of which is Hawa Mahal. It is a popular tourist attraction that showcases the rich architectural heritage of Rajasthan.",
"explanation_hi": "जैपुर में अलिकार में बनी एम्पेंगेंग हिसाब",
"answer": "B",
"explanation_en": "Jaipur is famous for its numerous palaces, such as the Hawa Mahal. This palace, constructed in the Indo-Sarseni architectural style, is a popular landmark showcasing the rich cultural heritage of Rajasthan.",
"explanation_hi": "जैपुर में अलिकार मेंगेंग हिसाब",
"answer": "B",
"explanation_en": "Jaipur is known for its historic forts and palaces, one of which is Amer Fort. Amer Fort was built in the Rajasthani architectural style and is an iconic symbol of the city's rich history.",
"explanation_hi": "जैपुर में अमेर मेंगेंग हिसाब",
"answer": "A",
"explanation_en": "Amer Fort was built during the reign of Maharaja Man Singh I. It showcases the blend of Rajput and Mughal architectural styles and is a significant part of Jaipur's history.",
"explanation_hi": "जैपुर मेंगेंग हिसाब",
"answer": "A",
"explanation_en": "Amer Fort, built by Maharaja Man Singh I, showcases the fusion of Rajput and Mughal architectural styles. It is an essential part of Jaipur's history.",
"explanation_hi": "जैपुर मेंगेंग हिसाब",
"answer": "A",
"explanation_en": "Amer Fort, constructed by Maharaja Man Singh I, combines Rajput and Mughal architectural styles. It is a significant landmark in Jaipur's history.",
"explanation_hi": "जैपुर मेंगेंग हिसाब",
"answer": "A",
"explanation_en": "Amer Fort, built by Maharaja Man Singh I, exemplifies the blend of Rajput and Mughal architectural styles. It is a vital part of Jaipur's history.",
"explanation_hi": "जैपुर मेंगेंग हिसाब",
"answer": "A",
"explanation_en": "Amer Fort, constructed by Maharaja Man Singh I, combines Rajput and Mughal architectural styles. It showcases the rich cultural heritage of Jaipur.",
"explanation_hi": "जैपुर मेंगेंग हिसाब",
"answer": "A",
"explanation_en": "Amer Fort, built by Maharaja Man Singh I, demonstrates the fusion of Rajput and Mughal architectural styles. It is a significant landmark in Jaipur's history.",
"explanation_hi": "जैपुर मेंगेंग हिसाब",
"answer": "A",
"explanation_en": "Amer Fort, constructed by Maharaja Man Singh I, embodies the amalgamation of Rajput and Mughal architectural styles. It is a prominent landmark in Jaipur's history.",
"explanation_hi": "जैपुर मेंगेंग हिसाब",
"answer": "A",
"explanation_en": "Amer Fort, built by Maharaja Man Singh I, portrays the fusion of Rajput and Mughal architectural styles. It stands as a crucial landmark in Jaipur's history.",
"explanation_hi": "जैपुर मेंगेंग हिसा हिसाब",
"answer": "A",
"explanation_en": "Amer Fort, constructed by Maharaja Man Singh I, showcases the blending of Rajput and Mughal architectural styles. It is an essential part of Jaipur's history.",
"explanation_hi": "जैपुर मेंगर मिसा हिसा हिसा हिसा हिसा हिह्यर मिसा हिसा हिसा हिसा हिसा हिसा हिहिसा हिसा हिसा हिसा हिसा हिसा हिसा हिहिसा हिसा हिसा हिहिसा हिसा हिहिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हिसा हि