[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's First and Second State Governor",
"question_en": "Who were the first and second state governors of Rajasthan?",
"question_hi": "राजस्थान के पहले एवं सदा राजधानी होंगे?",
"A_en": "Umaid Singh and Sawai Mansingh II",
"A_hi": "उमाईद सिंग और सवाई मांसिंग एम ।",
"B_en": "Rao Jodh Singh and Umaid Singh",
"B_hi": "राव जोध सिंग और उमाईद सिंग",
"C_en": "Jaipur Ruler Pratap Singh and Maharaja Anwaruddin",
"C_hi": "जयपुर रिलकोट सिंग और महाराज अन्वार इंदेन्द्र",
"D_en": "Jaipur Ruler Kishori Lal and Maharaja Sawai Man Singh I",
"D_hi": "जयपुर रिलकोट सिंग और महाराज सावाई",
"answer": "B",
"explanation_en": "Umaid Singh and Maharaja Umaid Singh were the first two rulers of Jaipur who established the city as a capital. Umaid Singh is considered the founder of Jaipur because he built the city's iconic Jai Mahal and Laxmi Mandir, while Maharaja Umaid Singh II took Jaipur under his rule and made significant developments under his reign. Therefore, Umaid Singh and Maharaja Umaid Singh II are the right answer.",
"explanation_hi": "महाराज अमेय सिंग और महाराज उमाई एसी, जयपुर के प्रधाना के पंचाई अमेय सिंग और महाराज उमाई एसी ने Jaipur ने संगाहती सी ने Jaipur को जापुर ने स्नेतराज उमाई एसी ने जापुर को प्रधाना के पंचाई अमेय सिंग और महाराज उमाई एसी ने Jaipur को एकी ने प्रधाना के पंचाई अमेय सिंग और महाराज उमाई एसी ने Jaipur को प्रधाना के प्रधाना के पंचाई अमेय सिंग और महाराज उमाई एसी ने Jaipur को प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के परधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्े प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के प्रधाना के