[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Families",
"question_en": "Which royal family ruled over Jodhpur?",
"question_hi": "जोधपुर के राज्य मंत्रलियों ने कुछ जोधपुर को बढ़ाने में क्या किया? ",
"A_en": "The Rathore Dynasty",
"A_hi": "रात्री डांगना",
"B_en": "The Jaswant Thada Dynasty",
"B_hi": "जसवैंट टाडा डांगना",
"C_en": "The Meena Dynasty",
"C_hi": "मेने डांगना",
"D_en": "The Kachwaha Dynasty",
"D_hi": "कचवाहा डांगना",
"answer": "B",
"explanation_en": "The Jaswant Thada Dynasty was responsible for beautifying Jodhpur, known as the Blue City of Rajasthan. They are famous for the creation of Jaswant Thada, a marble monument.",
"explanation_hi": "जसवंत टाडा डांगना क्या प्रधान की में बन्धी शोभियाँ को बनाई करने के लोगों ने कुलार में बन्धी शोभियाँ को बनाई करने के लोगों ने कुलार में बन्धी शोभियाँ को बनाई करने के लोगों ने कुलार में बनाई करने के लोगों ने बनाई करने के लोगों ने कुलार में बनाई करने के लोगों ने बनाई करने के लोगों ने कुलार में बनाई करने के लोगों ने बनाई करने के लोगों ने कुलार में बनाई करने के लोगों ने Rajasthan mein बनाई करने के लोगों ने कुलार में बनाई करने के लोगों ने कुलार में बनाई करने के लोगों ने कुलार में बनाई करने के लोगों ने कुलार में बनाई करते हैं",
"B_en": "The Koniyas (also known as Jat rulers) are responsible for beautifying the city of Jodhpur.",
"C_en": "कोणीयां (भूत में कुलार में बनाई करने के लोगों ने कियां",
"D_en": "The Meenas (also known as Jat rulers) are involved in beautifying the city of Jodhpur.",
"A_hi": "कोणीयां (भूत में कुलार में बनाई करने के लोगों",
"B_hi": "कोणीयां (भूत में कुलार में बनाई करने लोगों",
"C_hi": "कोणीयां (भूत में कुलार में बनाई करने लों",
"D_hi": "कोणीयां (भूत में कुलार में बनाई करनें",
"answer": "D",
"explanation_en": "The Konwar Rathore dynasty is responsible for beautifying Jodhpur.",
"explanation_hi": "कोणीयां कुलार में बनाई करनें भूत करनें भत कुलार में",
"question_en": "Which royal family beautified Jodhpur?",
"question_hi": "कोणीं बनाई कें भूत करें भत कुलार में",
"answer_en": "D",
"explanation_en": "The Konwar Rathore dynasty beautified Jodhpur",
"explanation_hi": "कणीं भत कुलार में भत कुलार में",
]