Sure, I will provide you with 10 multiple-choice questions on Rajasthan History. Here are the questions in JSON format:

[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following is a famous battlefield in Rajasthan?",
"question_hi": "यहां राजस्थान में सम्मेलित बैलेक्टर्फ़्स (निष्कर्षण):
1. Chittorgarh
2. Ajmer
3. Jaipur
4. Bikaner
5. Mount Abu

जवाब: 1

उत्तरालों को जानने के लिए विवरण:
Chittorgarh: इस सम्मेलित बैलेक्टर्फ़ के लिए विवरण:
Chittorgarh Fort: It is a famous medieval fort built by Rana Kumbha in the 13th century and is known for the valor of Mewar prince Rana Ratan Singh II. Chittorgarh Fort is a UNESCO World Heritage Site and stands as a symbol of Rajput valor.

Ajmer: Ajmer Sharif Dargah, a famous Sufi shrine, is located in Ajmer. It is the tomb of Sufi saint Moinuddin Chishti and attracts a large number of visitors every year.

Jaipur: Jaipur or Pink City is the capital city of Rajasthan and is famous for its forts, palaces, and museums. It is known as the Pink City due to the color of its buildings.

Bikaner: Bikaner is famous for its forts, palaces, and the Lalgarh Fort. It is also known for its traditional cuisine, especially the Gajar ka Halwa (Carrot Halwa).

Mount Abu: Mount Abu is a hill station located in Rajasthan and is famous for its Dilwara Jain Temples. Mount Abu is also known as the summer capital of Rajasthan due to its pleasant climate.

जवाब: 1

1. Chittorgarh
2. Ajmer Sharif Dargah
3. Jaipur
4. Bikaner
5. Mount Abu

विवरण:
Chittorgarh Fort is the largest fort in India and one of the most prominent ones in Rajasthan. It played a significant role in the history of Rajasthan and India.

Ajmer Sharif Dargah is a famous Sufi shrine dedicated to Sufi saint Moinuddin Chisti. It is one of the most visited places in Rajasthan.

Jaipur is the capital city of Rajasthan and is known for its forts, palaces, and museums. It is famous for being the 'Pink City' due to the color of its buildings.

Bikaner is famous for its forts, palaces, and Lalgarh Fort. It is also known for its traditional cuisine, especially Gajar ka halwa (Carrot Halwa).

Mount Abu is a hill station and famous for its Dilwara Jain Temples. It is also known as the summer capital of Rajasthan due to its pleasant climate.