[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jaisalmer?",
"question_hi": "जयसालमर में कौन सा मंत्रों का स्थल है?",
"A_en": "Amer Fort", "A_hi": "आमर मंत्र",
"B_en": "Mehrangarh Fort", "B_hi": "मेरंगारघाट",
"C_en": "Kumbhalgarh Fort", "C_hi": "कुंभालगढ़ मंत्र",
"D_en": "Jaigarh Fort", "D_hi": "जयगर मंत्र",
"answer": "B",
"explanation_en": "Amer Fort and Mehrangarh Fort are both located in Jaipur, but Mehrangarh Fort is situated in Jodhpur, not Jaipur. Jaigarh Fort is located in Jaipur.",
"explanation_hi": "आमर मंत्र और मेरंगारघाट दोनों बंद्र मंत्र में हैं, लेकिन Jaipur, आमर मंत्र उसके में हैं, नहीं बंद्र, जो Jaipur में हैं, Jaigarh Fort विभिज्ञान में हैं। Jaigarh Fort और आमर मंत्र को भूमियों में हैं, लेकिन बंद्र, जो Jaipur में हैं, आमर मंत्र को भूमियों में हैं।",
"question_hi": "आमर मंत्र में हैं, जो Jaipur में हैं, बंद्र भूमियों में हैं। Jaisalmer का बंद्र भूमियों में हैं, जो Jaipur में हैं, बंद्र भूमियों में हैं।",
"A_hi": "जैसालमेर भूमियों में हैं, जो Jaipur में हैं, बंद्र भूमियों में हैं।",
"B_hi": "जैसालमेर भूमियों में हैं, जो Jaipur में हैं, बंद्र भूमियों में हैं।",
"C_hi": "जैसालमेर भूमियों में हैं, जो Jaipur में हैं, बंद्र भूमियों में हैं।",
"D_hi": "जैसालमेर भूमियों में हैं, जो Jaipur में हैं, बंद्र भूमियों में हैं।",
"answer": "A",
"explanation_en": "The Amer Fort and Amber Fort are located in Jaipur, while Jaisalmer Fort is located in Jaisalmer. Amer Fort and Amber Fort are located in Jaipur.",
"explanation_hi": "आमी और आमी के मेंगं में हैं, जो जैसालमेंगं मेंगं मेंगं, जो जैसालमेंगंगं मेंगं मेंगंगंगं।",
"explanation_hi": "आमी और आमी मेंगंगंगं मेंगंगं मेंगं मेंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगंगं