[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jaipur?",
"question_hi": "जयपुर में कौन सी गतिविद्यालय की आँखी है।",
"A_en": "Amer Fort", "A_hi": "अमेर किले",
"B_en": "Hawa Mahal", "B_hi": "हावा महाल",
"C_en": "Galta Ji Temple", "C_hi": "गल्ता जी मंदिर",
"D_en": "Pratapgarh Fort", "D_hi": "प्रतापगढ़ किले",
"answer": "B",
"explanation_en": "Amer Fort and Hawa Mahal are famous forts located in Jaipur, but Hawa Mahal is more specifically known as a palace, while Amer Fort is a combination of a fort and a palace. Therefore, the correct answer is Hawa Mahal (B).",
"explanation_hi": "जयपुर में अमेर और हाउवा महाल जयपुर में एक किले और एक कंदर्भवन हैं, लेकिन अमेर में विशेष दर्शन है। विशेषदर्शन जयपुर में विशेष दर्शन है। इसेंगे। लेकिन जयपुर में विशेष दर्शन है।",
"answer": "B",
"explanation_en": "Amer Fort is a famous palace located in Jaipur. It is also known as the 'Shish Mahal'. While Amer Fort is a palace, the 'Shish Mahal' refers to a mirror work design found in several palaces of Jaipur, including City Palace and Hawa Mahal.",
"explanation_hi": "जयपुर में अमेर का एक मोहनिती पन्न लेखना है। यहींगे। अमेर का 'शिश महाल' कहाँ बजाना है। यहींगे। अमेर में कुछ कलाकारिती पन्न लेखना है।",
"answer": "B",
"explanation_en": "The Amer Fort is a well-known monument in Jaipur. It is also referred to as the 'Shish Mahal' due to its mirror work. The City Palace and Hawa Mahal are also famous for mirror work in Jaipur.",
"explanation_hi": "अमेर को राजगामंद कालाकार बजाने के लिएगांक लेखना है। यहींगेंगे। जयपुर में कुछ कलाकार बजाने के लिएगांक लेखना है। जयपुर मेंगेंगे। हावा महाल और कालाकार बजाने के लिएगांक लेखना है। यहींगेंगे। जयपुर मेंगे। हावा महाल और कालाकार बजाने के लिएगांक लेखना है। यहींगेंगे। जयपुर मेंगे। हावा महाल और कालाकार बजाने के लिएगांक लेखना है। यहिंगेंगे। जयपनर मेंगेंगे। हावा महाल और काल बजाना हिंगेंगेंगेंगेंगे। यहिंगेंगेंगेंगेंगेंगेंगेंगेंगेंगगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगगेंगेंगेंगेंगेंगेंगेंगेंगेंगगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगंगेंगेंगेंगेंगेंगेंगेंगेंगगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगंगेंगेंगेंगेंगेंगंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंगेंग