[
{
"subject": "Rajasthan History",
"topic": "Holding of First Karni Singh Rally in Rajasthan",
"question_en": "When and where was the first Karni Singh Rally held in Rajasthan?",
"question_hi": "राजस्थान में पहली कर्नी सिंग रायल कब और कहा गया था?",
"A_en": "January 1960, Birla Stadium, Jaipur",
"A_hi": "जनवरी 1960, बीला स्टेडियम, जयपुर",
"B_en": "February 1959, Mehrangarh Fort, Jodhpur",
"B_hi": "फविबर्वाद, जोधौर के मेहरारघ",
"C_en": "March 1962, Albert Hall, Jaipur",
"C_hi": "मार्च 1962, अल्बर हॉल, जयपुर",
"D_en": "April 1979, Sanganeri Handicrafts Market, Jaipur",
"D_hi": "आरपी घरतीयां, जयपुर के सांगानेरी विश्वासितां",
"answer": "C",
"explanation_en": "The first Karni Singh Rally was held in Jaipur, at Albert Hall in March 1962.",
"explanation_hi": "राजस्थान मंगाई, अल्बर हॉल, जयपुर की मुद्रा",
"explanation": "राजस्थान मंगाई, अल्बर हॉल, जयपुर की मुद्रा",
"explanation_en": "The first Karni Singh Rally was organized in Jaipur at Albert Hall in March 1962.",
"explanation_hi": "राजस्थान मंगाई, अल्बर हॉल, जयपुर की मुद्रा",
{
"subject": "Rajasthan History",
"topic": "Raja Jai Singh II and his Significant Contributions",
"question_en": "Who is the famous Rajput ruler of Jaipur and what were his significant contributions?",
"question_hi": "जयपुर के अम्बर हाल के फोमेन और उनके अनुसंगीत सहित उनकी संतुलिखी मार्चकों और उनके अनुसंगीत",
"A_en": "Raja Jai Singh II and his significant contributions.",
"A_hi": "राजा जयपुर के मार्चकों और उनके अनुसंगीत",
"B_en": "Umaid Bhawan and his contributions.",
"B_hi": "उमाई बौन और उनकी अनुसंगीत",
"C_en": "Jai Lal and his contributions.",
"C_hi": "जयलै और उनकी अनुसंगीत",
"D_en": "Kishan Singh and his contributions.",
"D_hi": "किशन सिंगे और उनकी अनुसंगीत",
"answer": "D",
"explanation_en": "Raja Kishan Singh played a significant role in setting up the first Rifle Range in India and was also a pioneer in the establishment of Jaipur Cantonment. His contributions are also known as Jaipur Cantonment's founding father.",
"explanation_hi": "राजा किशन सिंगे ने पहले भारत के पहले रेफॉर्स आई पहले बहले रेफारुसे पहले भारत",
"explanation": "Raja Kishan Singh played a crucial role in establishing the first rifle range in India and also contributed to the establishment of Jaipur Cantonment. He is regarded as the founding father of Jaipur Cantonment.",
}
]