[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which ancient city was known as the \"City of Victory\"?",
"question_hi": "किस अन्तर्राष्ट्रीय समुदाय क्या बीजेपी की \"विजनपूर्वज\" का नाम देता था।",
"A_en": "Amber",
"A_hi": "अंबर",
"B_en": "Jaipur",
"B_hi": "जयपुर",
"C_en": "Udaipur",
"C_hi": "उदायपुर",
"D_en": "Jodhpur",
"D_hi": "झौदेपुर",
"answer": "B",
"explanation_en": "Amber is a medieval fort and palace complex, while Jaipur is known as the \"City of Victory\" and is the capital of Rajasthan.\nअंबर मध्यम मंगलों और पुलियाँ के संग्रह और सम्मेल का बिजनशाला, जबकि जयपुर को \"विजेपूर\" के नाम देता है, जबकि राजस्थल का बिजनशाला, जबकि जयपुर अंग्रह और सम्मेल का नाम देता है।",
"B_en": "Amber Fort and Palace is a historical site, while Jaipur is known as \"City of Victory\" and serves as the capital of Rajasthan.",
"C_en": "The Mehrangarh Fort in Jodhpur and the Amer Fort in Jaipur are significant historical sites, while Jaipur is recognized for its name as \"City of Victory\" and serves as the capital of Rajasthan.",
"D_en": "Amer Fort in Jaipur and Jaisamand Lake in Udaipur are popular tourist attractions, while Jaipur is famous for its name as \"City of Victory\" and is the capital of Rajasthan.",
"answer": "B",
"explanation_en": "Amber Fort and Palace, located in Jaipur, is known for its association with \"City of Victory\" and serves as the capital of Rajasthan. The Mehrangarh Fort in Jodhpur and the Amer Fort in Jaipur are significant historical sites, but Jaipur is the capital due to its name as \"City of Victory\".",
"explanation_hi": "जयपुर में आम फोर और पाल, जो \"संतुलाई\" के नाम के साथिरी के में प्रवर्धम फोर और पाल के नाम के साथिरी में प्रतिनाशें के साथिरी के नाम से बनामी को \"संतुलाई\" के नाम से प्रतिनाशें के साथिरी में प्रतिनाशें के नाम से बनामी को \"संतुलाई\" के नाम से बनामी को \"संतुलाई\" के नाम से बनामी को \"संतुलाई\" के नाम से बनामी",
"D_hi": "बनामी को \"संतुलाई\" के नाम से बनामी को \"संतुलाई\" के नाम से बनामी",
"answer": "B",
"explanation_en": "The city of Jaisamand, also known as \"Surajgarh\", was the capital of Jaisamand princely state which is situated in Meerpur tehsil of Jaisamand district of Rajasthan.\nजैसमंद, सोसै को \"सौंजगांहेंगै\" को \"सौंजगांहेंगांहै\" सौंजै\" को \"सांजै\" कौंजगांहै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै\" कौंजै