[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jaipur?",
"question_hi": "जापुर में किस पसंदी किस्मत कोणत्र उपस्थिति है?",
"A_en": "Hawa Mahal", "A_hi": "हावा महाल",
"B_en": "Amer Fort", "B_hi": "अमेर कंधा",
"C_en": "Nahargarh Fort", "C_hi": "नाहरगढ़ कंधा",
"D_en": "Central Museum", "D_hi": "मेमोर",
"answer": "C",
"explanation_en": "Nahargarh Fort, also known as the 'Palace of Tigers', is a famous fort located in Jaipur, Rajasthan.\n\nराजस्थान में Jaipur mein Nahargarh कंधा, जो पेशां कोणत्र 'टीगर' कहा जाता है, राजस्थान में Jaipur mein है।",
"explanation_hi": "राजस्थान में Jaipur mein Nahargarh कंधा, जो पेशां कोणत्र 'टीगर' कहा जाता है, राजस्थान में Jaipur mein है।"
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following battles is closely associated with the history of Rajasthan?",
"question_hi": "राजस्थान के पूर्वागों द्वांचे किस को धैरीं का कालीना होगे।",
"A_en": "Battle of Saragarhi", "A_hi": "सरागढ़ी बेल",
"B_en": "Battle of Mewar", "B_hi": "मेवार बेल",
"C_en": "Battle of Haldighati", "C_hi": "हल्डिगटी बेल",
"D_en": "Battle of Talab Mohalla", "D_hi": "तालाब मोहाला",
"answer": "C",
"explanation_en": "The Battle of Haldighati is closely associated with the history of Rajasthan. It occurred in 1576 between the forces of Mewar and Marwar.",
"explanation_hi": "राजस्थान के छिद्रों के बेल बेल में की बेल, मेवार और मर्वार देशों की बेल",
"explanation_hi": "राजस्थान के छिद्रों के बेल, मेवार और मर्वार देशों की बेल",
"answer": "C"
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Who is the famous warrior who led the Chittorgarh Fort?",
"question_hi": "चीटूरगर के कोणति को विपकोणति कोणति लेडों कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति कोणति",
कोणति कोणति कोणति कोणति कोणति कोणति कोणति",
"A_en": "Shivaji Rai", "A_hi": "शिवांगडम",
"B_en": "Bhag", "B_hi": "