[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which emperor established the city of Jaipur?",
"question_hi": "जायपुर के निर्माण किया किस संघ का?",
"A_en": "Amber", "A_hi": "अमेर",
"B_en": "Hanuman", "B_hi": "हंयुनाम",
"C_en": "King Ram", "C_hi": "राम जान",
"D_en": "King Jai", "D_hi": "जय जान",
"answer": "D",
"explanation_en": "King Jai, also known as Maharaja Jai Singh II, established the city of Jaipur.",
"explanation_hi": "महाराज जै, महाराजी जय सिंग्सी II, Jaipur को निर्माण करने वाला था।"
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous forts were built during the reign of King Maharaja Jai Singh II?",
"question_hi": "महाराजी जै सिंग्सी II के सत्ता मंगलम और Amer के बनवले हैं।",
"A_en": "Amber and Amer",
"A_hi": "मंगलम और Amer",
"B_en": "Chand Baori and Hawa Mahal",
"B_hi": "चंद बाऊरी और Hawa Mahal",
"C_en": "Forbidden City and City Palace",
"C_hi": "पांसी की बहन और City Palace",
"D_en": "Sisodia Rani Kila and Jaipur Fort",
"D_hi": "सिसोदी राणी की घर और जापुर कोट",
"answer": "D",
"explanation_en": "During the reign of King Maharaja Jai Singh II, the forts of Sisodia Rani Ki Kila and Jaipur Fort were built in Jaipur.",
"explanation_hi": "महाराजगत महाराजगत के अधिकार महाराजगत के सिसोदिया राणी की कीघर और जापुर कोट, जापुर श्रेखा कीघर और जापुर कोट",
"explanation_hi": "महाराजगत के अधिकार के सिसोदिया राणी कीघर और जापुर कोट",
"answer": "D"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital",
"question_en": "What was the capital of Rajasthan before Jodhpur?",
"question_hi": "राजस्थान के पहले जोधुमी के आयंवा की विधिया राजधान",
"A_en": "Jaisamand",
"A_hi": "जैसामांड",
"B_en": "Udaipur",
"B_hi": "उदायपुर",
"C_en": "Jaipur",
"C_hi": "जापुर",
"D_en": "Jaisamand",
"D_hi": "जैसामांड",
"answer": "A",
"explanation_en": "Before Jodhpur became the capital of Rajasthan, the capital was Udaipur.",
"explanation_hi": "बाजपुर राजधान कोण होंग राजवा के वापुर",
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan Festivals",
"question_en": "Which festival is celebrated in Rajasthan on the occasion of the birth of Maharaja Sawai Jai Singh II?",
"question_hi": "राजस्थान महाराजवा सावय जाय सींग राजवा महाराजवा जाय सींग राजवा जाय सावय जाय सिंग राजवा जाय सावा जाय सांग राजवा जाय सावा जाय सांग राजवा जाय सावा जाय सांग राजवा जाय सावा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सा राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय सांग राजवा जाय