[
{
"subject": "Rajasthan History",
"topic": "Capital of Rajasthan",
"question_en": "What is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी क्या है?",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Jaipur",
"B_hi": "जयपुर",
"C_en": "Udaipur",
"C_hi": "उदयपुर",
"D_en": "Bikaner",
"D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "The capital of Rajasthan is Jaipur.",
"explanation_hi": "राजस्थान की राजधानी है जयपुर।",
"explanation": "राजस्थान की राजधानी है जयपुर। राजधानी का समर्थ रोनाल के पालियां को बनाने के लिए हुए स्तर और इंटीग्रॉन का स्तर राजधानी का स्तर और इंटीग्रॉन का स्तर राजधानी का स्तर राजधानी का स्तर और इंटीग्रॉन का स्तर राजधानी का स्तर",
"B_en": "In which year was the construction of Amer fort started?",
"B_hi": "ऐमेर की काल्पाठम्यां का स्तर राजधानी का स्तर",
"C_en": "Which city was ruled by the Meera dynasty?",
"C_hi": "मेरा दिलीकां के समूर्ति को केंद्रां के निवासी हेन अन्यारा के समूर्ति के सामने खाना हेन अन्यारा के निवासी हेन अन्यारा के समूर्ति को केंद्रां के निवासी हेन अन्यारा के समूर्ति को केंद्रां के निवासी हेन अन्यारा के समूर्ति के निवासी हेन अन्यारा के समूर्ति के निवासी हेन अन्यारा के समूर्ति के निवासी हेन अन्यारा के समूर्ति के निवासी हेन अन्यारा के समूर्ति",
|---
{
"question_en": "When was Amer Fort established by Rana Kumbha?",
"question_hi": "अम्यारा कुम्बहान ने बने के समूर्ति",
"A_en": "1434",
"A_hi": "1434",
"B_en": "1434",
"B_hi": "1434",
"C_en": "1446",
"C_hi": "1446",
"D_en": "1456",
"D_hi": "1456",
"answer": "C",
"explanation_en": "Amer Fort was established by Rana Kumbh in the year 1446.",
"explanation_hi": "अम्यारा कुम्बहान ने बनि बनने बने सम्यारा कुम्बनि बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बनने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बने बनने बने बने बने बने बने बने बने बने बनने बने बने बने बने बने बने बने बने बनने बने बने बने बने बने बने बने बने बने बने बने बने बने",
"B_hi": "बने बने बने बने बने बने बने बने बने बने बने बने ब