[
{
"subject": "Rajasthan History",
"topic": "Rajput Rajas",
"question_en": "Which Rajput clan did Maharana Pratap belong to?",
"question_hi": "महारानेवाला प्रतिपाल के लिए कौन-सा राजपुत गलत थे।",
"A_en": "Chittorgarh", "A_hi": "चीटरगढ",
"B_en": "Kachchhapatan", "B_hi": "कच्छपतन",
"C_en": "Meena", "C_hi": "मेना",
"D_en": "Sisodia", "D_hi": "सिसोड़िया",
"answer": "B",
"explanation_en": "Maharana Pratap belonged to the Kachchhapatan clan, which is a sub-clan of the Rathore clan. The Rathore clan is a part of the Rajput Rajas, a prominent warrior caste in Rajasthan.",
"explanation_hi": "महारानेवाला प्रतिपाल के लिए कौन-से जन के समाज में अमीर के लोगों का एक अध्यय समाज में एक उपलोग है, जिसके लोगों के समाज में एक अमीर विमान है।",
"B_en": "Maharana Pratap belongs to the Rathore community, which is a sub-clan of the Rajput community in Rajasthan. The Rajput community is a prominent warrior caste.",
"B_hi": "महारांना प्रतीप एक राजपुत में एक समाज है, जिसके लोगों के समाज में एक अमिर विमान है।",
"C_en": "Maharana Pratap belongs to the Rathore community, which is a sub-clan of the Rajput community in Rajasthan. The Rajput community consists of valiant warrior families.",
"C_hi": "महारांना प्रतीप एक राजपुत में एक समाज है, जिसके लोगों के समाज में एक अमिर विमान है।",
"D_en": "Maharana Pratap belongs to the Rathore community, which is a sub-clan of the Rajput community in Rajasthan. The Rajput community is known for their bravery and martial traditions.",
"D_hi": "महारांना प्रतीप एक राजपुत में एक समाज है, जिसके लोगों के समाज में एक अमिर विमान है।",
{
"subject": "Rajasthan",
"topic": "Early History",
"question_en": "Which dynasty was the foundation of Rajasthan?",
"question_hi": "राजस्थन की समाज क्यांके लोगों के समाज में एक अमिर विमान है।",
"A_en": "Ranas of Mewar",
"A_hi": "मेवर्न की जनता",
"B_en": "Rajputs",
"B_hi": "राजपुत",
"C_en": "Chauhans",
"C_hi": "चौहाँन",
"D_en": "Rathore",
"D_hi": "राघौर्ल",
"answer": "A",
"explanation_en": "The foundation of Rajasthan was laid by the Ranas of Mewar, a prominent Rajput clan. The Ranas of Mewar were known for their bravery and rule.",
"explanation_hi": "राजपुत के लोगों के ने राजपुत के लोगों के ने राजपुत के लोगों के ने राजपुत के लोगों के ने राजपुत के लोगं के ने राजपुत के लोगों के ने राजपुत के लोगों के ने राजपुत के लों के ने राजपुत के ले राजे ने राजपे ले ने राजपे ले ने राजपे ले राजे ले ने राजे ले राजे ले राजे ले ने राे ले ले राजे ले राे ले ले राे ले राे ले ले राे ले ले राे ले ले ले राे ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ले ल