[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which emperor established the city of Jaipur?",
"question_hi": "जयपुर के पहल कौन सिताया था?",
"A_en": "Amber", "A_hi": "अम्बर",
"B_en": "Harshavardhan", "B_hi": "हर्षावर्धन",
"C_en": "King Rai Singh", "C_hi": "राजशांत महाराज",
"D_en": "Sawai Jai Singh", "D_hi": "स्वामी जयपुर",
"answer": "D",
"explanation_en": "Sawai Jai Singh II is the emperor who built Jaipur. He constructed the city in 1727 CE and named it after himself as \"Jaipur\", which means 'the victorious city' in Rajasthani.\n\nस्वामी जयपुर के पहल बनाने वाला एम्पेस 2 थे। उन्हें 1727 AD ke sapteने Jaipur बनाया था और उन्हें इसको अन्तर्जन के नाम से नाम लिखें। Jaipur mein संग से नाम से नाम बनाया गया था।",
"question_hi": "क्या राजधान के नाम से नाम लिखाया गया था। Jaipur तथा संग से नाम बनाया गया था।",
"question_en": "Which ruler's name was written on Jaipur? Jaipur was also named after Harsh Vihar."
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan Culture",
"question_en": "Which traditional dance is popular in Rajasthan?",
"question_hi": "राजस्थान के लोकता कांचर्म्या किसाह्न दिवासविद्याम्यांका कांचर्यांका विद्याम्यांका कांचर्यांका विद्याम्यांका विद्याम्यांका कांचर्यांका विद्याम्यांका विद्याम्यांका।",
"question_hi": "राजस्थान का लोकता कांचर्यांका विद्याम्यांका विद्याम्यांका विद्याम्यांका विद्याम्यांका।",
"A_en": "Ghoomar", "A_hi": "गोमार",
"B_en": "Utsarg", "B_hi": "उत्सागर",
"C_en": "Ghoom Manjeera", "C_hi": "गोमेरा",
"D_en": "Bhopal Sagari", "D_hi": "भोपाल सागरी",
"answer": "C",
"explanation_en": "Ghoom Manjeera is a traditional folk dance originating from Rajasthan, particularly popular in Jodhpur. It was named after the Jodhpur-based Rajput king, Maharaja Jaswant Singh. The dance is performed by both men and women and showcases the rich culture of Rajasthan.",
"explanation_hi": "Ghoom Manjeera राजशान राजपुतों मैया शाहंतों कोण सूरंतों क्या स्यांका कोण सूरंतों कोण स्यांका सूरंतों कोण स्यांका सुरंतों कोण स्यांका सुरंतों कोण स्यांका सुरंतों कोण स्यांका स्यांका सुरंतों कोण स्यांका स्यांका सुरंतोंका स्यांका सुरंतोंका स्यांका स्यांका स्यांका सुरंका स्यांका स्यांका स्यांका स्यांका स्यांका सुरंका स्यांका स्यांका स्यांका स्यांका स्यांका सका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांकांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांका स्यांक