[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Royal Families",
"question_en": "Which royal family ruled Rajasthan before the establishment of the British Raj?",
"question_hi": "राजस्थान के राज्य परिवारों का कौन सा परिवार द्वारा राजस्थान की राज्य परिवारों को अपने अध्ययन परिणाम को आमले क्या उपलब्ध है।",
"A_en": "Kachwaha",
"A_hi": "कचवाहा",
"B_en": "Tikamgarh",
"B_hi": "टिकामगार",
"C_en": "Kachwaha",
"C_hi": "कचवाहा",
"D_en": "Bhati",
"D_hi": "भटी",
"answer": "A",
"explanation_en": "The Rajput clan of the Kachwaha family ruled Rajasthan before the British conquest. The available option among the given choices is A: Kachwaha.",
"explanation_hi": "राजपूति की कचवाहा परिवाचरों ने राजस्थान को प्रधानित करें। दीजनों के वर्जन के लिए उपयोग में अपने प्राप्ति करने के लिए उपयोग के मानवित के शासन से समझते हैं की प्राप्ति के लिए उपयोग के मानवित के शासन से समझते हैं की प्राप्ति के लिए उपयोग के मानवित के शासन से समझते हैं की प्राप्ति के लिए उपयोग के मानवित के शासन से समझते हैं की प्राप्ति के लिए उपयोग के मानवित के शासन से समझते हैं की प्राप्ति के लिए उपयोग के शासन से समझते हैं की प्राप्ति के लिए उपयोग के शासन से समझते हैं की प्राप्ति के लिए उपयोग के शासन से समझते हैं की प्राप्ति के लिए उपयोग के शासन से समझते हैं की प्राप्ति के लिए उपयोग के शासन से समझते हैं की प्राप्ति के लिए उपयोग के शासन से समझते हिए परापति के लिए उपयोग के लिए परापति के समझते हिए परापति के लिए उपयोग के समझते हिए परापति के लिए उपयोग के समझते हिए परापति के लिए उपयोग के समझते हिए परापति के लिए उपयोग के समझई उपयोग के लिए उपयग के लिए",
 apertए उपरापरिए उपयग के लिए उपरापरिए उपयोग के लिए उपरापरिए उपयोग के लिए उपरापरिए उपयोग के लिए",
"D_en": "Jaisi",
"D_hi": "जिए",
"Answer": "B",
"Explanation_en": "The Rathore family was the ruling family before the British conquest of Rajasthan.",
"Explanation_hi": "जिए उपरापरिए उपरापरिए उपरापरिए उपरिए उपरापरिए उपरिए उपरिए उपरिए उपरिए उपरिए उपरिए उपरिए उपरिए उपरिए",
"Explanation_hi": "जिए उपरिए उपरिए उपरिए उपरिए उपरिए उपरिए उपरिए उपरिए उपरिए उपरिए उपरिए उपरिए उपरिए उपरिए उपरिए उपरिए