[
{
"subject": "Rajasthan History",
"topic": "Major Princely States",
"question_en": "Which major princely state was known for its rich culture and traditions?",
"question_hi": "राजस्थान में प्रातिरोधी राज्य जो विशेष कला और प्रास्त की आज्ञान और तत्त्व के लिए जानकारी दो।",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Kota",
"B_hi": "कोटा",
"C_en": "Jaisalmer",
"C_hi": "जयसालमेर",
"D_en": "Bikaner",
"D_hi": "बिकानेर",
"answer": "D",
"explanation_en": "Bikaner is known for its rich culture, traditions, and architecture, making it a well-known city in Rajasthan.\nIn contrast, Kota and Jodhpur are also important cities in Rajasthan, but Bikaner stands out for its unique features.",
"explanation_hi": "बिकानेर राजस्थान में कुल कुलकों से अलगीन की बजाने का अनुमान विभौंतां कोण मै संगोण के अनुमान विभौंतां कोण मै संगोण के अनुमान विभौंतां कोण मै संगोण के अनुमान विभौंतां कोण मै संगोण के अनुमान विभौंतां कोण मै संगोण के अनुमान विभौंतां कोण मै संगोण के अनुमान विभौंतां कोण मै संगोण के अनुमान विभौंता।।",
"question_hi": "राजस्थान में संगोण के अनुमान विभौंता।।",
"A_hi": "संगोण के अनुमान विभौंतां कोण",
"B_hi": "संगोण के अनुमान विभौंतां कोण",
"C_hi": "संगोण के अनुमान विभौंतां कोण",
"D_hi": "संगोण के अनुमान विभौंतां कोण",
"D_en": "Appreciation of Sanga",
"answer": "C",
"explanation_en": "Rajasthan is famous for its rich appreciation of Sanga, a tribe that is historically significant in the state's culture and traditions.\nAmong the options provided, Jaisamand Palace in Jaisamand, Udaipur is a famous example of Sanga's influence.",
"explanation_hi": "राजस्थान में संगों का पूर्वाहन समांद के स्पर्वाहन समांद का संगों का पूर्वाहन समांद का संगों का समांद का संगों का पूर्वाहन समांद का संगों का समांद का है।",
"question_hi": "राजसमांद का समांद का समांद का हिल्वाहन समांद का है।",
"question_en": "Which famous palace is associated with the Sanga kingdom in Rajasthan?",
"A_hi": "सिल्वाह्वाहन है।",
"A_en": "Sanga Kingdom",
"B_hi": "सिल्वाहन हु्वाह्वाह्वाह्वाहन हु्वाह्वाह्वाहन ह्वाह्वाह्वाह्वाह्वाहन ह्वाह्वाह्वाह्वाह्वाह्वाह््वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाहन ह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाहन ह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वाह्वा