[
{
"subject": "Rajasthan History",
"topic": "Rajput Rajas",
"question_en": "Which Rajput Rajas have contributed significantly to the history of Rajasthan?",
"question_hi": "राजस्थान के राजपूतों ने राजस्थान के अर्थशास्त्रीय प्रश्न का उत्तर दो।",
"A_en": "Kachchhwaha Rajputs, Thakur Rajputs",
"A_hi": "कच्छवाहा राज्यों aur ताक्तुंग राज्यों",
"B_en": "Rathore Rajputs, Chauhans",
"B_hi": "रातोर राज्यों aur चौहानों",
"C_en": "Jat, Jataka",
"C_hi": "जमीं, जमाक",
"D_en": "Kumbhalgarh, Bishnoi",
"D_hi": "कुमभगवान, बिश्नी",
"answer": "B",
"explanation_en": "Out of the mentioned Rajput clans and families, Rathore Rajputs and Chauhans have significantly contributed to the history of Rajasthan. The Jat and Jataka communities have also played a role in the region's history, but the answer is based on the focus on Rajput clans.",
"explanation_hi": "उल्लेखन और चौहान मनों के राजपूतों और इंसाफर मनों ka उत्तराचार्यां के राजपूतों के राजपूत आदमियों के राजपूतों ka उत्तराचार्यां के राजपूतों के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्तराचार्यां के राजपूतों ka उत्त्राजपूतों के राजपूतों ka उत्राज्राजपूतों ka उत्राजपूतों ka उत्राजपूत्राजपूत्राज्राज्राज्रा्राजप्राजप्राज्राजप्राज्राज्राज्राजप्राज्राज्रा्रा्राज्राज्राज्राज्राज्राज्रा्राज्राज्रा्रा्रा्राज्रा्रा्राज्रा्राज्रा्रा्रा्रा्रा्राज्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा