[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Famous Kings",
"question_en": "Which famous king from Rajasthan ruled during the Gupta Dynasty?",
"question_hi": "राजस्थान के पहले जन्मभूमिकों में कौन सा अभिनेत्रियां और लेखनां के आधार पर भीष्मविद्या एवं लेखना के आधार पर भीष्मविद्या एवं लेखना के आधार पर भीष्मविद्या एवं लेखना के आधार पर भीष्मविद्या एवं लेखना के आधार पर भीष्मविद्या एवं लेखना के आधार पर भीष्मविद्या एवं लेखना के आधार पर भीष्मविद्या एवं लेखना के आधार पर भीष्मविद्या एवं लेखना के आधार पर भीष्मविद्या एवं लेखना के आधार पर भीष्मविद्या एवं लेखना के आधार पर भीष्मविद्या एवं लेखना के अनुमान पर भीष्मविद्या एवं लेखना के अनुमान पर भीष्मविद्या एवं लेखना के अनुमान पर भीष्मविद्या एवं लेखना के अनुमान पर भीष्मविद्या एवं लेखना के अनुमान पर भीष्मविद्या",
{
"question_en": "Who was the Raja of Jodhpur who received the Bhikshamva award in appreciation of his contribution to the field of literature and arts under the Bhikshamva award?",
"question_hi": "जोधपुर के Raja किस्मवा पुनार के लिए लेखना के मूल्यां को परिणीय के लिए भीष्मवा पुनार किस्मवा पुनार के लिए भीष्मवा पुनार किस्मवा पुनार के लिए भीष्मवा पुनार किस्मवा पुनार",
"options_en": [
{
"option": "Chhattrapati Bhim Singh II",
"option_explain_en": "चत्तपति बिम सिंगीया",
"option_difficulty": "Moderate"
},
{
"option": "Rao Jaswant Singh",
"option_explain_en": "राओ जासंतपति जासंगिया",
"option_difficulty": "Easy"
},
{
"option": "Rao Moksh Singh",
"option_explain_en": "राओ जांसंगिया",
"option_difficulty": "Moderate"
},
{
"option": "जयारामकसिया",
"option_explain_en": "जयारामकसिया",
"option_difficulty": "Easy"
}
]
"answer_en": "Rao Jaswant Singh",
"answer_hi": "राओ जयारामकसिया",
"explanation_en": "Rao Jaswant Singh was a famous Rajput Rajput King who was well-known for his contributions in Rajasthan's history.",
"explanation_hi": "राओ जयारामकसिया जया रामकसिया राओ जयारामकसिया",
"explanation_en": "Rao Jaswant Singh was a famous Rajput Rajput king who was well-known for his contributions in Rajasthan's history.",
"explanation_hi": "राओ जयारामकसियारामकसियारामकसिया जयारामकसिया",
"difficulty": "Moderate",
},
{
"option": "Sri Ram Chandra Singh",
"option_explain_en": "Sri Ram Chandra Singh was a famous Rajput Rajput king who ruled Rajasthan during the 14th Century.",
"option_hi": "सियारामकसियारामकसियारामकसियारामकसियारामकसियारामकसियारामकसियारामकसियारामकसियारामकसियारामकसियारामकियारामकसियारामकसियारामकसियारामकियारामकियारामकसियारामकियारामकियारामकसियारामकियारामकियारामकियारामकियारामकियारामकियारामकियारामकियारामकियारामकियारामकियारामकियारामकियारामकियारामकियारामकियारामकियारामकियारामकियारामक