[
{
"subject": "Rajasthan History",
"topic": "Rajasthani Culture",
"question_en": "Which language is considered as the mother tongue of Rajasthan's rich culture?",
"question_hi": "राजस्थान की महान कला-प्राचीनता के लिए मूल भाषा क्या है।",
"A_en": "Marwari", "A_hi": "मर्वारी",
"B_en": "Hindi", "B_hi": "हिंदी",
"C_en": "Aravalli", "C_hi": "अरवली",
"D_en": "Takshashila", "D_hi": "ताक़सिला",
"answer": "B",
"explanation_en": "Hindi is considered as the mother tongue for the rich cultural heritage of Rajasthan. Marwari and Aravalli are also regional languages spoken in Rajasthan, but Hindi holds significant importance in terms of education and administration.",
"explanation_hi": "राजस्थान में राजमंतर्यांक मैं अरवली और मर्वारि भी राजस्थान में भाषाओं को बीजन सिला और मर्वारि भी राजस्थान में भाषाओं को बिजन सिला और मर्वारि भी राजस्थान में भाषाओं को बिजन सिला और मर्वारि भी राजस्थान में भाषाओं को बिजन सिला और मर्वारि भी राजस्थान में भाषाओं को बिजन सिला और मर्वारि भी राजस्थान में भाषाओं को बिजन सिला और मर्वारि भी राजस्थान में भाषाओं को बिजन सिला और मर्वारि भी राजस्थान में भाषाओं को बिजन सिला और मर्वारि भी राजस्थान में भाषाओं को बिजन सिला और मर्वारि भी राजस्थान में भाषाओं को बिजन सिला और मर्वारि भी राजस्थान में भाषाओं को बिजन सिला और मर्वारि भी राजस्थान में भाषाओं को बिजन सिला और मर्वारि भी राजस्टान में भाषाओं को बिजन सिला और मर्वारि भी राजस्टान में भाषाओं को बिजन सिला और मर्वारि भिला भी राजस्टान में भाषाओ बिजन सिला भिला भिला राजस्टान में भाषाओ बिजन सिला भिला राजसिला भिला राजसिला भिला राजसिला भिला राजसिला राजसिला भिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राज सिला राजसिला राजसिला राजसिला राज राजसिला राजसिला",
{"राजसिला राज राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला",
{"राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला",
{"राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसिला राजसि