[
{
"subject": "Rajasthan History",
"topic": "Rajasthan in Mughal Era",
"question_en": "Which Mughal emperor is associated with the construction of the Mehrangarh Fort in Jodhpur?",
"question_hi": "जोधपुर में निर्माण किया गया मुगल उम्मेदवार कौन सी शहरों में निर्माण किया गया था?",
"A_en": "Sultan Bahadur Shah Zafar",
"A_hi": "सत्ता बाहदूर शाह जाफ़ार",
"B_en": "Shah Jahan",
"B_hi": "शाह जाहाँ",
"C_en": "Aurangzeb",
"C_hi": "अरोंगजेब",
"D_en": "Akbar",
"D_hi": "अकबर",
"answer": "C",
"explanation_en": "Aurangzeb is considered to be the emperor who constructed the Mehrangarh Fort in Jodhpur. It was built during his reign in the 16th century.",
"explanation_hi": "अरोंगजेब को पुलिस को भागीय होंगजेब ने मेहरांगर बिहर को भागीय होंगजेब ने बना विभिजाने वाले मेहरांगर बिहर",
"explanation_en": "Aurangzeb is credited with the construction of Mehrangarh Fort in Jodhpur. It was built during his reign in the 16th century.",
"explanation_hi": "अरोंगजेब ने क्लीस बिहींगर बिहर को बना विभिजाने वाले मेहरांगर बिहर",
"explanation_hi": "अरोंगजेब ने क्लीस बिहींगर बिहर को बना विभिजाने वाले मेहरांगर बिहर",
{
"subject": "Rajasthan History",
"topic": "Rajasthan in Mughal Era",
"question_en": "Which emperor is associated with the construction of Chittorgarh Fort?",
"question_hi": "जितारगार को कौर्तेल कांतुर मेहरांगर बिहर",
"A_en": "King Rana Kumbha",
"A_hi": "राजन कुम्भा",
"B_en": "King Rana Meera",
"B_hi": "राजन मीरा",
"C_en": "King Kumbha",
"C_hi": "राजन कुम्भ",
"D_en": "King Sanga",
"D_hi": "राजन सांगा",
"answer": "D",
"explanation_en": "King Sanga is associated with the construction of Chittor Fort. Chittorgarh Fort is named after him.",
"explanation_hi": "करंगा कांतुर कांतुर मेहरांगर बिहर",
"explanation_hi": "करंगा कांतुर मेहरांगर बिहर",
}
{
"subject": "Rajasthan History",
"topic": "Rajasthan during Mughal rule",
"question_en": "When did the Mughal rule end in Rajasthan?",
"question_hi": "राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राज्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल को राजस्तान मुगाल क