[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following is not a للمملكة العربية السعودية تاريخ وتراث ثقافي غني. تأسست المملكة في عام 1932 بعد توحيد مناطق نجد والحجاز ومناطق أخرى تحت قيادة ابن سعود. تشمل المملكة مدنًا تاريخية مهمة ومواقع تراثية مثل مدائن صالح وجدة التاريخية.

1. الرياض - عاصمة المملكة العربية السعودية وأكبر مدنها
2. العلا - مدينة تاريخية مشهورة بمدائن صالح
3. الطائف - مدينة سعودية تقع على المرتفعات الغربية لجبل السروات
4. أبها - عاصمة المملكة العربية السعودية

اختر الإجابة الصحيحة:

A. أبها
B. الطائف
C. العلا
D. أبها (غير صحيح، عاصمة المملكة هي الرياض)

الشرح: العلا هي مدينة تاريخية مشهورة بسبب مدائن صالح، أحد المواقع المسجلة في منظمة اليونسكو للتراث العالمي. الرياض هي عاصمة المملكة العربية السعودية وتقع على المرتفعات الشرقية لجبل طويق. الطائف هي مدينة سعودية تقع على المرتفعات الغربية لجبل السروات وليست عاصمة المملكة. أبها هي عاصمة المملكة العربية السعودية وتقع في منطقة عسير جنوب المملكة. الإجابة الصحيحة هي C. العلا.] 

يرجى مراعاة توفير الإجابات باللغة العربية والإنجليزية وتوضيح الشرح باللغتين أيضًا. 

تأكد من تنسيق الأسئلة والإجابات في JSON بالتنسيق التالي:

```json
{
  "subject": "المملكة العربية السعودية تاريخ وتراث",
  "topic": "",
  "question_ar": "",
  "question_en": "",
  "options_ar": [
    {
      "option_ar": "",
      "option_en": "",
      "option_value": ""
    },
    {
      "option_ar": "",
      "option_en": "",
      "option_value": ""
    },
    {
      "option_ar": "",
      "option_en": "",
      "option_value": ""
    },
    {
      "option_ar": "",
      "option_en": "",
      "option_value": ""
    }
  ],
  "correct_answer": {
    "option_ar": "",
    "option_en": "",
    "option_value": ""
  },
  "explanation_ar": "",
  "explanation_en": ""
}
```

يرجى توفير أسئلة و خيارات الإجابة وشرح باللغة العربية والإنجليزية وتحديث القيم المناسبة وفقًا للموضوع والأسئلة المقدمة. 

مثال:

```json
{
  "subject": "المملكة العربية السعودية تاريخ وتراث",
  "topic": "",
  "question_ar": "ما هي عاصمة المملكة العربية السعودية؟",
  "question_en": "What is the capital of Saudi Arabia?",
  "options_ar": [
    {
      "option_ar": "الرياض",
      "option_en": "الرياض",
      "option_value": "الرياض"
    },
    {
      "option_ar": "مكة المكرمة",
      "option_en": "Mecca",
      "option_value": "Mecca"
    },
    {
      "option_ar": "المدينة المنورة",
      "option_en": "Medina",
      "option_value": "Medina"
    },
    {
      "option_ar": "الدمام",
      "option_en": "Dammam",
      "option_value": "Dammam"
    }
  ],
  "correct_answer": {
    "option_ar": "الرياض",
    "option_en": "الرياض",
    "option_value": "الرياض"
  },
  "explanation_ar": "الرياض هي عاصمة المملكة العربية السعودية وتعتبر أكبر مدينة فيها. تقع الرياض في وسط المملكة وتمثل مركزًا اقتصاديًا وسياسيًا وثقافيًا هامًا.",
  "explanation_en": "Al Riyadh is the capital of the Kingdom of Saudi Arabia and serves as a major economic, political, and cultural center in the country."
}
```

في حال أردت إضافة المزيد من الأسئلة والمواضيع، يُرجى توفير تفاصيل الموضوع والسؤال باللغة العربية والإنجليزية، وسأقوم بتحديث الإجابات والشروح وفقًا لذلك. 

يرجى ملاحظة أنني يمكنني توفير أسئلة وشروح باللغة العربية والإنجليزية بناءً على طلبك. إذا كنت ترغب في إضافة المزيد من الأسئلة والمواضيع، يرجى توفير تفاصيل الموضوع والسؤال باللغتين العربية والإنجليزية وسأقوم بتحديث الإجابات والشروح وفقًا لذلك. 

إذا كنت تحتاج إلى مواضيع أخرى أو أسئلة باللغة العربية والإنجليزية، يُرجى توفير التفاصيل وسأقوم بإعداد الأسئلة والأجوبة والشروح وفقًا لذلك.