[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital and Princely States",
"question_en": "Which of these was a princely state in Rajasthan?",
"question_hi": "इन में किस स्थानीय स्वतंत्र भाग राजस्थान में थे।",
"A_en": "Jodhpur",
"A_hi": "जोधपुर",
"B_en": "Udaipur",
"B_hi": "उदयपुर",
"C_en": "Jaisalmer",
"C_hi": "जयसालमर",
"D_en": "Kota",
"D_hi": "कोटा",
"answer": "D",
"explanation_en": "Kota was a princely state in Rajasthan. Jodhpur, Udaipur, and Jaisalmer were also princely states in Rajasthan, but Kota is the only one mentioned in the question.",
"explanation_hi": "राजस्थान में कोटा एक स्वतंत्र भाग था। जोधपुर, उदयपुर और जयसालमर भी राजस्थान में स्वतंत्र भाग थे, लेकिन कोटा प्राकृति में एक स्वतंत्र भाग था। जोधपुर, उदयपुर, जयसालमर भी राजस्थान में एक स्वतंत्र भाग था। कोटा प्राकृति में एक स्वतंत्र भाग था। जोधपुर, उदयपुर, जयसालमर भी राजस्थान में एक स्वतंत्र भाग था।",
"question_hi": "राजस्थान में कोटा प्राकृति में एक स्वतंत्र भाग था। जोधपुर, उदयपुर, जयसालमर भी राजस्थान में एक स्वतंत्र भाग थां।",
"A_hi": "कोटा प्राकृति में Jodhpur, Udaipur, Jaisalmer के लिएक स्वतंत्र भाग थे।",
"options": [
{
"option_text_hi": "जोधपुर",
"option_text_en": "Jodhpur",
"option_text_hi": "उदयपुर",
"option_text_en": "Udaipur",
"option_text_hi": "जयसालमर",
"option_text_en": "Jaisalmer"
],
"answer": "B",
"explanation_en": "Kota was a part of the union territory in Rajasthan, along with Jodhpur, Udaipur, and Jaisalmer.",
"explanation_hi": "कोटा राजस्थान में जोधपुर, उदयपुर, जोड़पुर, और जयसालमर को सम्मान के बार्ती में कोटा, जोड़पुर, उदयपुर, और जयसालमर को समान के बार्ती में कोटा, जोड़पुर, उदयपुर, और जयसालमार को साँ बार्ती में कोटा, जोड़पुर, उदयपुर, और जी बार को साँ बारती में कोटा, जोड़पुर, उदयपुर, और जी बार को साँ बारती में कोटा, जोड़पर, उदयपुर, और जी बार कोटा, जोड़पर, उदयपुर, और जी बार कोटा, जोड़पुर, उदयपुर, और, जी बार, जी बार कोटा, जी बार, उदयपुर, जोड़पुर, उदयपुर, जी बार, जी बार",
	
"question_en": "Which princely state was the capital of Rajasthan during the Mughal period?",
"question_hi": "मघ्रा जी बार, उदयपुर, जी बार, जसार, उदयपुर, जी बार, जी बार, जसार, उदयपुर",
"options_en": [
{
"option": "A",
"option": "B",
"option": "C",
"option": "D",
"option": "E",
"option": "F",
"option": "G",
"option": "H",
"option": "I",
"option": "J",
"option": "K",
"option": "L",
"option": "M",
"option": "N",
"option": "Q",
"option": "T",
"option": "U",
"option": "ज",
"option": "जसार, जी बार, उदयपुर",
"options_hi": [
{
"option_hi": "जसार",
"option_hi": "जी बार",
"option_hi": "उदयपुर",
"option_hi": "जी बार",
"option_hi": "जी बार",
"option_hi": "जसार",
"option_hi": "जी बार",
"option_hi": "जसार",
"option_hi": "जी बार",
"option_hi": "जी बार",
"option_hi": "जसार",
"option_hi": "जी बार",
"option_hi": "जी बार",
],
"answer": "जसार",
"explanation_en": "During the Mughal period, Kota was the capital of Rajasthan.",
"explanation_hi": "मघ्रा जस