[
{
"subject": "Rajasthan History",
"topic": "Rajputana",
"question_en": "Which famous fort was built by Raja Ratan Singh of Kachhwaha clan?",
"question_hi": "राजा रत्न सिंह के कलनवाली मंदिर किस लोग बनाया गया है?",
"A_en": "Amber Fort", "A_hi": "अमेरिका मंदिर",
"B_en": "Mehrangarh Fort", "B_hi": "मेरंगर",
"C_en": "Sisodia Rani Ka Bagh", "C_hi": "सिसोड़ी रानी का बाग",
"D_en": "Kumbhalgarh Fort", "D_hi": "कुम्भलगढ़ मंदिर",
"answer": "B",
"explanation_en": "Amber Fort was built by Rao Jodhua, whereas Mehrangarh Fort was built by Rao Jodha.",
"explanation_hi": "अमेरिका मंदिर बना राजोड़ू सपैलिंगर मंदिर बना राजगढ़ सपैंगर मंदिर बना राजोड़ सपैंगर मंदिर",
"explanation_en": "Amber Fort was built by Rao Jodhua, while Mehrangarh Fort was built by Rao Jodha.",
"explanation_hi": "अमेरिका मंदिर बना राजोड़ सपैंगर मंदिर",
"answer": "B",
"explanation_en": "Mehrangarh Fort is located in Jodhpur, Rajasthan, while Amber Fort is located in Jaipur, Rajasthan.",
"explanation_hi": "मेरनगर मंदिर जोड़ सपैंगर मंदिर को जोड़ सपैंगर मंदिर का स्थल जोड़, राजस्थान में है। आदिस्थान, राजकुमार में अमेरिका में है आदिस्थान, राजकुमार में अमेरिका में है आदिस्थान, राजकुमार में अमेरिका में है आदिस्थान, राजकुमार में अमेरिका में है आदिस्थान, राजकुमार में अमेरिका में है आदिस्थान, राजकुमार में अमेरिका में है आदिस्थान, राजकुमार में अमेरिका में है आदिस्थान, राजकुमार में अमेरिका में है आदिस्थान, राजकुमार में अमेरिका में है आदिस्थान, राजकुमार में अमेरिका में है आदिस्थान, राजकुमार में अमेरिका में है आदिस्थान, राजकुमार में अमेरिका में है आदिस्थान, राजकुमार में अमेरिका में है आदिस्थान, राजकुमार में अमरिका में है आदिस्थान, राजकुमार में अमेरिका में है अदिस्थान, राजकुमार में अमेरिका में अदिस्थान, राजका में अमेरिका में अदिस्थान, राजका मेरिका में अदिस्थान, राजका मेरिका मेरिका मं अदिस्थान, राजका मेरिका मेरिका मेरिका मेरिका मेरिका मेरिका मेरिका मेरिका मं अदिस्थान, राजका मेरिका मेरिका मेरिका मेरिका मेरिका मेरिका मेरिका मं अदिस्थान, राजका मेरिका मेरिका मेरिका मेरिका मेरिका मेरिका मेरिका मं अदिसिका मेरिका मेरिका मेरिका मेरिका मेरिका मेरिका मेरिका",
}
] 
]