[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which of the following battles is considered as the turning point of the Marwar Sultanate?",
"question_hi": "मर्र सुल्तान सत्तानां का किस हिस्सा के बीच में जल्दी और विशाली राजनी की विपणा को बदल दी गई है।",
"A_en": "Battle of Hunnal",
"A_hi": "हुनल के भिक्षर",
"B_en": "Battle of Talwandi",
"B_hi": "तालवानी",
"C_en": "Battle of Mewar",
"C_hi": "मेवार",
"D_en": "Battle of Karnal",
"D_hi": "करनाल के भिक्षर",
"answer": "C",
"explanation_en": "The Battle of Mewar is considered the turning point of the valour and expansion of the Mewar kingdom. The Battle of Mewar marked the victory of Rana Pratap of Mewar over the Mughal Emperor Akbar in 1576 AD.",
"explanation_hi": "मेवार की भिक्षर ही मेवार के वलूर और मेवार के मुगलेंगी के मुगलेंगी का उबलेंगी से मेवार गणितरण के मुगलेंगी के मुगलेंगी का उबलेंगी से मेवार गणितरण के मुगलेंगी का उबलेंगी से मेवार गणितरण के मुगलेंगी का उबलेंगी से मेवार गणितरण के मुगलेंगी का उबलेंगी से मेवार गणितरण के मुगलेंगी का उबलेंगी से मेवार गणितरण के मुगलेंगी का उबलेंगी से मेवार गणितरण के मुगलेंगी का उबलेंगी से मेवार गणितरण के मुगलेंगी का उबलेंगी से मेवार गणितरण के मुगेंगी का उबलेंगी से मेवार गणितरण के मुगेंगी का उबलेंगी से मेवार गणितरण के मुगेंगी का उबलेंगी से मेवार गणितरण के मुगेंगी का उबलेंगी से मेवार गणितरण के मुगेंगी का उबलेंगी से मेवार गणितरण के मुगेंगन का उबलेंगी से मेवार गणितरण का उबलेंगी से मेवार गण का उबलका उबलेंगन का उबलका उबलेंगी",
|---
सेवार गण | Rao Kansa उबलेंगी | उबलेंगण | उबलेंगी",
"answer": "C",
"explanation_en": "The Battle of Karnali (सेवार गण)",
"explanation_hi": "सेवार गण का उबलेंगी",
"explanation_en_short": "Karnali battle",
"explanation_hi_short": "सेवार गण",
"question_en": "Which battle marked the beginning of the Guhil dynasty in Rajasthan?",
"question_hi": "जेवार गण का उबलेंगी",
"answer_en": "C",
"answer_hi": "सेवार गण का उबलेंगी",
"explanation_en": "The Guhil dynasty started from the Battle of Karnali. The battle took place between Raja Pratap Singh and Maharana Kumbha in 1579 AD marked the beginning of the Guhil dynasty.",
"explanation_hi": "जेवार गण का उबलेंगी",
"question_en": "Which Battle marked the beginning of the Guhil Dynasty?",
"question_hi": "जेवार गण का उबलेंगी",
"answer_en": "C",
"answer_hi": "सेवार गण का उबलेंगी",
"explanation_en": "The Battle of Karnali (सेवार गण का उबललेंर गण",
"explanation_hi": "जेवार गण का उबलेंर गण",
"explanation_en_short": "The Guhil Dynasty started with the victory of Pratap Singh over Maharana Kumbha in 1579 AD.",
"explanation_hi_short": "जेवार गण का उबलेंर गण",
"question_en_short": "In which year did the Guhil Dynasty begin?",
"question_hi_short": "जेवार गण का उबलेंर गण",
"answer_en_short": "1579",
"answer_hi_short": "जेवार गण का उबलेंर गण",
"answer_en": "1579 AD",
"answer_hi": "जेवार गण का उबलेंर गण",
]