[
{
"subject": "Rajasthan History",
"topic": "Famous Forts and Palaces",
"question_en": "Which famous fort is located in Jodhpur?",
"question_hi": "जोधपुर में कौन-सा महत्त्वागत कठिनाइयाँ पहुंची है।",
"A_en": "Meherazad Fort", "A_hi": "मेहरादगीन",
"B_en": "Lehariya Fort", "B_hi": "लहरीयां कठिनाइयाँ",
"C_en": "Rao Jodha ki Kala Bhawan", "C_hi": "राव जोधा के काला बोवां",
"D_en": "Mandore Haveli", "D_hi": "मंडोर हॉवेली",
"answer": "D",
"explanation_en": "Mandore Haveli is a famous landmark in Jodhpur, while Meherazad Fort, Lehariya Fort, Rao Jodha ki Kala Bhawan, and Rajasthan Sanskrit Academy are notable forts and palaces in Rajasthan.",
"explanation_hi": "मंडोर हॉवेली राजस्तान के मोहूं ने सीखूं के राजस्तान के मोहूं के राजस्तान के मोहूं के राजस्तान के मोहरूं के राजस्तान के मोहूं के राजस्तान के मोहूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहूं के राजस्तान के मोहरूं के राजस्तान के मोहूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के मोहरूं के राजस्तान के राजस्तान के राजस्तान के राजस्तान के राजस्तान के राजस्तान के राजस्तान के राजस्तान के राजस्तान के राजस्तान के राजस्तान के राजस्तान के राजस्तान के राजस्तान के राजस्तान के राजस्तान के राजस्तान के राज्तान के राजस्तान",

"
{"en": "question_en_en",
{"hi": "question_hi",
}
]
{"en": "Which famous forts and palaces are located in Rajasthan?",
{"hi": "राज्तान के राजस्तान के राज्तान के राज्तान के राजस्तान के राज्तान के राज्तान के राज्तान",
{"en": "Which famous forts and palaces are located in Rajasthan?",
{"hi": "राज्तान के राज्तान के राज्तान के राज्तान के राज्तान के राज्तान के राज्तान के राज्तान के राज्तान राज्तान के राज्तान",
{"en": "Which famous palace is located in Jaipur?",
{"hi": "जपराज्तान के राज्तान ज्तान के राज्तान के राज्तान के राज्तान के राज्तान राज्तान के राज्तान"} "Question_en": "Which forts and palaces are famous in Rajasthan?",
{"hi": "जपराज्तान के राज्तान के राज्तान के राज्तान",
{"en": "What are the famous forts and palaces in Rajasthan?",
{"hi": "Rājājājaprājī के र