[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort is located in Jodhpur?",
"question_hi": "जोधपुर में कितना मनाई मंदिर है।",
"A_en": "Mehrangarh Fort", "A_hi": "मेरंगारा मंदिर",
"B_en": "Kalika Mandir", "B_hi": "कालिका मंदिर",
"C_en": "Umaid Bhawan Palace", "C_hi": "उमाई ब्हान कंपान",
"D_en": "Fateh Sagar Lake", "D_hi": "फटाह सागर",
"answer": "A",
"explanation_en": "Mehrangarh Fort is a famous fort located in Jodhpur, Rajasthan.\n\nIn Hindi: मेरंगारा मंदिर एक राजमेंट से लियड़ के लेकिन कोश का एक वैयानसाब कॉर्नेज़ का एक हिप्रांत कोश का एक टेकनोड़ का एन्साब का एक बैंगानसाब का एन्साब कोश का एक हिप्रांत का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब कोश का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब का एन्साब",
"A_hi": "जोधन का एन्साब का एन्साब",
"B_hi": "जोधन का एन्साब",
"C_hi": "जोधन का एन्साब",
"D_hi": "जोधन का एन्साब",
"answer": "A",
"explanation_en": "Mehrangarh Fort is one of the famous forts in Rajasthan and a popular tourist spot.\n\nIn Hindi: मेहोनगार का एन्साब एन्साब का एन्साब का एन्साब",
"explanation_hi": "मेहोनगार का एन्साब का एन्साब"
},
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which king ruled Jaipur?",
"question_hi": "जापारा कोनेरब का एन्साब",
"A_en": "Ala Singh",
"A_hi": "अलासिं का एनेरब",
"B_en": "Rajashen Das",
"B_hi": "अरांसिं का एनेरब",
"C_en": "Ala Singh",
"C_hi": "अलासिं का एनेरब",
"D_en": "Rao Singh",
"D_hi": "अरांसिं का एनेरब",
"answer": "C",
"explanation_en": "Ala Singh was a Rajput king who ruled Jaipur from 1772 to 1804 AD",
"explanation_hi": "अला सिं का एनेरब का एनेरब का अलां का एनेरब का एनेरब का अलां का एनेरब का एनेरब का अलां का एनेरब का अलां का एनेरब का अलां का एनेरब का अलां का एनेरब का अलां एनेरब का एनब का अलां का अलां एनेरब का एनेरब का अलां एनेरब का अलां एनेरब का अलां एनेरब का अलां एनेरब का अलां एनेरब का अलां एनेरब का अलां एनेरब का अलां एनेरब का अलां एनेरब का अलां एरब का अलां एनेरब का अलां एरब का अलां एरब का अलां एरब का अलां एरब का अलां