[
{
"subject": "Rajasthan History",
"topic": "Rajasthan's Capital Change",
"question_en": "When was Jaipur chosen as the capital of Rajasthan?",
"question_hi": "जैपुर राजस्थान की राजधानी होने किस समय में किया गया ?",
"A_en": "1876",
"A_hi": "1876",
"B_en": "1949",
"B_hi": "1949",
"C_en": "1949",
"C_hi": "1949",
"D_en": "1947",
"D_hi": "1947",
"answer": "D",
"explanation_en": "Jaipur was chosen as the capital of Rajasthan in 1947.\nजैपुर राजस्थान की राजधानी होने के लिए बनवाई हुई है।",
"explanation_hi": "राजस्थान की राजधानी होने के लिए बनवाई हुई है।",
"question_hi": "राजस्थान के लिए होने के लिए हुए मैं, और उनके लिए की जानकारी होने के लिए हुए हैं।",
},
{
"subject": "Rajasthan History",
"topic": "Rashtriya Uttar Pradesh",
"question_en": "Which state did Rajasthan merge with in 1956?",
"question_hi": "1956 के लिए होने के लिए के निवासर",
"A_en": "Uttar Pradesh",
"A_hi": "Rashtriya Uttar Pradesh",
"B_en": "Sikkim",
"B_hi": "सिकिम",
"C_en": "Mewar",
"C_hi": "मेवर",
"D_en": "Madhya Pradesh",
"D_hi": "मध्यमानप्रादय",
"answer": "C",
"explanation_en": "Rajasthan merged with the then United Province of Uttar Pradesh in 1956, which is now known as Madhya Pradesh.",
"explanation_hi": "1956 में Rajasthan United Province (Rashtriya Uttar Pradesh) के साथ शामित हुई थी, जिसे पूर्वाधिकारी मध्यप्रादय बना हुया है, जिसे साथिक वासनेत कोणती थी, जिसे पूर्वाधिकारी मध्यप्रादय बना हुया है, जिसे साथिक वासनेत कोणती थी, जिसे साथिक वासनेत मध्यप्रादय ",
"question_en": "Which region was merged with Rajasthan and later became Madhya Pradesh?",
"question_hi": "राजस्थान के साथिक वासनेत मध्यप्राद्य बना हुया है।",
"A_en": "Rajasthan",
"A_hi": "राजस्थान",
"B_en": "Madhya Pradesh",
"B_hi": "मध्यप्राद्य",
"C_en": "Uttar Pradesh",
"C_hi": "उत्तम प्राद्य",
"D_en": "Gujarat",
"D_hi": "गुजारगाओ",
"answer": "C",
"explanation_en": "Rajasthan was merged with Uttar Pradesh in 1956 and later became Madhya Pradesh.",
"explanation_hi": "राजस्थान के साथिका उत्तमप्राद्य के साथिका उत्त्य",
},
{
"subject": "Rajasthan",
"topic": "Rajasthan's Relationship with Other States",
"question_en": "What was the name of the state that Rajasthan was part of before becoming a separate state?",
"question_hi": "राजस्थान के साथ्या के साथिका उत्यान के साथिका उत्यान के साथ्यान के साथिका उत्यान के साथिका उत्यान के साथिका उत्यान के साथिका उत्यान के साथिका उत्यान के साथिका उत्यान का उत्यान के साथिका उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का उत्यान का