[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built by Maharaja Mansingh?",
"question_hi": "राजस्थान में महाराजा माहंसिंग ने बनाया गया किस मंगलवाला को?",
"A_en": "Amber Fort", "A_hi": "अमेरिका बाँच",
"B_en": "Kumbhalgarh Fort", "B_hi": "कुम्भलगर बाँच",
"C_en": "Meena Bazaar", "C_hi": "मेना बाजार",
"D_en": "Nahargarh Fort", "D_hi": "नहरागर बाँच",
"answer": "B",
"explanation_en": "Amber Fort and Kumbhalgarh Fort are two popular forts in Rajasthan built by Maharaja Mansingh. However, Kumbhalgarh Fort is more prominent and is known for its strategic location and the longest wall in the world without any gate.\nFor this task, the answer is Kumbhalgarh Fort (B).",
"explanation_hi": "ये राजस्थान में महाराजा मानसिंग ने दोनों को बनाया है। लेकिन, Kumbhalgarh Fort प्रमोट और Amber Fort का हित विश्वामितरा के हैंें। कुम्भलगार बाँच में सकरों का हित विश्वामितरा के हित विश्वामितरा बाँच में सकरों का हित विश्वामितरा बाँच में सकरों के हित विश्वामितरा बाँच में सकरों का हित विश्वामितरा बाँच में सकरों का हित विश्वामितरा बाँच में सकरों का हित विश्वामितरा बाँच में सकरों का हित विश्वामितरा बाँच में सकरों का हित विश्वामितरा बाँच में सकरों का हित विश्वामितरा बाँच में सकरों का हित विश्वामितरा बाँच में सकरों का हित विश्वामितरा बाँच में सकरों का हित विश्वामितरा बाँच में सकरों का हित विश्वामितरा बाँच में सकरों का हित विश्वामितरा बाँच में सकरों का हित विश्वामितरा बाँच में सकरों का हित विश्वामितरा बाँच में सकरों का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित विश्वामितरा बाँच में सकरो का हित