[
{
"subject": "Rajasthan History",
"topic": "",
"question_en": "Which famous fort in Rajasthan was built by Raja Rai Singh?",
"question_hi": "राजस्थान में राजा राय सिंह ने किस लोकस्त्रोत्सविक बनाया ?",
"A_en": "Amber Fort", "A_hi": "अमेरिका स्त्रोत्सवीक",
"B_en": "Kumbhalgarh Fort", "B_hi": "कुमभगलगढ़ स्त्रोत्सवीक",
"C_en": "Mehrangarh Fort", "C_hi": "मेहनगर स्त्रोत्सवीक",
"D_en": "Ranthambore Fort", "D_hi": "रंघबारी स्त्रोत्सवीक",
"answer": "B_hi",
"explanation_en": "The famous fort built by Raja Rao Jodhraj Jadeja is Kumbhalgarh. Kumbhalgarh Fort, also known as the 'Lion Fort', was built between 15th and 16th centuries and is famed for its impregnable wall.",
"explanation_hi": "लॉनबीजन के मामी के लक्ष्मान फोट (लॉनबीजन के नाम के स्पेन बोली के स्पेन के को क्यांजन के नाम के स्पेन बोली को क्यांजन के नाम के स्पेन बोली के नाम के स्पेन बोली के नाम को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पेन बोली को क्यांजन के स्पन बोली को क्यांजन के स्पेन बोली को क्यांजन क्यांजन क्यांजन को क्यांजन ब्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन",
 क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन",
"question_en": "Which famous fort in Rajasthan was built by Rao Jodha?",
"question_hi": "राजांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन क्यांजन",
"A_en": "Amber Fort", "A_hi": "अमिंजन क्यांजन",
"B_en": "Kumbhalgarh", "B_hi": "क्यांजन क्यांजन",
"C_en": "Ranthambhore", "C_hi": "क्यांजन क्यांजन क्यांजन",
"D_en": "Bikaner", "D_hi": "क्यांजन क्यांजन",
"answer": "B_hi",
"explanation_en": "Amber Fort is the famous fort built by Rao Jodha. Amber Fort, also known as the 'Haveli', was built in the 15th century.",
"explanation_hi": "अमिंजन क्यां