[
{
"subject": "Rajasthan History",
"topic": "Madhyakalin Rajasthan mein Prashasanik aur Rajasva Vyavastha",
"question_en": "What was the main source of revenue for the kingdoms of medieval Rajasthan?",
"question_hi": "मध्यकालीन राजस्थान के राज्यों के लिए राजस्व का मुख्य स्रोत क्या था?",
"A_en": "Agricultural Tax", "A_hi": "कृषि कर",
"B_en": "Trade and Commerce", "B_hi": "व्यापार और वाणिज्य",
"C_en": "Tribute from Vassals", "C_hi": "सामंतों से उपहार",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The kingdoms of medieval Rajasthan derived their revenue from a variety of sources including agricultural tax, trade and commerce, and tribute from vassals.",
"explanation_hi": "मध्यकालीन राजस्थान के राज्यों ने अपना राजस्व कृषि कर, व्यापार और वाणिज्य, और सामंतों से उपहार जैसे विभिन्न स्रोतों से प्राप्त किया।"
},
{
"subject": "Rajasthan History",
"topic": "Madhyakalin Rajasthan mein Prashasanik aur Rajasva Vyavastha",
"question_en": "Which of the following was a key feature of the administrative system of the Rajput kingdoms of medieval Rajasthan?",
"question_hi": "निम्नलिखित में से कौन मध्यकालीन राजस्थान के राजपूत राज्यों के प्रशासनिक तंत्र की एक प्रमुख विशेषता थी?",
"A_en": "Centralized Administration", "A_hi": "केंद्रीकृत प्रशासन",
"B_en": "Decentralized Administration", "B_hi": "विकेंद्रीकृत प्रशासन",
"C_en": "Feudal System", "C_hi": "सामंतवादी प्रणाली",
"D_en": "Bureaucratic System", "D_hi": "अधिकारी तंत्र",
"answer": "C",
"explanation_en": "The Rajput kingdoms of medieval Rajasthan were characterized by a feudal system, where the king was the supreme authority and the nobles and vassals held land and power in return for loyalty and military service.",
"explanation_hi": "मध्यकालीन राजस्थान के राजपूत राज्यों में सामंतवादी प्रणाली की विशेषता थी, जहां राजा सर्वोच्च प्राधिकारी थे और नोबल और सामंतों को भूमि और शक्ति राजा की वफादारी और सैन्य सेवा के बदले में दी जाती थी।"
},
{
"subject": "Rajasthan History",
"topic": "Madhyakalin Rajasthan mein Prashasanik aur Rajasva Vyavastha",
"question_en": "What was the role of the 'Pargana' in the administrative system of medieval Rajasthan?",
"question_hi": "मध्यकालीन राजस्थान के प्रशासनिक तंत्र में 'परगना' की भूमिका क्या थी?",
"A_en": "Revenue Collection", "A_hi": "राजस्व संग्रह",
"B_en": "Law and Order", "B_hi": "कानून और व्यवस्था",
"C_en": "Administration of Justice", "C_hi": "न्याय प्रशासन",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "A",
"explanation_en": "The 'Pargana' was a revenue collection unit in the administrative system of medieval Rajasthan, responsible for collecting taxes and tributes from the peasants and nobles.",
"explanation_hi": "मध्यकालीन राजस्थान के प्रशासनिक तंत्र में 'परगना' राजस्व संग्रह की एक इकाई थी, जो किसानों और नोबल्स से कर और उपहार संग्रह करने के लिए जिम्मेदार थी।"
},
{
"subject": "Rajasthan History",
"topic": "Madhyakalin Rajasthan mein Prashasanik aur Rajasva Vyavastha",
"question_en": "Which of the following taxes was levied on the peasants of medieval Rajasthan?",
"question_hi": "निम्नलिखित में से कौन सा कर मध्यकालीन राजस्थान के किसानों पर लगाया जाता था?",
"A_en": "Bhaga", "A_hi": "भाग",
"B_en": "Kharaj", "B_hi": "खराज",
"C_en": "Ushr", "C_hi": "उश्र",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The peasants of medieval Rajasthan were liable to pay various taxes, including 'Bhaga', 'Kharaj', and 'Ushr', which were levied on their agricultural produce.",
"explanation_hi": "मध्यकालीन राजस्थान के किसानों को विभिन्न करों का भुगतान करना पड़ता था, जिनमें 'भाग', 'खराज', और 'उश्र' शामिल थे, जो उनकी कृषि उपज पर लगाए जाते थे।"
},
{
"subject": "Rajasthan History",
"topic": "Madhyakalin Rajasthan mein Prashasanik aur Rajasva Vyavastha",
"question_en": "What was the significance of the 'Chauth' in the administrative system of medieval Rajasthan?",
"question_hi": "मध्यकालीन राजस्थान के प्रशासनिक तंत्र में 'चौथ' का क्या महत्व था?",
"A_en": "It was a tax levied on the peasants", "A_hi": "यह किसानों पर लगाया गया एक कर था",
"B_en": "It was a tribute paid to the Mughal Empire", "B_hi": "यह मुगल साम्राज्य को दिया गया उपहार था",
"C_en": "It was a quarter of the revenue collected from a region", "C_hi": "यह एक क्षेत्र से संग्रहीत राजस्व का एक चौथाई हिस्सा था",
"D_en": "It was a military contingent maintained by the Rajput kingdoms", "D_hi": "यह राजपूत राज्यों द्वारा बनाए रखा गया एक सैन्य दल था",
"answer": "C",
"explanation_en": "The 'Chauth' was a quarter of the revenue collected from a region, which was paid to the Mughal Empire as a tribute by the Rajput kingdoms of medieval Rajasthan.",
"explanation_hi": "मध्यकालीन राजस्थान के राजपूत राज्यों द्वारा मुगल साम्राज्य को दिया जाने वाला 'चौथ' एक क्षेत्र से संग्रहीत राजस्व का एक चौथाई हिस्सा था।"
},
{
"subject": "Rajasthan History",
"topic": "Madhyakalin Rajasthan mein Prashasanik aur Rajasva Vyavastha",
"question_en": "Which of the following was a key feature of the revenue administration of the Rajput kingdoms of medieval Rajasthan?",
"question_hi": "निम्नलिखित में से कौन मध्यकालीन राजस्थान के राजपूत राज्यों के राजस्व प्रशासन की एक प्रमुख विशेषता थी?",
"A_en": "Centralized Revenue Collection", "A_hi": "केंद्रीकृत राजस्व संग्रह",
"B_en": "Decentralized Revenue Collection", "B_hi": "विकेंद्रीकृत राजस्व संग्रह",
"C_en": "Revenue Farming", "C_hi": "राजस्व खेती",
"D_en": "Taxation based on Land Ownership", "D_hi": "भूमि स्वामित्व पर आधारित कराधान",
"answer": "B",
"explanation_en": "The Rajput kingdoms of medieval Rajasthan had a decentralized revenue collection system, where the revenue was collected by the local administrators and nobles.",
"explanation_hi": "मध्यकालीन राजस्थान के राजपूत राज्यों में एक विकेंद्रीकृत राजस्व संग्रह प्रणाली थी, जहां राजस्व स्थानीय प्रशासकों और नोबल्स द्वारा संग्रहीत किया जाता था।"
},
{
"subject": "Rajasthan History",
"topic": "Madhyakalin Rajasthan mein Prashasanik aur Rajasva Vyavastha",
"question_en": "What was the role of the 'Amil' in the revenue administration of medieval Rajasthan?",
"question_hi": "मध्यकालीन राजस्थान के राजस्व प्रशासन में 'आमिल' की भूमिका क्या थी?",
"A_en": "He was responsible for collecting revenue", "A_hi": "वह राजस्व संग्रह के लिए जिम्मेदार था",
"B_en": "He was responsible for maintaining law and order", "B_hi": "वह कानून और व्यवस्था बनाए रखने के लिए जिम्मेदार था",
"C_en": "He was responsible for administering justice", "C_hi": "वह न्याय प्रशासन के लिए जिम्मेदार था",
"D_en": "He was responsible for collecting intelligence", "D_hi": "वह खुफिया संग्रह के लिए जिम्मेदार था",
"answer": "A",
"explanation_en": "The 'Amil' was a revenue collector who was responsible for collecting revenue from the peasants and nobles in medieval Rajasthan.",
"explanation_hi": "मध्यकालीन राजस्थान में 'आमिल' एक राजस्व संग्रहकर्ता था जो किसानों और नोबल्स से राजस्व संग्रह करने के लिए जिम्मेदार था।"
},
{
"subject": "Rajasthan History",
"topic": "Madhyakalin Rajasthan mein Prashasanik aur Rajasva Vyavastha",
"question_en": "Which of the following was a type of land revenue levied in medieval Rajasthan?",
"question_hi": "निम्नलिखित में से कौन मध्यकालीन राजस्थान में लगाया गया भूमि राजस्व का एक प्रकार था?",
"A_en": "Bhaga", "A_hi": "भाग",
"B_en": "Kharaj", "B_hi": "खराज",
"C_en": "Ushr", "C_hi": "उश्र",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The land revenue levied in medieval Rajasthan included 'Bhaga', 'Kharaj', and 'Ushr', which were different types of taxes levied on agricultural land.",
"explanation_hi": "मध्यकालीन राजस्थान में लगाया गया भूमि राजस्व में 'भाग', 'खराज', और 'उश्र' शामिल थे, जो कृषि भूमि पर लगाए गए विभिन्न प्रकार के कर थे।"
},
{
"subject": "Rajasthan History",
"topic": "Madhyakalin Rajasthan mein Prashasanik aur Rajasva Vyavastha",
"question_en": "What was the significance of the 'Jagir' system in medieval Rajasthan?",
"question_hi": "मध्यकालीन राजस्थान में 'जागीर' प्रणाली का क्या महत्व था?",
"A_en": "It was a system of land ownership", "A_hi": "यह एक भूमि स्वामित्व प्रणाली थी",
"B_en": "It was a system of revenue collection", "B_hi": "यह एक राजस्व संग्रह प्रणाली थी",
"C_en": "It was a system of military organization", "C_hi": "यह एक सैन्य संगठन प्रणाली थी",
"D_en": "It was a system of administrative organization", "D_hi": "यह एक प्रशासनिक संगठन प्रणाली थी",
"answer": "B",
"explanation_en": "The 'Jagir' system was a system of revenue collection, where the king granted land to his nobles and officials in return for military service and revenue collection.",
"explanation_hi": "मध्यकालीन राजस्थान में 'जागीर' प्रणाली एक राजस्व संग्रह प्रणाली थी, जहां राजा अपने नोबल्स और अधिकारियों को सैन्य सेवा और राजस्व संग्रह के बदले में भूमि देता था।"
}
]