[
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "Who is considered the founder of the Guhil dynasty in Mewar and established its rule at Nagda?",
    "question_hi": "मेवाड़ में गुहिल वंश का संस्थापक किसे माना जाता है, जिसने नागदा में अपने शासन की स्थापना की?",
    "A_en": "Rana Sanga",
    "A_hi": "राणा सांगा",
    "B_en": "Bappa Rawal (Kalabhoj)",
    "B_hi": "बप्पा रावल (कालभोज)",
    "C_en": "Maharana Pratap",
    "C_hi": "महाराणा प्रताप",
    "D_en": "Rana Kumbha",
    "D_hi": "राणा कुम्भा",
    "answer": "B",
    "explanation_en": "Bappa Rawal, also known as Kalabhoj, is credited with establishing the Guhil kingdom in Mewar in the 8th century after defeating the Mori rulers and capturing Chittor. He made Nagda his initial capital.",
    "explanation_hi": "बप्पा रावल, जिन्हें कालभोज के नाम से भी जाना जाता है, को 8वीं शताब्दी में मोरी शासकों को हराकर चित्तौड़ पर कब्जा करने के बाद मेवाड़ में गुहिल राज्य की स्थापना करने का श्रेय दिया जाता है। उन्होंने नागदा को अपनी प्रारंभिक राजधानी बनाया।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "The famous Vijay Stambh (Victory Tower) in Chittorgarh Fort was constructed by Maharana Kumbha to commemorate his victory over which kingdom?",
    "question_hi": "चित्तौड़गढ़ किले में स्थित प्रसिद्ध विजय स्तंभ का निर्माण महाराणा कुम्भा ने किस राज्य पर अपनी विजय के उपलक्ष्य में करवाया था?",
    "A_en": "Marwar Kingdom (Jodhpur)",
    "A_hi": "मारवाड़ राज्य (जोधपुर)",
    "B_en": "Sultanate of Gujarat",
    "B_hi": "गुजरात सल्तनत",
    "C_en": "Sultanate of Malwa (Battle of Sarangpur)",
    "C_hi": "मालवा सल्तनत (सारंगपुर का युद्ध)",
    "D_en": "Delhi Sultanate",
    "D_hi": "दिल्ली सल्तनत",
    "answer": "C",
    "explanation_en": "Maharana Kumbha constructed the Vijay Stambh in 1440 to commemorate his decisive victory over the combined armies of Malwa (Mahmud Khilji) and Gujarat in the Battle of Sarangpur (1437).",
    "explanation_hi": "महाराणा कुम्भा ने 1437 में सारंगपुर के युद्ध में मालवा (महमूद खिलजी) और गुजरात की संयुक्त सेनाओं पर अपनी निर्णायक जीत के उपलक्ष्य में 1440 में विजय स्तंभ का निर्माण करवाया था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "Identify the ruler of Mewar who participated in the Battle of Khanwa in 1527 against Babur, marking a significant conflict for supremacy in North India.",
    "question_hi": "मेवाड़ के उस शासक की पहचान करें जिसने 1527 में बाबर के विरुद्ध खानवा के युद्ध में भाग लिया था, जो उत्तरी भारत में प्रभुत्व के लिए एक महत्वपूर्ण संघर्ष था।",
    "A_en": "Maharana Pratap",
    "A_hi": "महाराणा प्रताप",
    "B_en": "Rana Sanga",
    "B_hi": "राणा सांगा",
    "C_en": "Rana Udai Singh II",
    "C_hi": "राणा उदय सिंह द्वितीय",
    "D_en": "Rana Kumbha",
    "D_hi": "राणा कुम्भा",
    "answer": "B",
    "explanation_en": "Rana Sanga (Rana Sangram Singh) led a confederation of Rajput kingdoms against Babur in the Battle of Khanwa (1527). Although he was defeated, the battle significantly impacted the future of the Mughal Empire in India.",
    "explanation_hi": "राणा सांगा (राणा संग्राम सिंह) ने खानवा के युद्ध (1527) में बाबर के खिलाफ राजपूत राज्यों के एक महासंघ का नेतृत्व किया था। यद्यपि वे पराजित हुए, इस युद्ध ने भारत में मुगल साम्राज्य के भविष्य को बहुत प्रभावित किया।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "During the Battle of Haldighati in 1576, who commanded the Mughal army against Maharana Pratap?",
    "question_hi": "1576 में हल्दीघाटी के युद्ध के दौरान, महाराणा प्रताप के विरुद्ध मुगल सेना का नेतृत्व किसने किया था?",
    "A_en": "Raja Man Singh I of Amber",
    "A_hi": "आमेर के राजा मान सिंह प्रथम",
    "B_en": "Todar Mal",
    "B_hi": "टोडरमल",
    "C_en": "Bairam Khan",
    "C_hi": "बैरम खान",
    "D_en": "Abu'l Fazl",
    "D_hi": "अबुल फजल",
    "answer": "A",
    "explanation_en": "The Battle of Haldighati was fought between Maharana Pratap and the Mughal forces led by Raja Man Singh I of Amber, an important general of Emperor Akbar.",
    "explanation_hi": "हल्दीघाटी का युद्ध महाराणा प्रताप और अकबर के एक महत्वपूर्ण सेनापति आमेर के राजा मान सिंह प्रथम के नेतृत्व वाली मुगल सेना के बीच लड़ा गया था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "The Mewar-Mughal treaty of 1615, which brought an end to the long-standing conflict, was signed between which Mewar ruler and Mughal Emperor Jahangir?",
    "question_hi": "1615 की मेवाड़-मुगल संधि, जिसने लंबे समय से चले आ रहे संघर्ष को समाप्त कर दिया, किस मेवाड़ शासक और मुगल सम्राट जहाँगीर के बीच हस्ताक्षरित हुई थी?",
    "A_en": "Maharana Pratap",
    "A_hi": "महाराणा प्रताप",
    "B_en": "Rana Udai Singh II",
    "B_hi": "राणा उदय सिंह द्वितीय",
    "C_en": "Rana Amar Singh I",
    "C_hi": "राणा अमर सिंह प्रथम",
    "D_en": "Rana Raj Singh I",
    "D_hi": "राणा राज सिंह प्रथम",
    "answer": "C",
    "explanation_en": "After years of conflict with Emperor Akbar and Jahangir, Maharana Amar Singh I (son of Maharana Pratap) signed a peace treaty with Jahangir in 1615, accepting Mughal suzerainty in exchange for specific privileges and autonomy.",
    "explanation_hi": "सम्राट अकबर और जहांगीर के साथ वर्षों के संघर्ष के बाद, महाराणा अमर सिंह प्रथम (महाराणा प्रताप के पुत्र) ने 1615 में जहांगीर के साथ एक शांति संधि पर हस्ताक्षर किए, जिसमें कुछ विशेषाधिकारों और स्वायत्तता के बदले मुगल संप्रभुता को स्वीकार किया गया था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "Who sacrificed her son Chandan to save the life of Prince Udai Singh II of Mewar, ensuring the continuity of the Sisodia dynasty?",
    "question_hi": "मेवाड़ के राजकुमार उदय सिंह द्वितीय के जीवन को बचाने के लिए अपने पुत्र चंदन का बलिदान किसने दिया था, जिससे सिसोदिया वंश की निरंतरता सुनिश्चित की?",
    "A_en": "Mirabai",
    "A_hi": "मीराबाई",
    "B_en": "Padmini",
    "B_hi": "पद्मिनी",
    "C_en": "Panna Dhai",
    "C_hi": "पन्ना धाय",
    "D_en": "Charumati",
    "D_hi": "चारुमती",
    "answer": "C",
    "explanation_en": "Panna Dhai, the nursemaid of Prince Udai Singh II, famously sacrificed her son Chandan when Banvir tried to kill Udai Singh to seize the throne. She hid Udai Singh and allowed Banvir to kill Chandan in his place.",
    "explanation_hi": "पन्ना धाय, राजकुमार उदय सिंह द्वितीय की धाय माँ, ने प्रसिद्ध रूप से अपने पुत्र चंदन का बलिदान दिया जब बनवीर ने सिंहासन हड़पने के लिए उदय सिंह को मारने की कोशिश की। उन्होंने उदय सिंह को छिपा दिया और बनवीर को उसके स्थान पर चंदन को मारने दिया।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "Which Maharana of Mewar defied Mughal Emperor Aurangzeb's jizya tax order and provided refuge to Rajsingh II of Kishangarh's sister Charumati?",
    "question_hi": "मेवाड़ के किस महाराणा ने मुगल सम्राट औरंगजेब के जजिया कर के आदेश का विरोध किया और किशनगढ़ के राजसिंह द्वितीय की बहन चारुमती को शरण दी थी?",
    "A_en": "Rana Amar Singh I",
    "A_hi": "राणा अमर सिंह प्रथम",
    "B_en": "Rana Raj Singh I",
    "B_hi": "राणा राज सिंह प्रथम",
    "C_en": "Maharana Pratap",
    "C_hi": "महाराणा प्रताप",
    "D_en": "Rana Jagat Singh II",
    "D_hi": "राणा जगत सिंह द्वितीय",
    "answer": "B",
    "explanation_en": "Maharana Raj Singh I (1652-1680) renewed hostilities with Aurangzeb by defying the jizya tax and opposing temple destruction. He famously provided refuge to Charumati, whom Aurangzeb wanted to marry, further intensifying the conflict.",
    "explanation_hi": "महाराणा राज सिंह प्रथम (1652-1680) ने जजिया कर का विरोध करके और मंदिर के विध्वंस का विरोध करके औरंगजेब के साथ शत्रुता को फिर से शुरू किया। उन्होंने प्रसिद्ध रूप से चारुमती को शरण दी, जिससे औरंगजेब शादी करना चाहता था, जिससे संघर्ष और तेज हो गया।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "In which battle did Maharana Pratap's loyal horse Chetak die after crossing a small stream to save his master?",
    "question_hi": "महाराणा प्रताप के वफादार घोड़े चेतक की मृत्यु किस युद्ध में अपने स्वामी को बचाने के लिए एक छोटी नदी पार करने के बाद हुई थी?",
    "A_en": "Battle of Kumbhalgarh",
    "A_hi": "कुम्भलगढ़ का युद्ध",
    "B_en": "Battle of Haldighati",
    "B_hi": "हल्दीघाटी का युद्ध",
    "C_en": "Battle of Diwer",
    "C_hi": "दिवेर का युद्ध",
    "D_en": "Battle of Khanwa",
    "D_hi": "खानवा का युद्ध",
    "answer": "B",
    "explanation_en": "Chetak, Maharana Pratap's famous horse, was injured during the Battle of Haldighati (1576). He died shortly after carrying Pratap safely away from the battlefield by jumping across a small stream.",
    "explanation_hi": "महाराणा प्रताप का प्रसिद्ध घोड़ा चेतक हल्दीघाटी के युद्ध (1576) के दौरान घायल हो गया था। प्रताप को युद्ध के मैदान से सुरक्षित बाहर निकालने के लिए एक छोटी नदी को पार करने के तुरंत बाद उसकी मृत्यु हो गई थी।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "Which of these fortresses, located in Mewar, was constructed by Maharana Kumbha and is famous for its massive wall, often compared to the Great Wall of China?",
    "question_hi": "मेवाड़ में स्थित इन किलों में से किस किले का निर्माण महाराणा कुम्भा ने करवाया था, जो अपनी विशाल दीवार के लिए प्रसिद्ध है, जिसकी तुलना अक्सर चीन की महान दीवार से की जाती है?",
    "A_en": "Chittorgarh Fort",
    "A_hi": "चित्तौड़गढ़ किला",
    "B_en": "Ranthambore Fort",
    "B_hi": "रणथंभौर किला",
    "C_en": "Kumbhalgarh Fort",
    "C_hi": "कुम्भलगढ़ किला",
    "D_en": "Jaisalmer Fort",
    "D_hi": "जैसलमेर किला",
    "answer": "C",
    "explanation_en": "Kumbhalgarh Fort, built by Maharana Kumbha in the 15th century, is renowned for its defensive wall stretching over 36 kilometers, earning it the nickname 'The Great Wall of India.'",
    "explanation_hi": "15वीं शताब्दी में महाराणा कुम्भा द्वारा निर्मित कुम्भलगढ़ किला अपनी 36 किलोमीटर से अधिक लंबी रक्षात्मक दीवार के लिए प्रसिद्ध है, जिसके कारण इसे 'भारत की महान दीवार' उपनाम मिला है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "Who led the first Jauhar (mass self-immolation) in Chittorgarh Fort during the siege by Allauddin Khilji in 1303?",
    "question_hi": "1303 में अलाउद्दीन खिलजी के घेराव के दौरान चित्तौड़गढ़ किले में पहले जौहर (सामूहिक आत्मदाह) का नेतृत्व किसने किया था?",
    "A_en": "Queen Karmavati",
    "A_hi": "रानी कर्मवती",
    "B_en": "Queen Padmini (Padmavati)",
    "B_hi": "रानी पद्मिनी (पद्मावती)",
    "C_en": "Mirabai",
    "C_hi": "मीराबाई",
    "D_en": "Rana Sanga",
    "D_hi": "राणा सांगा",
    "answer": "B",
    "explanation_en": "The first Jauhar of Chittorgarh occurred in 1303 when Sultan Allauddin Khilji besieged the fort. Queen Padmini, wife of Rawal Ratan Singh, led thousands of women in mass self-immolation to protect their honor.",
    "explanation_hi": "चित्तौड़गढ़ का पहला जौहर 1303 में हुआ था जब सुल्तान अलाउद्दीन खिलजी ने किले पर घेराबंदी की थी। रावल रतन सिंह की पत्नी रानी पद्मिनी ने अपने सम्मान की रक्षा के लिए हजारों महिलाओं के साथ सामूहिक आत्मदाह का नेतृत्व किया था।"
  }
]