[
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "Who founded the Guhil dynasty of Mewar and shifted the capital from Nagda to Chittorgarh in the 8th century AD?",
    "question_hi": "मेवाड़ के गुहिल वंश की स्थापना किसने की और 8वीं शताब्दी ईस्वी में राजधानी को नागदा से चित्तौड़गढ़ स्थानांतरित किया?",
    "A_en": "Bappa Rawal",
    "A_hi": "बप्पा रावल",
    "B_en": "Rawal Ratan Singh",
    "B_hi": "रावल रतन सिंह",
    "C_en": "Maharana Kumbha",
    "C_hi": "महाराणा कुम्भा",
    "D_en": "Maharana Pratap",
    "D_hi": "महाराणा प्रताप",
    "answer": "A",
    "explanation_en": "Bappa Rawal (Kalbhoj) is considered the founder of the Guhil dynasty in Mewar around the 8th century AD. He is credited with establishing the capital at Nagda and later consolidating control over Chittorgarh from the Moris.",
    "explanation_hi": "बप्पा रावल (कालभोज) को 8वीं शताब्दी ईस्वी के आसपास मेवाड़ में गुहिल वंश का संस्थापक माना जाता है। उन्हें नागदा में राजधानी स्थापित करने और बाद में मोरी शासकों से चित्तौड़गढ़ पर नियंत्रण स्थापित करने का श्रेय दिया जाता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "During whose reign did the famous First Jauhar (Saka) of Chittor take place in 1303 AD against Alauddin Khilji?",
    "question_hi": "किस शासक के शासनकाल में 1303 ई. में अलाउद्दीन खिलजी के विरुद्ध चित्तौड़ का प्रसिद्ध प्रथम जौहर (साका) हुआ था?",
    "A_en": "Maharana Kumbha",
    "A_hi": "महाराणा कुम्भा",
    "B_en": "Rawal Ratan Singh",
    "B_hi": "रावल रतन सिंह",
    "C_en": "Maharana Hammir",
    "C_hi": "महाराणा हम्मीर",
    "D_en": "Rana Sanga",
    "D_hi": "राणा सांगा",
    "answer": "B",
    "explanation_en": "The first Jauhar of Chittor occurred in 1303 AD when Sultan Alauddin Khilji attacked the fort. Rawal Ratan Singh led the defense (Saka) and his wife Rani Padmini led the Jauhar.",
    "explanation_hi": "चित्तौड़ का प्रथम जौहर 1303 ई. में हुआ था जब सुल्तान अलाउद्दीन खिलजी ने किले पर हमला किया था। रावल रतन सिंह ने साके का नेतृत्व किया और उनकी पत्नी रानी पद्मिनी ने जौहर का नेतृत्व किया।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "Which battle, fought in 1527 AD, was a decisive conflict between Rana Sanga of Mewar and the Mughal emperor Babur?",
    "question_hi": "1527 ई. में लड़ा गया कौन सा युद्ध मेवाड़ के राणा सांगा और मुगल सम्राट बाबर के बीच एक निर्णायक संघर्ष था?",
    "A_en": "Battle of Panipat",
    "A_hi": "पानीपत का युद्ध",
    "B_en": "Battle of Haldighati",
    "B_hi": "हल्दीघाटी का युद्ध",
    "C_en": "Battle of Khanwa",
    "C_hi": "खानवा का युद्ध",
    "D_en": "Battle of Sarangpur",
    "D_hi": "सारंगपुर का युद्ध",
    "answer": "C",
    "explanation_en": "The Battle of Khanwa (1527 AD) was fought between Rana Sanga and Babur. Although Rana Sanga had initial success, he was defeated by Babur's superior tactics (Tulgama) and artillery. This battle cemented Mughal power in North India and severely weakened the Rajput confederacy.",
    "explanation_hi": "खानवा का युद्ध (1527 ई.) राणा सांगा और बाबर के बीच लड़ा गया था। हालाँकि राणा सांगा को शुरुआती सफलता मिली, लेकिन बाबर की बेहतर रणनीति (तुलगामा) और तोपखाने के कारण वह पराजित हो गया। इस युद्ध ने उत्तरी भारत में मुगल शक्ति को मजबूत किया और राजपूत संघ को बुरी तरह से कमजोर कर दिया।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "To commemorate his victory over Mahmud Khilji of Malwa in the Battle of Sarangpur (1437 AD), Maharana Kumbha built which monument in Chittorgarh Fort?",
    "question_hi": "सारंगपुर के युद्ध (1437 ई.) में मालवा के महमूद खिलजी पर अपनी जीत का जश्न मनाने के लिए, महाराणा कुम्भा ने चित्तौड़गढ़ किले में किस स्मारक का निर्माण करवाया था?",
    "A_en": "Kumbhalgarh Fort",
    "A_hi": "कुम्भलगढ़ किला",
    "B_en": "Vijay Stambh (Tower of Victory)",
    "B_hi": "विजय स्तम्भ",
    "C_en": "Kirti Stambh",
    "C_hi": "कीर्ति स्तम्भ",
    "D_en": "Kumbha Shyam Temple",
    "D_hi": "कुम्भ श्याम मंदिर",
    "answer": "B",
    "explanation_en": "Maharana Kumbha built the Vijay Stambh (Tower of Victory) in Chittorgarh Fort to celebrate his victory over the combined forces of Malwa Sultan Mahmud Khilji and Gujarat Sultan Qutb-ud-din. Kirti Stambh (Tower of Fame) was built by a Jain merchant, Jija Bhagerwala.",
    "explanation_hi": "महाराणा कुम्भा ने मालवा के सुल्तान महमूद खिलजी और गुजरात के कुतुब-उद-दीन की संयुक्त सेनाओं पर अपनी जीत का जश्न मनाने के लिए चित्तौड़गढ़ किले में विजय स्तम्भ का निर्माण करवाया था। कीर्ति स्तम्भ (कीर्ति स्तंभ) का निर्माण एक जैन व्यापारी जीजा भागेरवाला ने करवाया था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "Maharana Pratap's famous Battle of Haldighati (1576 AD) was fought against the Mughal army led by which commander?",
    "question_hi": "महाराणा प्रताप का प्रसिद्ध हल्दीघाटी का युद्ध (1576 ई.) किस मुगल सेनापति के नेतृत्व वाली मुगल सेना के विरुद्ध लड़ा गया था?",
    "A_en": "Raja Man Singh I",
    "A_hi": "राजा मान सिंह प्रथम",
    "B_en": "Akbar",
    "B_hi": "अकबर",
    "C_en": "Raja Bhagwant Das",
    "C_hi": "राजा भगवंत दास",
    "D_en": "Todar Mal",
    "D_hi": "टोडरमल",
    "answer": "A",
    "explanation_en": "The Battle of Haldighati took place between Maharana Pratap and the Mughal forces in 1576. The Mughal army was led by Raja Man Singh I of Amber, who was a high-ranking general in Emperor Akbar's court.",
    "explanation_hi": "हल्दीघाटी का युद्ध 1576 में महाराणा प्रताप और मुगल सेना के बीच लड़ा गया था। मुगल सेना का नेतृत्व आमेर के राजा मान सिंह प्रथम ने किया था, जो सम्राट अकबर के दरबार में एक उच्च पदस्थ सेनापति थे।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "Who was the first ruler of Mewar from the Sisodia branch to adopt the title 'Maharana' after reclaiming Chittorgarh from the Delhi Sultanate in 1326 AD?",
    "question_hi": "1326 ई. में दिल्ली सल्तनत से चित्तौड़गढ़ को पुनः प्राप्त करने के बाद, सिसोदा शाखा के किस शासक ने 'महाराणा' की उपाधि धारण की थी?",
    "A_en": "Maharana Lakha",
    "A_hi": "महाराणा लाखा",
    "B_en": "Maharana Mokal",
    "B_hi": "महाराणा मोकल",
    "C_en": "Maharana Hammir Hammir",
    "C_hi": "महाराणा हम्मीर",
    "D_en": "Maharana Kumbha",
    "D_hi": "महाराणा कुम्भा",
    "answer": "C",
    "explanation_en": "After the defeat of Rawal Ratan Singh in 1303, the Guhil dynasty suffered a decline. Maharana Hammir (Guhil of Sisoda branch) re-established Mewar's independence in 1326 AD and adopted the title 'Rana' and later 'Maharana', starting the Sisodia dynasty.",
    "explanation_hi": "1303 में रावल रतन सिंह की हार के बाद, गुहिल वंश का पतन हो गया। महाराणा हम्मीर (सिसोदा शाखा के गुहिल) ने 1326 ई. में मेवाड़ की स्वतंत्रता को पुनः स्थापित किया और 'राणा' और बाद में 'महाराणा' की उपाधि अपनाई, जिससे सिसोदिया वंश की शुरुआत हुई।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "Maharana Amar Singh I concluded the Mughal-Mewar peace treaty in 1615 AD with which Mughal Emperor?",
    "question_hi": "महाराणा अमर सिंह प्रथम ने 1615 ई. में किस मुगल सम्राट के साथ मुगल-मेवाड़ शांति संधि पर हस्ताक्षर किए?",
    "A_en": "Akbar",
    "A_hi": "अकबर",
    "B_en": "Jahangir",
    "B_hi": "जहांगीर",
    "C_en": "Shah Jahan",
    "C_hi": "शाहजहाँ",
    "D_en": "Aurangzeb",
    "D_hi": "औरंगजेब",
    "answer": "B",
    "explanation_en": "The Mughal-Mewar peace treaty was signed in 1615 AD. Maharana Amar Singh I, son of Maharana Pratap, accepted Mughal suzerainty under Emperor Jahangir. This treaty allowed Mewar to retain significant autonomy.",
    "explanation_hi": "मुगल-मेवाड़ शांति संधि पर 1615 ई. में हस्ताक्षर किए गए थे। महाराणा प्रताप के पुत्र महाराणा अमर सिंह प्रथम ने सम्राट जहांगीर के अधीन मुगल आधिपत्य स्वीकार कर लिया। इस संधि ने मेवाड़ को महत्वपूर्ण स्वायत्तता बनाए रखने की अनुमति दी।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "During the reign of which Maharana did the construction of Jagat Shiromani Temple and Jag Mandir in Udaipur take place?",
    "question_hi": "उदयपुर में जगत शिरोमणि मंदिर और जग मंदिर का निर्माण किस महाराणा के शासनकाल में हुआ था?",
    "A_en": "Rana Mokal",
    "A_hi": "राणा मोकल",
    "B_en": "Maharana Jagat Singh I",
    "B_hi": "महाराणा जगत सिंह प्रथम",
    "C_en": "Maharana Raj Singh I",
    "C_hi": "महाराणा राज सिंह प्रथम",
    "D_en": "Maharana Uday Singh II",
    "D_hi": "महाराणा उदय सिंह द्वितीय",
    "answer": "B",
    "explanation_en": "The construction of Jagat Shiromani Temple and Jag Mandir (started by Maharana Karan Singh and completed by Jagat Singh I) in Udaipur took place during the reign of Maharana Jagat Singh I (1628-1652 AD).",
    "explanation_hi": "उदयपुर में जगत शिरोमणि मंदिर और जग मंदिर का निर्माण (महाराणा करण सिंह द्वारा शुरू किया गया और जगत सिंह प्रथम द्वारा पूरा किया गया) महाराणा जगत सिंह प्रथम (1628-1652 ई.) के शासनकाल के दौरान हुआ था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "Maharana Raj Singh I of Mewar opposed which of Aurangzeb's controversial policies in the late 17th century?",
    "question_hi": "17वीं शताब्दी के उत्तरार्ध में मेवाड़ के महाराणा राज सिंह प्रथम ने औरंगजेब की किस विवादास्पद नीति का विरोध किया था?",
    "A_en": "Imposition of Jaziya Tax and demolition of temples",
    "A_hi": "जजिया कर लगाना और मंदिरों को तोड़ना",
    "B_en": "Expansion of Mughal territories in South India",
    "B_hi": "दक्षिणी भारत में मुगल क्षेत्रों का विस्तार",
    "C_en": "Introduction of Mansabdari system",
    "C_hi": "मनसबदारी प्रणाली की शुरुआत",
    "D_en": "Support for Maratha power",
    "D_hi": "मराठा शक्ति का समर्थन",
    "answer": "A",
    "explanation_en": "Maharana Raj Singh I (1652-1680 AD) strongly opposed Aurangzeb's fanatical religious policies, including the re-imposition of Jaziya tax and the demolition of Hindu temples, leading to conflicts between Mewar and the Mughals.",
    "explanation_hi": "महाराणा राज सिंह प्रथम (1652-1680 ई.) ने औरंगजेब की कट्टर धार्मिक नीतियों का कड़ा विरोध किया, जिसमें जजिया कर को फिर से लगाना और हिंदू मंदिरों को तोड़ना शामिल था, जिसके कारण मेवाड़ और मुगलों के बीच संघर्ष हुआ।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Mewar",
    "question_en": "Which Maharana of Mewar established Chavand as the new capital after a long struggle against the Mughals?",
    "question_hi": "मुगलों के विरुद्ध लंबे संघर्ष के बाद मेवाड़ के किस महाराणा ने चावंड को नई राजधानी के रूप में स्थापित किया?",
    "A_en": "Maharana Uday Singh II",
    "A_hi": "महाराणा उदय सिंह द्वितीय",
    "B_en": "Maharana Pratap",
    "B_hi": "महाराणा प्रताप",
    "C_en": "Maharana Amar Singh I",
    "C_hi": "महाराणा अमर सिंह प्रथम",
    "D_en": "Maharana Raj Singh I",
    "D_hi": "महाराणा राज सिंह प्रथम",
    "answer": "B",
    "explanation_en": "After the Battle of Haldighati and subsequent struggles, Maharana Pratap established Chavand as his capital in 1585 AD. He successfully reclaimed most of Mewar territory from the Mughals, except Chittorgarh and Mandalgarh, operating from Chavand until his death.",
    "explanation_hi": "हल्दीघाटी के युद्ध और बाद के संघर्षों के बाद, महाराणा प्रताप ने 1585 ई. में चावंड को अपनी राजधानी बनाया। उन्होंने चित्तौड़गढ़ और मंडल गढ़ को छोड़कर मेवाड़ के अधिकांश क्षेत्र को मुगलों से सफलतापूर्वक पुनः प्राप्त किया और अपनी मृत्यु तक चावंड से ही शासन किया।"
  }
]