[
{
"subject": "Rajasthan History",
"topic": "Mewar",
"question_en": "Who was the founder of the Mewar kingdom?",
"question_hi": "मेवाड़ राज्य के संस्थापक कौन थे?",
"A_en": "Bappa Rawal", "A_hi": "बप्पा रावल",
"B_en": "Rana Pratap", "B_hi": "राणा प्रताप",
"C_en": "Rawal Jaisal", "C_hi": "रावल जैसल",
"D_en": "Shishodia Rajputs", "D_hi": "शिशोदिया राजपूत",
"answer": "A",
"explanation_en": "Bappa Rawal is considered the founder of the Mewar kingdom in the 8th century.",
"explanation_hi": "बप्पा रावल को 8वीं शताब्दी में मेवाड़ राज्य के संस्थापक माना जाता है।"
},
{
"subject": "Rajasthan History",
"topic": "Mewar",
"question_en": "Which Rana of Mewar is famous for his bravery in the Battle of Haldighati?",
"question_hi": "मेवाड़ के किस राणा को हल्दीघाटी की लड़ाई में अपनी बहादुरी के लिए प्रसिद्ध है?",
"A_en": "Rana Sanga", "A_hi": "राणा सांगा",
"B_en": "Rana Pratap", "B_hi": "राणा प्रताप",
"C_en": "Rana Raimal", "C_hi": "राणा रैमल",
"D_en": "Rana Lakha", "D_hi": "राणा लाखा",
"answer": "B",
"explanation_en": "Rana Pratap is renowned for his courageous stand against the Mughal Emperor Akbar in the Battle of Haldighati in 1576.",
"explanation_hi": "राणा प्रताप 1576 में हल्दीघाटी की लड़ाई में मुगल बादशाह अकबर के खिलाफ अपने वीरतापूर्ण रुख के लिए प्रसिद्ध हैं।"
},
{
"subject": "Rajasthan History",
"topic": "Mewar",
"question_en": "What was the name of the queen of Mewar who performed Jauhar during the siege of Chittor by Alauddin Khalji?",
"question_hi": "मेवाड़ की रानी का क्या नाम था जिसने अलादीन खिलजी द्वारा चित्तोर की घेराबंदी के दौरान जौहर किया था?",
"A_en": "Rani Padmini", "A_hi": "रानी पद्मिनी",
"B_en": "Rani Lakshmibai", "A_hi": "रानी लक्ष्मीबाई",
"C_en": "Rani Jivanti", "A_hi": "रानी जीवंती",
"D_en": "Rani Nagmati", "A_hi": "रानी नागमती",
"answer": "A",
"explanation_en": "Rani Padmini, also known as Padmavati, is famous for her legendary beauty and her decision to perform Jauhar during the siege of Chittor by Alauddin Khalji's forces.",
"explanation_hi": "रानी पद्मिनी, जिन्हें पद्मावती के नाम से भी जाना जाता है, अपनी पौराणिक सुंदरता और अलादीन खिलजी की सेना द्वारा चित्तोर की घेराबंदी के दौरान जौहर करने के निर्णय के लिए प्रसिद्ध हैं।"
},
{
"subject": "Rajasthan History",
"topic": "Mewar",
"question_en": "Which Mughal emperor invaded Mewar and led to the Battle of Haldighati?",
"question_hi": "किस मुगल बादशाह ने मेवाड़ पर आक्रमण किया और हल्दीघाटी की लड़ाई का नेतृत्व किया?",
"A_en": "Akbar", "A_hi": "अकबर",
"B_en": "Babur", "A_hi": "बाबर",
"C_en": "Jahangir", "A_hi": "जहांगीर",
"D_en": "Aurangzeb", "A_hi": "औरंगजेब",
"answer": "A",
"explanation_en": "The Battle of Haldighati took place in 1576 between the forces of Rana Pratap and the Mughal army led by Man Singh of Amber under the command of Mughal Emperor Akbar.",
"explanation_hi": "हल्दीघाटी की लड़ाई 1576 में राणा प्रताप की सेना और मुगल बादशाह अकबर के अधीन अम्बर के मानसिंह की सेना के बीच हुई थी।"
},
{
"subject": "Rajasthan History",
"topic": "Mewar",
"question_en": "What was the significance of the Battle of Haldighati in the history of Mewar?",
"question_hi": "मेवाड़ के इतिहास में हल्दीघाटी की लड़ाई का क्या महत्व था?",
"A_en": "It marked the end of Mewar Kingdom", "A_hi": "इसने मेवाड़ राज्य का अंत किया",
"B_en": "It was a decisive victory for the Mughals", "A_hi": "यह मुगलों के लिए एक निर्णायक जीत थी",
"C_en": "It showcased Rana Pratap's bravery and resistance against Mughal rule", "A_hi": "इसने राणा प्रताप की बहादुरी और मुगल शासन के खिलाफ प्रतिरोध को प्रदर्शित किया",
"D_en": "It led to the establishment of Mughal rule in Mewar", "A_hi": "इसने मेवाड़ में मुगल शासन की स्थापना की",
"answer": "C",
"explanation_en": "The Battle of Haldighati, though tactically a Mughal victory, became a symbol of Rana Pratap's bravery and resistance against Mughal rule, inspiring future generations.",
"explanation_hi": "हल्दीघाटी की लड़ाई, हालांकि रणनीतिक रूप से एक मुगल जीत थी, राणा प्रताप की बहादुरी और मुगल शासन के खिलाफ प्रतिरोध का प्रतीक बन गई, जिसने आने वाली पीढ़ियों को प्रेरित किया।"
},
{
"subject": "Rajasthan History",
"topic": "Mewar",
"question_en": "Who was the famous ruler of Mewar known for his diplomatic relations and building of the City Palace in Udaipur?",
"question_hi": "मेवाड़ के किस प्रसिद्ध शासक को अपनी कूटनीतिक संबंधों और उदयपुर में सिटी पैलेस के निर्माण के लिए जाना जाता है?",
"A_en": "Rana Pratap", "A_hi": "राणा प्रताप",
"B_en": "Rana Lakha", "A_hi": "राणा लाखा",
"C_en": "Rana Sangram Singh", "A_hi": "राणा सांग्राम सिंह",
"D_en": "Maharana Udai Singh", "A_hi": "महाराणा उदय सिंह",
"answer": "D",
"explanation_en": "Maharana Udai Singh II is credited with the foundation of Udaipur and the construction of the City Palace, showcasing his diplomatic and architectural contributions.",
"explanation_hi": "महाराणा उदय सिंह द्वितीय को उदयपुर की स्थापना और सिटी पैलेस के निर्माण का श्रेय दिया जाता है, जो उनकी कूटनीतिक और स्थापत्य योगदान को प्रदर्शित करता है।"
},
{
"subject": "Rajasthan History",
"topic": "Mewar",
"question_en": "Which fort in Mewar was the capital before Udaipur and was besieged by Alauddin Khalji?",
"question_hi": "मेवाड़ का कौन सा किला उदयपुर से पहले राजधानी थी और जिसे अलादीन खिलजी ने घेर लिया था?",
"A_en": "Kumbhalgarh Fort", "A_hi": "कुंभलगढ़ किला",
"B_en": "Rana Pratap Sagar Fort", "A_hi": "राणा प्रताप सागर किला",
"C_en": "Chittorgarh Fort", "A_hi": "चित्तौड़गढ़ किला",
"D_en": "Haldighati Fort", "A_hi": \"हल्दीघाटी किला\",
"answer": "C",
"explanation_en": "Chittorgarh Fort, also known as Chittor Fort, was the capital of Mewar before Udaipur and was famously besieged by Alauddin Khalji's forces.",
"explanation_hi": "चित्तौड़गढ़ किला, जिसे चित्तोर किला भी कहा जाता है, उदयपुर से पहले मेवाड़ की राजधानी थी और इसे अलादीन खिलजी की सेना ने घेर लिया था।"
},
{
"subject": "Rajasthan History",
"topic": "Mewar",
"question_en": "Who was the queen of Mewar that led the defense of Chittorgarh against the siege by Babur's forces?",
"question_hi": "मेवाड़ की रानी कौन थी जिसने बाबर की सेना द्वारा चित्तौड़गढ़ की घेराबंदी के खिलाफ रक्षा का नेतृत्व किया?",
"A_en": "Rani Padmini", "A_hi": "रानी पद्मिनी",
"B_en": "Rani Karnavati", "A_hi": "रानी कर्णवती",
"C_en": "Rani Lakshmibai", "A_hi": "रानी लक्ष्मीबाई",
"D_en": "Rani Jivanti Bai", "A_hi": "रानी जीवंती बाई",
"answer": "B",
"explanation_en": "Rani Karnavati led the defense of Chittorgarh against Babur's forces but ultimately decided to perform Jauhar.",
"explanation_hi": "रानी कर्णवती ने बाबर की सेना के खिलाफ चित्तौड़गढ़ की रक्षा का नेतृत्व किया लेकिन अंततः जौहर करने का निर्णय लिया।"
},
{
"subject": "Rajasthan History",
"topic": "Mewar",
"question_en": "What was the significance of Lake Pichola in the history of Mewar?",
"question_hi": "मेवाड़ के इतिहास में पिचोला झील का क्या महत्व था?",
"A_en": "It was a site of a major battle", "A_hi": "यह एक प्रमुख युद्ध का स्थल था",
"B_en": "It was the location of the first capital of Mewar", "A_hi": "यह मेवाड़ की पहली राजधानी का स्थान था",
"C_en": "It led to the founding of Udaipur city", "A_hi": "इसने उदयपुर शहर की स्थापना का नेतृत्व किया",
"D_en": "It was a major source of irrigation", "A_hi": "यह सिंचाई का एक प्रमुख स्रोत था",
"answer": "C",
"explanation_en": "Lake Pichola played a crucial role in the founding of Udaipur city by Maharana Udai Singh II, as it led to the establishment of the city around it.",
"explanation_hi": "पिचोला झील ने महाराणा उदय सिंह द्वितीय द्वारा उदयपुर शहर की स्थापना में महत्वपूर्ण भूमिका निभाई, क्योंकि इसके आसपास शहर की स्थापना हुई थी।"
},
{
"subject": "Rajasthan History",
"topic": "Mewar",
"question_en": "Which Maharana of Mewar made a treaty with the British East India Company?",
"question_hi": "मेवाड़ के किस महाराणा ने ब्रिटिश ईस्ट इंडिया कंपनी के साथ एक संधि की?",
"A_en": "Maharana Pratap", "A_hi": "महाराणा प्रताप",
"B_en": "Maharana Sangram Singh II", "A_hi": "महाराणा सांग्राम सिंह द्वितीय",
"C_en": "Maharana Ajai Singh", "A_hi": "महाराणा अजय सिंह",
"D_en": "Maharana Bhoj", "A_hi": "महाराणा भोज",
"answer": "C",
"explanation_en": "Maharana Ajai Singh of Mewar made a treaty with the British East India Company, marking a significant diplomatic relation.",
"explanation_hi": "मेवाड़ के महाराणा अजय सिंह ने ब्रिटिश ईस्ट इंडिया कंपनी के साथ एक संधि की, जो एक महत्वपूर्ण कूटनीतिक संबंध को चिह्नित करती है।"
}
]