[
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which inscription provides the earliest evidence of the 'Bhagavata (Vaishnava) sect' in Rajasthan?",
    "question_hi": "राजस्थान में 'भागवत (वैष्णव) संप्रदाय' का सबसे प्राचीन प्रमाण कौन सा शिलालेख प्रदान करता है?",
    "A_en": "Bijolia Inscription",
    "A_hi": "बिजोलिया शिलालेख",
    "B_en": "Ghosundi Inscription",
    "B_hi": "घोसुण्डी शिलालेख",
    "C_en": "Ghatiyala Inscription",
    "C_hi": "घटियाला शिलालेख",
    "D_en": "Kumbhalgarh Inscription",
    "D_hi": "कुम्भलगढ़ शिलालेख",
    "answer": "B",
    "explanation_en": "The Ghosundi inscription (2nd century BC) found near Chittorgarh is the first evidence of the Bhagavata cult and the worship of Sankarsana and Vasudeva in Rajasthan.",
    "explanation_hi": "चित्तौड़गढ़ के पास मिला घोसुण्डी शिलालेख (द्वितीय शताब्दी ईसा पूर्व) राजस्थान में भागवत पंथ और संकर्षण तथा वासुदेव की पूजा का पहला प्रमाण है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which ancient site in Rajasthan has yielded evidence of a circular Buddhist temple (Stupa)?",
    "question_hi": "राजस्थान के किस प्राचीन स्थल से एक गोलाकार बौद्ध मंदिर (स्तूप) के साक्ष्य मिले हैं?",
    "A_en": "Ahar",
    "A_hi": "आहड़",
    "B_en": "Kalibangan",
    "B_hi": "कालीबंगा",
    "C_en": "Bairath",
    "C_hi": "बैराठ",
    "D_en": "Ganeshwar",
    "D_hi": "गणेश्वर",
    "answer": "C",
    "explanation_en": "Bairath (Viratnagar) provides ruins of a circular Buddhist temple and monastery, showing the influence of Buddhism in ancient Rajasthan.",
    "explanation_hi": "बैराठ (विराटनगर) एक गोलाकार बौद्ध मंदिर और मठ के खंडहर प्रदान करता है, जो प्राचीन राजस्थान में बौद्ध धर्म के प्रभाव को दर्शाता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The Ghatiyala Inscription (861 AD) mentions the practice of which social custom for the first time in Rajasthan?",
    "question_hi": "घटियाला शिलालेख (861 ईस्वी) में राजस्थान में पहली बार किस सामाजिक प्रथा का उल्लेख मिलता है?",
    "A_en": "Child Marriage",
    "A_hi": "बाल विवाह",
    "B_en": "Sati Pratha",
    "B_hi": "सती प्रथा",
    "C_en": "Jauhar",
    "C_hi": "जौहर",
    "D_en": "Purdah system",
    "D_hi": "पर्दा प्रथा",
    "answer": "B",
    "explanation_en": "The Ghatiyala inscription of the Pratihara period mentions the Sati of Sampal Devi, providing early evidence of Sati in Rajasthan.",
    "explanation_hi": "प्रतिहार काल के घटियाला शिलालेख में संपल देवी के सती होने का उल्लेख है, जो राजस्थान में सती प्रथा का प्रारंभिक प्रमाण देता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "In ancient Rajasthan, what did the term 'Goshthi' refer to in social and religious administration?",
    "question_hi": "प्राचीन राजस्थान में, सामाजिक और धार्मिक प्रशासन में 'गोष्ठी' शब्द का तात्पर्य क्या था?",
    "A_en": "Military unit",
    "A_hi": "सैन्य इकाई",
    "B_en": "Tax collector",
    "B_hi": "कर संग्रहकर्ता",
    "C_en": "Local assembly or committee",
    "C_hi": "स्थानीय सभा या समिति",
    "D_en": "Agricultural land",
    "D_hi": "कृषि भूमि",
    "answer": "C",
    "explanation_en": "Goshthis were local assemblies or committees that managed temples, charities, and local affairs in ancient and early medieval Rajasthan.",
    "explanation_hi": "गोष्ठी स्थानीय सभाएं या समितियां थीं जो प्राचीन और प्रारंभिक मध्यकालीन राजस्थान में मंदिरों, दान और स्थानीय मामलों का प्रबंधन करती थीं।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The ancient city of 'Nagari' (Madhyamika) was a major center for which religious sect?",
    "question_hi": "प्राचीन नगर 'नगरी' (मध्यमिका) किस धार्मिक संप्रदाय का प्रमुख केंद्र था?",
    "A_en": "Vaishnavism",
    "A_hi": "वैष्णव धर्म",
    "B_en": "Jainism",
    "B_hi": "जैन धर्म",
    "C_en": "Shaivism",
    "C_hi": "शैव धर्म",
    "D_en": "Both A and B",
    "D_hi": "A और B दोनों",
    "answer": "D",
    "explanation_en": "Nagari (Chittorgarh) was an important center for both Vaishnavism (Ghosundi inscription) and Jainism during the ancient period.",
    "explanation_hi": "प्राचीन काल के दौरान नगरी (चित्तौड़गढ़) वैष्णव धर्म (घोसुण्डी शिलालेख) और जैन धर्म दोनों के लिए एक महत्वपूर्ण केंद्र था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which Chinese traveler visited Rajasthan (Bhinmal and Bairath) and described the religious conditions of the 7th century?",
    "question_hi": "किस चीनी यात्री ने राजस्थान (भीनमाल और बैराठ) की यात्रा की और 7वीं शताब्दी की धार्मिक स्थितियों का वर्णन किया?",
    "A_en": "Fa-Hien",
    "A_hi": "फाह्यान",
    "B_en": "Itsing",
    "B_hi": "इत्सिंग",
    "C_en": "Hiuen Tsang (Xuanzang)",
    "C_hi": "ह्वेन सांग",
    "D_en": "Megasthenes",
    "D_hi": "मेगस्थनीज",
    "answer": "C",
    "explanation_en": "Hiuen Tsang visited Bhinmal (Pi-lo-mo-lo) and Bairath, noting the decline of Buddhism and the rise of Hinduism in the region.",
    "explanation_hi": "ह्वेन सांग ने भीनमाल और बैराठ की यात्रा की, और इस क्षेत्र में बौद्ध धर्म के पतन और हिंदू धर्म के उत्थान का उल्लेख किया।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The 'Varna system' in ancient Rajasthan became more rigid during which period?",
    "question_hi": "प्राचीन राजस्थान में 'वर्ण व्यवस्था' किस काल में अधिक कठोर हो गई?",
    "A_en": "Maurya Period",
    "A_hi": "मौर्य काल",
    "B_en": "Gupta and Post-Gupta Period",
    "B_hi": "गुप्त और गुप्तोत्तर काल",
    "C_en": "Stone Age",
    "C_hi": "पाषाण काल",
    "D_en": "Indus Valley Period",
    "D_hi": "सिंधु घाटी काल",
    "answer": "B",
    "explanation_en": "The social structure became more complex and rigid with the emergence of sub-castes during the Gupta and Post-Gupta (Rajput) periods.",
    "explanation_hi": "गुप्त और गुप्तोत्तर (राजपूत) काल के दौरान उप-जातियों के उद्भव के साथ सामाजिक संरचना अधिक जटिल और कठोर हो गई।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The worship of the Sun (Surya) was highly prevalent in ancient Rajasthan. Which site is famous for an ancient Sun temple?",
    "question_hi": "प्राचीन राजस्थान में सूर्य की पूजा अत्यधिक प्रचलित थी। कौन सा स्थान प्राचीन सूर्य मंदिर के लिए प्रसिद्ध है?",
    "A_en": "Osian",
    "A_hi": "ओसियां",
    "B_en": "Jhalrapatan",
    "B_hi": "झालरापाटन",
    "C_en": "Both A and B",
    "C_hi": "A और B दोनों",
    "D_en": "None of these",
    "D_hi": "इनमें से कोई नहीं",
    "answer": "C",
    "explanation_en": "Both Osian (Jodhpur) and Jhalrapatan (Jhalawar) have famous Sun temples, indicating the popularity of Surya worship among the royalty and public.",
    "explanation_hi": "ओसियां (जोधपुर) और झालरापाटन (झालावाड़) दोनों में प्रसिद्ध सूर्य मंदिर हैं, जो राजघरानों और जनता के बीच सूर्य पूजा की लोकप्रियता को दर्शाते हैं।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which ancient inscription of Rajasthan refers to the Origin of Rajputs from the 'Vatsa Gotra Brahmin'?",
    "question_hi": "राजस्थान का कौन सा प्राचीन शिलालेख राजपूतों की उत्पत्ति 'वत्स गोत्र ब्राह्मण' से बताता है?",
    "A_en": "Bijolia Inscription",
    "A_hi": "बिजोलिया शिलालेख",
    "B_en": "Chirwa Inscription",
    "B_hi": "चीरवा शिलालेख",
    "C_en": "Kanaswa Inscription",
    "C_hi": "कणसवा शिलालेख",
    "D_en": "Harsnath Inscription",
    "D_hi": "हर्षनाथ शिलालेख",
    "answer": "A",
    "explanation_en": "The Bijolia Inscription (1170 AD) mentions that the Chahamans (Chauhans) were 'Vatsa Gotra Brahmins', reflecting the social status of rulers.",
    "explanation_hi": "बिजोलिया शिलालेख (1170 ईस्वी) में उल्लेख है कि चाहमान (चौहान) 'वत्स गोत्र के ब्राह्मण' थे, जो शासकों की सामाजिक स्थिति को दर्शाता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The temple of Lord Rishabhdev at Dhulev (Udaipur) is a unique example of cultural harmony because it is worshipped by:",
    "question_hi": "धुलेव (उदयपुर) में भगवान ऋषभदेव का मंदिर सांस्कृतिक सद्भाव का एक अनूठा उदाहरण है क्योंकि यहाँ पूजा की जाती है:",
    "A_en": "Jains and Vaishnavas",
    "A_hi": "जैन और वैष्णवों द्वारा",
    "B_en": "Jains and Bhils",
    "B_hi": "जैन और भीलों द्वारा",
    "C_en": "Jains and Shaivites",
    "C_hi": "जैन और शैवों द्वारा",
    "D_en": "All of the above",
    "D_hi": "उपरोक्त सभी",
    "answer": "D",
    "explanation_en": "Rishabhdev (Kesariyaji) is worshipped by Jains as the 1st Tirthankara, by Hindus as an incarnation of Vishnu, and by Bhils as 'Kalaji'.",
    "explanation_hi": "ऋषभदेव (केसरियाजी) को जैनियों द्वारा प्रथम तीर्थंकर के रूप में, हिंदुओं द्वारा विष्णु के अवतार के रूप में और भीलों द्वारा 'कालाजी' के रूप में पूजा जाता है।"
  }
]