[
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "Which of the following ancient civilizations is located in Hanumangarh district of Rajasthan?",
"question_hi": "निम्नलिखित प्राचीन सभ्यताओं में से कौन राजस्थान के हनुमानगढ़ जिले में स्थित है?",
"A_en": "Kalibangan", "A_hi": "कालीबंगान",
"B_en": "Ahar", "B_hi": "आहाड़",
"C_en": "Ganeshwar", "C_hi": "गणेश्वर",
"D_en": "Balathal", "D_hi": "बालाथल",
"answer": "A",
"explanation_en": "Kalibangan is an ancient civilization located in Hanumangarh district of Rajasthan.",
"explanation_hi": "कालीबंगान राजस्थान के हनुमानगढ़ जिले में स्थित एक प्राचीन सभ्यता है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "What is the name of the ancient civilization located in Udaipur district of Rajasthan, known for its copper artifacts?",
"question_hi": "उदयपुर जिले में स्थित प्राचीन सभ्यता का नाम क्या है, जो अपने तांबे के कलाकृतियों के लिए प्रसिद्ध है?",
"A_en": "Ahar", "A_hi": "आहाड़",
"B_en": "Ganeshwar", "B_hi": "गणेश्वर",
"C_en": "Kalibangan", "C_hi": "कालीबंगान",
"D_en": "Balathal", "D_hi": "बालाथल",
"answer": "B",
"explanation_en": "Ganeshwar is an ancient civilization located in Udaipur district of Rajasthan, known for its copper artifacts.",
"explanation_hi": "गणेश्वर उदयपुर जिले में स्थित एक प्राचीन सभ्यता है, जो अपने तांबे के कलाकृतियों के लिए प्रसिद्ध है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "Which of the following ancient civilizations is located in Alwar district of Rajasthan?",
"question_hi": "निम्नलिखित प्राचीन सभ्यताओं में से कौन राजस्थान के अलवर जिले में स्थित है?",
"A_en": "Bairath", "A_hi": "बैराथ",
"B_en": "Kalibangan", "B_hi": "कालीबंगान",
"C_en": "Ahar", "C_hi": "आहाड़",
"D_en": "Ganeshwar", "D_hi": "गणेश्वर",
"answer": "A",
"explanation_en": "Bairath is an ancient civilization located in Alwar district of Rajasthan.",
"explanation_hi": "बैराथ राजस्थान के अलवर जिले में स्थित एक प्राचीन सभ्यता है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "What is the name of the ancient civilization located in Dhoulpur district of Rajasthan, known for its unique burial system?",
"question_hi": "धौलपुर जिले में स्थित प्राचीन सभ्यता का नाम क्या है, जो अपने अनोखे दफन प्रणाली के लिए प्रसिद्ध है?",
"A_en": "Balathal", "A_hi": "बालाथल",
"B_en": "Ganeshwar", "B_hi": "गणेश्वर",
"C_en": "Kalibangan", "C_hi": "कालीबंगान",
"D_en": "Ahar", "D_hi": "आहाड़",
"answer": "A",
"explanation_en": "Balathal is an ancient civilization located in Dhoulpur district of Rajasthan, known for its unique burial system.",
"explanation_hi": "बालाथल धौलपुर जिले में स्थित एक प्राचीन सभ्यता है, जो अपने अनोखे दफन प्रणाली के लिए प्रसिद्ध है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "Which of the following ancient civilizations is known for its well-planned city layout?",
"question_hi": "निम्नलिखित प्राचीन सभ्यताओं में से कौन अपने अच्छी तरह से योजनाबद्ध शहर लेआउट के लिए जानी जाती है?",
"A_en": "Kalibangan", "A_hi": "कालीबंगान",
"B_en": "Ganeshwar", "B_hi": "गणेश्वर",
"C_en": "Ahar", "C_hi": "आहाड़",
"D_en": "Bairath", "D_hi": "बैराथ",
"answer": "A",
"explanation_en": "Kalibangan is known for its well-planned city layout.",
"explanation_hi": "कालीबंगान अपने अच्छी तरह से योजनाबद्ध शहर लेआउट के लिए जानी जाती है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "What is the name of the ancient civilization located in Jhalawar district of Rajasthan, known for its unique pottery?",
"question_hi": "झालावाड़ जिले में स्थित प्राचीन सभ्यता का नाम क्या है, जो अपने अनोखे मिट्टी के बर्तनों के लिए प्रसिद्ध है?",
"A_en": "Ganeshwar", "A_hi": "गणेश्वर",
"B_en": "Ahar", "B_hi": "आहाड़",
"C_en": "Kalibangan", "C_hi": "कालीबंगान",
"D_en": "Balathal", "D_hi": "बालाथल",
"answer": "A",
"explanation_en": "Ganeshwar is an ancient civilization located in Jhalawar district of Rajasthan, known for its unique pottery.",
"explanation_hi": "गणेश्वर झालावाड़ जिले में स्थित एक प्राचीन सभ्यता है, जो अपने अनोखे मिट्टी के बर्तनों के लिए प्रसिद्ध है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "Which of the following ancient civilizations is located in Udaipur district of Rajasthan, known for its ancient copper mines?",
"question_hi": "निम्नलिखित प्राचीन सभ्यताओं में से कौन उदयपुर जिले में स्थित है, जो अपने प्राचीन तांबे की खानों के लिए प्रसिद्ध है?",
"A_en": "Ganeshwar", "A_hi": "गणेश्वर",
"B_en": "Ahar", "B_hi": "आहाड़",
"C_en": "Kalibangan", "C_hi": "कालीबंगान",
"D_en": "Bairath", "D_hi": "बैराथ",
"answer": "A",
"explanation_en": "Ganeshwar is an ancient civilization located in Udaipur district of Rajasthan, known for its ancient copper mines.",
"explanation_hi": "गणेश्वर उदयपुर जिले में स्थित एक प्राचीन सभ्यता है, जो अपने प्राचीन तांबे की खानों के लिए प्रसिद्ध है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "What is the name of the ancient civilization located in Tonk district of Rajasthan, known for its unique stone tools?",
"question_hi": "टोंक जिले में स्थित प्राचीन सभ्यता का नाम क्या है, जो अपने अनोखे पत्थर के औजारों के लिए प्रसिद्ध है?",
"A_en": "Ahar", "A_hi": "आहाड़",
"B_en": "Ganeshwar", "B_hi": "गणेश्वर",
"C_en": "Kalibangan", "C_hi": "कालीबंगान",
"D_en": "Bairath", "D_hi": "बैराथ",
"answer": "A",
"explanation_en": "Ahar is an ancient civilization located in Tonk district of Rajasthan, known for its unique stone tools.",
"explanation_hi": "आहाड़ टोंक जिले में स्थित एक प्राचीन सभ्यता है, जो अपने अनोखे पत्थर के औजारों के लिए प्रसिद्ध है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "Which of the following ancient civilizations is known for its advanced irrigation system?",
"question_hi": "निम्नलिखित प्राचीन सभ्यताओं में से कौन अपने उन्नत सिंचाई प्रणाली के लिए जानी जाती है?",
"A_en": "Kalibangan", "A_hi": "कालीबंगान",
"B_en": "Ganeshwar", "B_hi": "गणेश्वर",
"C_en": "Ahar", "C_hi": "आहाड़",
"D_en": "Bairath", "D_hi": "बैराथ",
"answer": "A",
"explanation_en": "Kalibangan is known for its advanced irrigation system.",
"explanation_hi": "कालीबंगान अपने उन्नत सिंचाई प्रणाली के लिए जानी जाती है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "What is the name of the ancient civilization located in Dhoulpur district of Rajasthan, known for its ancient fort?",
"question_hi": "धौलपुर जिले में स्थित प्राचीन सभ्यता का नाम क्या है, जो अपने प्राचीन किले के लिए प्रसिद्ध है?",
"A_en": "Balathal", "A_hi": "बालाथल",
"B_en": "Ganeshwar", "B_hi": "गणेश्वर",
"C_en": "Kalibangan", "C_hi": "कालीबंगान",
"D_en": "Bairath", "D_hi": "बैराथ",
"answer": "A",
"explanation_en": "Balathal is an ancient civilization located in Dhoulpur district of Rajasthan, known for its ancient fort.",
"explanation_hi": "बालाथल धौलपुर जिले में स्थित एक प्राचीन सभ्यता है, जो अपने प्राचीन किले के लिए प्रसिद्ध है।"
}
]