[
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which social group was predominant in the rural agrarian society of ancient Rajasthan?",
    "question_hi": "प्राचीन राजस्थान के ग्रामीण कृषि समाज में प्रमुख सामाजिक वर्ग कौन सा था?",
    "A_en": "Rajputs",
    "A_hi": "राजपूत",
    "B_en": "Jats",
    "B_hi": "जैट",
    "C_en": "Gurjars",
    "C_hi": "गुर्जर",
    "D_en": "Meenas",
    "D_hi": "मेना",
    "answer": "B",
    "explanation_en": "In ancient Rajasthan, the Jats were the main agrarian community, owning most of the farmland and forming the backbone of rural economy.",
    "explanation_hi": "प्राचीन राजस्थान में जाट कृषि प्रधान समाज का मुख्य वर्ग थे, जो अधिकांश कृषि भूमि के मालिक थे और ग्रामीण अर्थव्यवस्था की रीढ़ बने रहते थे।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which of the following religions has a significant historical presence in Rajasthan, evident from numerous ancient Jain temples?",
    "question_hi": "निम्नलिखित धर्मों में से कौन सा धर्म राजस्थान में महत्वपूर्ण ऐतिहासिक उपस्थिति रखता है, जिसे कई प्राचीन जैन मंदिरों से जाना जा सकता है?",
    "A_en": "Hinduism",
    "A_hi": "हिंदू धर्म",
    "B_en": "Islam",
    "B_hi": "इस्लाम",
    "C_en": "Jainism",
    "C_hi": "जैन धर्म",
    "D_en": "Buddhism",
    "D_hi": "बौद्ध धर्म",
    "answer": "C",
    "explanation_en": "Rajasthan houses some of the oldest Jain temples such as Ranakpur and Dilwara, showcasing the prominence of Jainism in its ancient culture.",
    "explanation_hi": "राजस्थान में राणा कुर्पु और दिलवारा जैसे प्राचीन जैन मंदिर हैं, जो प्राचीन संस्कृति में जैन धर्म की प्रमुखता को दर्शाते हैं।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The ‘Panchayat’ system in ancient Rajasthan primarily functioned as a:",
    "question_hi": "प्राचीन राजस्थान में ‘पंचायत’ व्यवस्था मुख्य रूप से क्या कार्य करती थी?",
    "A_en": "Centralized monarchy",
    "A_hi": "केंद्रीय राजशाही",
    "B_en": "Local council of elders",
    "B_hi": "बुजुर्गों का स्थानीय परिषद",
    "C_en": "Military tribunal",
    "C_hi": "सैन्य न्यायाधिकरण",
    "D_en": "Trade guild",
    "D_hi": "व्यापारिक संघ",
    "answer": "B",
    "explanation_en": "Panchayat was a local council of elders that decided on disputes, land matters and maintained social order in rural Rajasthan.",
    "explanation_hi": "पंचायत ग्रामीण राजस्थान में विवादों, भूमि मामलों और सामाजिक व्यवस्था को नियंत्रित करने वाली बुजुर्गों की स्थानीय परिषद थी।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which folk dance of Rajasthan is traditionally performed by women during harvest festivals?",
    "question_hi": "कौन सा लोक नृत्य राजस्थान का, महिलाओं द्वारा फसल उत्सव के दौरान परम्परागत रूप से किया जाता है?",
    "A_en": "Ghoomar",
    "A_hi": "घूमर",
    "B_en": "Kalbeliya",
    "B_hi": "कल्बेलिया",
    "C_en": "Bhangra",
    "C_hi": "भांगड़ा",
    "D_en": "Ghoomar",
    "D_hi": "घूमर",
    "answer": "A",
    "explanation_en": "Ghoomar is a graceful dance performed by women of Rajasthan during festivals and harvest celebrations.",
    "explanation_hi": "घूमर राजस्थान की महिलाएं त्योहारों और फसल उत्सव के दौरान परम्परागत रूप से करते हैं।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The architectural style of the Mehrangarh Fort in Jodhpur is best described as:",
    "question_hi": "जोधपुर के मेहरानगढ़ किले की वास्तुकला शैली को सबसे अच्छी तरह से किस रूप में वर्णित किया जा सकता है?",
    "A_en": "Dravidian",
    "A_hi": "द्रविड़",
    "B_en": "Mughal",
    "B_hi": "मुग़ल",
    "C_en": "Rajputana",
    "C_hi": "राजपूताना",
    "D_en": "Sikh",
    "D_hi": "सिख",
    "answer": "C",
    "explanation_en": "Mehrangarh Fort exemplifies the Rajputana architecture with its massive walls, bastions, and intricate ornamentation.",
    "explanation_hi": "मेहरानगढ़ किला राजपूताना वास्तुकला का उदाहरण है, जिसमें विशाल दीवारें, किले और जटिल अलंकरण शामिल हैं।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which ancient king is credited with founding the city of Udaipur?",
    "question_hi": "किस प्राचीन राजा को उदयपुर शहर की स्थापना का श्रेय दिया जाता है?",
    "A_en": "Maharana Pratap",
    "A_hi": "महाराणा प्रताप",
    "B_en": "Maharana Sangram Singh",
    "B_hi": "महाराणा संगराम सिंह",
    "C_en": "Maharana Jagat Singh",
    "C_hi": "महाराणा जगत सिंह",
    "D_en": "Maharana Kumbha",
    "D_hi": "महाराणा कुंभ",
    "answer": "C",
    "explanation_en": "Maharana Jagat Singh II founded Udaipur in 1559 after the destruction of Chittorgarh, establishing it as a new capital.",
    "explanation_hi": "महाराणा जगत सिंह द्वितीय ने 1559 में चित्तौड़गढ़ के विनाश के बाद उदयपुर की स्थापना की, इसे नए राजधानी के रूप में स्थापित किया।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which community in ancient Rajasthan was primarily involved in weaving and textile production?",
    "question_hi": "प्राचीन राजस्थान में कौन सी समुदाय मुख्य रूप से बुनाई और वस्त्र उत्पादन में संलग्न थी?",
    "A_en": "Brahmins",
    "A_hi": "ब्राह्मण",
    "B_en": "Khatri",
    "B_hi": "खत्री",
    "C_en": "Chamar",
    "C_hi": "चमर",
    "D_en": "Rajputs",
    "D_hi": "राजपूत",
    "answer": "C",
    "explanation_en": "The Chamar community were traditionally weavers and played a vital role in Rajasthan’s textile trade.",
    "explanation_hi": "चमर समुदाय पारम्परिक रूप से बुनकर थे और राजस्थान के वस्त्र व्यापार में महत्वपूर्ण भूमिका निभाते थे।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which festival is celebrated to honor the goddess ‘Marudhar’ in Rajasthan’s desert culture?",
    "question_hi": "राजस्थान के रेगिस्तानी संस्कृति में देवी ‘मरुधर’ को सम्मानित करने के लिए कौन सा त्योहार मनाया जाता है?",
    "A_en": "Makar Sankranti",
    "A_hi": "मकर संक्रांति",
    "B_en": "Baisakhi",
    "B_hi": "बैसाखी",
    "C_en": "Rajasthani ‘Marudhar’ Festival",
    "C_hi": "राजस्थानी ‘मरुधर’ महोत्सव",
    "D_en": "Diwali",
    "D_hi": "दिवाली",
    "answer": "C",
    "explanation_en": "The Marudhar festival is a local celebration dedicated to the desert goddess, featuring folk songs and rituals.",
    "explanation_hi": "मरुधर महोत्सव एक स्थानीय उत्सव है जो रेगिस्तानी देवी को समर्पित है, जिसमें लोक गीत और अनुष्ठान होते हैं।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which ancient inscription in Rajasthan provides evidence of early Buddhist presence in the region?",
    "question_hi": "राजस्थान में कौन सी प्राचीन शिलालेख क्षेत्र में प्रारंभिक बौद्ध उपस्थिति का प्रमाण देती है?",
    "A_en": "Bharatpur inscription",
    "A_hi": "बहारपुर शिलालेख",
    "B_en": "Kumbhalgarh inscription",
    "B_hi": "कुंभलगढ़ शिलालेख",
    "C_en": "Kangra inscription",
    "C_hi": "कंगड़ा शिलालेख",
    "D_en": "Kumbha inscription",
    "D_hi": "कुंबा शिलालेख",
    "answer": "A",
    "explanation_en": "The Bharatpur inscription mentions a Buddhist vihara, confirming early Buddhist influence in Rajasthan.",
    "explanation_hi": "बहारपुर शिलालेख में एक बौद्ध विहार का उल्लेख है, जो राजस्थान में प्रारंभिक बौद्ध प्रभाव की पुष्टि करता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which traditional Rajasthani musical instrument is made from a single piece of wood and used in folk performances?",
    "question_hi": "कौन सा पारम्परिक राजस्थानी संगीत वाद्य एक ही लकड़ी के टुकड़े से बना होता है और लोक प्रदर्शन में उपयोग होता है?",
    "A_en": "Sarangi",
    "A_hi": "सारंगी",
    "B_en": "Dholak",
    "B_hi": "दोलक",
    "C_en": "Sarangi",
    "C_hi": "सारंगी",
    "D_en": "Khur",
    "D_hi": "खुर",
    "answer": "D",
    "explanation_en": "The khur is a wooden instrument carved from a single piece, commonly used in Rajasthani folk music.",
    "explanation_hi": "खुर एक लकड़ी का वाद्य है जिसे एक ही टुकड़े से तराशा जाता है और यह राजस्थानी लोक संगीत में सामान्यतः उपयोग होता है।"
  }
]