[
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "Which of the following ancient civilizations had a significant influence on the social structure of Rajasthan?",
"question_hi": "निम्नलिखित प्राचीन सभ्यताओं में से किसने राजस्थान के सामाजिक ढांचे पर महत्वपूर्ण प्रभाव डाला?",
"A_en": "Indus Valley Civilization", "A_hi": "सिंधु घाटी सभ्यता",
"B_en": "Vedic Civilization", "B_hi": "वैदिक सभ्यता",
"C_en": "Mauryan Civilization", "C_hi": "मौर्य सभ्यता",
"D_en": "Gupta Civilization", "D_hi": "गुप्त सभ्यता",
"answer": "A",
"explanation_en": "The Indus Valley Civilization had a significant influence on the social structure of Rajasthan, with its advanced urban planning and social hierarchy.",
"explanation_hi": "सिंधु घाटी सभ्यता ने राजस्थान के सामाजिक ढांचे पर महत्वपूर्ण प्रभाव डाला, जिसमें उसकी उन्नत शहरी योजना और सामाजिक पदानुक्रम शामिल था।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "What was the primary religion practiced in ancient Rajasthan?",
"question_hi": "प्राचीन राजस्थान में मुख्य रूप से कौन सा धर्म प्रचलित था?",
"A_en": "Hinduism", "A_hi": "हिंदू धर्म",
"B_en": "Buddhism", "B_hi": "बौद्ध धर्म",
"C_en": "Jainism", "C_hi": "जैन धर्म",
"D_en": "Sikhism", "D_hi": "सिख धर्म",
"answer": "A",
"explanation_en": "Hinduism was the primary religion practiced in ancient Rajasthan, with many temples and shrines dedicated to Hindu deities.",
"explanation_hi": "हिंदू धर्म प्राचीन राजस्थान में मुख्य रूप से प्रचलित था, जिसमें कई मंदिर और श्राइन हिंदू देवताओं को समर्पित थे।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "Which of the following ancient texts is considered a significant source of information on the social and cultural practices of ancient Rajasthan?",
"question_hi": "निम्नलिखित प्राचीन ग्रंथों में से किसे प्राचीन राजस्थान के सामाजिक और सांस्कृतिक प्रथाओं के बारे में जानकारी का एक महत्वपूर्ण स्रोत माना जाता है?",
"A_en": "Mahabharata", "A_hi": "महाभारत",
"B_en": "Ramayana", "B_hi": "रामायण",
"C_en": "Rigveda", "C_hi": "ऋग्वेद",
"D_en": "Puranas", "D_hi": "पुराण",
"answer": "A",
"explanation_en": "The Mahabharata is considered a significant source of information on the social and cultural practices of ancient Rajasthan, as it describes the region's geography, politics, and culture.",
"explanation_hi": "महाभारत को प्राचीन राजस्थान के सामाजिक और सांस्कृतिक प्रथाओं के बारे में जानकारी का एक महत्वपूर्ण स्रोत माना जाता है, क्योंकि यह क्षेत्र के भूगोल, राजनीति और संस्कृति का वर्णन करता है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "What was the name of the ancient city in Rajasthan that was known for its advanced irrigation system?",
"question_hi": "राजस्थान के उस प्राचीन शहर का नाम क्या था जो अपनी उन्नत सिंचाई प्रणाली के लिए जाना जाता था?",
"A_en": "Kalibangan", "A_hi": "कालीबंगान",
"B_en": "Bairat", "B_hi": "बैराट",
"C_en": "Rangmahal", "C_hi": "रंगमहल",
"D_en": "Amber", "D_hi": "अम्बर",
"answer": "A",
"explanation_en": "Kalibangan was an ancient city in Rajasthan that was known for its advanced irrigation system, which included canals, dams, and reservoirs.",
"explanation_hi": "कालीबंगान राजस्थान का एक प्राचीन शहर था जो अपनी उन्नत सिंचाई प्रणाली के लिए जाना जाता था, जिसमें नहरें, बांध और जलाशय शामिल थे।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "Which of the following ancient festivals is still celebrated in Rajasthan with great enthusiasm?",
"question_hi": "निम्नलिखित प्राचीन त्योहारों में से कौन सा अभी भी राजस्थान में बहुत उत्साह के साथ मनाया जाता है?",
"A_en": "Navaratri", "A_hi": "नवरात्रि",
"B_en": "Diwali", "B_hi": "दिवाली",
"C_en": "Holi", "C_hi": "होली",
"D_en": "Gangaur", "D_hi": "गणगौर",
"answer": "D",
"explanation_en": "Gangaur is an ancient festival that is still celebrated in Rajasthan with great enthusiasm, particularly in the cities of Jaipur and Udaipur.",
"explanation_hi": "गणगौर एक प्राचीन त्योहार है जो अभी भी राजस्थान में बहुत उत्साह के साथ मनाया जाता है, विशेष रूप से जयपुर और उदयपुर शहरों में।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "What was the name of the ancient tribe that inhabited the region of Rajasthan?",
"question_hi": "राजस्थान क्षेत्र में रहने वाले प्राचीन जनजाति का नाम क्या था?",
"A_en": "Bhils", "A_hi": "भील",
"B_en": "Minas", "B_hi": "मीना",
"C_en": "Gurjars", "C_hi": "गुर्जर",
"D_en": "Meenas", "D_hi": "मीणा",
"answer": "A",
"explanation_en": "The Bhils were an ancient tribe that inhabited the region of Rajasthan, and were known for their skill in archery and their traditional way of life.",
"explanation_hi": "भील प्राचीन जनजाति थी जो राजस्थान क्षेत्र में रहती थी, और他们 धनुर्विद्या में कौशल और उनके पारंपरिक जीवनशैली के लिए जाने जाते थे।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "Which of the following ancient monuments in Rajasthan is a UNESCO World Heritage Site?",
"question_hi": "निम्नलिखित प्राचीन स्मारकों में से कौन सा राजस्थान में एक यूनेस्को विश्व धरोहर स्थल है?",
"A_en": "Jaisalmer Fort", "A_hi": "जैसलमेर किला",
"B_en": "Mehrangarh Fort", "B_hi": "मेहरानगढ़ किला",
"C_en": "Chittor Fort", "C_hi": "चित्तौड़गढ़ किला",
"D_en": "Kumbhalgarh Fort", "D_hi": "कुम्भलगढ़ किला",
"answer": "A",
"explanation_en": "The Jaisalmer Fort is a UNESCO World Heritage Site and is one of the largest forts in the world, built in the 12th century.",
"explanation_hi": "जैसलमेर किला एक यूनेस्को विश्व धरोहर स्थल है और दुनिया के सबसे बड़े किलों में से एक है, जो 12वीं शताब्दी में बनाया गया था।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "What was the name of the ancient kingdom that existed in the region of Rajasthan?",
"question_hi": "राजस्थान क्षेत्र में अस्तित्व में रहने वाले प्राचीन राज्य का नाम क्या था?",
"A_en": "Mewar", "A_hi": "मेवाड़",
"B_en": "Marwar", "B_hi": "मारवाड़",
"C_en": "Dhundhar", "C_hi": "धुंधार",
"D_en": "Hadoti", "D_hi": "हाड़ौती",
"answer": "A",
"explanation_en": "Mewar was an ancient kingdom that existed in the region of Rajasthan, and was known for its rich culture and history.",
"explanation_hi": "मेवाड़ राजस्थान क्षेत्र में अस्तित्व में रहने वाला एक प्राचीन राज्य था, और इसकी समृद्ध संस्कृति और इतिहास के लिए जाना जाता था।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "Which of the following ancient cities in Rajasthan was an important center of trade and commerce?",
"question_hi": "निम्नलिखित प्राचीन शहरों में से कौन सा राजस्थान में व्यापार और वाणिज्य का एक महत्वपूर्ण केंद्र था?",
"A_en": "Bharatpur", "A_hi": "भरतपुर",
"B_en": "Alwar", "B_hi": "अलवर",
"C_en": "Bikaner", "C_hi": "बीकानेर",
"D_en": "Jodhpur", "D_hi": "जोधपुर",
"answer": "D",
"explanation_en": "Jodhpur was an important center of trade and commerce in ancient Rajasthan, and was known for its textile and metal industries.",
"explanation_hi": "जोधपुर प्राचीन राजस्थान में व्यापार और वाणिज्य का एक महत्वपूर्ण केंद्र था, और इसके वस्त्र और धातु उद्योगों के लिए जाना जाता था।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "What was the name of the ancient river that flowed through the region of Rajasthan?",
"question_hi": "राजस्थान क्षेत्र से बहने वाली प्राचीन नदी का नाम क्या था?",
"A_en": "Saraswati", "A_hi": "सरस्वती",
"B_en": "Ghaggar", "B_hi": "घग्गर",
"C_en": "Chambal", "C_hi": "चम्बल",
"D_en": "Kali Sindh", "D_hi": "काली सिंध",
"answer": "A",
"explanation_en": "The Saraswati was an ancient river that flowed through the region of Rajasthan, and was considered sacred in Hindu mythology.",
"explanation_hi": "सरस्वती राजस्थान क्षेत्र से बहने वाली एक प्राचीन नदी थी, और हिंदू पौराणिक कथाओं में इसका पूजनीय माना जाता था।"
}
]