[
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which inscription provides the earliest evidence of the 'Bhagavata' (Vaishnava) religion in Rajasthan?",
    "question_hi": "राजस्थान में 'भागवत' (वैष्णव) धर्म का सबसे प्राचीन प्रमाण कौन सा अभिलेख प्रदान करता है?",
    "A_en": "Bairat Inscription", "A_hi": "बैराठ अभिलेख",
    "B_en": "Ghosundi Inscription", "B_hi": "घोसुण्डी अभिलेख",
    "C_en": "Bijolia Inscription", "C_hi": "बिजोलिया अभिलेख",
    "D_en": "Ghatiyala Inscription", "D_hi": "घटियाला अभिलेख",
    "answer": "B",
    "explanation_en": "The Ghosundi inscription (2nd century BCE) located near Chittorgarh mentions the construction of a stone wall around the place of worship of Sankarshana and Vasudeva.",
    "explanation_hi": "चित्तौड़गढ़ के पास स्थित घोसुण्डी अभिलेख (द्वितीय शताब्दी ईसा पूर्व) में संकर्षण और वासुदेव की पूजा के स्थान के चारों ओर पत्थर की दीवार के निर्माण का उल्लेख है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The 'Bhabru Edict' of Ashoka, which proves his faith in Buddhism, was discovered at which ancient site?",
    "question_hi": "अशोक का 'भाब्रू शिलालेख', जो बौद्ध धर्म में उनकी आस्था को सिद्ध करता है, किस प्राचीन स्थल पर खोजा गया था?",
    "A_en": "Ahar", "A_hi": "आहड़",
    "B_en": "Ganeshwar", "B_hi": "गणेश्वर",
    "C_en": "Bairat (Viratnagar)", "C_hi": "बैराठ (विराटनगर)",
    "D_en": "Kalibangan", "D_hi": "कालीबंगा",
    "answer": "C",
    "explanation_en": "Captain Burt discovered the Bhabru rock edict at Bairat (Viratnagar) in 1837, which contains Ashoka's expression of faith in the Buddha, Dhamma, and Sangha.",
    "explanation_hi": "कैप्टन बर्ट ने 1837 में बैराठ (विराटनगर) में भाब्रू शिलालेख की खोज की थी, जिसमें बुद्ध, धम्म और संघ में अशोक की आस्था व्यक्त की गई है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The 'Lakulish Temple' located at Kailashpuri (Udaipur) represents which sect of Shaivism?",
    "question_hi": "कैलाशपुरी (उदयपुर) में स्थित 'लकुलीश मंदिर' शैव धर्म के किस संप्रदाय का प्रतिनिधित्व करता है?",
    "A_en": "Kapalika", "A_hi": "कापालिक",
    "B_en": "Pashupata", "B_hi": "पाशुपत",
    "C_en": "Lingayat", "C_hi": "लिंगायत",
    "D_en": "Kashmir Shaivism", "D_hi": "कश्मीर शैव धर्म",
    "answer": "B",
    "explanation_en": "Lakulish is considered the 28th avatar of Shiva and the founder of the Pashupata sect. The temple was built by Bappa Rawal.",
    "explanation_hi": "लकुलीश को शिव का 28वां अवतार और पाशुपत संप्रदाय का संस्थापक माना जाता है। इस मंदिर का निर्माण बप्पा रावल ने करवाया था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which ancient inscription provides information about the 'Sati system' for the first time in Rajasthan?",
    "question_hi": "राजस्थान में पहली बार 'सती प्रथा' के बारे में जानकारी कौन सा प्राचीन अभिलेख प्रदान करता है?",
    "A_en": "Ghatiyala Inscription (861 AD)", "A_hi": "घटियाला अभिलेख (861 ईस्वी)",
    "B_en": "Kumbhalgarh Inscription", "B_hi": "कुंभलगढ़ अभिलेख",
    "C_en": "Ranakpur Inscription", "C_hi": "रणकपुर अभिलेख",
    "D_en": "Sarnath Inscription", "D_hi": "सारनाथ अभिलेख",
    "answer": "A",
    "explanation_en": "The Ghatiyala inscription of the Pratihara King Kakkuka mentions the Sati of Sampalla Devi, providing early evidence of the custom in Rajasthan.",
    "explanation_hi": "प्रतिहार राजा कक्कुक के घटियाला अभिलेख में संपल्ला देवी के सती होने का उल्लेख है, जो राजस्थान में इस प्रथा का प्रारंभिक प्रमाण है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The Chinese traveler Hieun Tsang visited which ancient city of Rajasthan, known as a center of learning?",
    "question_hi": "चीनी यात्री ह्वेनसांग ने राजस्थान के किस प्राचीन शहर का दौरा किया था, जिसे शिक्षा के केंद्र के रूप में जाना जाता था?",
    "A_en": "Pushkar", "A_hi": "पुष्कर",
    "B_en": "Bhinmal (Pe-lo-mo-lo)", "B_hi": "भीनमाल (पी-लो-मो-लो)",
    "C_en": "Nagari", "C_hi": "नगरी",
    "D_en": "Jhalrapatan", "D_hi": "झालरापाटन",
    "answer": "B",
    "explanation_en": "Hieun Tsang visited Bhinmal (Jalore) during the 7th century and called it 'Pe-lo-mo-lo'. It was a famous center for Buddhist and Brahminic learning.",
    "explanation_hi": "ह्वेनसांग ने 7वीं शताब्दी के दौरान भीनमाल (जालौर) का दौरा किया और इसे 'पी-लो-मो-लो' कहा। यह बौद्ध और ब्राह्मणवादी शिक्षा का एक प्रसिद्ध केंद्र था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The 'Sun Temple' of Osian was built during the reign of which dynasty?",
    "question_hi": "ओसियां का 'सूर्य मंदिर' किस राजवंश के शासनकाल के दौरान बनाया गया था?",
    "A_en": "Chauhan", "A_hi": "चौहान",
    "B_en": "Gurjara-Pratihara", "B_hi": "गुर्जर-प्रतिहार",
    "C_en": "Guhil", "C_hi": "गुहिल",
    "D_en": "Parmar", "D_hi": "परमार",
    "answer": "B",
    "explanation_en": "The temples of Osian, including the famous Sun Temple and Mahavira Temple, are classic examples of Gurjara-Pratihara architecture (Maha-Maru style).",
    "explanation_hi": "ओसियां के मंदिर, जिनमें प्रसिद्ध सूर्य मंदिर और महावीर मंदिर शामिल हैं, गुर्जर-प्रतिहार वास्तुकला (महा-मारू शैली) के उत्कृष्ट उदाहरण हैं।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which ancient site in Rajasthan has yielded evidence of 'Swastika' and religious fire altars (Agni Kundas)?",
    "question_hi": "राजस्थान के किस प्राचीन स्थल से 'स्वास्तिक' और धार्मिक अग्नि वेदियों (अग्नि कुंड) के प्रमाण मिले हैं?",
    "A_en": "Kalibangan", "A_hi": "कालीबंगा",
    "B_en": "Ahar", "B_hi": "आहड़",
    "C_en": "Gilund", "C_hi": "गिलुण्ड",
    "D_en": "Bagore", "D_hi": "बागोर",
    "answer": "A",
    "explanation_en": "Kalibangan (Hanumangarh) shows evidence of fire altars on platforms, indicating the religious practice of ritual sacrifice or fire worship.",
    "explanation_hi": "कालीबंगा (हनुमानगढ़) में चबूतरे पर अग्नि वेदियों के प्रमाण मिलते हैं, जो कर्मकांडीय बलिदान या अग्नि पूजा की धार्मिक प्रथा का संकेत देते हैं।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which famous Jain scholar lived in the court of Prithviraj Chauhan III, reflecting the cultural diversity of the time?",
    "question_hi": "कौन सा प्रसिद्ध जैन विद्वान पृथ्वीराज चौहान तृतीय के दरबार में रहता था, जो उस समय की सांस्कृतिक विविधता को दर्शाता है?",
    "A_en": "Hemachandra Suri", "A_hi": "हेमचंद्र सूरी",
    "B_en": "Jinapati Suri", "B_hi": "जिनपति सूरी",
    "C_en": "Haribhadra Suri", "B_hi": "हरिभद्र सूरी",
    "D_en": "Udyotan Suri", "D_hi": "उद्योतन सूरी",
    "answer": "B",
    "explanation_en": "Jinapati Suri was a prominent Jain scholar in the court of Prithviraj Chauhan III. The Chauhans were generally tolerant and patronized Jainism.",
    "explanation_hi": "जिनपति सूरी पृथ्वीराज चौहान तृतीय के दरबार में एक प्रमुख जैन विद्वान थे। चौहान आमतौर पर उदार थे और जैन धर्म को संरक्षण देते थे।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "According to the 'Bijolia Inscription', which lake was built by the Chauhan ruler Vasudeva?",
    "question_hi": "बिजोलिया अभिलेख के अनुसार, चौहान शासक वासुदेव ने किस झील का निर्माण करवाया था?",
    "A_en": "Pushkar Lake", "A_hi": "पुष्कर झील",
    "B_en": "Sambhar Lake", "B_hi": "सांभर झील",
    "C_en": "Rajsamand Lake", "C_hi": "राजसमंद झील",
    "D_en": "Nakki Lake", "D_hi": "नक्की झील",
    "answer": "B",
    "explanation_en": "The 1170 AD Bijolia inscription states that the Chauhan progenitor Vasudeva created the Sambhar (Sakambhari) Lake.",
    "explanation_hi": "1170 ईस्वी के बिजोलिया अभिलेख में कहा गया है कि चौहान पूर्वज वासुदेव ने सांभर (शाकंभरी) झील का निर्माण किया था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The 'Kanhadade Prabandha', which describes the society and culture of Jalore, was written by whom?",
    "question_hi": "जालौर के समाज और संस्कृति का वर्णन करने वाला 'कान्हड़दे प्रबंध' किसके द्वारा लिखा गया था?",
    "A_en": "Nainsi", "A_hi": "नैणसी",
    "B_en": "Padmanabha", "B_hi": "पद्मनाभ",
    "C_en": "Suryamal Misran", "C_hi": "सूर्यमल मिश्रण",
    "D_en": "Chandbardai", "D_hi": "चन्दबरदाई",
    "answer": "B",
    "explanation_en": "Padmanabha wrote Kanhadade Prabandha in the 15th century, providing a detailed account of the struggle of Kanhadade against Alauddin Khalji and the contemporary culture.",
    "explanation_hi": "पद्मनाभ ने 15वीं शताब्दी में कान्हड़दे प्रबंध लिखा था, जो अलाउद्दीन खिलजी के खिलाफ कान्हड़दे के संघर्ष और तत्कालीन संस्कृति का विस्तृत विवरण प्रदान करता है।"
  }
]