[
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The Ghosundi inscription is considered the earliest evidence of which religious sect in Rajasthan?",
    "question_hi": "घोसुण्डी शिलालेख राजस्थान में किस धार्मिक संप्रदाय का सबसे प्राचीन प्रमाण माना जाता है?",
    "A_en": "Shaiva Sect",
    "A_hi": "शैव संप्रदाय",
    "B_en": "Bhagavata (Vaishnava) Sect",
    "B_hi": "भागवत (वैष्णव) संप्रदाय",
    "C_en": "Jainism",
    "C_hi": "जैन धर्म",
    "D_en": "Buddhism",
    "D_hi": "बौद्ध धर्म",
    "answer": "B",
    "explanation_en": "The Ghosundi inscription (2nd century BC) near Chittorgarh provides the earliest evidence of the Bhagavata or Vaishnava sect and the worship of Sankarshana and Vasudeva.",
    "explanation_hi": "चित्तौड़गढ़ के पास स्थित घोसुण्डी शिलालेख (द्वितीय शताब्दी ईसा पूर्व) भागवत या वैष्णव संप्रदाय और संकर्षण तथा वासुदेव की पूजा का सबसे प्राचीन प्रमाण प्रदान करता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "From which ancient site in Rajasthan have remains of a circular Buddhist temple (Stupa) been found?",
    "question_hi": "राजस्थान के किस प्राचीन स्थल से एक गोलाकार बौद्ध मंदिर (स्तूप) के अवशेष मिले हैं?",
    "A_en": "Kalibangan",
    "A_hi": "कालीबंगा",
    "B_en": "Ahar",
    "B_hi": "आहड़",
    "C_en": "Bairat (Viratnagar)",
    "C_hi": "बैराठ (विराटनगर)",
    "D_en": "Ganeshwar",
    "D_hi": "गणेश्वर",
    "answer": "C",
    "explanation_en": "Bairat (ancient Viratnagar) has yielded remains of a circular Buddhist temple, a monastery, and Ashokan edicts, proving it was a major center of Buddhism.",
    "explanation_hi": "बैराठ (प्राचीन विराटनगर) से एक गोलाकार बौद्ध मंदिर, एक मठ और अशोक के शिलालेखों के अवशेष मिले हैं, जो यह सिद्ध करते हैं कि यह बौद्ध धर्म का एक प्रमुख केंद्र था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "At which archaeological site in Rajasthan were multiple stoves (Chulhas) found in a single house, indicating the existence of a joint family system?",
    "question_hi": "राजस्थान के किस पुरातात्विक स्थल पर एक ही घर में कई चूल्हे मिले हैं, जो संयुक्त परिवार प्रणाली के अस्तित्व का संकेत देते हैं?",
    "A_en": "Bagore",
    "A_hi": "बागोर",
    "B_en": "Ahar",
    "B_hi": "आहड़",
    "C_en": "Gilund",
    "C_hi": "गिलुण्ड",
    "D_en": "Balathal",
    "D_hi": "बालाथल",
    "answer": "B",
    "explanation_en": "Excavations at Ahar (Udaipur) revealed houses with 4 to 6 stoves, suggesting a joint family system or a communal kitchen.",
    "explanation_hi": "आहड़ (उदयपुर) की खुदाई में 4 से 6 चूल्हों वाले घर मिले हैं, जो संयुक्त परिवार प्रणाली या सामुदायिक रसोई का सुझाव देते हैं।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The Lakulish Temple located at Eklingji (Udaipur) belongs to which sect?",
    "question_hi": "एकलिंगजी (उदयपुर) में स्थित लकुलीश मंदिर किस संप्रदाय से संबंधित है?",
    "A_en": "Nath Sect",
    "A_hi": "नाथ संप्रदाय",
    "B_en": "Pashupata Sect",
    "B_hi": "पाशुपत संप्रदाय",
    "C_en": "Kapalika Sect",
    "C_hi": "कापालिक संप्रदाय",
    "D_en": "Shakta Sect",
    "D_hi": "शाक्त संप्रदाय",
    "answer": "B",
    "explanation_en": "The Lakulish temple at Eklingji is the main center of the Pashupata sect in Rajasthan, established by Bappa Rawal in the 8th century.",
    "explanation_hi": "एकलिंगजी का लकुलीश मंदिर राजस्थान में पाशुपत संप्रदाय का मुख्य केंद्र है, जिसे 8वीं शताब्दी में बप्पा रावल द्वारा स्थापित किया गया था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which ancient city of Rajasthan was known as 'Upkeshpatan' and was a major center for Jainism and Hinduism?",
    "question_hi": "राजस्थान के किस प्राचीन शहर को 'उपकेशपट्टन' के नाम से जाना जाता था और यह जैन धर्म तथा हिंदू धर्म का एक प्रमुख केंद्र था?",
    "A_en": "Osian",
    "A_hi": "ओसियां",
    "B_en": "Bhinmal",
    "C_en": "Nagari",
    "D_en": "Chandrawati",
    "B_hi": "भीनमाल",
    "C_hi": "नगरी",
    "D_hi": "चंद्रावती",
    "answer": "A",
    "explanation_en": "Osian (Jodhpur) was known as Upkeshpatan. It is famous for its ancient Hindu and Jain temples built during the Pratihara period.",
    "explanation_hi": "ओसियां (जोधपुर) को उपकेशपट्टन के नाम से जाना जाता था। यह प्रतिहार काल के दौरान निर्मित अपने प्राचीन हिंदू और जैन मंदिरों के लिए प्रसिद्ध है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which inscription mentions the origin of the Chauhan Rajputs from the 'Vatsa Gotra' Brahmin, shedding light on the social structure of that era?",
    "question_hi": "कौन सा शिलालेख चौहान राजपूतों की उत्पत्ति 'वत्स गोत्र' ब्राह्मण से बताता है, जो उस युग की सामाजिक संरचना पर प्रकाश डालता है?",
    "A_en": "Ghatiyala Inscription",
    "A_hi": "घटियाला शिलालेख",
    "B_en": "Bijolia Inscription",
    "B_hi": "बिजोलिया शिलालेख",
    "C_en": "Kumbhalgarh Inscription",
    "C_hi": "कुंभलगढ़ शिलालेख",
    "D_en": "Chirwa Inscription",
    "D_hi": "चीरवा शिलालेख",
    "answer": "B",
    "explanation_en": "The Bijolia Inscription (1170 AD) describes the Chauhans as 'Vatsa Gotra Bhutah', indicating their Brahmin origins and providing social-cultural details of the period.",
    "explanation_hi": "बिजोलिया शिलालेख (1170 ईस्वी) चौहानों को 'वत्स गोत्र भूत' के रूप में वर्णित करता है, जो उनके ब्राह्मण मूल का संकेत देता है और उस काल के सामाजिक-सांस्कृतिक विवरण प्रदान करता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "According to the Chinese traveler Xuanzang (Hieun Tsang), which city in ancient Rajasthan was a great center of learning and Buddhism?",
    "question_hi": "चीनी यात्री युआन च्वांग (ह्वेन सांग) के अनुसार, प्राचीन राजस्थान का कौन सा शहर शिक्षा और बौद्ध धर्म का एक बड़ा केंद्र था?",
    "A_en": "Madhyamika",
    "A_hi": "मध्यमिका",
    "B_en": "Bhinmal (Po-lo-mo-lo)",
    "B_hi": "भीनमाल (पो-लो-मो-लो)",
    "C_en": "Pushkar",
    "C_hi": "पुष्कर",
    "D_en": "Nagda",
    "D_hi": "नागदा",
    "answer": "B",
    "explanation_en": "Hieun Tsang visited Bhinmal (Jalore) in the 7th century. He called it 'Po-lo-mo-lo' and described it as a prosperous center of culture and religion.",
    "explanation_hi": "ह्वेन सांग ने 7वीं शताब्दी में भीनमाल (जालौर) की यात्रा की थी। उन्होंने इसे 'पो-लो-मो-लो' कहा और इसे संस्कृति और धर्म के एक समृद्ध केंद्र के रूप में वर्णित किया।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which practice among the ancient social customs of Rajasthan is evidenced by the 'Sati Memorials' found at the Ghatiyala inscriptions?",
    "question_hi": "घटियाला शिलालेखों में पाए गए 'सती स्मारकों' से राजस्थान की प्राचीन सामाजिक प्रथाओं में से किस प्रथा का प्रमाण मिलता है?",
    "A_en": "Child Marriage",
    "A_hi": "बाल विवाह",
    "B_en": "Sati Pratha",
    "B_hi": "सती प्रथा",
    "C_en": "Purdah System",
    "C_hi": "पर्दा प्रथा",
    "D_en": "Polygamy",
    "D_hi": "बहुविवाह",
    "answer": "B",
    "explanation_en": "The Ghatiyala inscription (861 AD) of the Pratihara period mentions the Sati of a woman named Sampalladevi, providing historical evidence of Sati Pratha in Rajasthan.",
    "explanation_hi": "प्रतिहार काल के घटियाला शिलालेख (861 ईस्वी) में संपल्लदेवी नामक महिला के सती होने का उल्लेख है, जो राजस्थान में सती प्रथा का ऐतिहासिक प्रमाण प्रदान करता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The excavations at Kalibangan provide evidence of which ancient social planning feature?",
    "question_hi": "कालीबंगा में की गई खुदाई किस प्राचीन सामाजिक नियोजन विशेषता का प्रमाण प्रदान करती है?",
    "A_en": "Grid system for town planning",
    "A_hi": "नगर नियोजन के लिए ग्रिड प्रणाली",
    "B_en": "Cave paintings",
    "B_hi": "गुफा चित्रकारी",
    "C_en": "Iron smelting furnaces",
    "C_hi": "लोहा गलाने की भट्टियाँ",
    "D_en": "Pyramidal temples",
    "D_hi": "पिरामिडनुमा मंदिर",
    "answer": "A",
    "explanation_en": "Kalibangan shows a well-organized social structure through its grid-pattern town planning, drainage systems, and use of fortified citadels.",
    "explanation_hi": "कालीबंगा अपनी ग्रिड-पैटर्न नगर नियोजन, जल निकासी प्रणालियों और किलाबंद गढ़ों के उपयोग के माध्यम से एक सुव्यवस्थित सामाजिक संरचना को दर्शाता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which ancient deity's worship was most prevalent among the agrarian society of Rajasthan, often associated with the protection of cattle?",
    "question_hi": "राजस्थान के कृषि प्रधान समाज में किस प्राचीन देवता की पूजा सबसे अधिक प्रचलित थी, जो अक्सर पशुओं की रक्षा से जुड़ी होती थी?",
    "A_en": "Lord Indra",
    "A_hi": "भगवान इंद्र",
    "B_en": "Lord Varuna",
    "B_hi": "भगवान वरुण",
    "C_en": "Tejaji/Devnarayanji (Lok Devtas)",
    "C_hi": "तेजाजी/देवनारायणजी (लोक देवता)",
    "D_en": "Lord Agni",
    "D_hi": "भगवान अग्नि",
    "answer": "C",
    "explanation_en": "While Vedic deities were worshipped, the culture of Rajasthan is unique for its 'Lok Devtas' like Tejaji and Devnarayanji, who were worshipped as protectors of society and livestock since ancient/medieval transitions.",
    "explanation_hi": "यद्यपि वैदिक देवताओं की पूजा की जाती थी, राजस्थान की संस्कृति अपने 'लोक देवताओं' जैसे तेजाजी और देवनारायणजी के लिए अद्वितीय है, जिन्हें प्राचीन/मध्यकालीन संक्रमण काल से ही समाज और पशुधन के रक्षक के रूप में पूजा जाता था।"
  }
]