[
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "Which of the following ancient civilizations is located in the Hanumangarh district of Rajasthan?",
"question_hi": "निम्नलिखित प्राचीन सभ्यताओं में से कौन सी राजस्थान के हनुमानगढ़ जिले में स्थित है?",
"A_en": "Kalibangan", "A_hi": "कालीबंगा",
"B_en": "Ahar", "B_hi": "आहर",
"C_en": "Ganeshar", "C_hi": "गणेश्वर",
"D_en": "Balathal", "D_hi": "बालाथल",
"answer": "A",
"explanation_en": "Kalibangan is an ancient civilization located in the Hanumangarh district of Rajasthan.",
"explanation_hi": "कालीबंगा राजस्थान के हनुमानगढ़ जिले में स्थित एक प्राचीन सभ्यता है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "What is the name of the ancient civilization located in the Udaipur district of Rajasthan, known for its copper artifacts?",
"question_hi": "उदयपुर जिले में स्थित प्राचीन सभ्यता का नाम क्या है, जो अपने ताम्र कलाकृतियों के लिए जानी जाती है?",
"A_en": "Ahar", "A_hi": "आहर",
"B_en": "Ganeshar", "B_hi": "गणेश्वर",
"C_en": "Kalibangan", "C_hi": "कालीबंगा",
"D_en": "Balathal", "D_hi": "बालाथल",
"answer": "B",
"explanation_en": "Ganeshar is an ancient civilization located in the Udaipur district of Rajasthan, known for its copper artifacts.",
"explanation_hi": "गणेश्वर उदयपुर जिले में स्थित एक प्राचीन सभ्यता है, जो अपने ताम्र कलाकृतियों के लिए जानी जाती है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "Which of the following ancient civilizations is located in the Alwar district of Rajasthan?",
"question_hi": "निम्नलिखित प्राचीन सभ्यताओं में से कौन सी राजस्थान के अलवर जिले में स्थित है?",
"A_en": "Bairath", "A_hi": "बैराथ",
"B_en": "Kalibangan", "B_hi": "कालीबंगा",
"C_en": "Ahar", "C_hi": "आहर",
"D_en": "Ganeshar", "D_hi": "गणेश्वर",
"answer": "A",
"explanation_en": "Bairath is an ancient civilization located in the Alwar district of Rajasthan.",
"explanation_hi": "बैराथ राजस्थान के अलवर जिले में स्थित एक प्राचीन सभ्यता है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "What is the name of the ancient civilization located in the Dhariawad tehsil of Rajasthan's Udaipur district?",
"question_hi": "उदयपुर जिले की धारियावाद तहसील में स्थित प्राचीन सभ्यता का नाम क्या है?",
"A_en": "Balathal", "A_hi": "बालाथल",
"B_en": "Ganeshar", "B_hi": "गणेश्वर",
"C_en": "Ahar", "C_hi": "आहर",
"D_en": "Kalibangan", "D_hi": "कालीबंगा",
"answer": "A",
"explanation_en": "Balathal is an ancient civilization located in the Dhariawad tehsil of Rajasthan's Udaipur district.",
"explanation_hi": "बालाथल उदयपुर जिले की धारियावाद तहसील में स्थित एक प्राचीन सभ्यता है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "Which of the following ancient civilizations is known for its fire altars?",
"question_hi": "निम्नलिखित प्राचीन सभ्यताओं में से कौन सी अग्नि वेदियों के लिए जानी जाती है?",
"A_en": "Kalibangan", "A_hi": "कालीबंगा",
"B_en": "Ganeshar", "B_hi": "गणेश्वर",
"C_en": "Ahar", "C_hi": "आहर",
"D_en": "Balathal", "D_hi": "बालाथल",
"answer": "A",
"explanation_en": "Kalibangan is known for its fire altars, which are a unique feature of this ancient civilization.",
"explanation_hi": "कालीबंगा अग्नि वेदियों के लिए जानी जाती है, जो इस प्राचीन सभ्यता की एक विशिष्ट विशेषता है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "What is the name of the ancient civilization located in the Udaipur district of Rajasthan, known for its microliths?",
"question_hi": "उदयपुर जिले में स्थित प्राचीन सभ्यता का नाम क्या है, जो अपने सूक्ष्म पाषाणों के लिए जानी जाती है?",
"A_en": "Ganeshar", "A_hi": "गणेश्वर",
"B_en": "Ahar", "B_hi": "आहर",
"C_en": "Kalibangan", "C_hi": "कालीबंगा",
"D_en": "Balathal", "D_hi": "बालाथल",
"answer": "A",
"explanation_en": "Ganeshar is an ancient civilization located in the Udaipur district of Rajasthan, known for its microliths.",
"explanation_hi": "गणेश्वर उदयपुर जिले में स्थित एक प्राचीन सभ्यता है, जो अपने सूक्ष्म पाषाणों के लिए जानी जाती है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "Which of the following ancient civilizations is located in the Banas River valley?",
"question_hi": "निम्नलिखित प्राचीन सभ्यताओं में से कौन सी बानास नदी की घाटी में स्थित है?",
"A_en": "Ahar", "A_hi": "आहर",
"B_en": "Ganeshar", "B_hi": "गणेश्वर",
"C_en": "Kalibangan", "C_hi": "कालीबंगा",
"D_en": "Balathal", "D_hi": "बालाथल",
"answer": "A",
"explanation_en": "Ahar is an ancient civilization located in the Banas River valley.",
"explanation_hi": "आहर बानास नदी की घाटी में स्थित एक प्राचीन सभ्यता है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "What is the name of the ancient civilization located in the Udaipur district of Rajasthan, known for its copper and bronze artifacts?",
"question_hi": "उदयपुर जिले में स्थित प्राचीन सभ्यता का नाम क्या है, जो अपने ताम्र और कांस्य कलाकृतियों के लिए जानी जाती है?",
"A_en": "Ganeshar", "A_hi": "गणेश्वर",
"B_en": "Ahar", "B_hi": "आहर",
"C_en": "Kalibangan", "C_hi": "कालीबंगा",
"D_en": "Balathal", "D_hi": "बालाथल",
"answer": "A",
"explanation_en": "Ganeshar is an ancient civilization located in the Udaipur district of Rajasthan, known for its copper and bronze artifacts.",
"explanation_hi": "गणेश्वर उदयपुर जिले में स्थित एक प्राचीन सभ्यता है, जो अपने ताम्र और कांस्य कलाकृतियों के लिए जानी जाती है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "Which of the following ancient civilizations is located in the Alwar district of Rajasthan, known for its ancient temple?",
"question_hi": "निम्नलिखित प्राचीन सभ्यताओं में से कौन सी राजस्थान के अलवर जिले में स्थित है, जो अपने प्राचीन मंदिर के लिए जानी जाती है?",
"A_en": "Bairath", "A_hi": "बैराथ",
"B_en": "Kalibangan", "B_hi": "कालीबंगा",
"C_en": "Ahar", "C_hi": "आहर",
"D_en": "Ganeshar", "D_hi": "गणेश्वर",
"answer": "A",
"explanation_en": "Bairath is an ancient civilization located in the Alwar district of Rajasthan, known for its ancient temple.",
"explanation_hi": "बैराथ राजस्थान के अलवर जिले में स्थित एक प्राचीन सभ्यता है, जो अपने प्राचीन मंदिर के लिए जानी जाती है।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"question_en": "What is the name of the ancient civilization located in the Udaipur district of Rajasthan, known for its ancient settlement?",
"question_hi": "उदयपur जिले में स्थित प्राचीन सभ्यता का नाम क्या है, जो अपने प्राचीन बस्ती के लिए जानी जाती है?",
"A_en": "Balathal", "A_hi": "बालाथल",
"B_en": "Ganeshar", "B_hi": "गणेश्वर",
"C_en": "Ahar", "C_hi": "आहर",
"D_en": "Kalibangan", "D_hi": "कालीबंगा",
"answer": "A",
"explanation_en": "Balathal is an ancient civilization located in the Udaipur district of Rajasthan, known for its ancient settlement.",
"explanation_hi": "बालाथल उदयपुर जिले में स्थित एक प्राचीन सभ्यता है, जो अपने प्राचीन बस्ती के लिए जानी जाती है।"
}
]