[
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which inscription is considered the earliest evidence of the 'Bhagwat' (Vaishnav) cult in Rajasthan?",
    "question_hi": "राजस्थान में 'भागवत' (वैष्णव) मत का सबसे प्राचीन प्रमाण किस शिलालेख को माना जाता है?",
    "A_en": "Bijolia Inscription",
    "A_hi": "बिजोलिया शिलालेख",
    "B_en": "Ghosundi Inscription",
    "B_hi": "घोसुण्डी शिलालेख",
    "C_en": "Samoli Inscription",
    "C_hi": "सामोली शिलालेख",
    "D_en": "Manmori Inscription",
    "D_hi": "मानमोरी शिलालेख",
    "answer": "B",
    "explanation_en": "The Ghosundi inscription (2nd century BC) found in Chittorgarh is the earliest evidence of the Vaishnav/Bhagwat cult in Rajasthan. It mentions the construction of a stone wall around the place of worship for Sankarshana and Vasudeva.",
    "explanation_hi": "चित्तौड़गढ़ में मिला घोसुण्डी शिलालेख (द्वितीय शताब्दी ईसा पूर्व) राजस्थान में वैष्णव/भागवत मत का सबसे प्राचीन प्रमाण है। इसमें संकर्षण और वासुदेव की पूजा के स्थान के चारों ओर पत्थर की दीवार के निर्माण का उल्लेख है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "At which ancient site of Rajasthan was a circular Buddhist temple (Chaitya) and a monastery discovered?",
    "question_hi": "राजस्थान के किस प्राचीन स्थल पर एक गोलाकार बौद्ध मंदिर (चैत्य) और एक मठ खोजा गया था?",
    "A_en": "Ahar (Udaipur)",
    "A_hi": "आहड़ (उदयपुर)",
    "B_en": "Bairat (Jaipur)",
    "B_hi": "बैराठ (जयपुर)",
    "C_en": "Ganeshwar (Sikar)",
    "C_hi": "गणेश्वर (सीकर)",
    "D_en": "Kalibangan (Hanumangarh)",
    "D_hi": "कालीबंगा (हनुमानगढ़)",
    "answer": "B",
    "explanation_en": "Bairat (ancient Viratnagar) is famous for its Mauryan-period Buddhist structures, including a circular temple (Chaitya) and remains of a monastery on Bijak-ki-Pahari.",
    "explanation_hi": "बैराठ (प्राचीन विराटनगर) अपने मौर्यकालीन बौद्ध संरचनाओं के लिए प्रसिद्ध है, जिसमें बीजक-की-पहाड़ी पर एक गोलाकार मंदिर (चैत्य) और एक मठ के अवशेष शामिल हैं।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The 'Lakulish' temple at Kailashpuri (Udaipur), built by Bappa Rawal, belongs to which sect of Shaivism?",
    "question_hi": "बप्पा रावल द्वारा निर्मित कैलाशपुरी (उदयपुर) का 'लकुलीश' मंदिर शैव धर्म के किस संप्रदाय से संबंधित है?",
    "A_en": "Kapalika Sect",
    "A_hi": "कापालिक संप्रदाय",
    "B_en": "Pashupata Sect",
    "B_hi": "पाशुपत संप्रदाय",
    "C_en": "Lingayat Sect",
    "C_hi": "लिंगायत संप्रदाय",
    "D_en": "Kashmir Shaivism",
    "D_hi": "कश्मीर शैव धर्म",
    "answer": "B",
    "explanation_en": "The Lakulish Temple at Kailashpuri is the main seat of the Pashupata sect in Rajasthan. It was built by Bappa Rawal in the 8th century for Eklingji, the family deity of the Mewar rulers.",
    "explanation_hi": "कैलाशपुरी का लकुलीश मंदिर राजस्थान में पाशुपत संप्रदाय की मुख्य पीठ है। इसे 8वीं शताब्दी में मेवाड़ शासकों के कुलदेवता एकलिंगजी के लिए बप्पा रावल द्वारा बनवाया गया था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which inscription provides information about the migration of 'Mag' Brahmins (Sun worshippers) from Iran to Rajasthan?",
    "question_hi": "कौन सा शिलालेख ईरान से राजस्थान में 'मग' ब्राह्मणों (सूर्य उपासकों) के प्रवास के बारे में जानकारी प्रदान करता है?",
    "A_en": "Ghatiyala Inscription (861 AD)",
    "A_hi": "घटियाला शिलालेख (861 ई.)",
    "B_en": "Bijolia Inscription (1170 AD)",
    "B_hi": "बिजोलिया शिलालेख (1170 ई.)",
    "C_en": "Kumbhalgarh Inscription",
    "C_hi": "कुंभलगढ़ शिलालेख",
    "D_en": "Samoli Inscription",
    "D_hi": "सामोली शिलालेख",
    "answer": "A",
    "explanation_en": "The Ghatiyala inscription of Pratihara King Kakkuka mentions 'Mag' Brahmins, who were traditionally Sun worshippers, and provides insights into the social hierarchy of that period.",
    "explanation_hi": "प्रतिहार राजा कक्कुक के घटियाला शिलालेख में 'मग' ब्राह्मणों का उल्लेख है, जो पारंपरिक रूप से सूर्य उपासक थे, और यह उस काल के सामाजिक पदानुक्रम के बारे में जानकारी देता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The ancient 'Madhyamika' (present-day Nagari) was a major center for which religion during the Mauryan and Sunga periods?",
    "question_hi": "प्राचीन 'मध्यमिका' (वर्तमान नगरी) मौर्य और शुंग काल के दौरान किस धर्म का प्रमुख केंद्र था?",
    "A_en": "Jainism",
    "A_hi": "जैन धर्म",
    "B_en": "Buddhism and Vaishnavism",
    "B_hi": "बौद्ध और वैष्णव धर्म",
    "C_en": "Islam",
    "C_hi": "इस्लाम",
    "D_en": "Sikhism",
    "D_hi": "सिख धर्म",
    "answer": "B",
    "explanation_en": "Madhyamika (Nagari, Chittorgarh) was an important center for both Buddhism (stupas found) and Vaishnavism (Ghosundi inscription found) in ancient Rajasthan.",
    "explanation_hi": "प्राचीन राजस्थान में मध्यमिका (नगरी, चित्तौड़गढ़) बौद्ध धर्म (स्तूप मिले) और वैष्णव धर्म (घोसुण्डी शिलालेख मिला) दोनों का एक महत्वपूर्ण केंद्र था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which ancient site in Rajasthan is famous for its terracotta art depicting scenes from the Mahabharata and the lifestyle of the Kushan/Gupta period?",
    "question_hi": "राजस्थान का कौन सा प्राचीन स्थल महाभारत के दृश्यों और कुषाण/गुप्त काल की जीवनशैली को दर्शाने वाली टेराकोटा कला के लिए प्रसिद्ध है?",
    "A_en": "Rangmahal (Hanumangarh)",
    "A_hi": "रंगमहल (हनुमानगढ़)",
    "B_en": "Ganeshwar (Sikar)",
    "B_hi": "गणेश्वर (सीकर)",
    "C_en": "Tilwara (Barmer)",
    "C_hi": "तिलवाड़ा (बाड़मेर)",
    "D_en": "Bagore (Bhilwara)",
    "D_hi": "बागोर (भीलवाड़ा)",
    "answer": "A",
    "explanation_en": "Rangmahal in Hanumangarh district is known for Gandhara style terracotta art. Excavations revealed figures of Lord Krishna and scenes from the Kushan and Gupta eras.",
    "explanation_hi": "हनुमानगढ़ जिले में स्थित रंगमहल गांधार शैली की टेराकोटा कला के लिए जाना जाता है। खुदाई में भगवान कृष्ण की आकृतियाँ और कुषाण व गुप्त काल के दृश्य मिले हैं।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The ancient city of Bhinmal (Jalore) was a famous center of learning and the birthplace of which famous Sanskrit scholar?",
    "question_hi": "भीनमाल (जालौर) का प्राचीन शहर शिक्षा का एक प्रसिद्ध केंद्र था और किस प्रसिद्ध संस्कृत विद्वान का जन्मस्थान था?",
    "A_en": "Kalidasa",
    "A_hi": "कालिदास",
    "B_en": "Mahakavi Magha",
    "B_hi": "महाकवि माघ",
    "C_en": "Banabhatta",
    "C_hi": "बाणभट्ट",
    "D_en": "Bhavabhuti",
    "D_hi": "भवभूति",
    "answer": "B",
    "explanation_en": "Bhinmal was a great center of Sanskrit learning. It was the birthplace of Mahakavi Magha (author of Shishupala Vadha) and the astronomer Brahmagupta.",
    "explanation_hi": "भीनमाल संस्कृत शिक्षा का एक बड़ा केंद्र था। यह महाकवि माघ (शिशुपाल वध के लेखक) और खगोलशास्त्री ब्रह्मगुप्त की जन्मस्थली थी।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "According to ancient inscriptions, which community was responsible for the management of Sun temples in Rajasthan during the Pratihara era?",
    "question_hi": "प्राचीन शिलालेखों के अनुसार, प्रतिहार काल के दौरान राजस्थान में सूर्य मंदिरों के प्रबंधन के लिए कौन सा समुदाय जिम्मेदार था?",
    "A_en": "Oswal Jain",
    "A_hi": "ओसवाल जैन",
    "B_en": "Mag Brahmins",
    "B_hi": "मग ब्राह्मण",
    "C_en": "Kayasthas",
    "C_hi": "कायस्थ",
    "D_en": "Charans",
    "D_hi": "चारण",
    "answer": "B",
    "explanation_en": "The Mag Brahmins (also known as Shakdvipi Brahmins) were traditionally associated with Sun worship and were appointed as priests and managers of Sun temples.",
    "explanation_hi": "मग ब्राह्मण (जिन्हें शाकद्वीपीय ब्राह्मण भी कहा जाता है) पारंपरिक रूप से सूर्य पूजा से जुड़े थे और उन्हें सूर्य मंदिरों के पुजारियों और प्रबंधकों के रूप में नियुक्त किया गया था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The 'Dadhimati Mata' temple at Goth-Manglod (Nagaur) represents the architectural and religious style of which period?",
    "question_hi": "गोठ-मांगलोद (नागौर) स्थित 'दधिमती माता' का मंदिर किस काल की स्थापत्य और धार्मिक शैली का प्रतिनिधित्व करता है?",
    "A_en": "Maha-Maru Style (Pratihara Period)",
    "A_hi": "महा-मारु शैली (प्रतिहार काल)",
    "B_en": "Mughal Style",
    "B_hi": "मुगल शैली",
    "C_en": "British Style",
    "C_hi": "ब्रिटिश शैली",
    "D_en": "Panchayatana Style (Early Gupta)",
    "D_hi": "पंचायतन शैली (प्रारंभिक गुप्त)",
    "answer": "A",
    "explanation_en": "The Dadhimati Mata Temple is one of the oldest surviving temples in Rajasthan, built in the Maha-Maru style of the Pratihara period (approx. 7th-9th century).",
    "explanation_hi": "दधिमती माता मंदिर राजस्थान के सबसे पुराने जीवित मंदिरों में से एक है, जो प्रतिहार काल (लगभग 7वीं-9वीं शताब्दी) की महा-मारु शैली में बना है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The ancient site of 'Osian' (Jodhpur) is famous for the confluence of which two religious architectures?",
    "question_hi": "प्राचीन स्थल 'ओसियां' (जोधपुर) किन दो धार्मिक वास्तुशिल्पों के संगम के लिए प्रसिद्ध है?",
    "A_en": "Buddhist and Jain",
    "A_hi": "बौद्ध और जैन",
    "B_en": "Hindu (Vaishnav/Shaiva) and Jain",
    "B_hi": "हिंदू (वैष्णव/शैव) और जैन",
    "C_en": "Hindu and Islamic",
    "C_hi": "हिंदू और इस्लामी",
    "D_en": "Jain and Sikh",
    "D_hi": "जैन और सिख",
    "answer": "B",
    "explanation_en": "Osian is known as the 'Khajuraho of Rajasthan' and is famous for its 8th-12th century Hindu temples (like Surya Temple, Harihara Temple) and beautifully carved Jain temples (Mahavira Temple).",
    "explanation_hi": "ओसियां को 'राजस्थान का खजुराहो' कहा जाता है और यह अपनी 8वीं-12वीं शताब्दी के हिंदू मंदिरों (जैसे सूर्य मंदिर, हरिहर मंदिर) और खूबसूरती से नक्काशीदार जैन मंदिरों (महावीर मंदिर) के लिए प्रसिद्ध है।"
  }
]