[
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "Which of the following ancient civilizations is known for its sophisticated urban planning in Rajasthan?",
"question_hi": "निम्नलिखित प्राचीन सभ्यताओं में से कौन राजस्थान में अपनी परिष्कृत शहरी योजना के लिए जानी जाती है?",
"A_en": "Indus Valley Civilization", "A_hi": "सिंधु घाटी सभ्यता",
"B_en": "Vedic Civilization", "B_hi": "वैदिक सभ्यता",
"C_en": "Mauryan Civilization", "C_hi": "मौर्य सभ्यता",
"D_en": "Gupta Civilization", "D_hi": "गुप्त सभ्यता",
"answer": "A",
"explanation_en": "The Indus Valley Civilization is known for its sophisticated urban planning, with well-planned cities like Mohenjo-Daro and Harappa.",
"explanation_hi": "सिंधु घाटी सभ्यता अपनी परिष्कृत शहरी योजना के लिए जानी जाती है, जिसमें मोहनजोदड़ो और हड़प्पा जैसे अच्छी तरह से योजनाबद्ध शहर शामिल हैं।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "What was the primary occupation of the people in ancient Rajasthan?",
"question_hi": "प्राचीन राजस्थान में लोगों का मुख्य व्यवसाय क्या था?",
"A_en": "Agriculture", "A_hi": "कृषि",
"B_en": "Trade and Commerce", "B_hi": "व्यापार और वाणिज्य",
"C_en": "Pastoralism", "C_hi": "चरवाही",
"D_en": "Hunting and Gathering", "D_hi": "शिकार और इकट्ठा करना",
"answer": "C",
"explanation_en": "In ancient Rajasthan, pastoralism was the primary occupation of the people, with many tribes engaged in cattle rearing and sheep herding.",
"explanation_hi": "प्राचीन राजस्थान में, चरवाही लोगों का मुख्य व्यवसाय था, जिसमें कई जनजातियां मवेशी पालन और भेड़ पालन में लगी हुई थीं।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "Which of the following ancient Rajasthan kingdoms was known for its strong Buddhist influence?",
"question_hi": "निम्नलिखित प्राचीन राजस्थान राज्यों में से कौन मजबूत बौद्ध प्रभाव के लिए जाना जाता था?",
"A_en": "Gurjara-Pratihara Kingdom", "A_hi": "गुर्जरा-प्रतिहार राज्य",
"B_en": "Chauhan Kingdom", "B_hi": "चौहान राज्य",
"C_en": "Paramara Kingdom", "C_hi": "पарамार राज्य",
"D_en": "Mewar Kingdom", "D_hi": "मेवाड़ राज्य",
"answer": "A",
"explanation_en": "The Gurjara-Pratihara Kingdom was known for its strong Buddhist influence, with many Buddhist monasteries and stupas found in the region.",
"explanation_hi": "गुर्जरा-प्रतिहार राज्य मजबूत बौद्ध प्रभाव के लिए जाना जाता था, जिसमें क्षेत्र में कई बौद्ध मठ और स्तूप पाए गए थे।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "What was the name of the ancient Rajasthan festival that celebrated the arrival of spring?",
"question_hi": "प्राचीन राजस्थान त्योहार का नाम क्या था जो वसंत के आगमन का जश्न मनाता था?",
"A_en": "Holi", "A_hi": "होली",
"B_en": "Diwali", "B_hi": "दीवाली",
"C_en": "Navratri", "C_hi": "नवरात्रि",
"D_en": "Basant Panchami", "D_hi": "बसंत पंचमी",
"answer": "D",
"explanation_en": "Basant Panchami was an ancient Rajasthan festival that celebrated the arrival of spring, marked by the worship of the goddess Saraswati.",
"explanation_hi": "बसंत पंचमी प्राचीन राजस्थान त्योहार था जो वसंत के आगमन का जश्न मनाता था, जिसमें सरस्वती देवी की पूजा की जाती थी।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "Which of the following ancient Rajasthan tribes was known for its expertise in metalwork?",
"question_hi": "निम्नलिखित प्राचीन राजस्थान जनजातियों में से कौन धातु कार्य में अपनी विशेषज्ञता के लिए जानी जाती थी?",
"A_en": "Bhil Tribe", "A_hi": "भील जनजाति",
"B_en": "Meena Tribe", "B_hi": "मीणा जनजाति",
"C_en": "Gurjar Tribe", "C_hi": "गुर्जर जनजाति",
"D_en": "Asur Tribe", "D_hi": "आसुर जनजाति",
"answer": "D",
"explanation_en": "The Asur tribe was known for its expertise in metalwork, with many of its members being skilled blacksmiths and craftsmen.",
"explanation_hi": "आसुर जनजाति धातु कार्य में अपनी विशेषज्ञता के लिए जानी जाती थी, जिसमें इसके कई सदस्य कुशल लोहार और कारीगर थे।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "What was the name of the ancient Rajasthan city that was an important center of trade and commerce?",
"question_hi": "प्राचीन राजस्थान शहर का नाम क्या था जो व्यापार और वाणिज्य का एक महत्वपूर्ण केंद्र था?",
"A_en": "Ujjain", "A_hi": "उज्जैन",
"B_en": "Pushkar", "B_hi": "पुष्कर",
"C_en": "Ajmer", "C_hi": "अजमेर",
"D_en": "Merta", "D_hi": "मेड़ता",
"answer": "D",
"explanation_en": "Merta was an important center of trade and commerce in ancient Rajasthan, with many merchants and traders visiting the city.",
"explanation_hi": "मेड़ता प्राचीन राजस्थान में व्यापार और वाणिज्य का एक महत्वपूर्ण केंद्र था, जिसमें कई व्यापारी और व्यापारी शहर का दौरा करते थे।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "Which of the following ancient Rajasthan dynasties was known for its patronage of the arts?",
"question_hi": "निम्नलिखित प्राचीन राजस्थान राजवंशों में से कौन कला के संरक्षण के लिए जाना जाता था?",
"A_en": "Gurjara-Pratihara Dynasty", "A_hi": "गुर्जरा-प्रतिहार राजवंश",
"B_en": "Chauhan Dynasty", "B_hi": "चौहान राजवंश",
"C_en": "Paramara Dynasty", "C_hi": "पарамार राजवंश",
"D_en": "Kachwaha Dynasty", "D_hi": "कच्छवाह राजवंश",
"answer": "C",
"explanation_en": "The Paramara Dynasty was known for its patronage of the arts, with many notable poets, writers, and artists flourishing during its reign.",
"explanation_hi": "पарамार राजवंश कला के संरक्षण के लिए जाना जाता था, जिसमें कई प्रसिद्ध कवि, लेखक और कलाकार उसके शासनकाल में पनपे थे।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "What was the name of the ancient Rajasthan temple that was dedicated to the worship of Lord Shiva?",
"question_hi": "प्राचीन राजस्थान मंदिर का नाम क्या था जो भगवान शिव की पूजा के लिए समर्पित था?",
"A_en": "Eklingji Temple", "A_hi": "एकलिंगजी मंदिर",
"B_en": "Nagda Temple", "B_hi": "नागदा मंदिर",
"C_en": "Kumbhalgarh Temple", "C_hi": "कुम्भलगढ़ मंदिर",
"D_en": "Ranakpur Temple", "D_hi": "राणकपुर मंदिर",
"answer": "A",
"explanation_en": "The Eklingji Temple was an ancient Rajasthan temple dedicated to the worship of Lord Shiva, with many intricate carvings and sculptures adorning its walls.",
"explanation_hi": "एकलिंगजी मंदिर प्राचीन राजस्थान मंदिर था जो भगवान शिव की पूजा के लिए समर्पित था, जिसमें कई जटिल नक्काशी और मूर्तियां इसकी दीवारों पर लगी हुई थीं।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "Which of the following ancient Rajasthan festivals was celebrated to mark the beginning of the harvest season?",
"question_hi": "निम्नलिखित प्राचीन राजस्थान त्योहारों में से कौन फसल के मौसम की शुरुआत का जश्न मनाने के लिए मनाया जाता था?",
"A_en": "Baisakhi", "A_hi": "बैसाखी",
"B_en": "Lohri", "B_hi": "लोहड़ी",
"C_en": "Makar Sankranti", "C_hi": "मकर संक्रांति",
"D_en": "Navratri", "D_hi": "नवरात्रि",
"answer": "C",
"explanation_en": "Makar Sankranti was an ancient Rajasthan festival that celebrated the beginning of the harvest season, marked by the worship of the sun god and the distribution of sweets and gifts.",
"explanation_hi": "मकर संक्रांति प्राचीन राजस्थान त्योहार था जो फसल के मौसम की शुरुआत का जश्न मनाता था, जिसमें सूर्य देव की पूजा और मिठाइयों और उपहारों का वितरण किया जाता था।"
},
{
"subject": "Rajasthan History",
"topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
"question_en": "What was the name of the ancient Rajasthan text that dealt with the principles of governance and statecraft?",
"question_hi": "प्राचीन राजस्थान ग्रंथ का नाम क्या था जो शासन और राज्य के सिद्धांतों से संबंधित था?",
"A_en": "Arthashastra", "A_hi": "अर्थशास्त्र",
"B_en": "Manusmriti", "B_hi": "मनुस्मृति",
"C_en": "Rajatarangini", "C_hi": "राजतरंगिणी",
"D_en": "Mahabharata", "D_hi": "महाभारत",
"answer": "A",
"explanation_en": "The Arthashastra was an ancient Rajasthan text that dealt with the principles of governance and statecraft, written by the great sage Kautilya.",
"explanation_hi": "अर्थशास्त्र प्राचीन राजस्थान ग्रंथ था जो शासन और राज्य के सिद्धांतों से संबंधित था, जो महान ऋषि कौटिल्य द्वारा लिखा गया था।"
}
]