[
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which inscription provides the earliest evidence of the Bhagavata (Vaishnava) cult in Rajasthan?",
    "question_hi": "राजस्थान में भागवत (वैष्णव) संप्रदाय के प्राचीनतम प्रमाण किस शिलालेख से मिलते हैं?",
    "A_en": "Bijolia Inscription", "A_hi": "बिजोलिया शिलालेख",
    "B_en": "Ghosundi Inscription", "B_hi": "घोसुण्डी शिलालेख",
    "C_en": "Bairat Inscription", "C_hi": "बैराठ शिलालेख",
    "D_en": "Kumbhalgarh Inscription", "D_hi": "कुंभलगढ़ शिलालेख",
    "answer": "B",
    "explanation_en": "The Ghosundi Inscription (2nd Century BC) found in Chittorgarh is the earliest evidence of the Bhagavata cult in Rajasthan.",
    "explanation_hi": "चित्तौड़गढ़ में पाया गया घोसुण्डी शिलालेख (द्वितीय शताब्दी ईसा पूर्व) राजस्थान में भागवत संप्रदाय का सबसे प्राचीन प्रमाण है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "In ancient Rajasthan, which city was the capital of the Matsya Janapada?",
    "question_hi": "प्राचीन राजस्थान में मत्स्य जनपद की राजधानी कौन सा शहर था?",
    "A_en": "Madhyamika", "A_hi": "मध्यमिका",
    "B_en": "Ahichhatrapur", "B_hi": "अहिछत्रपुर",
    "C_en": "Viratnagar", "C_hi": "विराटनगर",
    "D_en": "Mathura", "D_hi": "मथुरा",
    "answer": "C",
    "explanation_en": "Viratnagar (modern-day Bairat) was the capital of the Matsya Janapada, mentioned in the Mahabharata.",
    "explanation_hi": "विराटनगर (वर्तमान बैराठ) मत्स्य जनपद की राजधानी थी, जिसका उल्लेख महाभारत में मिलता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The Ashokan Rock Edict found at Bairat (Bhabru Edict) reflects Ashoka's faith in which religion?",
    "question_hi": "बैराठ में पाया गया अशोक का शिलालेख (भाब्रू शिलालेख) अशोक की किस धर्म में आस्था को दर्शाता है?",
    "A_en": "Jainism", "A_hi": "जैन धर्म",
    "B_en": "Shaivism", "B_hi": "शैव धर्म",
    "C_en": "Buddhism", "C_hi": "बौद्ध धर्म",
    "D_en": "Vaishnavism", "D_hi": "वैष्णव धर्म",
    "answer": "C",
    "explanation_en": "The Bhabru Edict, discovered by Captain Burt in 1837 at Bairat, clearly states Ashoka's devotion to the Buddha, Dhamma, and Sangha.",
    "explanation_hi": "1837 में कैप्टन बर्ट द्वारा बैराठ में खोजा गया भाब्रू शिलालेख स्पष्ट रूप से बुद्ध, धम्म और संघ के प्रति अशोक की भक्ति को दर्शाता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which Chinese traveler visited Bhinmal in the 7th century during the reign of the Gurjara-Pratiharas?",
    "question_hi": "7वीं शताब्दी में गुर्जर-प्रतिहारों के शासनकाल के दौरान किस चीनी यात्री ने भीनमाल की यात्रा की थी?",
    "A_en": "Fa-Hien", "A_hi": "फाह्यान",
    "B_en": "Xuanzang (Hiuen Tsang)", "B_hi": "ह्वेनसांग",
    "C_en": "I-tsing", "C_hi": "इत्सिंग",
    "D_en": "Megasthenes", "D_hi": "मेगास्थनीज",
    "answer": "B",
    "explanation_en": "Xuanzang (Hiuen Tsang) visited Bhinmal (Pi-lo-mo-lo) around 641 AD and described the prosperity of the region.",
    "explanation_hi": "ह्वेनसांग ने लगभग 641 ईस्वी में भीनमाल (पी-लो-मो-लो) की यात्रा की और क्षेत्र की समृद्धि का वर्णन किया।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The Lakulish Temple (Eklingji) in Mewar represents which branch of Shaivism?",
    "question_hi": "मेवाड़ में लकुलीश मंदिर (एकलिंगजी) शैव धर्म की किस शाखा का प्रतिनिधित्व करता है?",
    "A_en": "Pashupata Sect", "A_hi": "पाशुपत संप्रदाय",
    "B_en": "Kapalika Sect", "B_hi": "कापालिक संप्रदाय",
    "C_en": "Lingayat Sect", "C_hi": "लिंगायत संप्रदाय",
    "D_en": "Kashmir Shaivism", "D_hi": "कश्मीर शैव धर्म",
    "answer": "A",
    "explanation_en": "The Lakulish sect is a major sub-sect of the Pashupata Shaivism, and the Eklingji temple is its main center in Rajasthan.",
    "explanation_hi": "लकुलीश संप्रदाय पाशुपत शैव धर्म का एक प्रमुख उप-संप्रदाय है, और एकलिंगजी मंदिर राजस्थान में इसका मुख्य केंद्र है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which ancient site in Rajasthan is known as the 'Tata Nagar' of ancient India due to the large hoard of coins found there?",
    "question_hi": "सिक्कों के विशाल भंडार के कारण राजस्थान के किस प्राचीन स्थल को प्राचीन भारत का 'टाटा नगर' कहा जाता है?",
    "A_en": "Noh (Bharatpur)", "A_hi": "नोह (भरतपुर)",
    "B_en": "Rairh (Tonk)", "B_hi": "रेढ़ (टोंक)",
    "C_en": "Balathal (Udaipur)", "B_hi": "बालाथल (उदयपुर)",
    "D_en": "Bagor (Bhilwara)", "D_hi": "बागोर (भीलवाड़ा)",
    "answer": "B",
    "explanation_en": "Rairh in Tonk district is called the 'Tata Nagar' of ancient India because of the discovery of a massive collection of ancient punch-marked coins.",
    "explanation_hi": "टोंक जिले के रेढ़ को प्राचीन आहत (पंचमार्क) सिक्कों के विशाल संग्रह की खोज के कारण प्राचीन भारत का 'टाटा नगर' कहा जाता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which social custom was primarily associated with the Rajput women of Rajasthan to protect their honor from invaders?",
    "question_hi": "आक्रमणकारियों से अपने सम्मान की रक्षा के लिए राजस्थान की राजपूत महिलाओं के साथ मुख्य रूप से कौन सी सामाजिक प्रथा जुड़ी हुई थी?",
    "A_en": "Sati Pratha", "A_hi": "सती प्रथा",
    "B_en": "Jauhar", "B_hi": "जौहर",
    "C_en": "Purda System", "C_hi": "पर्दा प्रथा",
    "D_en": "Nata Pratha", "D_hi": "नाता प्रथा",
    "answer": "B",
    "explanation_en": "Jauhar was the ancient practice of self-immolation by women to avoid capture and enslavement by invaders during war.",
    "explanation_hi": "जौहर युद्ध के दौरान आक्रमणकारियों द्वारा पकड़े जाने और गुलाम बनाए जाने से बचने के लिए महिलाओं द्वारा आत्मदाह की प्राचीन प्रथा थी।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The 'Madhyamika' city, which was the capital of the Shibi Janapada, is currently known by which name?",
    "question_hi": "'मध्यमिका' नगरी, जो शिबि जनपद की राजधानी थी, वर्तमान में किस नाम से जानी जाती है?",
    "A_en": "Nagari (Chittorgarh)", "A_hi": "नगरी (चित्तौड़गढ़)",
    "B_en": "Nagaur", "B_hi": "नागौर",
    "C_en": "Nagar (Tonk)", "C_hi": "नगर (टोंक)",
    "D_en": "Nadol (Pali)", "D_hi": "नाडोल (पाली)",
    "answer": "A",
    "explanation_en": "The ancient city of Madhyamika is modern-day Nagari, located near Chittorgarh, which was the capital of the Shibi Janapada.",
    "explanation_hi": "मध्यमिका का प्राचीन शहर वर्तमान नगरी है, जो चित्तौड़गढ़ के पास स्थित है, यह शिबि जनपद की राजधानी थी।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which ancient site in Rajasthan provides evidence of animal husbandry dating back to the Mesolithic period?",
    "question_hi": "राजस्थान का कौन सा प्राचीन स्थल मध्यपाषाण काल के पशुपालन के प्रमाण प्रदान करता है?",
    "A_en": "Kali-banga", "A_hi": "कालीबंगा",
    "B_en": "Ahar", "B_hi": "आहड़",
    "C_en": "Bagor", "C_hi": "बागोर",
    "D_en": "Ganeshwar", "D_hi": "गणेश्वर",
    "answer": "C",
    "explanation_en": "Bagor, situated on the banks of the Kothari River in Bhilwara, is one of the largest Mesolithic sites in India providing evidence of early animal husbandry.",
    "explanation_hi": "भीलवाड़ा में कोठारी नदी के तट पर स्थित बागोर, भारत के सबसे बड़े मध्यपाषाण स्थलों में से एक है जो प्रारंभिक पशुपालन के प्रमाण प्रदान करता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The ancient 'Kaya' or 'Kapila' philosophy is associated with which sage who is believed to have resided near Kolayat in Bikaner?",
    "question_hi": "प्राचीन 'सांख्य' दर्शन किस ऋषि से जुड़ा है, जिनके बारे में माना जाता है कि वे बीकानेर के कोलायत के पास रहते थे?",
    "A_en": "Sage Valmiki", "A_hi": "ऋषि वाल्मीकि",
    "B_en": "Sage Kapila", "B_hi": "महर्षि कपिल",
    "C_en": "Sage Vashistha", "C_hi": "ऋषि वशिष्ठ",
    "D_en": "Sage Gautam", "D_hi": "ऋषि गौतम",
    "answer": "B",
    "explanation_en": "Maharishi Kapila, the proponent of Samkhya philosophy, is traditionally associated with Kolayat (Bikaner), where a major fair is held in his honor.",
    "explanation_hi": "सांख्य दर्शन के प्रणेता महर्षि कपिल पारंपरिक रूप से कोलायत (बीकानेर) से जुड़े हुए हैं, जहाँ उनके सम्मान में एक प्रमुख मेला आयोजित किया जाता है।"
  }
]