[
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The Ghosundi Inscription, which provides the earliest evidence of the Bhagavata (Vaishnava) cult in Rajasthan, is written in which script?",
    "question_hi": "घोसण्डी शिलालेख, जो राजस्थान में भागवत (वैष्णव) संप्रदाय का सबसे प्राचीन प्रमाण प्रदान करता है, किस लिपि में लिखा गया है?",
    "A_en": "Devanagari", "A_hi": "देवनागरी",
    "B_en": "Brahmi", "B_hi": "ब्राह्मी",
    "C_en": "Kharosthi", "D_hi": "खरोष्ठी",
    "D_en": "Sanskrit", "C_hi": "संस्कृत",
    "answer": "B",
    "explanation_en": "The Ghosundi Inscription (2nd Century BCE) is written in Sanskrit language and Brahmi script. It mentions the construction of a stone wall around the place of worship for Sankarshana and Vasudeva.",
    "explanation_hi": "घोसण्डी शिलालेख (द्वितीय शताब्दी ईसा पूर्व) संस्कृत भाषा और ब्राह्मी लिपि में लिखा गया है। इसमें संकर्षण और वासुदेव के पूजा स्थल के चारों ओर पत्थर की दीवार के निर्माण का उल्लेख है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which Chinese traveler visited Bhinmal (Jalore) during the 7th century and described the social and religious life of ancient Rajasthan?",
    "question_hi": "7वीं शताब्दी के दौरान किस चीनी यात्री ने भीनमाल (जालौर) की यात्रा की और प्राचीन राजस्थान के सामाजिक और धार्मिक जीवन का वर्णन किया?",
    "A_en": "Faxian (Fa-Hien)", "A_hi": "फाह्यान",
    "B_en": "I-tsing", "B_hi": "इत्सिंग",
    "C_en": "Xuanzang (Hiuen Tsang)", "C_hi": "ह्वेनसांग",
    "D_en": "Wang Hiuen-tse", "D_hi": "वांग ह्वेन-त्से",
    "answer": "C",
    "explanation_en": "Xuanzang visited Bhinmal (which he called Pi-lo-mo-lo) in 641 AD. He described it as a prosperous center of learning and mentioned the presence of both Buddhist and Hindu cultures.",
    "explanation_hi": "ह्वेनसांग ने 641 ईस्वी में भीनमाल (जिसे उन्होंने पी-लो-मो-लो कहा था) की यात्रा की थी। उन्होंने इसे शिक्षा के एक समृद्ध केंद्र के रूप में वर्णित किया और बौद्ध और हिंदू दोनों संस्कृतियों की उपस्थिति का उल्लेख किया।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The archaeological site of Bairat (Viratnagar) provides evidence of which religious culture?",
    "question_hi": "बैराठ (विराटनगर) का पुरातात्विक स्थल किस धार्मिक संस्कृति का प्रमाण प्रदान करता है?",
    "A_en": "Jainism", "A_hi": "जैन धर्म",
    "B_en": "Buddhism", "B_hi": "बौद्ध धर्म",
    "C_en": "Shaivism", "C_hi": "शैव धर्म",
    "D_en": "Shaktism", "D_hi": "शाक्त धर्म",
    "answer": "B",
    "explanation_en": "Bairat (Jaipur) is famous for Buddhist remains, including a circular stupa and the Bhabru Ashokan edict, which confirms Ashoka's faith in Buddhism.",
    "explanation_hi": "बैराठ (जयपुर) बौद्ध अवशेषों के लिए प्रसिद्ध है, जिसमें एक गोलाकार स्तूप और भाब्रू अशोक शिलालेख शामिल है, जो बौद्ध धर्म में अशोक की आस्था की पुष्टि करता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The 'Kansua Temple' in Kota, which contains an 8th-century inscription, is dedicated to which deity?",
    "question_hi": "कोटा का 'कंसुआ मंदिर', जिसमें 8वीं शताब्दी का शिलालेख है, किस देवता को समर्पित है?",
    "A_en": "Lord Vishnu", "A_hi": "भगवान विष्णु",
    "B_en": "Lord Shiva", "B_hi": "भगवान शिव",
    "C_en": "Sun God", "C_hi": "सूर्य देव",
    "D_en": "Lord Ganesha", "D_hi": "भगवान गणेश",
    "answer": "B",
    "explanation_en": "The Kansua Temple in Kota is dedicated to Lord Shiva. It contains an inscription dated 738 AD, mentioning the Maurya king Dhavala, indicating the influence of Shaivism in the region.",
    "explanation_hi": "कोटा में कंसुआ मंदिर भगवान शिव को समर्पित है। इसमें 738 ईस्वी का एक शिलालेख है, जिसमें मौर्य राजा धवल का उल्लेख है, जो इस क्षेत्र में शैव धर्म के प्रभाव को दर्शाता है।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which famous ancient mathematician and astronomer was born in Bhinmal, Rajasthan?",
    "question_hi": "राजस्थान के भीनमाल में किस प्रसिद्ध प्राचीन गणितज्ञ और खगोलशास्त्री का जन्म हुआ था?",
    "A_en": "Aryabhata", "A_hi": "आर्यभट्ट",
    "B_en": "Brahmagupta", "B_hi": "ब्रह्मगुप्त",
    "C_en": "Varahamihira", "C_hi": "वराहमिहिर",
    "D_en": "Bhaskara I", "D_hi": "भास्कर प्रथम",
    "answer": "B",
    "explanation_en": "Brahmagupta was born in Bhinmal in 598 AD. He wrote the 'Brahmasphutasiddhanta' and is known for his work on zero and the laws of gravity long before Newton.",
    "explanation_hi": "ब्रह्मगुप्त का जन्म 598 ईस्वी में भीनमाल में हुआ था। उन्होंने 'ब्रह्मस्फुटसिद्धांत' लिखा और न्यूटन से बहुत पहले शून्य और गुरुत्वाकर्षण के नियमों पर अपने काम के लिए जाने जाते हैं।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The 'Nananda Stambha' (Yupa) inscriptions provide information about which of the following in ancient Rajasthan?",
    "question_hi": "'नाणंद स्तंभ' (यूप) शिलालेख प्राचीन राजस्थान में निम्नलिखित में से किसके बारे में जानकारी प्रदान करते हैं?",
    "A_en": "Trade routes", "A_hi": "व्यापार मार्ग",
    "B_en": "Vedic Sacrificial Rites (Yagya)", "B_hi": "वैदिक यज्ञ अनुष्ठान",
    "C_en": "Buddhist Councils", "C_hi": "बौद्ध परिषदें",
    "D_en": "Military strategies", "D_hi": "सैन्य रणनीतियाँ",
    "answer": "B",
    "explanation_en": "The Nananda (Bhilwara) and Badva (Baran) Yupa inscriptions provide evidence of the performance of Vedic sacrifices like Triratra and Aptoryama by local rulers and clans.",
    "explanation_hi": "नाणंद (भीलवाड़ा) और बड़वा (बारां) यूप शिलालेख स्थानीय शासकों और कुलों द्वारा त्रिरात्र और आप्तौर्याम जैसे वैदिक यज्ञों के प्रदर्शन का प्रमाण प्रदान करते हैं।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "Which style of temple architecture flourished in Rajasthan during the 8th to 12th centuries, as seen in the temples of Osian?",
    "question_hi": "8वीं से 12वीं शताब्दी के दौरान राजस्थान में मंदिर वास्तुकला की कौन सी शैली विकसित हुई, जैसा कि ओसियां के मंदिरों में देखा जाता है?",
    "A_en": "Dravida Style", "A_hi": "द्रविड़ शैली",
    "B_en": "Vesara Style", "B_hi": "वेसर शैली",
    "C_en": "Maha-Maru (Gurjara-Pratihara) Style", "C_hi": "महा-मारू (गुर्जर-प्रतिहार) शैली",
    "D_en": "Indo-Saracenic Style", "D_hi": "इंडो-सारसेनिक शैली",
    "answer": "C",
    "explanation_en": "The Maha-Maru style, also known as the Gurjara-Pratihara style, is characterized by ornate carvings. Osian, Abhaneri, and Kiradu are primary examples.",
    "explanation_hi": "महा-मारू शैली, जिसे गुर्जर-प्रतिहार शैली के रूप में भी जाना जाता है, अलंकृत नक्काशी द्वारा पहचानी जाती है। ओसियां, आभानेरी और किराडू इसके प्राथमिक उदाहरण हैं।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "According to ancient literature, which region of Rajasthan was known as 'Jangal Desh'?",
    "question_hi": "प्राचीन साहित्य के अनुसार राजस्थान के किस क्षेत्र को 'जांगल देश' के नाम से जाना जाता था?",
    "A_en": "Udaipur-Chittorgarh", "A_hi": "उदयपुर-चित्तौड़गढ़",
    "B_en": "Bikaner-Jodhpur", "B_hi": "बीकानेर-जोधपुर",
    "C_en": "Kota-Bundi", "C_hi": "कोटा-बूंदी",
    "D_en": "Alwar-Bharatpur", "D_hi": "अलवर-भरतपुर",
    "answer": "B",
    "explanation_en": "The northern-western part of Rajasthan, specifically the Bikaner and Jodhpur region, was called 'Jangal Desh' in ancient times. The rulers of Bikaner were called 'Jangaladhar Badshah'.",
    "explanation_hi": "राजस्थान के उत्तर-पश्चिमी भाग, विशेष रूप से बीकानेर और जोधपुर क्षेत्र को प्राचीन काल में 'जांगल देश' कहा जाता था। बीकानेर के शासकों को 'जांगलधर बादशाह' कहा जाता था।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "The 'Kolvi Caves' located in Jhalawar district are related to which religious sect?",
    "question_hi": "झालावाड़ जिले में स्थित 'कोलवी की गुफाएं' किस धार्मिक संप्रदाय से संबंधित हैं?",
    "A_en": "Digambara Jainism", "A_hi": "दिगंबर जैन धर्म",
    "B_en": "Hinayana Buddhism", "B_hi": "हीनयान बौद्ध धर्म",
    "C_en": "Nath Sampradaya", "C_hi": "नाथ संप्रदाय",
    "D_en": "Pashupata Shaivism", "D_hi": "पाशुपत शैव धर्म",
    "answer": "B",
    "explanation_en": "The Kolvi Caves are ancient Buddhist caves located in Jhalawar. They represent the Buddhist culture and architecture (Viharas and Stupas) in the Hadoti region.",
    "explanation_hi": "कोलवी गुफाएं झालावाड़ में स्थित प्राचीन बौद्ध गुफाएं हैं। वे हाड़ौती क्षेत्र में बौद्ध संस्कृति और वास्तुकला (विहार और स्तूप) का प्रतिनिधित्व करती हैं।"
  },
  {
    "subject": "Rajasthan History",
    "topic": "Prachin Rajasthan ka Samaj, Dharm aur Sanskriti",
    "question_en": "In ancient Rajasthan, the term 'Agrahara' referred to:",
    "question_hi": "प्राचीन राजस्थान में, 'अग्रहार' शब्द का तात्पर्य था:",
    "A_en": "Land granted to Brahmins", "A_hi": "ब्राह्मणों को दी गई भूमि",
    "B_en": "A tax on irrigation", "B_hi": "सिंचाई पर एक कर",
    "C_en": "Military outpost", "C_hi": "सैन्य चौकी",
    "D_en": "A type of ancient jewelry", "D_hi": "एक प्रकार का प्राचीन आभूषण",
    "answer": "A",
    "explanation_en": "In ancient and medieval Rajasthan, 'Agrahara' was the land granted to Brahmins or religious institutions, which was usually tax-free and intended for educational or religious purposes.",
    "explanation_hi": "प्राचीन और मध्यकालीन राजस्थान में, 'अग्रहार' ब्राह्मणों या धार्मिक संस्थानों को दी गई भूमि थी, जो आमतौर पर कर-मुक्त होती थी और शैक्षिक या धार्मिक उद्देश्यों के लिए होती थी।"
  }
]