[
{
"subject": "Rajasthan History",
"topic": "Prajamandal Andolan: Vibhinn Riyasaton mein Rajnaitik Jagrukta",
"question_en": "Which of the following princely states was the first to establish a Prajamandal?",
"question_hi": "निम्नलिखित में से कौन सी रियासत पहले प्रजामंडल स्थापित करने वाली थी?",
"A_en": "Mewar", "A_hi": "मेवाड़",
"B_en": "Marwar", "B_hi": "मारवाड़",
"C_en": "Bikaner", "C_hi": "बीकानेर",
"D_en": "Alwar", "D_hi": "अलवर",
"answer": "A",
"explanation_en": "Mewar was the first princely state to establish a Prajamandal in 1938.",
"explanation_hi": "मेवाड़ 1938 में प्रजामंडल स्थापित करने वाली पहली रियासत थी।"
},
{
"subject": "Rajasthan History",
"topic": "Prajamandal Andolan: Vibhinn Riyasaton mein Rajnaitik Jagrukta",
"question_en": "What was the main objective of the Prajamandal movement in Rajasthan?",
"question_hi": "राजस्थान में प्रजामंडल आंदोलन का मुख्य उद्देश्य क्या था?",
"A_en": "To promote social reform", "A_hi": "सामाजिक सुधार को बढ़ावा देने के लिए",
"B_en": "To achieve independence from British rule", "B_hi": "ब्रिटिश शासन से स्वतंत्रता प्राप्त करने के लिए",
"C_en": "To establish democratic institutions", "C_hi": "लोकतांत्रिक संस्थाओं की स्थापना करने के लिए",
"D_en": "To improve economic conditions", "D_hi": "आर्थिक स्थिति में सुधार करने के लिए",
"answer": "C",
"explanation_en": "The main objective of the Prajamandal movement was to establish democratic institutions in the princely states of Rajasthan.",
"explanation_hi": "प्रजामंडल आंदोलन का मुख्य उद्देश्य राजस्थान की रियासतों में लोकतांत्रिक संस्थाओं की स्थापना करना था।"
},
{
"subject": "Rajasthan History",
"topic": "Prajamandal Andolan: Vibhinn Riyasaton mein Rajnaitik Jagrukta",
"question_en": "Who was the leader of the Prajamandal movement in Mewar?",
"question_hi": "मेवाड़ में प्रजामंडल आंदोलन का नेता कौन था?",
"A_en": "Manikya Lal Verma", "A_hi": "मानिक्य लाल वर्मा",
"B_en": "Kesri Singh", "B_hi": "केसरी सिंह",
"C_en": "Gokul Lal Asawa", "C_hi": "गोकुल लाल असावा",
"D_en": "Vishnu Dutt Bhardwaj", "D_hi": "विष्णु दत्त भारद्वाज",
"answer": "A",
"explanation_en": "Manikya Lal Verma was the leader of the Prajamandal movement in Mewar.",
"explanation_hi": "मेवाड़ में प्रजामंडल आंदोलन का नेता मानिक्य लाल वर्मा था।"
},
{
"subject": "Rajasthan History",
"topic": "Prajamandal Andolan: Vibhinn Riyasaton mein Rajnaitik Jagrukta",
"question_en": "Which of the following was a major demand of the Prajamandal movement?",
"question_hi": "निम्नलिखित में से कौन सी प्रजामंडल आंदोलन की एक प्रमुख मांग थी?",
"A_en": "Abolition of feudal system", "A_hi": "सामंतवाद का उन्मूलन",
"B_en": "Introduction of democratic reforms", "B_hi": "लोकतांत्रिक सुधारों की शुरुआत",
"C_en": "Establishment of a responsible government", "C_hi": "एक जवाबदेह सरकार की स्थापना",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The Prajamandal movement demanded the abolition of the feudal system, introduction of democratic reforms, and establishment of a responsible government.",
"explanation_hi": "प्रजामंडल आंदोलन ने सामंतवाद के उन्मूलन, लोकतांत्रिक सुधारों की शुरुआत और एक जवाबदेह सरकार की स्थापना की मांग की।"
},
{
"subject": "Rajasthan History",
"topic": "Prajamandal Andolan: Vibhinn Riyasaton mein Rajnaitik Jagrukta",
"question_en": "What was the impact of the Prajamandal movement on the politics of Rajasthan?",
"question_hi": "प्रजामंडल आंदोलन का राजस्थान की राजनीति पर क्या प्रभाव पड़ा?",
"A_en": "It led to the establishment of a democratic government", "A_hi": "इसने एक लोकतांत्रिक सरकार की स्थापना की",
"B_en": "It resulted in the abolition of the feudal system", "B_hi": "इसने सामंतवाद के उन्मूलन का परिणाम दिया",
"C_en": "It led to the integration of the princely states with India", "C_hi": "इसने रियासतों के भारत में विलयन को बढ़ावा दिया",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The Prajamandal movement had a significant impact on the politics of Rajasthan, leading to the establishment of a democratic government, abolition of the feudal system, and integration of the princely states with India.",
"explanation_hi": "प्रजामंडल आंदोलन का राजस्थान की राजनीति पर महत्वपूर्ण प्रभाव पड़ा, जिससे एक लोकतांत्रिक सरकार की स्थापना, सामंतवाद के उन्मूलन और रियासतों के भारत में विलयन हुआ।"
},
{
"subject": "Rajasthan History",
"topic": "Prajamandal Andolan: Vibhinn Riyasaton mein Rajnaitik Jagrukta",
"question_en": "Who was the key figure in the Prajamandal movement in Marwar?",
"question_hi": "मारवाड़ में प्रजामंडल आंदोलन में कौन सी प्रमुख व्यक्ति थी?",
"A_en": "Jivaram Joshi", "A_hi": "जीवाराम जोशी",
"B_en": "Kesri Singh", "B_hi": "केसरी सिंह",
"C_en": "Gokul Lal Asawa", "C_hi": "गोकुल लाल असावा",
"D_en": "Vishnu Dutt Bhardwaj", "D_hi": "विष्णु दत्त भारद्वाज",
"answer": "A",
"explanation_en": "Jivaram Joshi was a key figure in the Prajamandal movement in Marwar.",
"explanation_hi": "मारवाड़ में प्रजामंडल आंदोलन में जीवाराम जोशी एक प्रमुख व्यक्ति थे।"
},
{
"subject": "Rajasthan History",
"topic": "Prajamandal Andolan: Vibhinn Riyasaton mein Rajnaitik Jagrukta",
"question_en": "What was the role of the Prajamandal movement in the integration of the princely states with India?",
"question_hi": "प्रजामंडल आंदोलन की भूमिका रियासतों के भारत में विलयन में क्या थी?",
"A_en": "It played a significant role in the integration process", "A_hi": "इसने एकीकरण प्रक्रिया में महत्वपूर्ण भूमिका निभाई",
"B_en": "It had no role in the integration process", "B_hi": "इसने एकीकरण प्रक्रिया में कोई भूमिका नहीं निभाई",
"C_en": "It opposed the integration of the princely states with India", "C_hi": "इसने रियासतों के भारत में विलयन का विरोध किया",
"D_en": "It was neutral in the integration process", "D_hi": "इसने एकीकरण प्रक्रिया में तटस्थ भूमिका निभाई",
"answer": "A",
"explanation_en": "The Prajamandal movement played a significant role in the integration of the princely states with India by creating a sense of nationalism and demanding democratic reforms.",
"explanation_hi": "प्रजामंडल आंदोलन ने राष्ट्रवाद की भावना पैदा करके और लोकतांत्रिक सुधारों की मांग करके रियासतों के भारत में विलयन में महत्वपूर्ण भूमिका निभाई।"
},
{
"subject": "Rajasthan History",
"topic": "Prajamandal Andolan: Vibhinn Riyasaton mein Rajnaitik Jagrukta",
"question_en": "Which of the following was a consequence of the Prajamandal movement?",
"question_hi": "निम्नलिखित में से कौन सी प्रजामंडल आंदोलन का परिणाम थी?",
"A_en": "Establishment of a democratic government in Rajasthan", "A_hi": "राजस्थान में एक लोकतांत्रिक सरकार की स्थापना",
"B_en": "Abolition of the feudal system in Rajasthan", "B_hi": "राजस्थान में सामंतवाद का उन्मूलन",
"C_en": "Integration of the princely states with India", "C_hi": "रियासतों का भारत में विलयन",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The Prajamandal movement led to the establishment of a democratic government, abolition of the feudal system, and integration of the princely states with India.",
"explanation_hi": "प्रजामंडल आंदोलन के परिणामस्वरूप राजस्थान में एक लोकतांत्रिक सरकार की स्थापना, सामंतवाद का उन्मूलन और रियासतों का भारत में विलयन हुआ।"
},
{
"subject": "Rajasthan History",
"topic": "Prajamandal Andolan: Vibhinn Riyasaton mein Rajnaitik Jagrukta",
"question_en": "Who was the founder of the Prajamandal movement in Bikaner?",
"question_hi": "बीकानेर में प्रजामंडल आंदोलन का संस्थापक कौन था?",
"A_en": "Gokul Lal Asawa", "A_hi": "गोकुल लाल असावा",
"B_en": "Vishnu Dutt Bhardwaj", "B_hi": "विष्णु दत्त भारद्वाज",
"C_en": "Kesri Singh", "C_hi": "केसरी सिंह",
"D_en": "Jivaram Joshi", "D_hi": "जीवाराम जोशी",
"answer": "A",
"explanation_en": "Gokul Lal Asawa was the founder of the Prajamandal movement in Bikaner.",
"explanation_hi": "बीकानेर में प्रजामंडल आंदोलन का संस्थापक गोकुल लाल असावा था।"
}
]