[
{
"subject": "Rajasthan History",
"topic": "Rajasthan mein Kisan Andolan: Bijolia, Bengu aur Anya",
"question_en": "What was the main reason behind the Bijolia Kisan Andolan?",
"question_hi": "बिजोलिया किसान आंदोलन के पीछे मुख्य कारण क्या था?",
"A_en": "High taxes imposed by the British", "A_hi": "ब्रिटिश द्वारा लगाए गए उच्च कर",
"B_en": "Lack of irrigation facilities", "B_hi": "सिंचाई सुविधाओं की कमी",
"C_en": "Exploitation by the local rulers", "C_hi": "स्थानीय शासकों द्वारा शोषण",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The Bijolia Kisan Andolan was a result of the combination of high taxes, lack of irrigation facilities, and exploitation by the local rulers.",
"explanation_hi": "बिजोलिया किसान आंदोलन उच्च कर, सिंचाई सुविधाओं की कमी और स्थानीय शासकों द्वारा शोषण के संयोजन का परिणाम था।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan mein Kisan Andolan: Bijolia, Bengu aur Anya",
"question_en": "Which of the following was a key leader of the Bijolia Kisan Andolan?",
"question_hi": "निम्नलिखित में से कौन बिजोलिया किसान आंदोलन का एक प्रमुख नेता था?",
"A_en": "Sethji", "A_hi": "सेठजी",
"B_en": "Kanhaiyalal", "B_hi": "कान्हैयालाल",
"C_en": "Veer Narayan Singh", "C_hi": "वीर नारायण सिंह",
"D_en": "Sadhu Seth", "D_hi": "साधु सेठ",
"answer": "B",
"explanation_en": "Kanhaiyalal was a key leader of the Bijolia Kisan Andolan.",
"explanation_hi": "कान्हैयालाल बिजोलिया किसान आंदोलन का एक प्रमुख नेता था।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan mein Kisan Andolan: Bijolia, Bengu aur Anya",
"question_en": "What was the outcome of the Bijolia Kisan Andolan?",
"question_hi": "बिजोलिया किसान आंदोलन का परिणाम क्या था?",
"A_en": "The British government reduced taxes", "A_hi": "ब्रिटिश सरकार ने कर कम किए",
"B_en": "The local rulers agreed to provide irrigation facilities", "B_hi": "स्थानीय शासकों ने सिंचाई सुविधाएं प्रदान करने पर सहमति व्यक्त की",
"C_en": "The movement was suppressed by the British", "C_hi": "ब्रिटिश द्वारा आंदोलन का दमन किया गया",
"D_en": "The movement led to the establishment of a new peasant organization", "D_hi": "आंदोलन ने एक नई किसान संगठन की स्थापना की",
"answer": "C",
"explanation_en": "The Bijolia Kisan Andolan was ultimately suppressed by the British.",
"explanation_hi": "बिजोलिया किसान आंदोलन को अंततः ब्रिटिश द्वारा दबा दिया गया था।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan mein Kisan Andolan: Bijolia, Bengu aur Anya",
"question_en": "In which year did the Bijolia Kisan Andolan take place?",
"question_hi": "बिजोलिया किसान आंदोलन किस वर्ष में हुआ था?",
"A_en": "1915", "A_hi": "1915",
"B_en": "1916", "B_hi": "1916",
"C_en": "1917", "C_hi": "1917",
"D_en": "1923", "D_hi": "1923",
"answer": "D",
"explanation_en": "The Bijolia Kisan Andolan took place in 1923.",
"explanation_hi": "बिजोलिया किसान आंदोलन 1923 में हुआ था।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan mein Kisan Andolan: Bijolia, Bengu aur Anya",
"question_en": "What was the main demand of the Bengu Kisan Andolan?",
"question_hi": "बेंगू किसान आंदोलन की मुख्य मांग क्या थी?",
"A_en": "Reduction in land revenue", "A_hi": "भूमि राजस्व में कमी",
"B_en": "Increase in irrigation facilities", "B_hi": "सिंचाई सुविधाओं में वृद्धि",
"C_en": "Abolition of begar system", "C_hi": "बेगार प्रणाली का उन्मूलन",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The Bengu Kisan Andolan demanded reduction in land revenue, increase in irrigation facilities, and abolition of begar system.",
"explanation_hi": "बेंगू किसान आंदोलन ने भूमि राजस्व में कमी, सिंचाई सुविधाओं में वृद्धि और बेगार प्रणाली के उन्मूलन की मांग की थी।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan mein Kisan Andolan: Bijolia, Bengu aur Anya",
"question_en": "Who was the leader of the Bengu Kisan Andolan?",
"question_hi": "बेंगू किसान आंदोलन का नेता कौन था?",
"A_en": "Kanhaiyalal", "A_hi": "कान्हैयालाल",
"B_en": "Veer Narayan Singh", "B_hi": "वीर नारायण सिंह",
"C_en": "Bhagwan Singh", "C_hi": "भागवान सिंह",
"D_en": "Sadhu Seth", "D_hi": "साधु सेठ",
"answer": "C",
"explanation_en": "Bhagwan Singh was the leader of the Bengu Kisan Andolan.",
"explanation_hi": "भागवान सिंह बेंगू किसान आंदोलन के नेता थे।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan mein Kisan Andolan: Bijolia, Bengu aur Anya",
"question_en": "What was the impact of the Bijolia and Bengu Kisan Andolans on the peasants of Rajasthan?",
"question_hi": "बिजोलिया और बेंगू किसान आंदोलनों का राजस्थान के किसानों पर क्या प्रभाव पड़ा?",
"A_en": "They led to the improvement of the peasants' economic condition", "A_hi": "उन्होंने किसानों की आर्थिक स्थिति में सुधार किया",
"B_en": "They led to the suppression of the peasants' rights", "B_hi": "उन्होंने किसानों के अधिकारों का दमन किया",
"C_en": "They led to the increase in the peasants' awareness about their rights", "C_hi": "उन्होंने किसानों को उनके अधिकारों के बारे में जागरूक किया",
"D_en": "They had no impact on the peasants of Rajasthan", "D_hi": "उनका राजस्थान के किसानों पर कोई प्रभाव नहीं पड़ा",
"answer": "C",
"explanation_en": "The Bijolia and Bengu Kisan Andolans led to the increase in the peasants' awareness about their rights.",
"explanation_hi": "बिजोलिया और बेंगू किसान आंदोलनों ने किसानों को उनके अधिकारों के बारे में जागरूक किया।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan mein Kisan Andolan: Bijolia, Bengu aur Anya",
"question_en": "What was the role of the British government in the Bijolia and Bengu Kisan Andolans?",
"question_hi": "बिजोलिया और बेंगू किसान आंदोलनों में ब्रिटिश सरकार की भूमिका क्या थी?",
"A_en": "They supported the peasants' demands", "A_hi": "उन्होंने किसानों की मांगों का समर्थन किया",
"B_en": "They suppressed the peasants' movements", "B_hi": "उन्होंने किसानों के आंदोलनों का दमन किया",
"C_en": "They remained neutral", "C_hi": "वे तटस्थ रहे",
"D_en": "They provided financial assistance to the peasants", "D_hi": "उन्होंने किसानों को वित्तीय सहायता प्रदान की",
"answer": "B",
"explanation_en": "The British government suppressed the peasants' movements in the Bijolia and Bengu Kisan Andolans.",
"explanation_hi": "ब्रिटिश सरकार ने बिजोलिया और बेंगू किसान आंदोलनों में किसानों के आंदोलनों का दमन किया।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan mein Kisan Andolan: Bijolia, Bengu aur Anya",
"question_en": "What was the impact of the Bijolia and Bengu Kisan Andolans on the freedom struggle in India?",
"question_hi": "बिजोलिया और बेंगू किसान आंदोलनों का भारत में स्वतंत्रता संग्राम पर क्या प्रभाव पड़ा?",
"A_en": "They had no impact on the freedom struggle", "A_hi": "उनका स्वतंत्रता संग्राम पर कोई प्रभाव नहीं पड़ा",
"B_en": "They weakened the freedom struggle", "B_hi": "उन्होंने स्वतंत्रता संग्राम को कमजोर किया",
"C_en": "They strengthened the freedom struggle", "C_hi": "उन्होंने स्वतंत्रता संग्राम को मजबूत किया",
"D_en": "They had a neutral impact on the freedom struggle", "D_hi": "उनका स्वतंत्रता संग्राम पर तटस्थ प्रभाव पड़ा",
"answer": "C",
"explanation_en": "The Bijolia and Bengu Kisan Andolans strengthened the freedom struggle in India.",
"explanation_hi": "बिजोलिया और बेंगू किसान आंदोलनों ने भारत में स्वतंत्रता संग्राम को मजबूत किया।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan mein Kisan Andolan: Bijolia, Bengu aur Anya",
"question_en": "What was the significance of the Bijolia and Bengu Kisan Andolans in the history of Rajasthan?",
"question_hi": "राजस्थान के इतिहास में बिजोलिया और बेंगू किसान आंदोलनों का क्या महत्व था?",
"A_en": "They marked the beginning of the peasant movement in Rajasthan", "A_hi": "उन्होंने राजस्थान में किसान आंदोलन की शुरुआत की",
"B_en": "They led to the establishment of a new peasant organization", "B_hi": "उन्होंने एक नई किसान संगठन की स्थापना की",
"C_en": "They strengthened the freedom struggle in India", "C_hi": "उन्होंने भारत में स्वतंत्रता संग्राम को मजबूत किया",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The Bijolia and Bengu Kisan Andolans marked the beginning of the peasant movement in Rajasthan, led to the establishment of a new peasant organization, and strengthened the freedom struggle in India.",
"explanation_hi": "बिजोलिया और बेंगू किसान आंदोलनों ने राजस्थान में किसान आंदोलन की शुरुआत की, एक नई किसान संगठन की स्थापना की और भारत में स्वतंत्रता संग्राम को मजबूत किया।"
}
]