[
{
"subject": "Rajasthan History",
"topic": "Rajasthan ka Ekikaran: Saaton Charan (Stages of Integration)",
"question_en": "What was the primary reason for the integration of Rajasthan?",
"question_hi": "राजस्थान के एकीकरण का मुख्य कारण क्या था?",
"A_en": "Economic factors", "A_hi": "आर्थिक कारक",
"B_en": "Geographical factors", "B_hi": "भौगोलिक कारक",
"C_en": "Political factors", "C_hi": "राजनीतिक कारक",
"D_en": "Social factors", "D_hi": "सामाजिक कारक",
"answer": "C",
"explanation_en": "The integration of Rajasthan was primarily driven by political factors, including the efforts of Sardar Patel and the Indian government to unify the princely states.",
"explanation_hi": "राजस्थान का एकीकरण मुख्य रूप से राजनीतिक कारकों द्वारा संचालित किया गया था, जिसमें सरदार पटेल और भारत सरकार द्वारा रियासतों को एकजुट करने के प्रयास शामिल थे।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan ka Ekikaran: Saaton Charan (Stages of Integration)",
"question_en": "Which of the following was the first step in the integration of Rajasthan?",
"question_hi": "राजस्थान के एकीकरण का पहला चरण क्या था?",
"A_en": "Formation of the United States of Rajasthan", "A_hi": "राजस्थान के संयुक्त राज्यों का गठन",
"B_en": "Merger of the princely states", "B_hi": "रियासतों का विलय",
"C_en": "Signing of the Instrument of Accession", "C_hi": "सccession केструмент पर हस्ताक्षर",
"D_en": "Creation of the Rajasthan Union", "D_hi": "राजस्थान यूनियन का निर्माण",
"answer": "C",
"explanation_en": "The first step in the integration of Rajasthan was the signing of the Instrument of Accession by the princely states, which marked their agreement to join the Indian Union.",
"explanation_hi": "राजस्थान के एकीकरण का पहला चरण रियासतों द्वारा सccession केструмент पर हस्ताक्षर करना था, जिसने भारतीय संघ में शामिल होने की उनकी सहमति को दर्शाया।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan ka Ekikaran: Saaton Charan (Stages of Integration)",
"question_en": "What was the name of the first state formed after the integration of Rajasthan?",
"question_hi": "राजस्थान के एकीकरण के बाद गठित पहले राज्य का नाम क्या था?",
"A_en": "United States of Rajasthan", "A_hi": "राजस्थान के संयुक्त राज्य",
"B_en": "Rajasthan Union", "B_hi": "राजस्थान यूनियन",
"C_en": "Matsya Union", "C_hi": "मatsya संघ",
"D_en": "Ajmer State", "D_hi": "अजमेर राज्य",
"answer": "C",
"explanation_en": "The first state formed after the integration of Rajasthan was the Matsya Union, which was created on March 18, 1948.",
"explanation_hi": "राजस्थान के एकीकरण के बाद गठित पहला राज्य मatsya संघ था, जिसका गठन 18 मार्च, 1948 को किया गया था।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan ka Ekikaran: Saaton Charan (Stages of Integration)",
"question_en": "Who played a key role in the integration of Rajasthan?",
"question_hi": "राजस्थान के एकीकरण में कौन महत्वपूर्ण भूमिका निभाई?",
"A_en": "Sardar Patel", "A_hi": "सरदार पटेल",
"B_en": "Jawaharlal Nehru", "B_hi": "जवाहरलाल नेहरू",
"C_en": "Mahatma Gandhi", "C_hi": "महात्मा गांधी",
"D_en": "Indira Gandhi", "D_hi": "इंदिरा गांधी",
"answer": "A",
"explanation_en": "Sardar Patel played a key role in the integration of Rajasthan, as he was the Home Minister of India at the time and was instrumental in convincing the princely states to join the Indian Union.",
"explanation_hi": "सरदार पटेल ने राजस्थान के एकीकरण में महत्वपूर्ण भूमिका निभाई, क्योंकि वे उस समय भारत के गृह मंत्री थे और रियासतों को भारतीय संघ में शामिल होने के लिए मनाने में महत्वपूर्ण थे।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan ka Ekikaran: Saaton Charan (Stages of Integration)",
"question_en": "What was the main challenge faced during the integration of Rajasthan?",
"question_hi": "राजस्थान के एकीकरण के दौरान मुख्य चुनौती क्या थी?",
"A_en": "Geographical factors", "A_hi": "भौगोलिक कारक",
"B_en": "Economic factors", "B_hi": "आर्थिक कारक",
"C_en": "Political factors", "C_hi": "राजनीतिक कारक",
"D_en": "Social and cultural differences", "D_hi": "सामाजिक और सांस्कृतिक मतभेद",
"answer": "D",
"explanation_en": "The main challenge faced during the integration of Rajasthan was the social and cultural differences between the various princely states, which made it difficult to unify them under a single administration.",
"explanation_hi": "राजस्थान के एकीकरण के दौरान मुख्य चुनौती विभिन्न रियासतों के बीच सामाजिक और सांस्कृतिक मतभेद थे, जो उन्हें एक ही प्रशासन के तहत एकजुट करना मुश्किल बना दिया।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan ka Ekikaran: Saaton Charan (Stages of Integration)",
"question_en": "Which of the following was the last step in the integration of Rajasthan?",
"question_hi": "राजस्थान के एकीकरण का अंतिम चरण क्या था?",
"A_en": "Formation of the United States of Rajasthan", "A_hi": "राजस्थान के संयुक्त राज्यों का गठन",
"B_en": "Merger of the princely states", "B_hi": "रियासतों का विलय",
"C_en": "Signing of the Instrument of Accession", "C_hi": "सccession केструмент पर हस्ताक्षर",
"D_en": "Creation of the Rajasthan state as we know it today", "D_hi": "आज के राजस्थान राज्य का निर्माण",
"answer": "D",
"explanation_en": "The last step in the integration of Rajasthan was the creation of the Rajasthan state as we know it today, which was formed on November 1, 1956.",
"explanation_hi": "राजस्थान के एकीकरण का अंतिम चरण आज के राजस्थान राज्य का निर्माण था, जो 1 नवंबर, 1956 को बनाया गया था।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan ka Ekikaran: Saaton Charan (Stages of Integration)",
"question_en": "What was the result of the integration of Rajasthan?",
"question_hi": "राजस्थान के एकीकरण का परिणाम क्या था?",
"A_en": "Formation of a single, unified state", "A_hi": "एकल, एकीकृत राज्य का गठन",
"B_en": "Creation of multiple smaller states", "B_hi": "कई छोटे राज्यों का निर्माण",
"C_en": "Division of the region into different territories", "C_hi": "क्षेत्र को विभिन्न क्षेत्रों में विभाजित करना",
"D_en": "No significant changes", "D_hi": "कोई महत्वपूर्ण परिवर्तन नहीं",
"answer": "A",
"explanation_en": "The integration of Rajasthan resulted in the formation of a single, unified state, which has since become a major state in India.",
"explanation_hi": "राजस्थान के एकीकरण से एकल, एकीकृत राज्य का गठन हुआ, जो अब भारत का एक प्रमुख राज्य बन गया है।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan ka Ekikaran: Saaton Charan (Stages of Integration)",
"question_en": "Who was the first Chief Minister of Rajasthan after its integration?",
"question_hi": "राजस्थान के एकीकरण के बाद उसका पहला मुख्यमंत्री कौन था?",
"A_en": "Heera Lal Shastri", "A_hi": "हीरालाल शास्त्री",
"B_en": "Tika Ram Paliwal", "B_hi": "टीकाराम पालीवाल",
"C_en": "Mohan Lal Sukhadia", "C_hi": "मोहन लाल सुखाड़िया",
"D_en": "Jivraj Narayan Mehta", "D_hi": "जीवराज नारायण मेहता",
"answer": "A",
"explanation_en": "Heera Lal Shastri was the first Chief Minister of Rajasthan after its integration, serving from 1949 to 1951.",
"explanation_hi": "हीरालाल शास्त्री राजस्थान के एकीकरण के बाद उसका पहला मुख्यमंत्री था, जिन्होंने 1949 से 1951 तक सेवा की।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan ka Ekikaran: Saaton Charan (Stages of Integration)",
"question_en": "What was the significance of the integration of Rajasthan?",
"question_hi": "राजस्थान के एकीकरण का महत्व क्या था?",
"A_en": "It led to the formation of a single, unified state", "A_hi": "इसने एकल, एकीकृत राज्य के गठन को जन्म दिया",
"B_en": "It resulted in the creation of multiple smaller states", "B_hi": "इसने कई छोटे राज्यों का निर्माण किया",
"C_en": "It had no significant impact on the region", "C_hi": "इसने क्षेत्र पर कोई महत्वपूर्ण प्रभाव नहीं डाला",
"D_en": "It led to the division of the region into different territories", "D_hi": "इसने क्षेत्र को विभिन्न क्षेत्रों में विभाजित किया",
"answer": "A",
"explanation_en": "The integration of Rajasthan was significant as it led to the formation of a single, unified state, which has since become a major state in India.",
"explanation_hi": "राजस्थान का एकीकरण महत्वपूर्ण था क्योंकि इससे एकल, एकीकृत राज्य का गठन हुआ, जो अब भारत का एक प्रमुख राज्य बन गया है।"
},
{
"subject": "Rajasthan History",
"topic": "Rajasthan ka Ekikaran: Saaton Charan (Stages of Integration)",
"question_en": "How many stages were involved in the integration of Rajasthan?",
"question_hi": "राजस्थान के एकीकरण में कितने चरण शामिल थे?",
"A_en": "3 stages", "A_hi": "3 चरण",
"B_en": "4 stages", "B_hi": "4 चरण",
"C_en": "5 stages", "C_hi": "5 चरण",
"D_en": "7 stages", "D_hi": "7 चरण",
"answer": "D",
"explanation_en": "The integration of Rajasthan involved 7 stages, which were completed over a period of several years.",
"explanation_hi": "राजस्थान के एकीकरण में 7 चरण शामिल थे, जो कई वर्षों की अवधि में पूरे किए गए थे।"
}
]