[
{
"subject": "General Science",
"topic": "Biology",
"question_en": "What is the process by which plants make their own food?",
"question_hi": "पौधे अपना खुद का भोजन कैसे बनाते हैं?",
"A_en": "Respiration", "A_hi": "श्वसन",
"B_en": "Photosynthesis", "B_hi": "फोटोसिंथेसिस",
"C_en": "Decomposition", "C_hi": "विघटन",
"D_en": "Fermentation", "D_hi": "फर्मेंटेशन",
"answer": "B",
"explanation_en": "Photosynthesis is the process by which plants make their own food using sunlight, water, and carbon dioxide.",
"explanation_hi": "फोटोसिंथेसिस पौधों द्वारा सूर्य की किरणों, पानी और कार्बन डाइऑक्साइड का उपयोग करके अपना भोजन बनाने की प्रक्रिया है।"
},
{
"subject": "General Science",
"topic": "Physics",
"question_en": "What is the largest planet in our solar system?",
"question_hi": "हमारे सौर मंडल में सबसे बड़ा ग्रह कौन सा है?",
"A_en": "Earth", "A_hi": "पृथ्वी",
"B_en": "Saturn", "B_hi": "शनि",
"C_en": "Jupiter", "C_hi": "बृहस्पति",
"D_en": "Uranus", "D_hi": "उरानस",
"answer": "C",
"explanation_en": "Jupiter is the largest planet in our solar system, with a diameter of approximately 142,984 kilometers.",
"explanation_hi": "बृहस्पति हमारे सौर मंडल का सबसे बड़ा ग्रह है, जिसका व्यास लगभग 142,984 किलोमीटर है।"
},
{
"subject": "General Science",
"topic": "Chemistry",
"question_en": "What is the chemical symbol for gold?",
"question_hi": "सोने का रासायनिक प्रतीक क्या है?",
"A_en": "Ag", "A_hi": "एग",
"B_en": "Au", "B_hi": "औ",
"C_en": "Hg", "C_hi": "एचजी",
"D_en": "Pb", "D_hi": "पीबी",
"answer": "B",
"explanation_en": "Au is the chemical symbol for gold, which comes from the Latin word 'Aurum'.",
"explanation_hi": "औ सोने का रासायनिक प्रतीक है, जो लैटिन शब्द 'Aurum' से आता है।"
},
{
"subject": "General Science",
"topic": "Biology",
"question_en": "What is the process by which water moves through a plant, from the roots to the leaves?",
"question_hi": "जड़ों से पत्तियों तक पानी का कैसे संचरण होता है?",
"A_en": "Transpiration", "A_hi": "त्राण्सपिरेशन",
"B_en": "Respiration", "B_hi": "श्वसन",
"C_en": "Photosynthesis", "C_hi": "फोटोसिंथेसिस",
"D_en": "Osmosis", "D_hi": "ओस्मोसिस",
"answer": "A",
"explanation_en": "Transpiration is the process by which water moves through a plant, from the roots to the leaves, and is then released into the air as water vapor.",
"explanation_hi": "त्राण्सपिरेशन जड़ों से पत्तियों तक पानी का संचरण है, और फिर हवा में पानी के वाष्प के रूप में जारी किया जाता है।"
},
{
"subject": "General Science",
"topic": "Physics",
"question_en": "What is the term for the amount of matter in an object?",
"question_hi": "किसी विशिष्ट वस्तु के भीतर मौजूद पदार्थ की मात्रा को क्या कहते हैं?",
"A_en": "Mass", "A_hi": "भार",
"B_en": "Density", "B_hi": "घनत्व",
"C_en": "Volume", "C_hi": "आयतन",
"D_en": "Weight", "D_hi": "वज़न",
"answer": "A",
"explanation_en": "Mass is the amount of matter in an object, which is typically measured in units of kilograms or grams.",
"explanation_hi": "भार किसी वस्तु में मौजूद पदार्थ की मात्रा है, जो आमतौर पर किलोग्राम या ग्राम में मापा जाता है।"
},
{
"subject": "General Science",
"topic": "Chemistry",
"question_en": "What is the scientific term for the study of the structure, properties, and reactions of matter?",
"question_hi": "मैटर के संरचना, गुण और प्रतिक्रियाओं के अध्ययन के लिए वैज्ञानिक शब्द क्या है?",
"A_en": "Physics", "A_hi": "भौतिकी",
"B_en": "Chemistry", "B_hi": "रासायनिकी",
"C_en": "Biology", "C_hi": "जीव विज्ञान",
"D_en": "Geology", "D_hi": "भूविज्ञान",
"answer": "B",
"explanation_en": "Chemistry is the scientific study of the structure, properties, and reactions of matter, which includes the study of atoms, molecules, and compounds.",
"explanation_hi": "रासायनिकी मैटर के संरचना, गुण और प्रतिक्रियाओं का वैज्ञानिक अध्ययन है, जिसमें अणु, मolecule और संयुग्मित पदार्थों के अध्ययन शामिल हैं।"
},
{
"subject": "General Science",
"topic": "Biology",
"question_en": "What is the process by which an organism's genetic information is passed from one generation to the next?",
"question_hi": "जीव की आनुवंशिक जानकारी का एक पीढ़ी से दूसरी पीढ़ी तक कैसे पारित होती है?",
"A_en": "Mitosis", "A_hi": "मायटोसिस",
"B_en": "Meiosis", "B_hi": "मायोसिस",
"C_en": "Photosynthesis", "C_hi": "फोटोसिंथेसिस",
"D_en": "Genetic Drift", "D_hi": " आनुवंशिक टलना",
"answer": "A",
"explanation_en": "Mitosis is the process by which an organism's genetic information is passed from one generation to the next, through the division of cells.",
"explanation_hi": "मायटोसिस एक जीव की आनुवंशिक जानकारी का एक पीढ़ी से दूसरी पीढ़ी तक पारित होने का प्रक्रिया है, जो कोशिकाओं के विभाजन के माध्यम से होता है।"
},
{
"subject": "General Science",
"topic": "Physics",
"question_en": "What is the term for the energy that an object has due to its motion?",
"question_hi": "किसी वस्तु की गति के कारण उसके पास मौजूद ऊर्जा का नाम क्या है?",
"A_en": "Kinetic Energy", "A_hi": "काइनेटिक ऊर्जा",
"B_en": "Potential Energy", "B_hi": "संभावित ऊर्जा",
"C_en": "Thermal Energy", "C_hi": "गति ऊर्जा",
"D_en": "Electromagnetic Energy", "D_hi": "इलेक्ट्रोमैग्नेटिक ऊर्जा",
"answer": "A",
"explanation_en": "Kinetic Energy is the energy that an object has due to its motion, which is typically measured in units of joules or kilojoules.",
"explanation_hi": "काइनेटिक ऊर्जा किसी वस्तु की गति के कारण उसके पास मौजूद ऊर्जा है, जो आमतौर पर जूल या किलो जूल में मापी जाती है।"
},
{
"subject": "General Science",
"topic": "Chemistry",
"question_en": "What is the term for the study of the properties and behavior of matter at very small scales?",
"question_hi": "मैटर के बहुत छोटे स्तरों पर उसके गुण और व्यवहार का अध्ययन करने के लिए वैज्ञानिक शब्द क्या है?",
"A_en": "Physics", "A_hi": "भौतिकी",
"B_en": "Chemistry", "B_hi": "रासायनिकी",
"C_en": "Biology", "C_hi": "जीव विज्ञान",
"D_en": "Atomic Physics", "D_hi": "अणु भौतिकी",
"answer": "D",
"explanation_en": "Atomic Physics is the study of the properties and behavior of matter at very small scales, which includes the study of atoms and subatomic particles.",
"explanation_hi": "अणु भौतिकी मैटर के बहुत छोटे स्तरों पर उसके गुण और व्यवहार का अध्ययन है, जिसमें अणु और उप-आण्विक कणों का अध्ययन शामिल है।"
},
{
"subject": "General Science",
"topic": "Biology",
"question_en": "What is the term for the process by which an organism's body temperature is regulated?",
"question_hi": "किसी जीव के शरीर की तापमान को नियंत्रित करने की प्रक्रिया का नाम क्या है?",
"A_en": "Respiration", "A_hi": "श्वसन",
"B_en": "Photosynthesis", "B_hi": "फोटोसिंथेसिस",
"C_en": "Homeostasis", "C_hi": "होमिओस्टेसिस",
"D_en": "Osmosis", "D_hi": "ओस्मोसिस",
"answer": "C",
"explanation_en": "Homeostasis is the process by which an organism's body temperature is regulated, through the balance of heat production and heat loss.",
"explanation_hi": "होमिओस्टेसिस किसी जीव के शरीर की तापमान को नियंत्रित करने की प्रक्रिया है, जिसमें गर्मी उत्पादन और गर्मी के नुकसान के संतुलन के माध्यम से होता है।"
}