[
{
"subject": "General Science",
"topic": "Aavart Sarani ke Mool Siddhant (Periodic Table Basics)",
"question_en": "Who is known as the father of the periodic table?",
"question_hi": "आवर्त सारणी का जनक किसे कहा जाता है?",
"A_en": "Mendeleev", "A_hi": "मेंडेलीव",
"B_en": "Dobereiner", "B_hi": "डोबेरिनर",
"C_en": "Newlands", "B_hi": "न्यूलैंड्स",
"D_en": "Mosley", "D_hi": "मॉसले",
"answer": "A",
"explanation_en": "Dmitri Mendeleev is regarded as the father of the periodic table because he arranged elements by increasing atomic mass and predicted properties of undiscovered elements.",
"explanation_hi": "दमित्री मेंडेलीव को आवर्त सारणी का जनक कहा जाता है क्योंकि उन्होंने तत्वों को बढ़ते हुए परमाणु द्रव्यमान के अनुसार व्यवस्थित किया और अज्ञात तत्वों के गुणों की भविष्यवाणी की।"
},
{
"subject": "General Science",
"topic": "Aavart Sarani ke Mool Siddhant (Periodic Table Basics)",
"question_en": "Which of the following properties of an element is periodic?",
"question_hi": "तत्व के निम्नलिखित में से कौन सा गुण आवर्ती है?",
"A_en": "Atomic mass", "A_hi": "परमाणु द्रव्यमान",
"B_en": "Density", "B_hi": "घनत्व",
"C_en": "Atomic number", "C_hi": "परमाणु क्रमांक",
"D_en": "Boiling point", "D_hi": "क्वथनांक",
"answer": "C",
"explanation_en": "Atomic number is the periodic property of an element; it increases by one unit across a period and repeats after completion of a period.",
"explanation_hi": "परमाणु क्रमांक तत्व का आवर्ती गुण है; यह एक आवर्त में एक इकाई बढ़ता है और आवर्त पूर्ण होने पर दोहराता है।"
},
{
"subject": "General Science",
"topic": "Aavart Sarani ke Mool Siddhant (Periodic Table Basics)",
"question_en": "The modern periodic table is arranged in order of increasing",
"question_hi": "आधुनिक आवर्त सारणी किस बढ़ते हुए क्रम में व्यवस्थित है?",
"A_en": "Atomic mass", "A_hi": "परमाणु द्रव्यमान",
"B_en": "Atomic number", "B_hi": "परमाणु क्रमांक",
"C_en": "Valence electrons", "B_hi": "संयोजी इलेक्ट्रॉन",
"D_en": "Neutrons", "D_hi": "न्यूट्रॉन",
"answer": "B",
"explanation_en": "In the modern periodic table elements are arranged in order of increasing atomic number, which determines their chemical properties.",
"explanation_hi": "आधुनिक आवर्त सारणी में तत्वों को बढ़ते हुए परमाणु क्रमांक के अनुसार व्यवस्थित किया गया है, जो उनके रासायनिक गुणों को निर्धारित करता है।"
},
{
"subject": "General Science",
"topic": "Aavart Sarani ke Mool Siddhant (Periodic Table Basics)",
"question_en": "How many periods are there in the modern periodic table?",
"question_hi": "आधुनिक आवर्त सारणी में कितने आवर्त होते हैं?",
"A_en": "5", "A_hi": "५",
"B_en": "6", "B_hi": "६",
"C_en": "7", "B_hi": "७",
"D_en": "8", "D_hi": "८",
"answer": "C",
"explanation_en": "The modern periodic table has 7 horizontal rows called periods.",
"explanation_hi": "आधुनिक आवर्त सारणी में ७ क्षैतिज पंक्तियाँ होती हैं जिन्हें आवर्त कहा जाता है।"
},
{
"subject": "General Science",
"topic": "Aavart Sarani ke Mool Siddhant (Periodic Table Basics)",
"question_en": "Which of the following is the most reactive metal among the given options?",
"question_hi": "निम्नलिखित में से कौन-सी सबसे अधिक क्रियाशील धातु है?",
"A_en": "Sodium", "A_hi": "सोडियम",
"B_en": "Potassium", "B_hi": "पोटैशियम",
"C_en": "Lithium", "B_hi": "लिथियम",
"D_en": "Calcium", "D_hi": "कैल्शियम",
"answer": "B",
"explanation_en": "Potassium is the most reactive metal among the given options; reactivity of alkali metals increases down the group.",
"explanation_hi": "पोटैशियम दी गई विकल्पों में सबसे अधिक क्रियाशील धातु है; क्षार धातुओं की क्रियाशीलता समूह में नीचे की ओर बढ़ती है।"
},
{
"subject": "General Science",
"topic": "Aavart Sarani ke Mool Siddhant (Periodic Table Basics)",
"question_en": "Which group of elements is called halogens?",
"question_hi": "किस समूह के तत्वों को हैलोजन कहा जाता है?",
"A_en": "Group 15", "A_hi": "समूह १५",
"B_en": "Group 16", "B_hi": "समूह १६",
"C_en": "Group 17", "B_hi": "समूह १७",
"D_en": "Group 18", "D_hi": "समूह १८",
"answer": "C",
"explanation_en": "Group 17 elements (F, Cl, Br, I, At, Ts) are collectively known as halogens.",
"explanation_hi": "समूह 17 के तत्वों (F, Cl, Br, I, At, Ts) को सम्मिलित रूप से हैलोजन कहा जाता है।"
},
{
"subject": "General Science",
"topic": "Aavart Sarani ke Mool Siddhant (Periodic Table Basics)",
"question_en": "Noble gases are placed in which group of the periodic table?",
"question_hi": "आवर्त सारणी में निष्क्रिय गैसें किस समूह में रखी गई हैं?",
"A_en": "Group 16", "A_hi": "समूह १६",
"B_en": "Group 17", "B_hi": "समूह १७",
"C_en": "Group 18", "B_hi": "समूह १८",
"D_en": "Group 1", "D_hi": "समूह १",
"answer": "C",
"explanation_en": "Group 18 elements (He, Ne, Ar, Kr, Xe, Rn, Og) are called noble gases; they have complete outer shells and are inert.",
"explanation_hi": "समूह 18 के तत्व (He, Ne, Ar, Kr, Xe, Rn, Og) को निष्क्रिय गैसें कहा जाता है; इनकी बाहरी कोश पूर्ण होती है और ये अक्रिय होती हैं।"
},
{
"subject": "General Science",
"topic": "Aavart Sarani ke Mool Siddhant (Periodic Table Basics)",
"question_en": "Which of the following statements about periods is correct?",
"question_hi": "आवर्तों के बारे में निम्नलिखित में से कौन-सा कथन सही है?",
"A_en": "Number of valence electrons remains the same across a period", "A_hi": "एक आवर्त में संयोजी इलेक्ट्रॉनों की संख्या समान रहती है",
"B_en": "Number of shells remains the same across a period", "B_hi": "एक आवर्त में कोशों की संख्या समान रहती है",
"C_en": "Atomic size increases across a period", "B_hi": "एक आवर्त में परमाणु आकार बढ़ता है",
"D_en": "Metallic character increases across a period", "D_hi": "एक आवर्त में धात्विक लक्षण बढ़ते हैं",
"answer": "B",
"explanation_en": "Across a period the number of electron shells remains the same while atomic number increases.",
"explanation_hi": "एक आवर्त में इलेक्ट्रॉन कोशों की संख्या समान रहती है जबकि परमाणु क्रमांक बढ़ता है।"
},
{
"subject": "General Science",
"topic": "Aavart Sarani ke Mool Siddhant (Periodic Table Basics)",
"question_en": "Which element has the smallest atomic radius in the second period?",
"question_hi": "द्वितीय आवर्त में सबसे छोटा परमाणु त्रिज्या किस तत्व की है?",
"A_en": "Lithium", "A_hi": "लिथियम",
"B_en": "Boron", "B_hi": "बोरॉन",
"C_en": "Fluorine", "B_hi": "फ्लोरीन",
"D_en": "Neon", "D_hi": "नियॉन",
"answer": "C",
"explanation_en": "Atomic radius decreases from left to right across a period due to increasing nuclear charge; fluorine has the smallest atomic radius in the second period.",
"explanation_hi": "आवर्त में बाईं ओर से दाईं ओर जाने पर परमाणु त्रिज्या घटती है क्योंकि नाभिकीय आवेश बढ़ता है; द्वितीय आवृत्ति में फ्लोरीन की सबसे छोटी परमाणु त्रिज्या है।"
},
{
"subject": "General Science",
"topic": "Aavart Sarani ke Mool Siddhant (Periodic Table Basics)",
"question_en": "Which property increases down a group in the periodic table?",
"question_hi": "आवर्त सारणी में कौन-सा गुण एक समूह में नीचे जाने पर बढ़ता है?",
"A_en": "Electronegativity", "A_hi": "विद्युत्‌ऋणता",
"B_en": "Ionization energy", "B_hi": "आयनन ऊर्जा",
"C_en": "Atomic size", "B_hi": "परमाणु आकार",
"D_en": "Valency", "D_hi": "संयोजकता",
"answer": "C",
"explanation_en": "Down a group the number of electron shells increases, leading to larger atomic size, while electronegativity and ionization energy decrease.",
"explanation_hi": "एक समूह में नीचे जाने पर इलेक्ट्रॉन कोशों की संख्या बढ़ती है जिससे परमाणु आकार बढ़ता है जबकि विद्युत्‌ऋणता और आयनन ऊर्जा घटती है।"
}
]