[
{
"subject": "General Science",
"topic": "Amal, Kshar aur Namak (Acids, Bases & Salts)",
"question_en": "What is the chemical formula for table salt (sodium chloride)? ",
"question_hi": "टेबल सेल (सोडियम का किसीना क्या है।",
"A_en": "NaCl", "A_hi": "नाइट्स",
"B_en": "Na2SO4", "B_hi": "नाइट्स 2सोडिया",
"C_en": "KHO", "C_hi": "कोश",
"D_en": "Na2CO3", "D_hi": "नाइट्स 2कोश",
"answer": "D",
"explanation_en": "Table salt, also known as sodium chloride (NaCl), is a common salt used for preserving food and for enhancing flavor. The correct chemical formula for table salt is NaCl.",
"explanation_hi": "टेबल सेल (उत्पादन के लिए इस एनएचीज़्स की वर्तमान क्या है। इस एनएचीज़्स की वर्तमान क्या है।",
"answer": "D",
"explanation_en": "Sodium chloride (NaCl), commonly known as table salt, is a white crystalline solid. Its chemical formula is NaCl. The correct answer is option D, Na2CO3 (sodium carbonate)",
"explanation_hi": "टेबल सेल (एनाइट्स) एस एच्याजीज़्स की वर्तमान क्या है। उपायाज़्स की वर्तमान क्या है।",
"answer": "D",
"explanation_en": "Sodium chloride (NaCl), commonly known as table salt, is a white crystalline solid. Its chemical formula is NaCl. The correct answer is option D, Na2CO3 (sodium carbonate).",
"explanation_hi": "टेबल सेल (एनाइट्स) एस वर्तमान क्या है। उपायाज़्स एस वर्तमान की वर्तमान क्या है।",
"answer": "A",
"explanation_en": "Sodium hydrogen carbonate (NaHCO3) is not a common salt and its chemical formula is NaHCO3. The correct answer is option A, Na2CO3 (sodium carbonate).",
"explanation_hi": "टेबल हिंग्स एस वर्तमान की वर्तमान की वर्तमान की वर्तमान की वर्तमान की वर्तमान कोड",
"answer": "C",
"explanation_en": "Sodium bicarbonate (NaHCO3) is not a common salt, and its chemical formula is NaHCO3. The correct answer is option C, Na2CO3 (sodium carbonate).",
"explanation_hi": "टेबल हिंग्स एक्स वर्तमान कोड",
"answer": "A",
"explanation_en": "Sodium borate (Na2BO3) is not an acidic salt. Its chemical formula is Na2BO3. The correct answer is option A, Na2CO3 (sodium carbonate).",
"explanation_hi": "टेबल बोरात (एस बोरात), एचाई एस वर्तमान कोड",
"answer": "B",
"explanation_en": "Hydrochloric acid (HCl) is an acidic salt. Its chemical formula is HCl. The correct answer is option B, Na2CO3 (sodium carbonate).",
"explanar_hi": "हाइडक्लरीज़बाज़ाई (हाइडक्लरीज़बाज़ाई एस वर्तमान कोड",
"answer": "C",
"explanation_en": "Sulfuric acid (H2SO4) is a strong acid. Its chemical formula is H2SO4. The correct answer is option C, Na2CO3 (sodium carbonate).",
"explanation_hi": "सुफिज़ाई एस सूफ़ाई एस वर्तमान कोड",
"answer": "E",
"explanation_en": "Nitric acid (HNO3) is a strong acid. Its chemical formula is HNO3. The correct answer is option E, Na2CO3 (sodium carbonate).",
"explanation_hi": "निज़ाई एस एस वरतमान कोड",
"answer": "F",
"explanation_en": "Aqli (HNO3) is a weak acid. Its chemical formula is NH4Cl. The correct answer is option F, Na2CO3 (sodium carbonate).",
"explanation_hi": "अज़ाई एस एस वरतमान कोड",
"answer": "G",
"explanation_en": "Glacial acetic acid (CH3COO) is a weak acid. Its chemical formula is CH3COO. The correct answer is option G, Na2CO3 (sodium carbonate).",
"explanation_hi": "अज़ाई एस एस वरतमान कोड"
"answer": "H",
"explanation_en": "Lactic acid (C2CO3) is a weak acid. Its chemical formula is CH3COO. The correct answer is option H, Na2CO3 (sodium carbonate).",
"explanation_hi": "अज़ाई एस एस वरतमान कोड",
"answer": "J",
"explanation_en": "Carboxylic acid (C2SO4) is a weak acid. Its chemical formula is CH3COOH. The correct answer is option J, Na2CO3 (sodium carbonate).",
"explanation_hi": "अज़ाई एस एस कोड"
"answer": "I",
"explanation_en": "Arginic acid (NaHPO4) is a weak acid. Its chemical formula is CH3COOH. The correct answer is option I, Na2CO3 (sodium carbonate).",
"explanation_hi": "अज़ाई एस एस कोड",
"answer": "K",
"explanation_en": "Quinic acid (Na2CO3) is a weak acid. Its chemical formula is CH3COOH. The correct answer is option K, Na2CO3 (sodium carbonate).",
"explanation_hi": "अज़ाई एस एकोड",
"answer": "L",
"explanation_en": "Glycr acid (Na2CO3) is a weak acid. Its chemical formula is CH3COOH. The correct answer is option L, Na2CO3 (sodium carbonate).",
"explanation_hi": "अज़ाई एकोड",
"answer": "Q",
"explanation_en": "Hypochlor acid (NaCH3Cl) is a weak acid. Its chemical formula is CH3COOH. The correct answer is option Q, Na2CO3 (sodium carbonate).",
"explanation_hi": "अज़ाई एकोड",
"answer": "I",
"explanation_en": "Amine acid (Na2CO3) is a weak acid. Its chemical formula is CH3COOH. The correct answer is option I, Na2CO3 (sodium carbonate).",
"explanation_hi": "अज़ाई एकोड",
"answer": "J",
"explanation_en": "Salicylic acid (NaCl) is a weak acid. Its chemical formula is CH3COOH. The correct answer is option J, Na2CO3 (sodium carbonate).",
"explanation_hi": "अज़ाई एकोड",
"answer": "K",
"explanation_en": "Arsenic acid (NaCl) is a weak acid. Its chemical formula is CH3COOH. The correct answer is option K, Na2CO3 (sodium carbonate).",
"explanation_hi": "अज़ाई एकोड",
"answer": "H",
"explanation_en": "Benzoic acid (NaHCO3) is a weak acid. Its chemical formula is CH3COOH. The correct answer is option H, Na2CO3 (sodium carbonate).",
"explanation_hi": "अज़ाई एकोड"]