[
{
"subject": "General Science",
"topic": "Amal, Kshar aur Namak (Acids, Bases & Salts)",
"question_en": "What is the chemical formula for table salt?",
"question_hi": "टेबल सफेद की कार्यालय मार्गदर्शनल संदर्भ है।",
"A_en": "NaCl",
"A_hi": "नाथना की मार्गदर्शनल",
"B_en": "HCl",
"B_hi": "हाइडरोजना की मार्गदर्शनल",
"C_en": "Na2SO4",
"C_hi": "नाथना की तेलचना की मार्गदर्शनल",
"D_en": "NH4Cl",
"D_hi": "नाथना की नाथना की मार्गदर्शनल",
"answer": "C",
"explanation_en": "Sodium sulfate (Na2SO4) is the example of a salt. It is a neutral compound and does not fit into acidic or basic categories.",
"explanation_hi": "नाथना (Na2SO4) एस्टोन की तेलचना की मार्गदर्शनल",
"explanation_en": "Acids are substances that donate hydrogen ions (H+) when dissolved in water. Sodium chloride (NaCl) is an example of an acidic salt.",
"explanation_hi": "एक पदार्थ होने की तेलचना की मार्गदर्शन",
"explanation_en": "Bases are substances that accept hydrogen ions (H+) when dissolved in water. Sodium bicarbonate (NaHCO3) is an example of a basic salt.",
"explanation_hi": "प्रावत पदार्थ होने की मार्गदर्शन",
"explanation_en": "Salts are compounds formed when an acid combines with a base. Sodium hydrogen carbonate (NaHCO3) is an example of a neutral salt.",
"explanation_hi": "एक एक्सिड और प्रावत पदार्थ के निर्माण",
"explanation_en": "Acids are substances that release hydrogen ions (H+) when dissolved in water. Sodium hydroxide (NaOH) is an example of an acidic salt.",
"explanation_hi": "एक एक्सीड प्रावत पदार्थ के निर्माण",
"explanation_en": "Bases are substances that react with acids to form salts. Sodium hydroxide (NaOH) and citric acid (C6H8O7) are an example of basic and acidic salts respectively.",
"explanation_hi": "एक एक्सिड और प्रावत पदार्थ के निर्माण",
"explanation_en": "Acids and bases combine to form salts. Sodium bicarbonate (NaHCO3) and sodium carbonate (Na2CO3) are examples of acidic and basic salts respectively.",
"explanation_hi": "एक एक्सिड और प्रावत पदार्थ के निर्माण",
"explanation_en": "Acids and bases can also be classified as strong or weak. Sulfuric acid (H2SO4) and sodium bisulfate (NaHSO4) are examples of strong acidic and weak acidic salts respectively.",
"explanation_hi": "एक एक्सिड और प्रावत पदार्थ के निर्माण",
"explanation_en": "Sodium chloride (NaCl) and sodium carbonate (Na2CO3) are examples of neutral salts",
"explanation_hi": "एक एक्सिड और प्रावत पदार्थ के निर्माण",
"explanation_en": "Sodium sulfate (Na2SO4) and sodium nitrate (NaNO3) are examples of acidic salts",
"explanation_hi": "एक एक्सिड और प्रावत पदार्थ के निर्माण",
"explanation_en": "Sodium carbonate (Na2CO3) and sodium bicarbonate (NaHCO3) are examples of basic salts",
"explanation_hi": "एक एक्सिड और प्रावत प्रावत पदारथ के निर्माण",
"explanation_en": "Sodium sulfate (Na2SO4) aur sodium phosphate (Na3PO4) aur shakti na karein",
"explanation_hi": "एक एक्सिड औरथ करथ के निरथ निराण",
"explanation_en": "एक एकसिड औरथ के निराण",
"explanation_hi": "एक एक्सिड औरथ के नराण",
]