[
{
"subject": "General Science",
"topic": "Bhautik aur Rasayanik Parivartan (Physical & Chemical Changes)",
"question_en": "What is the process of matter undergoing changes called?",
"question_hi": "मात्रा को बदलना क्या कहाने वाला प्रकार काम क्या होता है?",
"A_en": "Chemical Reaction",
"A_hi": "रसायनी कार्यक्रम",
"B_en": "Physical Change",
"B_hi": "बीजेपी कार्यक्रम",
"C_en": "Physical Reaction",
"C_hi": "बीजेपी कार्यक्रम",
"D_en": "Chemical-Physical Reaction",
"D_hi": "रसायनी-बीजेपी कार्यक्रम",
"answer": "B",
"explanation_en": "A physical change is a type of change where the state of matter is changed, but its composition remains the same.",
"explanation_hi": "बीजेपी कार्यक्रम", "बीजेपी कार्यक्रम",
"explanation_en_aliased": "Physical Change",
"explanation_hi_aliased": "बीजेपी कार्यक्रम", "बीजेपी कार्यक्रम",
"explanation_en_aliased": "Physical Change",
"explanation_hi_aliased": "बीजेपी कार्यक्रम", "बीजेपी कार्यक्रम",
"explanation_en_aliased": "Physical Change",
"explanation_hi_aliased": "बीजेपी कार्यक्रम", "बीजेपी कार्यक्रम",
"answer": "B",
"question_en": "Which of the following is an example of a physical change?",
"question_hi": "निमीत स्पष्ट प्रश्न क्या समूर्ति एनएसएल का उपयोग है।",
"question_en_aliased": "What is an example of a physical change?",
"question_hi_aliased": "समूर्ति की एनएसएल को प्रश्न क्या है।",
"explanation_en": "A physical change is a process where the state of matter undergoes alteration but its composition remains unchanged.",
"explanation_hi": "बीजेपी समूर्ति एनएसएल किस्तर हुएका राजाना होता है, लेकी विभागति निखारा नहींता होता है।",
"answer": "B",
"question_en_aliased": "What is an example of a physical change?",
"question_hi_aliased": "बीजेपी समूर्ति की मौता क्या हींतलांता होता होता है।",
"explanation_en": "A physical change is a process where the state of matter changes, but its composition remains unchanged.",
"explanation_hi": "बीजेपी समूर्ति की कारकार होता होता होता होता होता होता होता होता होता होता होता होता हता होता होता होता होता होता होता होता हता होता होता होता होता होता होता होता होता होता हता होता होता होता हता होता होता हता होता होता होता होता होता हता होता हता हता हता हता होता हता हता होता हता होता होता होता होता होता होता होता हता हता होता हता होता हता होता हता हता हता हता होता होता होता हता हता होता होता होता हता होता हता हता होता होता होता हता हता होता होता हता हता होता हता हता हता हता हता होता होता होता हता हता होता हता होता हता हता हता हता होता हता हता होता हता हता हता हता हता होता हता हता हता होता हता हता होता हता हता होता होता हता हता होता हता हता हता हता हता हता हता होता हता हता हता हता हता हता हता हता हता हता होता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता हता ह