<think>
Okay, let's tackle this task. The user wants 10 high-quality MCQs on General Science, specifically about Sound and Waves in Hindi and English. I need to make sure each question follows the given JSON structure and meets the difficulty level suitable for Rajasthan State Exams, SSC, and Railway exams.

First, I'll brainstorm topics related to sound and waves. Possible areas include types of waves, properties like frequency, wavelength, speed of sound, reflection of sound, applications such as sonar or ultrasonic waves, concepts like resonance, and maybe some basic physics principles like Doppler effect.

Next, I need to formulate questions in both languages. For each question, the English and Hindi versions should be accurate. The options should be plausible, with the correct answer clearly marked. Explanation in both languages is necessary to clarify the answer.

I should check for any technical terms that might need translation or if there's a standard term in Hindi for scientific concepts. For example, "speed of sound" is "ध्वनि का वेग" in Hindi. Also, ensuring that the difficulty level isn't too high but still tests the understanding required for these exams.

Need to avoid repetition and cover a variety of subtopics under sound and waves. Let's start drafting each question step by step, ensuring the structure is correct and explanations are clear.
</think>

[{"subject":"General Science","topic":"Dhwani (Sound) aur Tarange (Waves)","question_en":"What is the speed of sound in air at 20°C?","question_hi":"20°C पर वायु में ध्वनि का वेग क्या है?","A_en":"343 m/s","A_hi":"343 मीटर/सेकंड","B_en":"1500 m/s","B_hi":"1500 मीटर/सेकंड","C_en":"5000 m/s","C_hi":"5000 मीटर/सेकंड","D_en":"1000 m/s","D_hi":"1000 मीटर/सेकंड","answer":"A","explanation_en":"The speed of sound in air at 20°C is approximately 343 meters per second.","explanation_hi":"20°C पर वायु में ध्वनि का वेग लगभग 343 मीटर प्रति सेकंड होता है।"},{"subject":"General Science","topic":"Dhwani (Sound) aur Tarange (Waves)","question_en":"Which type of wave is a sound wave?","question_hi":"ध्वनि तरंग किस प्रकार की तरंग है?","A_en":"Transverse wave","A_hi":"अनुप्रस्थ तरंग","B_en":"Longitudinal wave","B_hi":"अनुदैर्ध्य तरंग","C_en":"Surface wave","C_hi":"सतह की तरंग","D_en":"Electromagnetic wave","D_hi":"विद्युत चुंबकीय तरंग","answer":"B","explanation_en":"Sound waves are longitudinal waves because the particles of the medium vibrate parallel to the direction of wave propagation.","explanation_hi":"ध्वनि तरंगें अनुदैर्ध्य तरंगें होती हैं जबकि माध्यम के कण तरंग के प्रसार की दिशा में समानांतर दोलन करते हैं।"},{"subject":"General Science","topic":"Dhwani (Sound) aur Tarange (Waves)","question_en":"What is the unit of frequency?","question_hi":"आवृत्ति की इकाई क्या है?","A_en":"Hertz","A_hi":"हर्ट्ज़","B_en":"Meter","B_hi":"मीटर","C_en":"Second","C_hi":"सेकंड","D_en":"Newton","D_hi":"न्यूटन","answer":"A","explanation_en":"The unit of frequency is Hertz (Hz), which represents the number of cycles per second.","explanation_hi":"आवृत्ति की इकाई हर्ट्ज़ (Hz) है, जो प्रति सेकंड स्थानांतरणों की संख्या को दर्शाती है।"},{"subject":"General Science","topic":"Dhwani (Sound) aur Tarange (Waves)","question_en":"Which of the following is used in sonar systems?","question_hi":"अल्ट्रासोनिक तरंगें निम्नलिखित में से किसमें उपयोग की जाती हैं?","A_en":"X-rays","A_hi":"एक्स-रे","B_en":"Ultrasonic waves","B_hi":"अल्ट्रासोनिक तरंगें","C_en":"Infrared waves","C_hi":"अवरक्त तरंगें","D_en":"Gamma rays","D_hi":"गामा किरणें","answer":"B","explanation_en":"Sonar systems use ultrasonic waves to detect and locate objects underwater.","explanation_hi":"सोनार प्रणाली अल्ट्रासोनिक तरंगों का उपयोग जल में वस्तुओं का पता लगाने और स्थान निर्धारित करने के लिए करती है।"},{"subject":"General Science","topic":"Dhwani (Sound) aur Tarange (Waves)","question_en":"What is the term for the reflection of sound?","question_hi":"ध्वनि के परावर्तन के लिए शब्द क्या है?","A_en":"Echo","A_hi":"प्रतिध्वनि","B_en":"Reverberation","B_hi":"गूंजेबाज़ी","C_en":"Refraction","C_hi":"अपवर्तन","D_en":"Diffraction","D_hi":"विवर्तन","answer":"A","explanation_en":"An echo is a reflection of sound that arrives at the listener with a delay after the direct sound.","explanation_hi":"प्रतिध्वनि ध्वनि का एक परावर्तन है जो सीधी ध्वनि के बाद बराबर देरी से सुनाई देता है।"},{"subject":"General Science","topic":"Dhwani (Sound) aur Tarange (Waves)","question_en":"Which of the following is not a characteristic of sound?","question_hi":"निम्नलिखित में से कौन ध्वनि का एक गुण नहीं है?","A_en":"Pitch","A_hi":"तार","B_en":"Frequency","B_hi":"आवृत्ति","C_en":"Amplitude","C_hi":"आयाम","D_en":"Color","D_hi":"रंग","answer":"D","explanation_en":"Color is not a characteristic of sound. It is a property of light.","explanation_hi":"रंग ध्वनि का एक गुण नहीं है। यह प्रकाश का एक गुण है।"},{"subject":"General Science","topic":"Dhwani (Sound) aur Tarange (Waves)","question_en":"What is the term for the maximum displacement of particles in a medium during wave propagation?","question_hi":"तरंग प्रसार के दौरान माध्यम के कणों के अधिकतम विस्थापन के लिए शब्द क्या है?","A_en":"Frequency","A_hi":"आवृत्ति","B_en":"Amplitude","B_hi":"आयाम","C_en":"Wavelength","C_hi":"तरंगदैर्ध्य","D_en":"Speed","D_hi":"वेग","answer":"B","explanation_en":"Amplitude is the maximum displacement of particles from their mean position during wave propagation.","explanation_hi":"आयाम तरंग प्रसार के दौरान कणों के उनकी माध्य स्थिति से अधिकतम विस्थापन को कहते हैं।"},{"subject":"General Science","topic":"Dhwani (Sound) aur Tarange (Waves)","question_en":"Which of the following media allows sound to travel fastest?","question_hi":"निम्नलिखित में से कौन सा माध्यम ध्वनि को तेजी से यात्रा करने की अनुमति देता है?","A_en":"Air","A_hi":"वायु","B_en":"Water","B_hi":"जल","C_en":"Steel","C_hi":"इस्पात","D_en":"Vacuum","D_hi":"शून्याक","answer":"C","explanation_en":"Sound travels fastest in solids like steel because the particles are closely packed.","explanation_hi":"ध्वनि ठोस जैसे इस्पात में सबसे तेज यात्रा करती है क्योंकि कण दृढ़ रूप से संवर्धित होते हैं।"},{"subject":"General Science","topic":"Dhwani (Sound) aur Tarange (Waves)","question_en":"What is the term for the change in frequency of a wave due to the motion of the source or observer?","question_hi":"स्रोत या प्रेक्षक की गति के कारण तरंग की आवृत्ति में परिवर्तन के लिए शब्द क्या है?","A_en":"Doppler effect","A_hi":"डॉप्लर प्रभाव","B_en":"Resonance","B_hi":"अनुनाद","C_en":"Refraction","C_hi":"अपवर्तन","D_en":"Interference","D_hi":"अपवर्तन","answer":"A","explanation_en":"The Doppler effect is the change in frequency of a wave due to the relative motion between the source and the observer.","explanation_hi":"डॉप्लर प्रभाव एक तरंग की आवृत्ति में परिवर्तन को कहते हैं जो स्रोत और प्रेक्षक के बीच सापेक्ष गति के कारण होता है।"},{"subject":"General Science","topic":"Dhwani (Sound) aur Tarange (Waves)","question_en":"Which of the following is used to measure the intensity of sound?","question_hi":"ध्वनि की तीव्रता मापने के लिए निम्नलिखित में से किसका उपयोग किया जाता है?","A_en":"Decibel","A_hi":"डेसिबल","B_en":"Hertz","B_hi":"हर्ट्ज़","C_en":"Meter","C_hi":"मीटर","D_en":"Newton","D_hi":"न्यूटन","answer":"A","explanation_en":"The intensity of sound is measured in decibels (dB).","explanation_hi":"ध्वनि की तीव्रता डेसिबल (dB) में मापी जाती है।"}]