[
{
"subject": "General Science",
"topic": "Genetics aur Mendel ke Niyam (Inheritance)",
"question_en": "What is the concept of Mendel's Laws of Inheritance?",
"question_hi": "मैंडल के विकास के लिए क्या कहेंगे विशेष माननेवाले केंद्रित संदर्भ कैसे प्रदर्शित होते हैं।",
"A_en": "Mendel's Law of Segregation is responsible for the segregation of alleles.",
"A_hi": "मैंडल के विकास के विशेष माननेवाले केंद्रित संदर्भ कैसे प्रदर्शित होते हैं।",
"B_en": "Mendel's Law of Inheritance determines the segregation of genes.",
"B_hi": "मैन्डल के परिणाम का अनुमान संदर्भूत संदर्भ कैसे प्रदर्शित होते हैं।",
"C_en": "Mendel's Law of Segregation is responsible for the segregation of alleles.",
"C_hi": "मैन्डल के संदर्भवत संदर्भ कैसे प्रदर्शित होते हैं।",
"D_en": "Mendel's Law of Isolation determines the separation of alleles.",
"D_hi": "मैन्डल के इस्तीत संदर्भ कैसे प्रदर्शित होते हैं।",
"E_en": "Mendel's Law of Segregation governs the separation of alleles.",
"E_hi": "मैन्डल के संदर्भवत संदर्भ कैसे प्रदर्शित होते हैं।",
"F_en": "Mendelian Punnett Squares are used to determine the possible offspring combinations in a simple Mendelian segregation.",
"F_hi": "मैनेलिन पुनेट बॉल्याउटे एन्डेलिं सीट बॉल्याउटे एन्डेलिं सीट बॉल्याउटे एन्डेलिं सीट बॉल्याउटे एन्डेलिं सीट बॉल्याउटे एन्डेलिं सीट बॉल्याउटे एन्डेलिं सीट बॉल्याउटे एन्डेलिं सीट बॉल्याउटे एन्डेलिं सीट बॉल्याउटे एन्डेलिं सीट बॉल्याउटे एन्डेलिं सीट बॉल्याउटे एन्डेलिं सीट बॉल्याउटे एन्डेलिं सीट बॉल्याउटे एन्डेलिं सीट बॉल्याउटे एन्डेलिं सीट बॉल्याउटे एन्डेलिं सीट बल्याउटे एन्डेले सीट बॉल्याउटे एन्डेले सीट बॉल्याउटे एन्डेले सीट बॉल्याउटे एन्डे सीट बॉल्याउटे एन्डे सीट बॉल्याउटे एन्डे सीट बॉल्याउट",

"question_en": "What is the Punnett's Law in inheritance?",
"question_hi": "पिटे एने सैट एने सीट एन्डे सैट",
"A_en": "Punnett's Law of Inheritance explains the inheritance of traits by offspring.",
"A_hi": "एने सैट एने एन्डे सैट एने सीट",
"B_en": "The Punnett's Law describes how traits are passed to the next generation.",
"B_hi": "एनटे एने सैट एने एने सीट",
"C_en": "Punnett's Principle tells us about the inheritance of genes.",
"C_hi": "एने एने एने सीट",
"D_en": "Punnett's Law explains how traits are passed from parents to offspring.",
"D_hi": "एने एने एने एने एने एने एने एने एने",
"E_en": "Punnett's Law of Inheritance describes the transmission of characters.",
"E_hi": "एने एने एने एने एने",
"question_en": "What is Punnett's Law of Inheritance?",
"question_hi": "एने एने एने एने",
"A_en": "Mendel's Law distinguishes the segregation of traits.",
"A_hi": "एने एने एने एने",
"B_en": "Punnett's Law explains the passage of genes.",
"B_hi": "एने एने एने",
"C_en": "Mendel's Law describes how genes are inherited.",
"C_hi": "एने एने एने",
"D_en": "Punnett's Law defines the inheritance of characters.",
"D_hi": "एने एने एने",
"E_en": "एने एने एने",
"question_en": "