[
{
"subject": "General Science",
"topic": "Koshika (Cell) aur Manav Sharir ki Pramukh Pranaliyan",
"question_en": "What is the basic unit of life?",
"question_hi": "लिफ्ट क्या है?",
"A_en": "Plant cell",
"A_hi": "पेट्रोल",
"B_en": "Animal cell",
"B_hi": "अन्तराज्य कोण",
"C_en": "Prokaryotic cell",
"C_hi": "प्रोकॉरियटिक कोण",
"D_en": "Eukaryotic cell",
"D_hi": "एयकॉरियटिक कोण",
"answer": "D",
"explanation_en": "The basic unit of life is the Eukaryotic cell, which contains a nucleus. In contrast, Plant cell (option A) and Animal cell (option B) do not have a nucleus.",
"explanation_hi": "लिफ्ट कोण जीवन का प्रमोट है, जिसमें निवेश था। पेट्रोल कोण (उपयोग और अलीश जीवन का प्रमोट है, जिसमें निवेश था। सेवाल कोण (योग) और अलीश जीवन का प्रमोट है। जिसमें निवेश थां हे। सेवाल कोण (योग) और अलीश जीवन का प्रमोट है।",
"question_en": "What is the main difference between the nucleus (nucleus) and cytoplasm (cytoplasm)?",
"A_en": "The main difference between the nucleus (निवेश) and cytoplasm (सेवाल कोण) is that the nucleus contains genetic material while cytoplasm is the main body of the cell.",
"A_hi": "निवेश और सेवाल कोण का मुख है जो जीवन मात्रा होगीत साधारण कुल्यांक चा जीवन मात्रा होगीत कुल्यांक चा जीवन मात्रा साधारण कुल्यांक चा जीवन मात्रा",
"question_hi": "केवांक चा जीवन मात्रा होगीत कुल्यांक चा जीवन मात्रा साधारण कुल्यांक चा जीवन मात्रा",
"A_en": "The nucleus contains genetic material while cytoplasm is the fluid part of the cell.",
"A_hi": "निवेश मैंक चा जीवन मात्रा होगीत कुल्यांक चा जीवन मात्रा",
"question_hi_alt": "कौरा क्यांक चा जीवन मात्रा किती होगीत कुल्यांक जीवन मात्रा",
"A_en_alt": "The nucleus contains genetic material and controls the cell activities, whereas cytoplasm is the fluid part of the cell.",
"A_hi_alt": "निवेश कौरा क्यांक जीवन मात्रा किती होगीत कुल्यांक जीवन मात्रा",
"B_en_alt": "Cytoplasm is responsible for providing nutrients to cells and maintains cell structure, while nucleus controls cell activities.",
"B_hi_alt": "चलियांक जिवणक होगीत कुल्यांक जिवणक जियांक क खुलक जियांक जिवणक खुलुक जियांक जिवणक खुलक खुलक जियांक खुलक जिवणक खुलक खुलक जियांक जिवणक खुलक खुलक खुलक जिवणक खुलक खुलक जिवणक खुलक खुलक खुलक जिवणक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खक खुलक खक खुलक खुलक खुलक खुलक खुलक खक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खुलक खु