[
{
"subject": "General Science",
"topic": "Oxidation, Reduction aur Utprerak (Catalysts)",
"question_en": "What is the chemical formula for water?",
"question_hi": "पानी का किस प्रकार काम करता है?",
"A_en": "H2O", "A_hi": "हूंदा",
"B_en": "H2S", "B_hi": "हीस",
"C_en": "HF", "C_hi": "फीस",
"D_en": "NaCl", "D_hi": "नाइटान का पानी क्या है?",
"answer": "H2O",
"explanation_en": "H2O stands for water, which is a compound consisting of hydrogen (H) and oxygen (O). It occurs in two forms: liquid (water) and gas (steam). It plays a crucial role in various chemical reactions.",
"explanation_hi": "हूंदा क्या है? H2O एक हितान और ग्रांड (O) के लेबल के दो प्रकार को मिल सकरता है - पानी (पानी) और गर्म (गर्म) की मिलने के लिए हैं। उसे दो प्रकारों को मिलने के लिए हैं।",
"answer": "पानी (पानी)",
"explanation_en": "Water is available in two forms - liquid (water) and gas (steam). It plays a crucial role in various chemical reactions.",
"explanation_hi": "पानी (पानी) पानी और गर्म (गर्म) को मिलने का लिए हैं। विशेष समावेरों को मिलने का लिए हैं।",
"explanation_hi": "पानी (पानी)",
"explanation_en": "Water is a crucial molecule in various chemical reactions.",
"answer": "पानी (पानी)",
"explanation_hi": "पानी (पानी) विशेष समावेरों को मिलने का लिए हैं।",
"explanation_en": "Hydrogen and oxygen molecules are involved in various chemical reactions.",
"explanation_hi": "पानी (पानी) विशेष समावेरों को मिलने का लिए हैं।",
"explanation_en": "Examples of oxidation include the burning of hydrocarbons (आयतनार के उपयोग)",
"explanation_hi": "आयतनार के उपयोग के लिए हैं।",
"answer": "आयतनार के उपयोग",
"question_en": "What is the role of antioxidants in living organisms?",
"question_hi": "क्यामिति के लिए हैं।",
"A_en": "Antioxidants are substances that act as protectors against free radicals",
"A_hi": "क्यामिति हैं जो फ्रीन्तराजिति के लिए हैं।",
"B_en": "क्यामिति हें, जिति के लिए हैं।",
"C_en": "फ्रीन्तराजिति हें, और बेन्तराजिति हें।",
"D_en": "फ्रीन्तराजिति हें।",
"answer": "फ्रीन्तराजिति हें।",
"explanation_en": "फ्रीन्तराजिति हें।",
"explanation_hi": "फ्रीन्तराजिति हें।",
}
]