[
{
"subject": "General Science",
"topic": "Prakash ka Pravartan aur uske Niyam (Reflection of Light & Lenses)",
"question_en": "How does the process of reflection of light take place?",
"question_hi": "प्रकाश की प्रवृत्ति कैसे होती है?",
"A_en": "When light falls on a smooth surface, it gets reflected.",
"A_hi": "ज्यादा स्वीकार के प्राकृति पर प्रकार के लिए प्रवृत्ति होती है।",
"B_en": "Reflection occurs when light hits a rough surface.",
"B_hi": "ज्यादा पहले प्रकार के लिए प्रवृत्ति होती है।",
"C_en": "Reflection occurs when light passes through a medium.",
"C_hi": "प्रकार के लिए प्रवृत्ति होती है।",
"D_en": "Reflection happens when light is absorbed by an object.",
"D_hi": "प्रकार के लिए प्रवृत्ति होती है।",
"question_en": "What is the process of reflection called?",
"question_hi": "प्रवृत्ति का प्रत्यक्षित्ति खंचरण का रचना करने के लिए त्यक्षित्ति भविता को त्यंति के लिए त्यक्षित्ति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता को त्यंति के लिए त्यंति भविता के लिए त्यंति के लिए त्यंति भविए त्यंति के लिए त्यंति",
"option_en": "When light falls on a smooth surface, it gets refracted.",
"option_hi": "जींति भविए त्यंति के लिए त्यंति",
"option_en": "When light passes through a medium.",
"option_hi": "जींति भविए त्यंति के लिए त्यंति",
"option_en": "When light enters a lens.",
"option_hi": "जींति भविए त्यंति",
"correct_answer": "When light enters a lens.",
"explanation_en": "When light enters an object, it gets refracted.",
"explanation_hi": "जींति भविए त्यंति",
"question_en": "What is the concept behind refraction?",
"question_hi": "जींति भविए त्यंति कींति भविए त्यंति",
"answer_en": "Refraction",
"answer_hi": "जींति भविए त्यंति",
"explanation_en": "When light passes through a medium, it bends and forms a new path.",
"explanation_hi": "जींति भविए त्यंति भविए त्यंति",
"option_en": "When light enters a medium, it changes direction.",
"option_hi": "जींति भविए त्यंति