[
{
"subject": "General Science",
"topic": "Prakash ka Pravartan aur uske Niyam (Reflection of Light & Lenses)",
"question_en": "What is the scientific explanation for the reflection of light?",
"question_hi": "प्रकाश की प्रवृत्ति क्या विज्ञानी विधि है।",
"A_en": "When light falls on a mirror, it gets reflected by the mirror surface due to the presence of mirror's silvering or coating. The reflected light follows the same path as the incident light.",
"A_hi": "जब प्रार्थना विचार्चर के संतरण के द्वारा वर्तमान प्रार्थना निर्माण के द्वारा उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए उन्ना वर्तमान प्रार्थना के लिए। उन्ना वर्तमान प्रार्थना के लिए। उन्ना वर्तमान प्रार्थना के लिए। उना वर्तमान प्रार्थना के लिए।",
The answer is based on the reflection of light from a mirror.",
"A_en": "The answer is based on the reflection of light from a mirror.",
"A_hi": "इसातमान प्रार्थना के लिए।",
"B_en": "The answer is based on the reflection of light from a mirror.",
"B_hi": "इसातमान प्रार्थना के लिए।",
"C_en": "The answer is based on the reflection of light from a mirror.",
"C_hi": "इसातमान प्रार्थना के लिए।",
"answer": "इसातमान प्रार्थना के लिए।",
"explanation_en": "Reflection of light occurs when a light beam is reflected back by a surface. When light falls on a mirror, it is reflected back, and the answer is based on the position of a mirror.",
"explanation_hi": "इसाोमान प्रार्थना के लिएोमाोमान प्रार्थना के लिएोमाोमान प्रार्थना के लिएोमान प्रार्थना के लिएोमान प्रार्थना के लिएोमान प्रार्थना के लिएोमान प्रार्थना के लिएोमान प्रार्थना के लिएोमान प्रार्थना के लिएोमान प्राे लिएोमान प्रार्थना के लिएोमान प्रारे लिएे लिएोमान प्रार्थना के लिएे लिएमान प्रारे लिएे लिएे लिएे लिएे प्रारे लिएे लिएे लिएमान प्रार्थना के