[
{
"subject": "General Science",
"topic": "Tatva, Yogik aur Mishran (Elements, Compounds, Mixtures)",
"question_en": "What is the difference between a compound and a mixture?",
"question_hi": "कंपाउंड और मिश्रण के बीच क्या अंतर है?",
"A_en": "A compound is a pure substance, whereas a mixture is a combination of two or more substances.", 
"A_hi": "कंपाउंड एक शुद्ध पदार्थ है, जबकि मिश्रण दो या दो से अधिक पदार्थों का मिश्रण है।",
"B_en": "A compound is a combination of two or more substances, whereas a mixture is a pure substance.", 
"B_hi": "कंपाउंड दो या दो से अधिक पदार्थों का मिश्रण है, जबकि मिश्रण एक शुद्ध पदार्थ है।",
"C_en": "A compound is a mixture of two or more substances, whereas a mixture is a compound.", 
"C_hi": "कंपाउंड दो या दो से अधिक पदार्थों का मिश्रण है, जबकि मिश्रण एक कंपाउंड है।",
"D_en": "A compound is a mixture of elements, whereas a mixture is a combination of compounds.", 
"D_hi": "कंपाउंड तत्वों का मिश्रण है, जबकि मिश्रण कंपाउंडों का संयोजन है।",
"answer": "A",
"explanation_en": "A compound is a pure substance with a fixed composition, whereas a mixture is a physical blend of two or more substances.",
"explanation_hi": "कंपाउंड एक शुद्ध पदार्थ है जिसकी एक निश्चित संरचना है, जबकि मिश्रण दो या दो से अधिक पदार्थों का शारीरिक मिश्रण है।"
},
{
"subject": "General Science",
"topic": "Tatva, Yogik aur Mishran (Elements, Compounds, Mixtures)",
"question_en": "What is the definition of an element?",
"question_hi": "तत्व की परिभाषा क्या है?",
"A_en": "An element is a pure substance that consists of only one type of atom.", 
"A_hi": "एक तत्व एक शुद्ध पदार्थ है जिसमें केवल एक प्रकार का परमाणु होता है।",
"B_en": "An element is a combination of two or more substances.", 
"B_hi": "एक तत्व दो या दो से अधिक पदार्थों का मिश्रण है।",
"C_en": "An element is a mixture of two or more substances.", 
"C_hi": "एक तत्व दो या दो से अधिक पदार्थों का मिश्रण है।",
"D_en": "An element is a compound of two or more elements.", 
"D_hi": "एक तत्व दो या दो से अधिक तत्वों का कंपाउंड है।",
"answer": "A",
"explanation_en": "An element is a pure substance that consists of only one type of atom.",
"explanation_hi": "एक तत्व एक शुद्ध पदार्थ है जिसमें केवल एक प्रकार का परमाणु होता है।"
},
{
"subject": "General Science",
"topic": "Tatva, Yogik aur Mishran (Elements, Compounds, Mixtures)",
"question_en": "What is the difference between an element and a compound?",
"question_hi": "तत्व और कंपाउंड के बीच क्या अंतर है?",
"A_en": "An element is a pure substance, whereas a compound is a mixture of two or more substances.", 
"A_hi": "एक तत्व एक शुद्ध पदार्थ है, जबकि कंपाउंड दो या दो से अधिक पदार्थों का मिश्रण है।",
"B_en": "An element is a mixture of two or more substances, whereas a compound is a pure substance.", 
"B_hi": "एक तत्व दो या दो से अधिक पदार्थों का मिश्रण है, जबकि कंपाउंड एक शुद्ध पदार्थ है।",
"C_en": "An element is a compound of two or more elements, whereas a compound is a mixture of elements.", 
"C_hi": "एक तत्व दो या दो से अधिक तत्वों का कंपाउंड है, जबकि कंपाउंड तत्वों का मिश्रण है।",
"D_en": "An element is a mixture of elements, whereas a compound is a combination of elements.", 
"D_hi": "एक तत्व तत्वों का मिश्रण है, जबकि कंपाउंड तत्वों का संयोजन है।",
"answer": "A",
"explanation_en": "An element is a pure substance with a fixed composition, whereas a compound is a mixture of two or more substances.",
"explanation_hi": "एक तत्व एक शुद्ध पदार्थ है जिसकी एक निश्चित संरचना है, जबकि कंपाउंड दो या दो से अधिक पदार्थों का मिश्रण है।"
},
{
"subject": "General Science",
"topic": "Tatva, Yogik aur Mishran (Elements, Compounds, Mixtures)",
"question_en": "What is the definition of a mixture?",
"question_hi": "मिश्रण की परिभाषा क्या है?",
"A_en": "A mixture is a physical blend of two or more substances.", 
"A_hi": "एक मिश्रण दो या दो से अधिक पदार्थों का शारीरिक मिश्रण है।",
"B_en": "A mixture is a combination of two or more elements.", 
"B_hi": "एक मिश्रण दो या दो से अधिक तत्वों का संयोजन है।",
"C_en": "A mixture is a compound of two or more substances.", 
"C_hi": "एक मिश्रण दो या दो से अधिक पदार्थों का कंपाउंड है।",
"D_en": "A mixture is a pure substance with a fixed composition.", 
"D_hi": "एक मिश्रण एक शुद्ध पदार्थ है जिसकी एक निश्चित संरचना है।",
"answer": "A",
"explanation_en": "A mixture is a physical blend of two or more substances, whereas a compound is a chemically bonded substance.",
"explanation_hi": "एक मिश्रण दो या दो से अधिक पदार्थों का शारीरिक मिश्रण है, जबकि कंपाउंड एक रासायनिक बंधित पदार्थ है।"
},
{
"subject": "General Science",
"topic": "Tatva, Yogik aur Mishran (Elements, Compounds, Mixtures)",
"question_en": "What is the difference between a homogeneous and a heterogeneous mixture?",
"question_hi": "समान और असमान मिश्रण के बीच क्या अंतर है?",
"A_en": "A homogeneous mixture is a mixture that has the same composition throughout, whereas a heterogeneous mixture is a mixture that has different composition in different parts.", 
"A_hi": "एक समान मिश्रण एक मिश्रण है जिसकी एक ही संरचना है, जबकि एक असमान मिश्रण एक मिश्रण है जिसकी अलग-अलग भागों में अलग-अलग संरचना है।",
"B_en": "A homogeneous mixture is a mixture that has different composition in different parts, whereas a heterogeneous mixture is a mixture that has the same composition throughout.", 
"B_hi": "एक समान मिश्रण एक मिश्रण है जिसकी अलग-अलग भागों में अलग-अलग संरचना है, जबकि एक असमान मिश्रण एक मिश्रण है जिसकी एक ही संरचना है।",
"C_en": "A homogeneous mixture is a mixture of two or more elements, whereas a heterogeneous mixture is a mixture of compounds.", 
"C_hi": "एक समान मिश्रण दो या दो से अधिक तत्वों का मिश्रण है, जबकि एक असमान मिश्रण कंपाउंडों का मिश्रण है।",
"D_en": "A homogeneous mixture is a compound of two or more elements, whereas a heterogeneous mixture is a mixture of compounds.", 
"D_hi": "एक समान मिश्रण दो या दो से अधिक तत्वों का कंपाउंड है, जबकि एक असमान मिश्रण कंपाउंडों का मिश्रण है।",
"answer": "A",
"explanation_en": "A homogeneous mixture has the same composition throughout, whereas a heterogeneous mixture has different composition in different parts.",
"explanation_hi": "एक समान मिश्रण एक ही संरचना है, जबकि एक असमान मिश्रण अलग-अलग संरचना है।"
},
{
"subject": "General Science",
"topic": "Tatva, Yogik aur Mishran (Elements, Compounds, Mixtures)",
"question_en": "What is the definition of a compound?",
"question_hi": "कंपाउंड की परिभाषा क्या है?",
"A_en": "A compound is a chemically bonded substance.", 
"A_hi": "कंपाउंड एक रासायनिक बंधित पदार्थ है।",
"B_en": "A compound is a mixture of two or more substances.", 
"B_hi": "कंपाउंड दो या दो से अधिक पदार्थों का मिश्रण है।",
"C_en": "A compound is a pure substance with a fixed composition.", 
"C_hi": "कंपाउंड एक शुद्ध पदार्थ है जिसकी एक निश्चित संरचना है।",
"D_en": "A compound is a mixture of elements.", 
"D_hi": "कंपाउंड तत्वों का मिश्रण है।",
"answer": "A",
"explanation_en": "A compound is a chemically bonded substance with a fixed composition.",
"explanation_hi": "कंपाउंड एक रासायनिक बंधित पदार्थ है जिसकी एक निश्चित संरचना है।"
},
{
"subject": "General Science",
"topic": "Tatva, Yogik aur Mishran (Elements, Compounds, Mixtures)",
"question_en": "What is the difference between a homogeneous and a heterogeneous solution?",
"question_hi": "समान और असमान समाधान के बीच क्या अंतर है?",
"A_en": "A homogeneous solution is a solution that has the same composition throughout, whereas a heterogeneous solution is a solution that has different composition in different parts.", 
"A_hi": "एक समान समाधान एक समाधान है जिसकी एक ही संरचना है, जबकि एक असमान समाधान एक समाधान है जिसकी अलग-अलग भागों में अलग-अलग संरचना है।",
"B_en": "A homogeneous solution is a solution that has different composition in different parts, whereas a heterogeneous solution is a solution that has the same composition throughout.", 
"B_hi": "एक समान समाधान एक समाधान है जिसकी अलग-अलग भागों में अलग-अलग संरचना है, जबकि एक असमान समाधान एक समाधान है जिसकी एक ही संरचना है।",
"C_en": "A homogeneous solution is a mixture of two or more elements, whereas a heterogeneous solution is a mixture of compounds.", 
"C_hi": "एक समान समाधान दो या दो से अधिक तत्वों का मिश्रण है, जबकि एक असमान समाधान कंपाउंडों का मिश्रण है।",
"D_en": "A homogeneous solution is a compound of two or more elements, whereas a heterogeneous solution is a mixture of compounds.", 
"D_hi": "एक समान समाधान दो या दो से अधिक तत्वों का कंपाउंड है, जबकि एक असमान समाधान कंपाउंडों का मिश्रण है।",
"answer": "A",
"explanation_en": "A homogeneous solution has the same composition throughout, whereas a heterogeneous solution has different composition in different parts.",
"explanation_hi": "एक समान समाधान एक ही संरचना है, जबकि एक असमान समाधान अलग-अलग संरचना है।"
},
{
"subject": "General Science",
"topic": "Tatva, Yogik aur Mishran (Elements, Compounds, Mixtures)",
"question_en": "What is the definition of an element?",
"question_hi": "तत्व की परिभाषा क्या है?",
"A_en": "An element is a pure substance that consists of only one type of atom.", 
"A_hi": "एक तत्व एक शुद्ध पदार्थ है जिसमें केवल एक प्रकार का परमाणु होता है।",
"B_en": "An element is a combination of two or more substances.", 
"B_hi": "एक तत्व दो या दो से अधिक पदार्थों का मिश्रण है।",
"C_en": "An element is a mixture of two or more substances.", 
"C_hi": "एक तत्व दो या दो से अधिक पदार्थों का मिश्रण है।",
"D_en": "An element is a compound of two or more elements.", 
"D_hi": "एक तत्व दो या दो से अधिक तत्वों का कंपाउंड है।",
"answer": "A",
"explanation_en": "An element is a pure substance that consists of only one type of atom.",
"explanation_hi": "एक तत्व एक शुद्ध पदार्थ है जिसमें केवल एक प्रकार का परमाणु होता है।"
},
{
"subject": "General Science",
"topic": "Tatva, Yogik aur Mishran (Elements, Compounds, Mixtures)",
"question_en": "What is the difference between a physical change and a chemical change?",
"question_hi": "शारीरिक परिवर्तन और रासायनिक परिवर्तन के बीच क्या अंतर है?",
"A_en": "A physical change is a change that does not affect the chemical composition of a substance, whereas a chemical change is a change that alters the chemical composition of a substance.", 
"A_hi": "एक शारीरिक परिवर्तन एक परिवर्तन है जो पदार्थ के रासायनिक संरचना को प्रभावित नहीं करता है, जबकि एक रासायनिक परिवर्तन एक परिवर्तन है जो पदार्थ की रासायनिक संरचना को बदलता है।",
"B_en": "A physical change is a change that alters the chemical composition of a substance, whereas a chemical change is a change that does not affect the chemical composition of a substance.", 
"B_hi": "एक शारीरिक परिवर्तन एक परिवर्तन है जो पदार्थ की रासायनिक संरचना को बदलता है, जबकि एक रासायनिक परिवर्तन एक परिवर्तन है जो पदार्थ की रासायनिक संरचना को प्रभावित नहीं करता है।",
"C_en": "A physical change is a chemical change of a substance, whereas a chemical change is a physical change.", 
"C_hi": "एक शारीरिक परिवर्तन पदार्थ का रासायनिक परिवर्तन है, जबकि एक रासायनिक परिवर्तन एक शारीरिक परिवर्तन है।",
"D_en": "A physical change is a change that affects the physical properties of a substance, whereas a chemical change is a change that affects the chemical properties of a substance.", 
"D_hi": "एक शारीरिक परिवर्तन एक परिवर्तन है जो पदार्थ के शारीरिक गुणों को प्रभावित करता है, जबकि एक रासायनिक परिवर्तन एक परिवर्तन है जो पदार्थ के रासायनिक गुणों को प्रभावित करता है।",
"answer": "A",
"explanation_en": "A physical change does not affect the chemical composition of a substance, whereas a chemical change alters the chemical composition of a substance.",
"explanation_hi": "एक शारीरिक परिवर्तन पदार्थ की रासायनिक संरचना को प्रभावित नहीं करता है, जबकि एक रासायनिक परिवर्तन पदार्थ की रासायनिक संरचना को बदलता है।"
}