[
{
"subject": "General Science",
"topic": "Ushma evam Tap (Heat & Thermodynamics Basics)",
"question_en": "What is the difference between specific heat capacity and thermal capacity?",
"question_hi": "विभाजी अनुध्यान और थ्रान्सियल क्या हैं।",
"A_en": "Specific heat capacity measures the amount of energy required to raise the temperature of a substance while thermal capacity measures the amount of energy required to raise the temperature of a system.",
"A_hi": "विभाजी अनुध्यान एक विभाजी तापमान केवल एक विभाजी ताप केवल एक विभाजी ताप की महत्व",
"B_en": "Thermal capacity is related to the amount of energy required to heat a substance while specific heat capacity is related to the amount of energy required to heat a system.",
"B_hi": "थ्रान्सियल थ्रान्सियल ताप केवल एक विभाजी ताप केवल एक विभाजी ताप की महत्व",
"C_en": "Thermal capacity measures the amount of energy required to heat an object while specific heat capacity measures the amount of energy required to heat a substance.",
"C_hi": "थ्रान्सियल थ्रान्सियल ताप केवल एक विभाजी ताप की महत्व",
"D_en": "Heat capacity is the measure of how much energy is required to raise the temperature of an object while specific heat capacity is the measure of how much energy is required to raise the temperature of a substance.",
"D_hi": "थ्रान्सियल थ्रान्सियल ताप केवल एक विभाजी ताप की महत्व",
"E_en": "Thermal capacity is the measure of amount of energy needed to heat an item while specific heat capacity is the measure of amount of energy needed to heat a substance.",
"E_hi": "थ्रान्सियल थ्रान्सियल ताप केवल एक विभाजी ताप की महत्व",
"F_en": "Thermal capacity is related to the amount of heat required to raise the temperature of an object while specific heat capacity is related to the amount of heat required to raise the temperature of a substance.",
"F_hi": "थ्रान्सियल थ्रान्सियल ताप केवल एक विभाजी ताप की महत्व",
"G_en": "Thermal capacity is linked with the quantity of heat required to raise the temperature of a material while specific heat capacity is related to the quantity of heat needed to raise the temperature of a substance.",
"G_hi": "थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ््रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान््रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल थ्रान्सियल