[
{
"subject": "Technology",
"topic": "Computer Networking",
"question_en": "What is the primary function of a router in a computer network?",
"question_hi": "कंप्यूटर नेटवर्क में राउटर का प्राथमिक कार्य क्या है?",
"A_en": "To connect multiple devices to the internet", "A_hi": "विभिन्न उपकरणों को इंटरनेट से जोड़ने के लिए",
"B_en": "To provide internet connectivity to a single device", "B_hi": "एक ही उपकरण को इंटरनेट कनेक्टिविटी प्रदान करने के लिए",
"C_en": "To direct data packets between networks", "C_hi": "नेटवर्क्स के बीच डेटा पैकेट्स को निर्देशित करने के लिए",
"D_en": "To provide power to a network", "D_hi": "नेटवर्क को शक्ति प्रदान करने के लिए",
"answer": "C",
"explanation_en": "A router's primary function is to direct data packets between networks, ensuring efficient data transfer.",
"explanation_hi": "राउटर का प्राथमिक कार्य नेटवर्क्स के बीच डेटा पैकेट्स को निर्देशित करना है, जिससे डेटा ट्रांसफर को सुविधाजनक बनाया जा सके।"
},
{
"subject": "Technology",
"topic": "Artificial Intelligence",
"question_en": "What is the primary goal of a machine learning model?",
"question_hi": "मशीन लर्निंग मॉडल का प्राथमिक उद्देश्य क्या है? ",
"A_en": "To make decisions based on historical data", "A_hi": "इतिहासिक डेटा पर निर्णय लेने के लिए",
"B_en": "To improve its performance over time", "B_hi": "समय के साथ अपनी प्रदर्शन को सुधारने के लिए",
"C_en": "To learn from its environment", "C_hi": "पर्यावरण से सीखने के लिए",
"D_en": "To replace human intelligence", "D_hi": "मानव बुद्धिमत्ता को बदलने के लिए",
"answer": "C",
"explanation_en": "Machine learning models aim to learn from their environment and improve their performance over time.",
"explanation_hi": "मशीन लर्निंग मॉडल समय के साथ पर्यावरण से सीखने का प्रयास करते हैं और अपनी प्रदर्शन को सुधारते हैं।"
},
{
"subject": "Technology",
"topic": "Cloud Computing",
"question_en": "What is the primary advantage of cloud computing?",
"question_hi": "क्लाउड कंप्यूटिंग का प्राथमिक लाभ क्या है? ",
"A_en": "Scalability and flexibility", "A_hi": "स्केलेबिलिटी और फ्लेक्सिबिलिटी",
"B_en": "Reduced capital expenditure", "B_hi": "कैपिटल व्यय की कमी",
"C_en": "Improved data security", "C_hi": "डेटा सुरक्षा में सुधार",
"D_en": "No need for maintenance", "D_hi": "संचालन की आवश्यकता नहीं है",
"answer": "A",
"explanation_en": "Cloud computing offers scalability and flexibility, allowing businesses to quickly adapt to changing needs.",
"explanation_hi": "क्लाउड कंप्यूटिंग स्केलेबिलिटी और फ्लेक्सिबिलिटी प्रदान करता है, जिससे व्यवसायों को जल्दी से बदलती जरूरतों के अनुसार ढाला जा सकता है।"
},
{
"subject": "Technology",
"topic": "Database Management",
"question_en": "What is the primary purpose of a database index?",
"question_hi": "डेटाबेस इंडेक्स का प्राथमिक उद्देश्य क्या है? ",
"A_en": "To improve data security", "A_hi": "डेटा सुरक्षा में सुधार करने के लिए",
"B_en": "To improve query performance", "B_hi": "प्रश्न प्रदर्शन में सुधार करने के लिए",
"C_en": "To reduce data redundancy", "C_hi": "डेटा रिडंडेंसी को कम करने के लिए",
"D_en": "To improve data integrity", "D_hi": "डेटा अखंडता में सुधार करने के लिए",
"answer": "B",
"explanation_en": "A database index is used to improve query performance by allowing the database to quickly locate specific data.",
"explanation_hi": "डेटाबेस इंडेक्स प्रश्न प्रदर्शन में सुधार करने के लिए उपयोग किया जाता है, जिससे डेटाबेस को जल्दी से विशिष्ट डेटा की स्थानांतरण को प्राप्त करने में मदद मिलती है।"
},
{
"subject": "Technology",
"topic": "Operating Systems",
"question_en": "What is the primary function of a kernel in an operating system?",
"question_hi": "ऑपरेटिंग सिस्टम में कोर्नेल का प्राथमिक कार्य क्या है? ",
"A_en": "To manage hardware resources", "A_hi": "हार्डवेयर संसाधनों का प्रबंधन करने के लिए",
"B_en": "To provide user interface", "B_hi": "उपयोगकर्ता इंटरफेस प्रदान करने के लिए",
"C_en": "To manage memory allocation", "C_hi": "मेमोरी आवंटन का प्रबंधन करने के लिए",
"D_en": "To manage file systems", "D_hi": "फ़ाइल सिस्टम का प्रबंधन करने के लिए",
"answer": "A",
"explanation_en": "The kernel's primary function is to manage hardware resources, such as CPU, memory, and I/O devices.",
"explanation_hi": "कोर्नेल का प्राथमिक कार्य हार्डवेयर संसाधनों का प्रबंधन करना है, जैसे कि CPU, मेमोरी और I/O उपकरण।"
},
{
"subject": "Technology",
"topic": "Networking",
"question_en": "What is the primary advantage of a wireless network?",
"question_hi": "वायरलेस नेटवर्क का प्राथमिक लाभ क्या है? ",
"A_en": "Increased security", "A_hi": "बढ़ी हुई सुरक्षा",
"B_en": "Reduced cables", "B_hi": "केबल की कमी",
"C_en": "Improved data transfer speed", "C_hi": "डेटा ट्रांसफर स्पीड में सुधार",
"D_en": "Increased scalability", "D_hi": "बढ़ी हुई स्केलेबिलिटी",
"answer": "B",
"explanation_en": "Wireless networks reduce the need for cables, making them easier to set up and more flexible.",
"explanation_hi": "वायरलेस नेटवर्क केबल की आवश्यकता को कम करते हैं, जिससे उन्हें सेटअप करना और अधिक फ्लेक्सिबल हो जाता है।"
},
{
"subject": "Technology",
"topic": "Database Management",
"question_en": "What is the primary purpose of a database schema?",
"question_hi": "डेटाबेस स्कीमा का प्राथमिक उद्देश्य क्या है? ",
"A_en": "To define the relationships between tables", "A_hi": "टेबलों के बीच संबंधों को परिभाषित करने के लिए",
"B_en": "To improve data security", "B_hi": "डेटा सुरक्षा में सुधार करने के लिए",
"C_en": "To improve query performance", "C_hi": "प्रश्न प्रदर्शन में सुधार करने के लिए",
"D_en": "To reduce data redundancy", "D_hi": "डेटा रिडंडेंसी को कम करने के लिए",
"answer": "A",
"explanation_en": "A database schema defines the relationships between tables, including the structure and organization of data.",
"explanation_hi": "डेटाबेस स्कीमा टेबलों के बीच संबंधों को परिभाषित करता है, जिसमें डेटा की संरचना और संगठन शामिल है।"
},
{
"subject": "Technology",
"topic": "Computer Hardware",
"question_en": "What is the primary function of a power supply unit (PSU) in a computer?",
"question_hi": "कंप्यूटर में पॉवर सप्लाई यूनिट (पीएसयू) का प्राथमिक कार्य क्या है? ",
"A_en": "To provide power to the CPU", "A_hi": "CPU को शक्ति प्रदान करने के लिए",
"B_en": "To provide power to the motherboard", "B_hi": "मदरबोर्ड को शक्ति प्रदान करने के लिए",
"C_en": "To regulate the power output", "C_hi": "शक्ति के उत्पादन को नियंत्रित करने के लिए",
"D_en": "To convert AC to DC power", "D_hi": "AC से DC शक्ति में परिवर्तन करने के लिए",
"answer": "D",
"explanation_en": "A power supply unit (PSU) converts AC power from the mains to DC power for the computer's components.",
"explanation_hi": "पॉवर सप्लाई यूनिट (पीएसयू) मेन्स से AC शक्ति को कंप्यूटर के घटकों के लिए DC शक्ति में परिवर्तित करता है।"
},
{
"subject": "Technology",
"topic": "Software Development",
"question_en": "What is the primary goal of a software development methodology?",
"question_hi": "सॉफ्टवेयर विकास विधि का प्राथमिक उद्देश्य क्या है? ",
"A_en": "To create a working software product", "A_hi": "काम करने वाले सॉफ्टवेयर उत्पाद का निर्माण करने के",
"B_en": "To improve software quality", "B_hi": "सॉफ्टवेयर गुणवत्ता में सुधार करने के",
"C_en": "To reduce development time and cost", "C_hi": "विकास समय और लागत को कम करने के",
"D_en": "To improve collaboration among team members", "D_hi": "टीम के सदस्यों के बीच सहयोग में सुधार करने के",
"answer": "B",
"explanation_en": "A software development methodology aims to improve software quality, scalability, and maintainability.",
"explanation_hi": "सॉफ्टवेयर विकास विधि सॉफ्टवेयर की गुणवत्ता, स्केलेबिलिटी और रखरखाव में सुधार करने का लक्ष्य रखती है।"
},
{
"subject": "Technology",
"topic": "Data Science",
"question_en": "What is the primary purpose of data visualization in data science?",
"question_hi": "डेटा साइंस में डेटा विज़ुअलाइजेशन का प्राथमिक उद्देश्य क्या है? ",
"A_en": "To improve data security", "A_hi": "डेटा सुरक्षा में सुधार करने के",
"B_en": "To improve data quality", "B_hi": "डेटा गुणवत्ता में सुधार करने के",
"C_en": "To communicate insights to stakeholders", "C_hi": "विश्लेषणों को स्टेकहोल्डर्स के साथ साझा करने के",
"D_en": "To reduce data redundancy", "D_hi": "डेटा रिडंडेंसी को कम करने के",
"answer": "C",
"explanation_en": "Data visualization in data science aims to communicate insights and findings to stakeholders in a clear and concise manner.",
"explanation_hi": "डेटा साइंस में डेटा विज़ुअलाइजेशन विश्लेषणों और निष्कर्षों को स्टेकहोल्डर्स के साथ साझा करने के लिए एक स्पष्ट और संक्षिप्त तरीके से संवाद करने का लक्ष्य रखता है।"
}