[
{
"subject": "Technology",
"topic": "Artificial Intelligence",
"question_en": "Which of the following is NOT a type of machine learning?",
"question_hi": "निम्नलिखित में से कौन-सा मशीन लर्निंग का प्रकार नहीं है?",
"A_en": "Supervised Learning", "A_hi": "सुपरवाइज़्ड लर्निंग",
"B_en": "Unsupervised Learning", "B_hi": "अनसुपरवाइज़्ड लर्निंग",
"C_en": "Reinforcement Learning", "C_hi": "रिइन्फोर्समेंट लर्निंग",
"D_en": "Static Learning", "D_hi": "स्टेटिक लर्निंग",
"answer": "D",
"explanation_en": "Static Learning is not a recognized type of machine learning; the main types are Supervised, Unsupervised, and Reinforcement Learning.",
"explanation_hi": "स्टेटिक लर्निंग मशीन लर्निंग का मान्य प्रकार नहीं है; मुख्य प्रकार हैं सुपरवाइज़्ड, अनसुपरवाइज़्ड और रिइन्फोर्समेंट लर्निंग।"
},
{
"subject": "Technology",
"topic": "Blockchain",
"question_en": "What does ‘block’ in a blockchain primarily contain?",
"question_hi": "ब्लॉकचेन में ‘ब्लॉक’ मुख्य रूप से क्या रखता है?",
"A_en": "Only hash of previous block", "A_hi": "केवल पिछले ब्लॉक का हैश",
"B_en": "Transaction data and hash", "B_hi": "लेन-देन डेटा और हैश",
"C_en": "Only timestamp", "C_hi": "केवल टाइमस्टैम्प",
"D_en": "User passwords", "D_hi": "उपयोगकर्ता पासवर्ड",
"answer": "B",
"explanation_en": "Each block contains transaction data along with its own hash and the hash of the previous block, ensuring integrity.",
"explanation_hi": "प्रत्येक ब्लॉक अपने लेन-देन डेटा के साथ अपना हैश और पिछले ब्लॉक का हैश रखता है, जिससे अखंडता सुनिश्चित होती है।"
},
{
"subject": "Technology",
"topic": "Cyber Security",
"question_en": "Which attack tricks users into clicking on a malicious link?",
"question_hi": "कौन-सा हमला उपयोगकर्ताओं को नुकसानदायक लिंक पर क्लिक करने के लिए बहलाता है?",
"A_en": "DDoS", "A_hi": "डीडीओएस",
"B_en": "Phishing", "B_hi": "फ़िशिंग",
"C_en": "Spoofing", "C_hi": "स्पूफिंग",
"D_en": "Tailgating", "D_hi": "टेलगेटिंग",
"answer": "B",
"explanation_en": "Phishing is a social-engineering attack that deceives users into clicking malicious links to steal credentials or install malware.",
"explanation_hi": "फ़िशिंग एक सोशल-इंजीनियरिंग हमला है जो उपयोगकर्ताओं को क्रेडेंशियल चुराने या मैलवेयर इंस्टॉल करने के लिए नुकसानदायक लिंक पर क्लिक करने के लिए धोखा देता है।"
},
{
"subject": "Technology",
"topic": "Cloud Computing",
"question_en": "Which service model provides hardware-level resources virtually?",
"question_hi": "कौन-सा सेवा मॉडल हार्डवेयर-स्तर के संसाधन वर्चुअल रूप से प्रदान करता है?",
"A_en": "SaaS", "A_hi": "सास",
"B_en": "PaaS", "B_hi": "पास",
"C_en": "IaaS", "C_hi": "इनफ्रास्ट्रक्चर अस ए सर्विस",
"D_en": "FaaS", "D_hi": "फंक्शन अस ए सर्विस",
"answer": "C",
"explanation_en": "Infrastructure as a Service (IaaS) delivers virtualized hardware such as servers, storage, and networks over the cloud.",
"explanation_hi": "इनफ्रास्ट्रक्चर अस ए सर्विस (IaaS) क्लाउड पर सर्वर, स्टोरेज और नेटवर्क जैसे वर्चुअलाइज़्ड हार्डवेयर प्रदान करता है।"
},
{
"subject": "Technology",
"topic": "5G",
"question_en": "What is the ideal latency target for 5G networks?",
"question_hi": "5G नेटवर्क के लिए आदर्श विलंबता लक्ष्य क्या है?",
"A_en": "1 ms", "A_hi": "1 मिलीसेकंड",
"B_en": "10 ms", "B_hi": "10 मिलीसेकंड",
"C_en": "100 ms", "C_hi": "100 मिलीसेकंड",
"D_en": "1 second", "D_hi": "1 सेकंड",
"answer": "A",
"explanation_en": "5G aims for ultra-low latency of about 1 millisecond to enable real-time applications like remote surgery and autonomous driving.",
"explanation_hi": "5G रियल-टाइम एप्लिकेशन जैसे रिमोट सर्जरी और ऑटोनोमस ड्राइविंग को सक्षम करने के लिए लगभग 1 मिलीसेकंड की अल्ट्रा-लो विलंबता लक्षित करता है।"
},
{
"subject": "Technology",
"topic": "Internet of Things",
"question_en": "Which protocol is lightweight and preferred for IoT battery-operated devices?",
"question_hi": "कौन-सा प्रोटोकॉल लाइटवेट है और IoT बैटरी-संचालित उपकरणों के लिए पसंद किया जाता है?",
"A_en": "HTTP", "A_hi": "एचटीटीपी",
"B_en": "MQTT", "B_hi": "एमक्यूटीटी",
"C_en": "FTP", "C_hi": "एफटीपी",
"D_en": "Telnet", "D_hi": "टेलनेट",
"answer": "B",
"explanation_en": "MQTT (Message Queuing Telemetry Transport) is a lightweight publish/subscribe protocol optimized for low-power IoT devices.",
"explanation_hi": "एमक्यूटीटी (Message Queuing Telemetry Transport) एक लाइटवेट प्रकाशित/सदस्यता प्रोटोकॉल है जो कम-शक्ति IoT उपकरणों के लिए अनुकूलित है।"
},
{
"subject": "Technology",
"topic": "Quantum Computing",
"question_en": "What is the basic unit of quantum information?",
"question_hi": "क्वांटम जानकारी की मूल इकाई क्या है?",
"A_en": "Bit", "A_hi": "बिट",
"B_en": "Byte", "B_hi": "बाइट",
"C_en": "Qubit", "C_hi": "क्यूबिट",
"D_en": "Photon", "D_hi": "फोटॉन",
"answer": "C",
"explanation_en": "A qubit, or quantum bit, can exist in superposition of 0 and 1, offering exponentially more computing states than a classical bit.",
"explanation_hi": "एक क्यूबिट, या क्वांटम बिट, 0 और 1 के सुपरपोज़िशन में मौजूद रह सकता है, जो क्लासिकल बिट की तुलना में घातीय रूप से अधिक कम्प्यूटिंग स्थितियाँ देता है।"
},
{
"subject": "Technology",
"topic": "Robotics",
"question_en": "Which sensor is most commonly used for obstacle detection in mobile robots?",
"question_hi": "मोबाइल रोबोट में बाधा पहचान के लिए सबसे अधिक कौन-सा सेंसर प्रयुक्त होता है?",
"A_en": "Humidity sensor", "A_hi": "आर्द्रता सेंसर",
"B_en": "Ultrasonic sensor", "B_hi": "अल्ट्रासोनिक सेंसर",
"C_en": "Gas sensor", "D_hi": "गैस सेंसर",
"D_en": "PH sensor", "D_hi": "पीएच सेंसर",
"answer": "B",
"explanation_en": "Ultrasonic sensors emit sound waves and measure echo time to calculate distance, making them ideal for real-time obstacle avoidance.",
"explanation_hi": "अल्ट्रासोनिक सेंसर ध्वनि तरंगें उत्सर्जित करता है और दूरी की गणना के लिए प्रतिध्वनि समय मापता है, जिससे यह रियल-टाइम बाधा परिहार के लिए आदर्श है।"
},
{
"subject": "Technology",
"topic": "Augmented Reality",
"question_en": "Which hardware is chiefly responsible for precise AR overlay alignment in smartphones?",
"question_hi": "स्मार्टफोन में सटीक AR ओवरले संरेखण के लिए मुख्य रूप से कौन-सा हार्डवेयर उत्तरदायी है?",
"A_en": "NFC chip", "A_hi": "एनएफसी चिप",
"B_en": "IMU (accelerometer & gyroscope)", "B_hi": "आईएमयू (एक्सेलेरोमीटर और जायरोस्कोप)",
"C_en": "FM receiver", "C_hi": "एफएम रिसीवर",
"D_en": "Vibrator motor", "D_hi": "वाइब्रेटर मोटर",
"answer": "B",
"explanation_en": "The Inertial Measurement Unit (IMU) tracks device orientation and motion, allowing AR software to anchor virtual objects accurately in the real world.",
"explanation_hi": "इनर्शियल मेज़रमेंट यूनिट (IMU) डिवाइस उन्मुखीकरण और गति को ट्रैक करता है, जिससे AR सॉफ्टवेयर वास्तविक दुनिया में वर्चुअल वस्तुओं को सटीक रूप से स्थापित कर सकता है।"
},
{
"subject": "Technology",
"topic": "Semiconductors",
"question_en": "Which Indian government scheme aims to boost domestic semiconductor manufacturing?",
"question_hi": "भारत सरकार का कौन-सा योजना घरेलू अर्धचालक विनिर्माण को बढ़ावा देने के लिए है?",
"A_en": "Digital India", "A_hi": "डिजिटल इंडिया",
"B_en": "PLI scheme for Semiconductors", "B_hi": "अर्धचालकों के लिए पीएलआई योजना",
"C_en": "Swachh Bharat Mission", "C_hi": "स्वच्छ भारत मिशन",
"D_en": "PM-KISAN", "D_hi": "प्रधानमंत्री-किसान",
"answer": "B",
"explanation_en": "The Production Linked Incentive (PLI) scheme for semiconductors offers financial incentives to companies setting up fabrication units in India.",
"explanation_hi": "अर्धचालकों के लिए उत्पादन से जुड़ी प्रोत्साहन (पीएलआई) योजना भारत में फैब्रिकेशन इकाइयाँ स्थापित करने वाली कंपनियों को वित्तीय प्रोत्साहन प्रदान करती है।"
}
]