[
{
"subject": "Technology",
"topic": "Artificial Intelligence",
"question_en": "Which of the following is a subset of AI that enables systems to learn from data?",
"question_hi": "निम्नलिखित में से कौन-सी AI की शाखा सिस्टम को डेटा से सीखने में सक्षम बनाती है?",
"A_en": "Blockchain", "A_hi": "ब्लॉकचेन",
"B_en": "Machine Learning", "B_hi": "मशीन लर्निंग",
"C_en": "Cloud Computing", "C_hi": "क्लाउड कंप्यूटिंग",
"D_en": "Cyber Security", "D_hi": "साइबर सुरक्षा",
"answer": "B",
"explanation_en": "Machine Learning is a subset of AI that provides systems the ability to automatically learn and improve from experience without being explicitly programmed.",
"explanation_hi": "मशीन लर्निंग AI की एक शाखा है जो सिस्टम को बिना स्पष्ट प्रोग्रामिंग के अनुभव से स्वचालित रूप से सीखने और सुधारने की क्षमता देती है।"
},
{
"subject": "Technology",
"topic": "Artificial Intelligence",
"question_en": "Which programming language is most widely used for AI development?",
"question_hi": "AI विकास के लिए सबसे अधिक उपयोग होने वाली प्रोग्रामिंग भाषा कौन-सी है?",
"A_en": "Java", "A_hi": "जावा",
"B_en": "C++", "B_hi": "सी++",
"C_en": "Python", "C_hi": "पायथन",
"D_en": "Ruby", "D_hi": "रूबी",
"answer": "C",
"explanation_en": "Python is the most popular language for AI due to its simplicity and extensive libraries like TensorFlow, PyTorch, and scikit-learn.",
"explanation_hi": "Python अपनी सरलता और TensorFlow, PyTorch व scikit-learn जैसे विस्तृत लाइब्रेरीज़ के कारण AI के लिए सबसे लोकप्रिय भाषा है।"
},
{
"subject": "Technology",
"topic": "Artificial Intelligence",
"question_en": "What does NLP stand for in AI?",
"question_hi": "AI में NLP का क्या अर्थ है?",
"A_en": "Natural Language Processing", "A_hi": "नेचुरल लैंग्वेज प्रोसेसिंग",
"B_en": "Neural Logic Programming", "B_hi": "न्यूरल लॉजिक प्रोग्रामिंग",
"C_en": "Network Layer Protocol", "C_hi": "नेटवर्क लेयर प्रोटोकॉल",
"D_en": "Numeric Learning Package", "D_hi": "न्यूमेरिक लर्निंग पैकेज",
"answer": "A",
"explanation_en": "Natural Language Processing (NLP) is a branch of AI that helps computers understand, interpret and manipulate human language.",
"explanation_hi": "नेचुरल लैंग्वेज प्रोसेसिंग (NLP) AI की एक शाखा है जो कंप्यूटरों को मानव भाषा को समझने, व्याख्या करने और नियंत्रित करने में मदद करती है।"
},
{
"subject": "Technology",
"topic": "Artificial Intelligence",
"question_en": "Which of these is an AI system developed by Google that defeated a Go world champion?",
"question_hi": "इनमें से कौन-सी AI सिस्टम Google द्वारा विकसित है जिसने गो (Go) विश्व चैंपियन को हराया?",
"A_en": "Watson", "A_hi": "वॉटसन",
"B_en": "AlphaGo", "B_hi": "अल्फा गो",
"C_en": "Siri", "C_hi": "सिरी",
"D_en": "Cortana", "C_hi": "कोर्टाना",
"answer": "B",
"explanation_en": "AlphaGo, developed by DeepMind (a subsidiary of Google), famously defeated world Go champion Lee Sedol in 2016.",
"explanation_hi": "DeepMind (Google की सहायक कंपनी) द्वारा विकसित AlphaGo ने 2016 में गो विश्व चैंपियन ली सेडोल को प्रसिद्ध रूप से हराया था।"
},
{
"subject": "Technology",
"topic": "Artificial Intelligence",
"question_en": "Which algorithm is commonly used for image recognition in AI?",
"question_hi": "AI में इमेज रिकग्निशन के लिए सामान्यतः कौन-सा एल्गोरिद्म उपयोग होता है?",
"A_en": "Linear Regression", "A_hi": "लिनियर रिग्रेशन",
"B_en": "Convolutional Neural Network", "B_hi": "कनवल्यूशनल न्यूरल नेटवर्क",
"C_en": "K-Means", "B_hi": "के-मीन्स",
"D_en": "Decision Tree", "D_hi": "डिसीजन ट्री",
"answer": "B",
"explanation_en": "Convolutional Neural Networks (CNNs) are specifically designed to process grid-like data such as images, making them highly effective for image recognition tasks.",
"explanation_hi": "कनवल्यूशनल न्यूरल नेटवर्क (CNN) विशेष रूप से इमेज जैसी ग्रिड-जैसी डेटा प्रोसेस करने के लिए बनाए गए हैं, जिससे यह इमेज रिकग्निशन कार्यों में अत्यधिक प्रभावी होते हैं।"
},
{
"subject": "Technology",
"topic": "Artificial Intelligence",
"question_en": "Which of the following is an example of an AI-powered virtual assistant?",
"question_hi": "निम्नलिखित में से कौन-सा AI-संचालित वर्चुअल सहायक का उदाहरण है?",
"A_en": "Microsoft Word", "A_hi": "माइक्रोसॉफ्ट वर्ड",
"B_en": "Adobe Photoshop", "B_hi": "एडोब फोटोशॉप",
"C_en": "Amazon Alexa", "C_hi": "अमेज़न एलेक्सा",
"D_en": "Google Chrome", "D_hi": "गूगल क्रोम",
"answer": "C",
"explanation_en": "Amazon Alexa is an AI-powered virtual assistant that can perform tasks or services based on voice commands.",
"explanation_hi": "अमेज़न एलेक्सा एक AI-संचालित वर्चुअल सहायक है जो वॉयस कमांड के आधार पर कार्य या सेवाएं कर सकती है।"
},
{
"subject": "Technology",
"topic": "Artificial Intelligence",
"question_en": "What is the full form of ANN in AI?",
"question_hi": "AI में ANN का पूर्ण रूप क्या है?",
"A_en": "Artificial Neural Network", "A_hi": "आर्टिफिशियल न्यूरल नेटवर्क",
"B_en": "Automatic Network Node", "B_hi": "ऑटोमैटिक नेटवर्क नोड",
"C_en": "Advanced Neural Node", "C_hi": "एडवांस्ड न्यूरल नोड",
"D_en": "Analog Network Number", "D_hi": "एनालॉग नेटवर्क नंबर",
"answer": "A",
"explanation_en": "Artificial Neural Network (ANN) is a computing system inspired by the biological neural networks that constitute animal brains.",
"explanation_hi": "आर्टिफिशियल न्यूरल नेटवर्क (ANN) एक कंप्यूटिंग सिस्टम है जो जीवित जंतुओं के मस्तिष्क बनाने वाले जैविक न्यूरल नेटवर्क से प्रेरित है।"
},
{
"subject": "Technology",
"topic": "Artificial Intelligence",
"question_en": "Which Indian AI-based app won the ‘AI for Good’ award at the 2022 World Summit AI?",
"question_hi": "कौन-सा भारतीय AI-आधारित ऐप 2022 के वर्ल्ड समिट AI में ‘AI for Good’ पुरस्कार जीता?",
"A_en": "Aarogya Setu", "A_hi": "आरोग्य सेतु",
"B_en": "DigiYatra", "B_hi": "डिजियात्रा",
"C_en": "GitaGPT", "C_hi": "गीता जीपीटी",
"D_en": "Bhashini", "D_hi": "भाषिनी",
"answer": "D",
"explanation_en": "Bhashini, an AI-driven language translation platform developed by the Indian government, won the ‘AI for Good’ award for promoting inclusive digital communication.",
"explanation_hi": "भाषिनी, भारत सरकार द्वारा विकसित AI-संचालित भाषा अनुवाद प्लेटफॉर्म, समावेशी डिजिटल संचार को बढ़ावा देने के लिए ‘AI for Good’ पुरस्कार जीता।"
},
{
"subject": "Technology",
"topic": "Artificial Intelligence",
"question_en": "Which of these is NOT a type of machine learning?",
"question_hi": "इनमें से कौन-सा मशीन लर्निंग का प्रकार नहीं है?",
"A_en": "Reinforcement Learning", "A_hi": "रिइन्फोर्समेंट लर्निंग",
"B_en": "Unsupervised Learning", "B_hi": "अनसुपरवाइज़्ड लर्निंग",
"C_en": "Supervised Learning", "C_hi": "सुपरवाइज़्ड लर्निंग",
"D_en": "Static Learning", "D_hi": "स्टेटिक लर्निंग",
"answer": "D",
"explanation_en": "The main types of machine learning are supervised, unsupervised, and reinforcement learning; 'Static Learning' is not a recognized category.",
"explanation_hi": "मशीन लर्निंग के मुख्य प्रकार सुपरवाइज़्ड, अनसुपरवाइज़्ड और रिइन्फोर्समेंट लर्निंग होते हैं; ‘स्टेटिक लर्निंग’ कोई मान्य श्रेणी नहीं है।"
},
{
"subject": "Technology",
"topic": "Artificial Intelligence",
"question_en": "Which AI model developed by OpenAI is known for generating human-like text?",
"question_hi": "ओपनएआई द्वारा विकसित कौन-सा AI मॉडल मानव-जैसा टेक्स्ट उत्पन्न करने के लिए जाना जाता है?",
"A_en": "WaveNet", "A_hi": "वेवनेट",
"B_en": "GPT", "B_hi": "जीपीटी",
"C_en": "ResNet", "C_hi": "रेसनेट",
"D_en": "BERT", "D_hi": "बर्ट",
"answer": "B",
"explanation_en": "GPT (Generative Pre-trained Transformer) models developed by OpenAI are designed to generate coherent and contextually relevant human-like text.",
"explanation_hi": "ओपनएआई द्वारा विकसित GPT (जेनेरेटिव प्री-ट्रेंसफॉर्मर) मॉडल सुसंगत और संदर्भानुसार मानव-जैसा टेक्स्ट उत्पन्न करने के लिए डिज़ाइन किए गए हैं।"
}
]