[
{
"subject": "Technology",
"topic": "AI and Machine Learning",
"question_en": "What is the primary function of a Convolutional Neural Network (CNN) in image processing?",
"question_hi": "चित्र शोधन में कॉनवोल्यूशनल न्यूरल नेटवर्क (CNN) की प्राथमिक क्रिया क्या है?",
"A_en": "Text recognition", "A_hi": "शब्द स्वीकृति",
"B_en": "Image classification", "B_hi": "चित्र वर्गीकरण",
"C_en": "Object detection", "C_hi": "वस्तु की पहचान",
"D_en": "Feature extraction", "D_hi": "गुण संग्रहण",
"answer": "D",
"explanation_en": "Convolutional Neural Networks (CNNs) are primarily used for feature extraction in image processing.",
"explanation_hi": "चित्र शोधन में कॉनवोल्यूशनल न्यूरल नेटवर्क (CNNs) का प्राथमिक उपयोग गुण संग्रहण है।"
},
{
"subject": "Technology",
"topic": "Data Structures",
"question_en": "What is the time complexity of searching an element in a Binary Search Tree (BST)?",
"question_hi": "बाइनरी सर्च ट्री (BST) में एक तत्व की खोज करने का समय जटिलता क्या है?",
"A_en": "O(1)", "A_hi": "O(1)",
"B_en": "O(log n)", "B_hi": "O(log n)",
"C_en": "O(n)", "C_hi": "O(n)",
"D_en": "O(n log n)", "D_hi": "O(n log n)",
"answer": "B",
"explanation_en": "The time complexity of searching an element in a Binary Search Tree (BST) is O(log n).",
"explanation_hi": "बाइनरी सर्च ट्री (BST) में एक तत्व की खोज करने का समय जटिलता O(log n) है।"
},
{
"subject": "Technology",
"topic": "Computer Networking",
"question_en": "What is the primary function of a DNS server in a network?",
"question_hi": "नेटवर्क में DNS सर्वर की प्राथमिक क्रिया क्या है?",
"A_en": "Routing packets", "A_hi": "पैकेट का मार्गदर्शन",
"B_en": "Resolving domain names", "B_hi": "डोमेन नामों का समाधान",
"C_en": "Providing email services", "C_hi": "ईमेल सेवाएं प्रदान करना",
"D_en": "Managing network security", "D_hi": "नेटवर्क सुरक्षा प्रबंधन",
"answer": "B",
"explanation_en": "The primary function of a DNS server is to resolve domain names to their corresponding IP addresses.",
"explanation_hi": "DNS सर्वर की प्राथमिक क्रिया डोमेन नामों का समाधान करना है, जिससे उनके संबंधित IP पतों का पता लगाया जा सके।"
},
{
"subject": "Technology",
"topic": "Operating Systems",
"question_en": "What is the purpose of a Page Table in a memory management system?",
"question_hi": "मेमोरी प्रबंधन प्रणाली में पेज टेबल का उद्देश्य क्या है?",
"A_en": "To manage free memory", "A_hi": "मुक्त मेमोरी का प्रबंधन करना",
"B_en": "To allocate memory to processes", "B_hi": "प्रोसेसों को मेमोरी आवंटित करना",
"C_en": "To store page table entries", "C_hi": "पेज टेबल एंट्री संग्रहीत करना",
"D_en": "To handle page faults", "D_hi": "पेज फॉल्ट को संभालना",
"answer": "C",
"explanation_en": "The primary purpose of a Page Table is to store page table entries, which map virtual addresses to physical addresses.",
"explanation_hi": "प्राथमिक उद्देश्य पेज टेबल का है कि वह पेज टेबल एंट्री संग्रहीत करे, जो वर्चुअल एड्रेस को फिजिकल एड्रेस से जोड़ता है।"
},
{
"subject": "Technology",
"topic": "Database Management Systems",
"question_en": "What is the difference between a primary key and a foreign key in a database?",
"question_hi": "डेटाबेस में प्राथमिक कुंजी और विदेशी कुंजी के बीच अंतर क्या है? ",
"A_en": "A primary key is a unique identifier, while a foreign key is a reference to another table.", "A_hi": "प्राथमिक कुंजी एक अद्वितीय पहचानकर्ता है, जबकि विदेशी कुंजी दूसरे टेबल का संदर्भ है।",
"B_en": "A primary key is a reference to another table, while a foreign key is a unique identifier.", "B_hi": "प्राथमिक कुंजी दूसरे टेबल का संदर्भ है, जबकि विदेशी कुंजी एक अद्वितीय पहचानकर्ता है।",
"C_en": "A primary key is used for data integrity, while a foreign key is used for data relationships.", "C_hi": "प्राथमिक कुंजी डेटा प्रामाणिकता के लिए उपयोग की जाती है, जबकि विदेशी कुंजी डेटा संबंधों के लिए उपयोग की जाती है।",
"D_en": "A primary key is used for data relationships, while a foreign key is used for data integrity.", "D_hi": "प्राथमिक कुंजी डेटा संबंधों के लिए उपयोग की जाती है, जबकि विदेशी कुंजी डेटा प्रामाणिकता के लिए उपयोग की जाती है।",
"answer": "A",
"explanation_en": "A primary key is a unique identifier, while a foreign key is a reference to another table.",
"explanation_hi": "प्राथमिक कुंजी एक अद्वितीय पहचानकर्ता है, जबकि विदेशी कुंजी दूसरे टेबल का संदर्भ है।"
},
{
"subject": "Technology",
"topic": "Web Development",
"question_en": "What is the purpose of a JavaScript library like jQuery?",
"question_hi": "जावास्क्रिप्ट लाइब्रेरी जैसे कि जक्वेरी का उद्देश्य क्या है?",
"A_en": "To add custom CSS styles", "A_hi": "अपने स्वयं के कस्टम CSS शैलियाँ जोड़ने के लिए",
"B_en": "To simplify JavaScript code", "B_hi": "जावास्क्रिप्ट कोड को सादगीकृत करने के लिए",
"C_en": "To handle user interactions", "C_hi": "उपयोगकर्ता के इंटरफेस को संभालने के लिए",
"D_en": "To secure web applications", "D_hi": "वेब अनुप्रयोगों को सुरक्षित करने के लिए",
"answer": "B",
"explanation_en": "The purpose of a JavaScript library like jQuery is to simplify JavaScript code, making it easier to write and maintain.",
"explanation_hi": "जावास्क्रिप्ट लाइब्रेरी जैसे कि जक्वेरी का उद्देश्य जावास्क्रिप्ट कोड को सादगीकृत करना है, जिससे यह लिखना और बनाए रखना आसान हो।"
},
{
"subject": "Technology",
"topic": "Computer Architecture",
"question_en": "What is the primary function of a CPU's Arithmetic Logic Unit (ALU)?",
"question_hi": "सीपीयू के अलू (ALU) की प्राथमिक क्रिया क्या है?",
"A_en": "To perform input/output operations", "A_hi": "इनपुट/आउटपुट ऑपरेशन करने के लिए",
"B_en": "To execute instructions from the CPU's cache", "B_hi": "सीपीयू के कैश से निर्देशों को कार्यान्वित करने के लिए",
"C_en": "To perform arithmetic and logical operations", "C_hi": "गणितीय और तर्कसंगत ऑपरेशन करने के लिए",
"D_en": "To manage system memory", "D_hi": "सिस्टम मेमोरी का प्रबंधन करने के लिए",
"answer": "C",
"explanation_en": "The primary function of a CPU's Arithmetic Logic Unit (ALU) is to perform arithmetic and logical operations.",
"explanation_hi": "सीपीयू के अलू की प्राथमिक क्रिया गणितीय और तर्कसंगत ऑपरेशन करना है।"
},
{
"subject": "Technology",
"topic": "Cloud Computing",
"question_en": "What is the benefit of using a cloud-based infrastructure?",
"question_hi": "क्लाउड-आधारित इंफ्रास्ट्रक्चर का उपयोग करते समय इसका लाभ क्या है?",
"A_en": "Improved scalability", "A_hi": "बेहतर पैमाना",
"B_en": "Increased security", "B_hi": "बढ़ी हुई सुरक्षा",
"C_en": "Reduced costs", "C_hi": "लागत में कमी",
"D_en": "All of the above", "D_hi": "ऊपर दिए गए सभी",
"answer": "D",
"explanation_en": "The benefits of using a cloud-based infrastructure include improved scalability, increased security, and reduced costs.",
"explanation_hi": "क्लाउड-आधारित इंफ्रास्ट्रक्चर का उपयोग करने से बेहतर पैमाना, बढ़ी हुई सुरक्षा, और लागत में कमी होती है।"
},
{
"subject": "Technology",
"topic": "Networking Fundamentals",
"question_en": "What is the purpose of a router in a network?",
"question_hi": "नेटवर्क में राउटर का उद्देश्य क्या है?",
"A_en": "To connect devices to the internet", "A_hi": "उपकरणों को इंटरनेट से जोड़ने के लिए",
"B_en": "To route packets between networks", "B_hi": "नेटवर्क के बीच पैकेट को मार्गदर्शन करने के लिए",
"C_en": "To provide email services", "C_hi": "ईमेल सेवाएं प्रदान करने के लिए",
"D_en": "To manage network security", "D_hi": "नेटवर्क सुरक्षा प्रबंधन करने के लिए",
"answer": "B",
"explanation_en": "The purpose of a router is to route packets between networks.",
"explanation_hi": "राउटर का उद्देश्य नेटवर्क के बीच पैकेट को मार्गदर्शन करना है।"
},
{
"subject": "Technology",
"topic": "Database Administration",
"question_en": "What is the purpose of indexing in a database?",
"question_hi": "डेटाबेस में इंडेक्सिंग का उद्देश्य क्या है? ",
"A_en": "To improve data security", "A_hi": "डेटा सुरक्षा में सुधार करने के लिए",
"B_en": "To increase data storage capacity", "B_hi": "डेटा संग्रहण क्षमता बढ़ाने के लिए",
"C_en": "To improve query performance", "C_hi": "प्रश्न प्रदर्शन में सुधार करने के लिए",
"D_en": "To reduce data redundancy", "D_hi": "डेटा दублиकेशन को कम करने के लिए",
"answer": "C",
"explanation_en": "The purpose of indexing is to improve query performance by allowing the database to quickly locate and retrieve data.",
"explanation_hi": "इंडेक्सिंग का उद्देश्य प्रश्न प्रदर्शन में सुधार करना है, जिससे डेटाबेस को जल्दी से डेटा का पता लगाना और प्राप्त करना आसान हो जाता है।"
}