[
{
"subject": "Technology",
"topic": "Computer Networks",
"question_en": "What is the primary function of a router in a computer network?",
"question_hi": "एक कंप्यूटर नेटवर्क में राउटर का मुख्य कार्य क्या है?",
"A_en": "To provide power to devices", "A_hi": "डिवाइस को पावर प्रदान करना",
"B_en": "To connect devices to the internet", "B_hi": "डिवाइस को इंटरनेट से जोड़ना",
"C_en": "To direct traffic between networks", "C_hi": "नेटवर्क के बीच ट्रैफिक को निर्देशित करना",
"D_en": "To provide storage to devices", "D_hi": "डिवाइस को स्टोरेज प्रदान करना",
"answer": "C",
"explanation_en": "A router's primary function is to direct traffic between networks, allowing devices to communicate with each other.",
"explanation_hi": "राउटर का मुख्य कार्य नेटवर्क के बीच ट्रैफिक को निर्देशित करना है, जिससे डिवाइस एक-दूसरे से संवाद कर सकें।"
},
{
"subject": "Technology",
"topic": "Artificial Intelligence",
"question_en": "What is the primary goal of machine learning?",
"question_hi": "मशीन लर्निंग का प्राथमिक उद्देश्य क्या है?",
"A_en": "To make decisions based on human intuition", "A_hi": "मानव प्रवृत्ति पर निर्णय लेना",
"B_en": "To analyze and understand human behavior", "B_hi": "मानव व्यवहार का विश्लेषण और समझना",
"C_en": "To enable machines to learn from data", "C_hi": "डेटा से मशीनों को सीखने की अनुमति देना",
"D_en": "To create autonomous robots", "D_hi": "स्वायत्त रोबोट बनाना",
"answer": "C",
"explanation_en": "The primary goal of machine learning is to enable machines to learn from data, allowing them to improve their performance on a task over time.",
"explanation_hi": "मशीन लर्निंग का प्राथमिक उद्देश्य डेटा से मशीनों को सीखने की अनुमति देना है, जिससे उन्हें समय के साथ किसी कार्य पर अपनी प्रदर्शन में सुधार करने की अनुमति मिलती है।"
},
{
"subject": "Technology",
"topic": "Database Management",
"question_en": "What is the purpose of normalization in database design?",
"question_hi": "डेटाबेस डिज़ाइन में नॉर्मलाइजेशन का उद्देश्य क्या है?",
"A_en": "To reduce data redundancy", "A_hi": "डेटा रिडंडेंसी को कम करना",
"B_en": "To improve data security", "B_hi": "डेटा सुरक्षा में सुधार करना",
"C_en": "To increase data storage capacity", "C_hi": "डेटा स्टोरेज क्षमता को बढ़ाना",
"D_en": "To improve data retrieval efficiency", "D_hi": "डेटा रिकवरी की दक्षता में सुधार करना",
"answer": "A",
"explanation_en": "Normalization in database design is used to reduce data redundancy, ensuring that each piece of data is stored in one place and one place only.",
"explanation_hi": "डेटाबेस डिज़ाइन में नॉर्मलाइजेशन का उपयोग डेटा रिडंडेंसी को कम करने के लिए किया जाता है, जिससे प्रत्येक डेटा को एक ही स्थान पर और एक ही स्थान पर ही संग्रहीत किया जा सके।"
},
{
"subject": "Technology",
"topic": "Networking",
"question_en": "What is the difference between a hub and a switch in a network?",
"question_hi": "नेटवर्क में हब और स्विच के बीच अंतर क्या है?",
"A_en": "A hub connects multiple devices to the internet", "A_hi": "हब डिवाइस को इंटरनेट से जोड़ता है",
"B_en": "A switch connects multiple devices to each other", "B_hi": "स्विच डिवाइस को एक-दूसरे से जोड़ता है",
"C_en": "A hub is faster than a switch", "C_hi": "हब स्विच से तेज है",
"D_en": "A switch is more secure than a hub", "D_hi": "स्विच हब से सुरक्षित है",
"answer": "B",
"explanation_en": "A switch is used to connect multiple devices to each other, allowing them to communicate with each other, while a hub is used to connect devices to the internet.",
"explanation_hi": "स्विच का उपयोग डिवाइस को एक-दूसरे से जोड़ने के लिए किया जाता है, जिससे वे एक-दूसरे से संवाद कर सकें, जबकि हब का उपयोग डिवाइस को इंटरनेट से जोड़ने के लिए किया जाता है।"
},
{
"subject": "Technology",
"topic": "Cyber Security",
"question_en": "What is the purpose of a firewall in a computer system?",
"question_hi": "कंप्यूटर सिस्टम में फ़ायरवॉल का उद्देश्य क्या है?",
"A_en": "To allow hackers to access the system", "A_hi": "हैकर्स को सिस्टम में प्रवेश करने की अनुमति देना",
"B_en": "To block unauthorized access to the system", "B_hi": "अनधिकृत प्रवेश को ब्लॉक करना",
"C_en": "To improve system performance", "C_hi": "सिस्टम की प्रदर्शन में सुधार करना",
"D_en": "To provide data backup", "D_hi": "डेटा बैकअप प्रदान करना",
"answer": "B",
"explanation_en": "A firewall is used to block unauthorized access to the system, preventing hackers from accessing sensitive data.",
"explanation_hi": "फ़ायरवॉल का उपयोग अनधिकृत प्रवेश को ब्लॉक करने के लिए किया जाता है, जिससे हैकर्स सेंसिटिव डेटा तक पहुँच नहीं पाएंगे।"
},
{
"subject": "Technology",
"topic": "Operating System",
"question_en": "What is the primary function of a kernel in an operating system?",
"question_hi": "ऑपरेटिंग सिस्टम में कोर्नेल का प्राथमिक कार्य क्या है?",
"A_en": "To manage user interfaces", "A_hi": "उपयोगकर्ता इंटरफ़ेस का प्रबंधन करना",
"B_en": "To manage hardware resources", "B_hi": "हार्डवेयर संसाधनों का प्रबंधन करना",
"C_en": "To provide file management", "C_hi": "फ़ाइल प्रबंधन प्रदान करना",
"D_en": "To enable multitasking", "D_hi": "मल्टीटास्किंग को सक्षम करना",
"answer": "B",
"explanation_en": "The kernel is responsible for managing hardware resources, such as memory and CPU, in an operating system.",
"explanation_hi": "कोर्नेल हार्डवेयर संसाधनों का प्रबंधन, जैसे कि मेमोरी और CPU, ऑपरेटिंग सिस्टम में जिम्मेदार होता है।"
},
{
"subject": "Technology",
"topic": "Data Structures",
"question_en": "What is the difference between a stack and a queue in data structures?",
"question_hi": "डेटा संरचना में स्टैक और क्यू के बीच अंतर क्या है?",
"A_en": "A stack uses FIFO, while a queue uses LIFO", "A_hi": "स्टैक FIFO का उपयोग करता है, जबकि क्यू LIFO का उपयोग करता है",
"B_en": "A stack uses LIFO, while a queue uses FIFO", "B_hi": "स्टैक LIFO का उपयोग करता है, जबकि क्यू FIFO का उपयोग करता है",
"C_en": "A stack is faster than a queue", "C_hi": "स्टैक क्वू से तेज है",
"D_en": "A queue is more secure than a stack", "D_hi": "क्यू स्टैक से सुरक्षित है",
"answer": "B",
"explanation_en": "A stack uses LIFO (Last In, First Out) data structure, while a queue uses FIFO (First In, First Out) data structure.",
"explanation_hi": "स्टैक LIFO (लास्ट इन, फ़र्स्ट आउट) डेटा संरचना का उपयोग करता है, जबकि क्यू FIFO (फ़र्स्ट इन, फ़र्स्ट आउट) डेटा संरचना का उपयोग करता है।"
},
{
"subject": "Technology",
"topic": "Cloud Computing",
"question_en": "What is the primary benefit of cloud computing?",
"question_hi": "क्लाउड कंप्यूटिंग का प्राथमिक लाभ क्या है?",
"A_en": "Increased storage capacity", "A_hi": "संग्रहण क्षमता में वृद्धि",
"B_en": "Improved data security", "B_hi": "डेटा सुरक्षा में सुधार",
"C_en": "Scalability and flexibility", "C_hi": "स्केलेबिलिटी और फ्लेक्सिबिलिटी",
"D_en": "Reduced maintenance costs", "D_hi": "रखरखाव की लागत में कमी",
"answer": "C",
"explanation_en": "Cloud computing provides scalability and flexibility, allowing users to quickly scale their resources up or down as needed.",
"explanation_hi": "क्लाउड कंप्यूटिंग स्केलेबिलिटी और फ्लेक्सिबिलिटी प्रदान करता है, जिससे उपयोगकर्ताओं को जल्दी से अपने संसाधनों को आवश्यकतानुसार बढ़ा या घटा सकते हैं।"
},
{
"subject": "Technology",
"topic": "Networking Protocols",
"question_en": "What is the primary function of TCP/IP protocol?",
"question_hi": "टीसीपी/आईपी प्रोटोकॉल का प्राथमिक कार्य क्या है?",
"A_en": "To provide email services", "A_hi": "ईमेल सेवाएं प्रदान करना",
"B_en": "To manage network devices", "B_hi": "नेटवर्क डिवाइस प्रबंधित करना",
"C_en": "To enable communication between devices", "C_hi": "डिवाइस के बीच संवाद को सक्षम करना",
"D_en": "To provide data encryption", "D_hi": "डेटा एन्क्रिप्शन प्रदान करना",
"answer": "C",
"explanation_en": "TCP/IP protocol is used to enable communication between devices, allowing them to send and receive data over a network.",
"explanation_hi": "टीसीपी/आईपी प्रोटोकॉल का उपयोग डिवाइस के बीच संवाद को सक्षम करने के लिए किया जाता है, जिससे उन्हें नेटवर्क पर डेटा भेजने और प्राप्त करने में सक्षम होते हैं।"
}