[
{
"subject": "Technology",
"topic": "Artificial Intelligence",
"question_en": "What is the primary function of an Artificial Neural Network (ANN)?",
"question_hi": "एर्थिफ़िशियल न्यूरल नेटवर्क (एएनएन) का मुख्य कार्य क्या है?",
"A_en": "Data Mining", "A_hi": "डेटा माइनिंग",
"B_en": "Machine Learning", "B_hi": "मशीन लर्निंग",
"C_en": "Data Analysis", "C_hi": "डेटा एनालिसिस",
"D_en": "Pattern Recognition", "D_hi": "पर्सन रिकॉग्निशन",
"answer": "B",
"explanation_en": "Machine Learning is the primary function of an Artificial Neural Network (ANN), which enables the network to learn and improve its performance on a task without being explicitly programmed.",
"explanation_hi": "मशीन लर्निंग एर्थिफ़िशियल न्यूरल नेटवर्क (एएनएन) का मुख्य कार्य है, जो नेटवर्क को एक कार्य पर सीखने और उस पर कार्य करने में सुधार करने की अनुमति देता है, जिसे वह स्पष्ट रूप से कार्यक्रमित नहीं किया जाता है।"
},
{
"subject": "Technology",
"topic": "Cloud Computing",
"question_en": "What is the primary advantage of using a Cloud-based infrastructure?",
"question_hi": "क्लाउड-आधारित इंफ्रास्ट्रक्चर का मुख्य लाभ क्या है?",
"A_en": "Scalability", "A_hi": "स्केलेबिलिटी",
"B_en": "Reliability", "B_hi": "रिलायबिलिटी",
"C_en": "Cost-effectiveness", "C_hi": "लागत प्रभावी",
"D_en": "Security", "D_hi": "सुरक्षा",
"answer": "C",
"explanation_en": "Cost-effectiveness is the primary advantage of using a Cloud-based infrastructure, which allows users to pay only for the resources they use, reducing capital expenditures and operational costs.",
"explanation_hi": "लागत प्रभावीपन क्लाउड-आधारित इंफ्रास्ट्रक्चर का मुख्य लाभ है, जिससे उपयोगकर्ताओं को उन संसाधनों के लिए केवल भुगतान करना पड़ता है जिनका उपयोग वे करते हैं, जिससे राजधानी और परिचालन व्यय कम होते हैं।"
},
{
"subject": "Technology",
"topic": "Internet of Things (IoT)",
"question_en": "What is the primary benefit of IoT in Smart Cities?",
"question_hi": "आईओटी में स्मार्ट सिटी के मुख्य लाभ क्या हैं?",
"A_en": "Improved Traffic Management", "A_hi": "सुधारित ट्रैफिक प्रबंधन",
"B_en": "Enhanced Public Safety", "B_hi": "बढ़ईया सार्वजनिक सुरक्षा",
"C_en": "Increased Energy Efficiency", "C_hi": "बढ़ी हुई ऊर्जा की कार्यक्षमता",
"D_en": "All of the above", "D_hi": "सभी ऊपर के विकल्प",
"answer": "D",
"explanation_en": "The primary benefit of IoT in Smart Cities is a combination of improved traffic management, enhanced public safety, and increased energy efficiency, which leads to a better quality of life for citizens.",
"explanation_hi": "आईओटी में स्मार्ट सिटी का मुख्य लाभ सुधारित ट्रैफिक प्रबंधन, बढ़ी हुई सार्वजनिक सुरक्षा और बढ़ी हुई ऊर्जा की कार्यक्षमता है, जिससे नागरिकों के जीवन में सुधार होता है।"
},
{
"subject": "Technology",
"topic": "Blockchain",
"question_en": "What is the primary purpose of a Blockchain?",
"question_hi": "ब्लॉकचेन का मुख्य उद्देश्य क्या है?",
"A_en": "Data Storage", "A_hi": "डेटा स्टोरेज",
"B_en": "Transaction Verification", "B_hi": "लेनदेन सत्यापन",
"C_en": "Smart Contracts", "C_hi": "बुद्धिमान अनुबंध",
"D_en": "Security", "D_hi": "सुरक्षा",
"answer": "B",
"explanation_en": "The primary purpose of a Blockchain is to provide a secure and transparent way of verifying transactions, ensuring the integrity and authenticity of data.",
"explanation_hi": "ब्लॉकचेन का मुख्य उद्देश्य लेनदेन को सुरक्षित और पारदर्शी तरीके से सत्यापित करना है, जिससे डेटा की स्थिरता और विश्वसनीयता सुनिश्चित हो।"
},
{
"subject": "Technology",
"topic": "Cyber Security",
"question_en": "What is the primary goal of a Firewall?",
"question_hi": "फ़ायरवॉल का मुख्य उद्देश्य क्या है?",
"A_en": "Network Security", "A_hi": "नेटवर्क सुरक्षा",
"B_en": "Data Protection", "B_hi": "डेटा सुरक्षा",
"C_en": "Intrusion Detection", "C_hi": "अनुचित प्रवेश का पता लगाना",
"D_en": "All of the above", "D_hi": "सभी ऊपर के विकल्प",
"answer": "D",
"explanation_en": "The primary goal of a Firewall is to provide a combination of network security, data protection, and intrusion detection, which helps to prevent unauthorized access to a network or system.",
"explanation_hi": "फ़ायरवॉल का मुख्य उद्देश्य नेटवर्क सुरक्षा, डेटा सुरक्षा और अनुचित प्रवेश का पता लगाना है, जिससे नेटवर्क या सिस्टम को अनधिकृत पहुंच से बचाया जा सकता है।"
},
{
"subject": "Technology",
"topic": "Algorithms",
"question_en": "What is the time complexity of a Binary Search algorithm?",
"question_hi": "बाइनरी सर्च एल्गोरिथम का समय जटिलता क्या है?",
"A_en": "O(n)", "A_hi": "ओ(एन)",
"B_en": "O(log n)", "B_hi": "ओ(लॉग एन)",
"C_en": "O(n^2)", "C_hi": "ओ(एन चाहिए)",
"D_en": "O(1)", "D_hi": "ओ(1)",
"answer": "B",
"explanation_en": "The time complexity of a Binary Search algorithm is O(log n), which means that the time taken by the algorithm increases logarithmically with the size of the input.",
"explanation_hi": "बाइनरी सर्च एल्गोरिथम का समय जटिलता ओ(लॉग एन) है, जिसका अर्थ है कि एल्गोरिथम के द्वारा लिया गया समय निरंतरता के आकार के साथ लॉगारिदमिक रूप से बढ़ता है।"
},
{
"subject": "Technology",
"topic": "Database Management",
"question_en": "What is the primary purpose of an Index in a Database?",
"question_hi": "डेटाबेस में इंडेक्स का मुख्य उद्देश्य क्या है?",
"A_en": "Data Storage", "A_hi": "डेटा स्टोरेज",
"B_en": "Query Optimization", "B_hi": "प्रश्न ऑप्टिमाइजेशन",
"C_en": "Data Retrieval", "C_hi": "डेटा प्राप्ति",
"D_en": "All of the above", "D_hi": "सभी ऊपर के विकल्प",
"answer": "B",
"explanation_en": "The primary purpose of an Index in a Database is to improve query optimization, which enables the database to quickly locate and retrieve data.",
"explanation_hi": "डेटाबेस में इंडेक्स का मुख्य उद्देश्य प्रश्न ऑप्टिमाइजेशन करना है, जिससे डेटाबेस को जल्दी से डेटा का स्थान और प्राप्ति करने में मदद मिलती है।"
},
{
"subject": "Technology",
"topic": "Operating Systems",
"question_en": "What is the primary function of a Kernel in an Operating System?",
"question_hi": "ऑपरेटिंग सिस्टम में कोर्नेल का मुख्य कार्य क्या है?",
"A_en": "Process Scheduling", "A_hi": "प्रक्रिया नियंत्रण",
"B_en": "Memory Management", "B_hi": "मेमोरी मैनेजमेंट",
"C_en": "File System Management", "C_hi": "फ़ाइल सिस्टम मैनेजमेंट",
"D_en": "All of the above", "D_hi": "सभी ऊपर के विकल्प",
"answer": "D",
"explanation_en": "The primary function of a Kernel in an Operating System is a combination of process scheduling, memory management, and file system management, which enables the operating system to manage and coordinate system resources.",
"explanation_hi": "ऑपरेटिंग सिस्टम में कोर्नेल का मुख्य कार्य प्रक्रिया नियंत्रण, मेमोरी मैनेजमेंट और फ़ाइल सिस्टम मैनेजमेंट है, जिससे ऑपरेटिंग सिस्टम को सिस्टम संसाधनों का प्रबंधन और समन्वय करने में मदद मिलती है।"
},
{
"subject": "Technology",
"topic": "Networking",
"question_en": "What is the primary function of a Switch in a Network?",
"question_hi": "नेटवर्क में स्विच का मुख्य कार्य क्या है?",
"A_en": "Routing", "A_hi": "रूटिंग",
"B_en": "Switching", "B_hi": "स्विचिंग",
"C_en": "Load Balancing", "C_hi": "लोड बैलेंसिंग",
"D_en": "All of the above", "D_hi": "सभी ऊपर के विकल्प",
"answer": "B",
"explanation_en": "The primary function of a Switch in a Network is to switch data packets from one network segment to another, which enables efficient and high-speed data transmission.",
"explanation_hi": "नेटवर्क में स्विच का मुख्य कार्य डेटा पैकेट को एक नेटवर्क सेगमेंट से दूसरे नेटवर्क सेगमेंट में स्विच करना है, जिससे कुशल और उच्च गति से डेटा प्रसारण होती है।"
},
{
"subject": "Technology",
"topic": "Data Science",
"question_en": "What is the primary purpose of Data Visualization?",
"question_hi": "डेटा विज्यूलाइज़ेशन का मुख्य उद्देश्य क्या है?",
"A_en": "Data Analysis", "A_hi": "डेटा एनालिसिस",
"B_en": "Insight Generation", "B_hi": "अंतर्दृष्टि उत्पन्न करना",
"C_en": "Communication", "C_hi": "संचार",
"D_en": "All of the above", "D_hi": "सभी ऊपर के विकल्प",
"answer": "D",
"explanation_en": "The primary purpose of Data Visualization is to provide a combination of data analysis, insight generation, and communication, which enables users to effectively understand and communicate complex data insights.",
"explanation_hi": "डेटा विज्यूलाइज़ेशन का मुख्य उद्देश्य डेटा एनालिसिस, अंतर्दृष्टि उत्पन्न करना और संचार है, जिससे उपयोगकर्ताओं को जटिल डेटा अंतर्दृष्टि को प्रभावी ढंग से समझने और संचारित करने में मदद मिलती है।"
}
]