[
{
"subject": "Technology",
"topic": "Artificial Intelligence",
"question_en": "What is the primary function of a Neural Network in Artificial Intelligence?",
"question_hi": "कृत्रिम बुद्धिमत्ता में न्यूरल नेटवर्क का मुख्य कार्य क्या है?",
"A_en": "Data Analysis", "A_hi": "डेटा विश्लेषण",
"B_en": "Pattern Recognition", "B_hi": "पैटर्न पहचान",
"C_en": "Decision Making", "C_hi": "निर्णय लेना",
"D_en": "Machine Learning", "D_hi": "मशीन लर्निंग",
"answer": "B",
"explanation_en": "Neural Networks are primarily used for Pattern Recognition in Artificial Intelligence.",
"explanation_hi": "न्यूरल नेटवर्क कृत्रिम बुद्धिमत्ता में पैटर्न पहचान के लिए मुख्य रूप से उपयोग किए जाते हैं।"
},
{
"subject": "Technology",
"topic": "Database Management",
"question_en": "What is the term for a database that stores data in a hierarchical structure?",
"question_hi": "डेटाबेस में डेटा को एक वृत्ताकार संरचना में कैसे संग्रहीत किया जाता है, इसका नाम क्या है?",
"A_en": "Network Database", "A_hi": "नेटवर्क डेटाबेस",
"B_en": "Hierarchical Database", "B_hi": "वृत्ताकार डेटाबेस",
"C_en": "Relational Database", "C_hi": "संबंधी डेटाबेस",
"D_en": "Flat File Database", "D_hi": "फ्लैट फाइल डेटाबेस",
"answer": "B",
"explanation_en": "Hierarchical Database is a type of database that stores data in a hierarchical structure.",
"explanation_hi": "वृत्ताकार डेटाबेस एक प्रकार का डेटाबेस है जो डेटा को वृत्ताकार संरचना में संग्रहीत करता है।"
},
{
"subject": "Technology",
"topic": "Operating System",
"question_en": "What is the primary function of a Process Manager in an Operating System?",
"question_hi": "ऑपरेटिंग सिस्टम में प्रोसेस मैनेजर का मुख्य कार्य क्या है?",
"A_en": "Memory Management", "A_hi": "मेमोरी मैनेजमेंट",
"B_en": "File Management", "B_hi": "फ़ाइल मैनेजमेंट",
"C_en": "Process Scheduling", "C_hi": "प्रोसेस शेड्यूलिंग",
"D_en": "Device Management", "D_hi": "डिवाइस मैनेजमेंट",
"answer": "C",
"explanation_en": "Process Manager is responsible for scheduling and managing processes in an Operating System.",
"explanation_hi": "प्रोसेस मैनेजर ऑपरेटिंग सिस्टम में प्रक्रियाओं का शेड्यूलिंग और प्रबंधन करता है।"
},
{
"subject": "Technology",
"topic": "Networking",
"question_en": "What is the term for a network that is not connected to the Internet?",
"question_hi": "इंटरनेट से जुड़ा नहीं होने वाला नेटवर्क का नाम क्या है?",
"A_en": "Intranet", "A_hi": "इंट्रानेट",
"B_en": "Extranet", "B_hi": "एक्स्ट्रानेट",
"C_en": "LAN", "C_hi": "लैन",
"D_en": "WAN", "D_hi": "वान",
"answer": "A",
"explanation_en": "Intranet is a network that is not connected to the Internet.",
"explanation_hi": "इंट्रानेट एक ऐसा नेटवर्क है जो इंटरनेट से जुड़ा नहीं होता है।"
},
{
"subject": "Technology",
"topic": "Cloud Computing",
"question_en": "What is the term for a cloud service that provides a virtual infrastructure for deploying applications?",
"question_hi": "क्लाउड सेवा जो वेबसाइटों के लिए एक वIRTUAL इन्फ्रास्ट्रक्चर प्रदान करती है, इसका नाम क्या है?",
"A_en": "Infrastructure as a Service (IaaS)", "A_hi": "इंफ्रास्ट्रक्चर अस ए सर्विस (आईएएस)",
"B_en": "Platform as a Service (PaaS)", "B_hi": "प्लेटफॉर्म अस ए सर्विस (पीएएस)",
"C_en": "Software as a Service (SaaS)", "C_hi": "सॉफ्टवेयर अस ए सर्विस (एसएएस)",
"D_en": "Database as a Service (DBaaS)", "D_hi": "डेटाबेस अस ए सर्विस (डीबीएएस)",
"answer": "A",
"explanation_en": "Infrastructure as a Service (IaaS) provides a virtual infrastructure for deploying applications in cloud computing.",
"explanation_hi": "इंफ्रास्ट्रक्चर अस ए सर्विस (आईएएस) वेबसाइटों के लिए एक वIRTUAL इन्फ्रास्ट्रक्चर प्रदान करती है।"
},
{
"subject": "Technology",
"topic": "Internet of Things (IoT)",
"question_en": "What is the term for the network of physical devices, vehicles, and other items that are embedded with sensors, software, and connectivity, allowing them to collect and exchange data?",
"question_hi": "वे शारीरिक उपकरण, वाहन और अन्य वस्तुएं जिनमें सेंसर, सॉफ्टवेयर और कनेक्टिविटी होती है, और जो डेटा एकत्रित और आदान-प्रदान कर सकते हैं उनका नेटवर्क का नाम क्या है?",
"A_en": "Internet of Things (IoT)", "A_hi": "इंटरनेट ऑफ थिंग्स (आईओटी)",
"B_en": "Machine to Machine (M2M) Communication", "B_hi": "मशीन टू मशीन (एम२एम) कम्यूनिकेशन",
"C_en": "Wireless Sensor Network (WSN)", "C_hi": "वायरलेस सेंसर नेटवर्क (डब्ल्यूएसएन)",
"D_en": "Cloud Computing", "D_hi": "क्लाउड कंप्यूटिंग",
"answer": "A",
"explanation_en": "Internet of Things (IoT) refers to the network of physical devices, vehicles, and other items that are embedded with sensors, software, and connectivity.",
"explanation_hi": "इंटरनेट ऑफ थिंग्स (आईओटी) का अर्थ है शारीरिक उपकरण, वाहन और अन्य वस्तुओं का नेटवर्क जिनमें सेंसर, सॉफ्टवेयर और कनेक्टिविटी होती है।"
},
{
"subject": "Technology",
"topic": "Data Science",
"question_en": "What is the term for a type of data that is difficult to process and analyze due to its complexity and size?",
"question_hi": "डेटा का वह प्रकार जो अपनी जटिलता और आकार के कारण प्रोसेसिंग और एनालिसिस करना मुश्किल होता है, इसका नाम क्या है?",
"A_en": "Structured Data", "A_hi": "संरचित डेटा",
"B_en": "Unstructured Data", "B_hi": "अनसंरचित डेटा",
"C_en": "Big Data", "C_hi": "बिग डेटा",
"D_en": "Small Data", "D_hi": "स्मॉल डेटा",
"answer": "C",
"explanation_en": "Big Data is a type of data that is difficult to process and analyze due to its complexity and size.",
"explanation_hi": "बिग डेटा एक ऐसा डेटा है जो अपनी जटिलता और आकार के कारण प्रोसेसिंग और एनालिसिस करना मुश्किल होता है।"
},
{
"subject": "Technology",
"topic": "Cyber Security",
"question_en": "What is the term for a type of malware that is designed to extort money from victims by threatening to publish their personal data?",
"question_hi": "वह प्रकार का मैलवेयर जो शिकायतकर्ताओं से पैसे की मांग करने के लिए अपने व्यक्तिगत डेटा प्रकाशित करने की धमकी देता है, इसका नाम क्या है?",
"A_en": "Ransomware", "A_hi": "रैंसमवेयर",
"B_en": "Spyware", "B_hi": "स्पायवेयर",
"C_en": "Adware", "C_hi": "एडवेयर",
"D_en": "Virus", "D_hi": "वायरस",
"answer": "A",
"explanation_en": "Ransomware is a type of malware that is designed to extort money from victims by threatening to publish their personal data.",
"explanation_hi": "रैंसमवेयर एक ऐसा मैलवेयर है जो शिकायतकर्ताओं से पैसे की मांग करने के लिए अपने व्यक्तिगत डेटा प्रकाशित करने की धमकी देता है।"
},
{
"subject": "Technology",
"topic": "Machine Learning",
"question_en": "What is the term for a type of algorithm that uses a large dataset to train a model and make predictions?",
"question_hi": "वह प्रकार का एल्गोरिदम जो एक बड़े डेटासेट का उपयोग करके एक मॉडल को प्रशिक्षित करता है और भविष्यवाणी करता है, इसका नाम क्या है?",
"A_en": "Supervised Learning", "A_hi": "सुपरवाइज्ड लर्निंग",
"B_en": "Unsupervised Learning", "B_hi": "अनसुपरवाइज्ड लर्निंग",
"C_en": "Reinforcement Learning", "C_hi": "रियार्मेंट लर्निंग",
"D_en": "Deep Learning", "D_hi": "डीप लर्निंग",
"answer": "A",
"explanation_en": "Supervised Learning is a type of algorithm that uses a large dataset to train a model and make predictions.",
"explanation_hi": "सुपरवाइज्ड लर्निंग एक ऐसा एल्गोरिदम है जो एक बड़े डेटासेट का उपयोग करके एक मॉडल को प्रशिक्षित करता है और भविष्यवाणी करता है।"
},
{
"subject": "Technology",
"topic": "Algorithms",
"question_en": "What is the term for a step-by-step procedure for solving a problem or performing a computation?",
"question_hi": "वह चरण-दर-चरण प्रक्रिया जो समस्या का समाधान करती है या गणना करती है, इसका नाम क्या है?",
"A_en": "Algorithm", "A_hi": "एल्गोरिथ्म",
"B_en": "Procedure", "B_hi": "प्रक्रिया",
"C_en": "Function", "C_hi": "फंक्शन",
"D_en": "Method", "D_hi": "मेथड",
"answer": "A",
"explanation_en": "Algorithm is a step-by-step procedure for solving a problem or performing a computation.",
"explanation_hi": "एल्गोरिथ्म एक चरण-दर-चरण प्रक्रिया है जो समस्या का समाधान करती है या गणना करती है।"
}