<think>
Okay, I need to create 10 high-quality MCQs on the topic of Database, Email, URL, and Web Browser for Rajasthan State Exams, SSC, and Railway. Let's start by brainstorming the key concepts for each subject.

First, Databases. Important points could be types of databases (relational, non-relational), SQL vs NoSQL, primary key, foreign key, normalization. Maybe a question on RDBMS examples like MySQL, Oracle.

Next, Email. Topics here might include email components (SMTP, POP, IMAP), email protocols, email structure (subject, body, attachments), spam, phishing. A question about email clients vs webmail.

Then, URL. Breaking down a URL into protocol, domain, path, query parameters. Common protocols like HTTP, HTTPS. Maybe a question on URL encoding.

Web Browsers. Different browsers (Chrome, Firefox, Safari), browser components (address bar, bookmarks), browser security features, cache, cookies. Could ask about default search engines or browser extensions.

Now, considering the difficulty level for Rajasthan exams. They might expect some basic knowledge but also a bit of depth. For example, knowing the difference between SMTP and POP, or how cookies work in browsers.

Let me structure each question with clear options. Ensure that the options are in both Hindi and English. The explanations should be concise but informative. Also, avoid any technical jargon that's too advanced, but still test understanding.

For example, a question on primary key in databases: what is its role? Options could include unique identifier, allowing duplicates, etc. The correct answer would be unique identifier.

Another question on email protocols: which protocol is used to send emails? SMTP, POP, IMAP. Answer would be SMTP.

URL structure: Identify the protocol in http://example.com. Answer is HTTP.

Web browser question: Which component stores your browsing history? Cache, Cookies, Bookmarks, History. Answer is History.

Now, need to ensure that the JSON structure is followed exactly. Each question must have subject, topic, question in both languages, options A-D in both languages, answer, and explanations in both languages. Also, check for any typos or language errors.

Let me list out 10 questions covering all the topics. Mix them up so it's not all database first, then email, etc. Alternate between topics for variety.

1. Database: Primary key
2. Email: SMTP vs POP
3. URL: Components
4. Web Browser: Cache vs Cookies
5. Database: Normalization purpose
6. Email: Phishing definition
7. URL: HTTP vs HTTPS
8. Web Browser: Default search engine
9. Database: SQL vs NoSQL
10. Email: Email client example

Now draft each question, ensuring the Hindi and English options are correct. Check explanations to confirm they match the answer. Also, make sure the difficulty is appropriate for the target exams.
</think>

[{"subject":"Technology","topic":"Database, Email, URL, Web Browser ki Samanya Jankari","question_en":"कोई डेटाबेस प्रमुख कुंजी (Primary Key) के बारे में क्या सही है?","question_hi":"Which of the following is correct about a database primary key?","A_en":"एक तालिका में एक से अधिक प्रमुख कुंजी हो सकती है।","A_hi":"A table can have multiple primary keys.","B_en":"प्रमुख कुंजी में डुप्लिकेट मानों की अनुमति होती है।","B_hi":"Primary keys allow duplicate values.","C_en":"प्रमुख कुंजी एक अद्वितीय पहचानकर्ता होती है।","C_hi":"A primary key is a unique identifier.","D_en":"प्रमुख कुंजी एक वैकल्पिक फ़ील्ड होती है।","D_hi":"A primary key is an optional field.","answer":"C","explanation_en":"A primary key uniquely identifies each record in a database table and does not allow duplicate or null values.","explanation_hi":"एक प्रमुख कुंजी डेटाबेस तालिका में प्रत्येक रिकॉर्ड की अद्वितीय पहचान करती है और डुप्लिकेट या खाली मानों की अनुमति नहीं देती है।"},{"subject":"Technology","topic":"Database, Email, URL, Web Browser ki Samanya Jankari","question_en":"ईमेल भेजने के लिए कौन-सा प्रोटोकॉल प्रयोग किया जाता है?","question_hi":"Which protocol is used to send emails?","A_en":"POP","A_hi":"POP","B_en":"IMAP","B_hi":"IMAP","C_en":"SMTP","C_hi":"SMTP","D_en":"FTP","D_hi":"FTP","answer":"C","explanation_en":"SMTP (Simple Mail Transfer Protocol) is used for sending emails between servers.","explanation_hi":"एसएमटीपी (सिम्पल मेल ट्रांसफर प्रोटोकॉल) सर्वरों के बीच ईमेल भेजने के लिए प्रयोग किया जाता है।"},{"subject":"Technology","topic":"Database, Email, URL, Web Browser ki Samanya Jankari","question_en":"URL में प्रोटोकॉल का भाग कौन-सा होता है?","question_hi":"Which part of a URL represents the protocol?","A_en":"http://example.com","A_hi":"http://example.com","B_en":"example.com","B_hi":"example.com","C_en":"/path/to/resource","C_hi":"/path/to/resource","D_en":"?query=1","D_hi":"?query=1","answer":"A","explanation_en":"The protocol in a URL specifies the method used to access the resource (e.g., HTTP, HTTPS).","explanation_hi":"एक URL में प्रोटोकॉल भाग संसाधन तक पहुंचने के तरीके को निर्दिष्ट करता है (जैसे, HTTP, HTTPS)।"},{"subject":"Technology","topic":"Database, Email, URL, Web Browser ki Samanya Jankari","question_en":"वेब ब्राउज़र में कैश का क्या कार्य है?","question_hi":"What is the function of cache in a web browser?","A_en":"ईमेल प्राप्त करने के लिए संग्रहीत करता है।","A_hi":"Stores emails for receiving.","B_en":"गुप्त सूचना को एन्क्रिप्ट करता है।","B_hi":"Encrypts sensitive information.","C_en":"अक्सर देखे गए पृष्ठों की प्रतिलिपि संग्रहीत करता है।","C_hi":"Stores copies of frequently viewed pages.","D_en":"उपयोगकर्ता लॉगिन डेटा को संग्रहीत करता है।","D_hi":"Stores user login data.","answer":"C","explanation_en":"Browser cache stores copies of web pages to load them faster on subsequent visits.","explanation_hi":"ब्राउज़र कैश वेब पृष्ठों की प्रतिलिपियाँ संग्रहीत करता है जिससे बाद के दौरे में तेज़ी से लोड होते हैं।"},{"subject":"Technology","topic":"Database, Email, URL, Web Browser ki Samanya Jankari","question_en":"नॉर्मलाइजेशन का उद्देश्य क्या है?","question_hi":"What is the purpose of normalization in databases?","A_en":"डेटा डुप्लिकेशन को कम करना।","A_hi":"Reduce data duplication.","B_en":"डेटाबेस को सुरक्षित करना।","B_hi":"Secure the database.","C_en":"ईमेल प्रसंस्करण को तेज करना।","C_hi":"Speed up email processing.","D_en":"वेब पृष्ठों को अनुकूलित करना।","D_hi":"Optimize web pages.","answer":"A","explanation_en":"Normalization organizes data to minimize redundancy and dependency.","explanation_hi":"नॉर्मलाइजेशन डेटा को आयोजित करता है जिससे अतिरिक्तता और निर्भरता कम हो जाती है।"},{"subject":"Technology","topic":"Database, Email, URL, Web Browser ki Samanya Jankari","question_en":"ईमेल में फिशिंग क्या है?","question_hi":"What is phishing in the context of emails?","A_en":"वैध ईमेल सेवा के लिए नाम है।","A_hi":"A legitimate email service name.","B_en":"अनधिकृत उपयोगकर्ताओं को ईमेल भेजना।","B_hi":"Sending emails to unauthorized users.","C_en":"गलत ईमेल पते को भेजना।","C_hi":"Sending emails to incorrect addresses.","D_en":"अकाउंट जानकारी चुराने के लिए धोखा देना।","D_hi":"Tricking users to reveal account information.","answer":"D","explanation_en":"Phishing is a fraudulent practice where attackers trick users into revealing sensitive information like passwords or credit card numbers.","explanation_hi":"फिशिंग एक धोखाधड़ी वाला अभ्यास है जहाँ हमलावर उपयोगकर्ताओं को पासवर्ड या क्रेडिट कार्ड नंबर जैसी संवेदनशील जानकारी देने के लिए धोखा देते हैं।"},{"subject":"Technology","topic":"Database, Email, URL, Web Browser ki Samanya Jankari","question_en":"HTTP और HTTPS में मुख्य अंतर क्या है?","question_hi":"What is the main difference between HTTP and HTTPS?","A_en":"HTTPS ईमेल भेजने के लिए होता है।","A_hi":"HTTPS is used to send emails.","B_en":"HTTPS सुरक्षित डेटा ट्रांसमिशन के लिए एन्क्रिप्शन प्रदान करता है।","B_hi":"HTTPS provides encryption for secure data transmission.","C_en":"HTTP तेज़ चलता है जबकि HTTPS धीमा है।","C_hi":"HTTP is faster while HTTPS is slower.","D_en":"HTTPS डेटाबेस में प्रयोग होता है।","D_hi":"HTTPS is used in databases.","answer":"B","explanation_en":"HTTPS encrypts data between the browser and server, ensuring secure communication, whereas HTTP does not.","explanation_hi":"HTTPS ब्राउज़र और सर्वर के बीच डेटा को एन्क्रिप्ट करता है, सुरक्षित संचार सुनिश्चित करता है, जबकि HTTP नहीं।"},{"subject":"Technology","topic":"Database, Email, URL, Web Browser ki Samanya Jankari","question_en":"निम्नलिखित में से कौन-सा ईमेल प्रोटोकॉल ईमेल प्राप्त करने के लिए प्रयोग किया जाता है?","question_hi":"Which of the following email protocols is used to receive emails?","A_en":"SMTP","A_hi":"SMTP","B_en":"POP","B_hi":"POP","C_en":"FTP","C_hi":"FTP","D_en":"Telnet","D_hi":"Telnet","answer":"B","explanation_en":"POP (Post Office Protocol) is used to retrieve emails from a server to a local device.","explanation_hi":"पीओपी (पोस्ट ऑफिस प्रोटोकॉल) ईमेल को सर्वर से लोकल डिवाइस में प्राप्त करने के लिए प्रयोग किया जाता है।"},{"subject":"Technology","topic":"Database, Email, URL, Web Browser ki Samanya Jankari","question_en":"SQL और NoSQL डेटाबेस के बीच अंतर क्या है?","question_hi":"What is the difference between SQL and NoSQL databases?","A_en":"SQL डेटाबेस संबंधी होते हैं जबकि NoSQL असंबंधी होते हैं।","A_hi":"SQL databases are relational while NoSQL are non-relational.","B_en":"SQL ईमेल सुरक्षा के लिए प्रयोग किए जाते हैं।","B_hi":"SQL is used for email security.","C_en":"NoSQL डेटाबेस वेब ब्राउज़र के लिए होते हैं।","C_hi":"NoSQL databases are for web browsers.","D_en":"SQL डेटाबेस छोटे डेटा के लिए बेहतर हैं।","D_hi":"SQL databases are better for small data.","answer":"A","explanation_en":"SQL databases use structured query language for relational data, while NoSQL databases handle non-relational data like documents or key-value pairs.","explanation_hi":"एसक्यूएल डेटाबेस संबंधी डेटा के लिए संरचित प्रश्न भाषा प्रयोग करते हैं, जबकि NoSQL डेटाबेस दस्तावेज या कुंजी-मान जैसे असंबंधी डेटा को संभालते हैं।"},{"subject":"Technology","topic":"Database, Email, URL, Web Browser ki Samanya Jankari","question_en":"कौन-सा ईमेल एप्लिकेशन उपयोगकर्ता को ईमेल प्रबंधित करने की अनुमति देता है?","question_hi":"Which email application allows users to manage emails?","A_en":"Google Chrome","A_hi":"Google Chrome","B_en":"Microsoft Outlook","B_hi":"Microsoft Outlook","C_en":"Facebook Messenger","C_hi":"Facebook Messenger","D_en":"WhatsApp","D_hi":"WhatsApp","answer":"B","explanation_en":"Microsoft Outlook is an email client that allows users to manage emails, calendars, and contacts.","explanation_hi":"माइक्रोसॉफ्ट आउटलुक एक ईमेल क्लाइंट है जो उपयोगकर्ताओं को ईमेल, कैलेंडर और संपर्कों का प्रबंधन करने की अनुमति देता है।"}]