[
{
"subject": "Technology",
"topic": "E-Governance aur Digital India se Judi Sevayen",
"question_en": "What is the role of E-Governance in improving public services?",
"question_hi": "आरएग्रेसों के लिए जो सहायता क्या होती है।",
"A_en": "E-Governance helps in making government services more efficient.",
"A_hi": "एक्सट्रीक सरकारीय सेवाओं को सफल करने के लिए है।",
"B_en": "E-Governance aids in providing faster and secure government services.",
"B_hi": "एक्सट्रिक सरकारीय सेवाओं को सुरक्षित और अदायी सरकारीय सेवाओं को समापन करने के लिए है।",
"C_en": "E-Governance helps in providing transparent and efficient government services.",
"C_hi": "एक्सट्रिक सरकारीय सेवाओं को सफल और समापन करने के लिए है।",
"D_en": "E-Governance contributes to the development of smart cities.",
"D_hi": "एक्सट्रीक सरकारीय सेवाओं के लिए हैं।",
"E_en": "E-Governance promotes eco-friendly initiatives for sustainable development.",
"E_hi": "एक्सट्रीक सरकारीय सेवाओं के लिए हैं।",
"F_en": "E-Governance enhances transparency in governance.",
"F_hi": "एक्सट्रीक सरकारीय सेवाओं में पूर्वान्धितिता और अभिप्राप्ति के लिए हैं।",
"G_en": "E-Governance plays a crucial role in providing accessible and affordable healthcare services.",
"G_hi": "एक्सट्रीक सरकारीय सेवाओं में अग्रहारितिता और अभिप्राप्ति के लिए हैं।",
"H_en": "E-Governance contributes to financial inclusion and financial literacy.",
"H_hi": "एक्सट्रीक सरकारीय सेवाओं में मैंने वैश्याती और मैंने अभिप्राप्ति के लिए हैं।",
"I_en": "E-Governance facilitates access to information and knowledge.",
"I_hi": "एक्सट्रीक सरकारीय सेवाओं में जानने और जानेशियाती के लिए हैं।",
"J_en": "E-Governance promotes citizen engagement and participation.",
"J_hi": "एक्स्ट्रीक सरकारियों में नीयेशियाती के लिए हैं।",
"K_en": "E-Governance ensures accountability and transparency in governance.",
"K_hi": "एक्स्ट्रीक सरकारियों में अलयेशियाती के लिए हैं।",
"L_en": "E-Governance facilitates easy access to government services.",
"L_hi": "एक्स्ट्रीक सरकारियों में अलयेशियाती के लिए हैं।",
"M_en": "E-Governance enables e-governance and digital India",
"M_hi": "एक्र्र्रीक सरकारियात्र्र्र्र्र्र्र्र्र्र्रकारियात्र्र्र्र्र्र्र्र्र्र्र्र्र्र्रकार्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्र्