<think>
Okay, let's tackle this task. The user wants 10 high-quality MCQs on MS Office Basics for Rajasthan exams, SSC, and Railway. The questions need to be in both Hindi and English, with explanations in both languages. First, I need to ensure that the questions cover Word, Excel, and PowerPoint. Let me brainstorm the topics for each.

For Word: Features like Autocorrect, WordArt, Mail Merge, Styles, and Navigation Pane. Maybe some keyboard shortcuts too.

Excel: Formulas (like SUMIFS, VLOOKUP), functions (AVERAGEIFS), freezing panes, protecting sheets, conditional formatting.

PowerPoint: Slide transitions, animations, master slides, custom shows, slide layout options.

Also, check for common questions that might appear in these exams. Make sure the difficulty level is appropriate—basic to medium. Let's start drafting each question, making sure the options are clear and the correct answer is unambiguous. Need to translate both the question and options accurately into Hindi. Explanations should be concise and clarify the correct answer. Let me verify each answer to avoid errors, maybe use official Microsoft resources or standard textbooks for accuracy. Once done, structure them into the required JSON format without any markdown. Double-check the JSON syntax to prevent errors.
</think>

[
  {
    "subject": "Technology",
    "topic": "MS Office (Word, Excel, PowerPoint) Basics",
    "question_en": "Which feature in MS Word is used to replace incorrect words with correct ones automatically?",
    "question_hi": "एमएस वर्ड में गलत शब्दों को सही शब्दों के साथ स्वचालित रूप से बदलने के लिए किस विशेषता का उपयोग किया जाता है?",
    "A_en": "Autocorrect",
    "A_hi": "स्वचालित सुधार",
    "B_en": "WordArt",
    "B_hi": "वर्डआर्ट",
    "C_en": "Mail Merge",
    "C_hi": "मेल मर्ज",
    "D_en": "Styles",
    "D_hi": "स्टाइल्स",
    "answer": "A",
    "explanation_en": "Autocorrect in MS Word automatically replaces incorrect or misspelled words with correct ones as you type.",
    "explanation_hi": "एमएस वर्ड में स्वचालित सुधार (Autocorrect) टाइप करते समय गलत या अपचित शब्दों को सही शब्दों के साथ स्वचालित रूप से बदल देता है।"
  },
  {
    "subject": "Technology",
    "topic": "MS Office (Word, Excel, PowerPoint) Basics",
    "question_en": "In MS Excel, which keyboard shortcut is used to create a new worksheet?",
    "question_hi": "एमएस एक्सेल में, एक नए वर्कशीट बनाने के लिए कौन-सा कीबोर्ड शॉर्टकट उपयोग किया जाता है?",
    "A_en": "Ctrl + N",
    "A_hi": "Ctrl + N",
    "B_en": "Shift + F11",
    "B_hi": "Shift + F11",
    "C_en": "Ctrl + Shift + N",
    "C_hi": "Ctrl + Shift + N",
    "D_en": "Alt + F11",
    "D_hi": "Alt + F11",
    "answer": "B",
    "explanation_en": "Shift + F11 is the keyboard shortcut in Excel to insert a new worksheet.",
    "explanation_hi": "एक्सेल में Shift + F11 एक कीबोर्ड शॉर्टकट है जिसका उपयोग एक नए वर्कशीट को सम्मिलित करने के लिए किया जाता है।"
  },
  {
    "subject": "Technology",
    "topic": "MS Office (Word, Excel, PowerPoint) Basics",
    "question_en": "Which of the following is used to create a custom animation in PowerPoint?",
    "question_hi": "आप पावरपॉइंट में एक आत्मनिर्भर एनिमेशन बनाने के लिए निम्नलिखित में से किसका उपयोग करेंगे?",
    "A_en": "Slide Show Tab",
    "A_hi": "स्लाइड शो टैब",
    "B_en": "Animations Tab",
    "B_hi": "एनिमेशन टैब",
    "C_en": "Design Tab",
    "C_hi": "डिज़ाइन टैब",
    "D_en": "Transitions Tab",
    "D_hi": "ट्रांजिशन टैब",
    "answer": "B",
    "explanation_en": "The Animations Tab in PowerPoint is used to create and manage custom animations for slides.",
    "explanation_hi": "पावरपॉइंट में एनिमेशन टैब का उपयोग स्लाइडों के लिए आत्मनिर्भर एनिमेशन बनाने और प्रबंध करने के लिए किया जाता है।"
  },
  {
    "subject": "Technology",
    "topic": "MS Office (Word, Excel, PowerPoint) Basics",
    "question_en": "In Excel, what is the function of the formula =SUMIFS?",
    "question_hi": "एक्सेल में, =SUMIFS फॉर्मूले का कार्य क्या है?",
    "A_en": "Sums values based on multiple conditions",
    "A_hi": "कई शर्तों के आधार पर मानों को जोड़ता है",
    "B_en": "Sums values in a range",
    "B_hi": "एक रेंज में मानों को जोड़ता है",
    "C_en": "Counts cells with numbers",
    "C_hi": "अंकों वाली सेल को गिनता है",
    "D_en": "Averages values in a range",
    "D_hi": "एक रेंज में मानों का औसत लेता है",
    "answer": "A",
    "explanation_en": "The SUMIFS function in Excel sums the values that meet multiple criteria.",
    "explanation_hi": "एक्सेल में SUMIFS फंक्शन कई मानदंडों को पूरा करने वाले मानों को जोड़ता है।"
  },
  {
    "subject": "Technology",
    "topic": "MS Office (Word, Excel, PowerPoint) Basics",
    "question_en": "Which feature in MS Word allows you to apply the same formatting to multiple paragraphs quickly?",
    "question_hi": "एमएस वर्ड में कौन-सी विशेषता आपको एक ही समय में कई पैराग्राफों में समान फॉरमेटिंग लागू करने की अनुमति देती है?",
    "A_en": "Styles",
    "A_hi": "स्टाइल्स",
    "B_en": "Themes",
    "B_hi": "थीम्स",
    "C_en": "Templates",
    "C_hi": "टेम्पलेट्स",
    "D_en": "WordArt",
    "D_hi": "वर्डआर्ट",
    "answer": "A",
    "explanation_en": "Styles in Microsoft Word allow users to apply consistent formatting across multiple paragraphs quickly.",
    "explanation_hi": "माइक्रोसॉफ्ट वर्ड में स्टाइल्स उपयोगकर्ताओं को कई पैराग्राफों में तेजी से संगत फॉरमेटिंग लागू करने की अनुमति देते हैं।"
  },
  {
    "subject": "Technology",
    "topic": "MS Office (Word, Excel, PowerPoint) Basics",
    "question_en": "In PowerPoint, how do you apply a transition to multiple slides at once?",
    "question_hi": "पावरपॉइंट में, आप एक साथ कई स्लाइडों पर ट्रांजिशन कैसे लागू करते हैं?",
    "A_en": "Ctrl + A and select transition",
    "A_hi": "Ctrl + A और ट्रांजिशन चुनें",
    "B_en": "Ctrl + C and paste transition",
    "B_hi": "Ctrl + C और ट्रांजिशन पेस्ट करें",
    "C_en": "Select slides in Slide Sorter and apply transition",
    "C_hi": "स्लाइड सॉर्टर में स्लाइड चुनें और ट्रांजिशन लागू करें",
    "D_en": "Right-click and apply transition",
    "D_hi": "राइट-क्लिक करें और ट्रांजिशन लागू करें",
    "answer": "C",
    "explanation_en": "In PowerPoint, you can select multiple slides in Slide Sorter view and apply a transition to all of them simultaneously.",
    "explanation_hi": "पावरपॉइंट में, आप स्लाइड सॉर्टर दृश्य में कई स्लाइड चुन सकते हैं और उन सभी में एक साथ ट्रांजिशन लागू कर सकते हैं।"
  },
  {
    "subject": "Technology",
    "topic": "MS Office (Word, Excel, PowerPoint) Basics",
    "question_en": "What is the default file extension for a PowerPoint presentation?",
    "question_hi": "पावरपॉइंट प्रस्तुति के लिए डिफॉल्ट फ़ाइल एक्सटेंशन क्या है?",
    "A_en": ".pptx",
    "A_hi": ".pptx",
    "B_en": ".docx",
    "B_hi": ".docx",
    "C_en": ".xlsx",
    "C_hi": ".xlsx",
    "D_en": ".pdf",
    "D_hi": ".pdf",
    "answer": "A",
    "explanation_en": "The default file extension for a PowerPoint presentation is .pptx.",
    "explanation_hi": "पावरपॉइंट प्रस्तुति के लिए डिफॉल्ट फ़ाइल एक्सटेंशन .pptx है।"
  },
  {
    "subject": "Technology",
    "topic": "MS Office (Word, Excel, PowerPoint) Basics",
    "question_en": "In MS Excel, what does the function AVERAGEIFS do?",
    "question_hi": "एमएस एक्सेल में, AVERAGEIFS फंक्शन क्या करता है?",
    "A_en": "Calculates average based on multiple criteria",
    "A_hi": "कई मानदंडों के आधार पर औसत की गणना करता है",
    "B_en": "Sums values in a range",
    "B_hi": "एक रेंज में मानों को जोड़ता है",
    "C_en": "Counts cells with specific text",
    "C_hi": "विशिष्ट पाठ वाली सेल की गणना करता है",
    "D_en": "Finds the maximum value",
    "D_hi": "अधिकतम मान खोजता है",
    "answer": "A",
    "explanation_en": "The AVERAGEIFS function calculates the average of cells that meet multiple criteria.",
    "explanation_hi": "AVERAGEIFS फंक्शन कई मानदंडों को पूरा करने वाली सेलों का औसत की गणना करता है।"
  },
  {
    "subject": "Technology",
    "topic": "MS Office (Word, Excel, PowerPoint) Basics",
    "question_en": "How can you protect an Excel sheet from being edited?",
    "question_hi": "आप एक एक्सेल शीट को संपादित न होने देने के लिए कैसे सुरक्षित कैसे कर सकते हैं?",
    "A_en": "Use Protect Sheet option",
    "A_hi": "शीट को सुरक्षित करने का विकल्प उपयोग करें",
    "B_en": "Lock cells manually",
    "B_hi": "सेल को मैन्युअल रूप से लॉक करें",
    "C_en": "Apply password to worksheet",
    "C_hi": "वर्कशीट पर पासवर्ड लागू करें",
    "D_en": "All of the above",
    "D_hi": "ऊपर दिए गए सभी",
    "answer": "D",
    "explanation_en": "To protect an Excel sheet from editing, you can lock specific cells, apply a password, or use the Protect Sheet feature.",
    "explanation_hi": "एक एक्सेल शीट को संपादित न होने देने के लिए, आप विशिष्ट सेल को लॉक कर सकते हैं, एक पासवर्ड लागू कर सकते हैं, या शीट सुरक्षा विशेषता का उपयोग कर सकते हैं।"
  },
  {
    "subject": "Technology",
    "topic": "MS Office (Word, Excel, PowerPoint) Basics",
    "question_en": "Which of the following is used to display the current slide in full screen during a PowerPoint presentation?",
    "question_hi": "पावरपॉइंट प्रस्तुति के दौरान वर्तमान स्लाइड को फुल स्क्रीन में डिस्प्ले करने के लिए निम्नलिखित में से किसका उपयोग किया जाता है?",
    "A_en": "Slide Show Tab",
    "A_hi": "स्लाइड शो टैब",
    "B_en": "Presenter View",
    "B_hi": "प्रेजेंटर व्यू",
    "C_en": "Full Screen Mode",
    "C_hi": "फुल स्क्रीन मोड",
    "D_en": "Custom