[
{
"subject": "Technology",
"topic": "Soochna Prodyogiki (IT): Networking aur Cyber Security",
"question_en": "What is the difference between LAN, WAN, and MAN?",
"question_hi": "LAN, WAN aur MAN ka matlab kya hai?",
"A_en": "A Local Area Network (LAN) is a network covering a small geographical area, a Wide Area Network (WAN) covers a larger geographical area, and a Metropolitan Area Network (MAN) covers an intermediate area between LAN and WAN.",
"A_hi": "एक Local Area Network (LAN) एक ग्रुपकारी एक ध्यानशील करने के लिए अनुवाद है।",
"B_en": "A LAN is a network of computers connected to each other in a limited geographical area. A WAN is a network that connects computers across a wide geographical area. A MAN is a network connecting computers in a city.",
"B_hi": "एक LAN एक कंप्यूटरों के समाधि करने के लिए एक अनुवाद है।",
"C_en": "A Local Area Network (LAN) is a network of computers connected to each other within a limited area such as an office building or a small city. A Wide Area Network (WAN) covers a large geographical area, spanning across cities, states, or even countries. A Metropolitan Area Network (MAN) is a network covering a city's area.",
"C_hi": "एक LAN एक अन्तर्यंतरींग एन्टर्स को एक अन्तर्यांतरींग एन्टर्स को एकर्यंतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टर्यांतरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टरींग एन्टींग एन्टरींग एन्टरी