[
{
 "subject": "Computer",
 "topic": "Computer Basics",
 "question_en": "What is the full form of CPU?",
 "question_hi": "सीपीयू का पूरा नाम क्या है?",
 "A_en": "Central Process Unit", "A_hi": "सेंट्रल प्रोसेस यूनिट",
 "B_en": "Central Power Unit", "B_hi": "सेंट्रल पावर यूनिट",
 "C_en": "Central Processing Unit", "C_hi": "सेंट्रल प्रोसेसिंग यूनिट",
 "D_en": "Central Power Interface", "D_hi": "सेंट्रल पावर इंटरफेस",
 "answer": "C",
 "explanation_en": "CPU stands for Central Processing Unit, which is the primary component of a computer that performs most instructions that the computer executes.",
 "explanation_hi": "सीपीयू का अर्थ है सेंट्रल प्रोसेसिंग यूनिट, जो कंप्यूटर का मुख्य घटक है जो कंप्यूटर द्वारा निष्पादित अधिकांश आदेशों को करता है।"
},
{
 "subject": "Computer",
 "topic": "Computer Hardware",
 "question_en": "What is the main function of a Motherboard?",
 "question_hi": "मदरबोर्ड का मुख्य कार्य क्या है?",
 "A_en": "To store data", "A_hi": "डेटा स्टोर करना",
 "B_en": "To connect hardware components", "B_hi": "हार्डवेयर घटकों को कनेक्ट करना",
 "C_en": "To provide power supply", "C_hi": "पॉवर सप्लाई प्रदान करना",
 "D_en": "To cool down the computer", "D_hi": "कंप्यूटर को ठंडा करना",
 "answer": "B",
 "explanation_en": "A motherboard is the main circuit board of a computer that connects and supports all hardware components.",
 "explanation_hi": "मदरबोर्ड एक कंप्यूटर का मुख्य सर्किट बोर्ड है जो सभी हार्डवेयर घटकों को कनेक्ट और समर्थन करता है।"
},
{
 "subject": "Computer",
 "topic": "Computer Software",
 "question_en": "What is the primary function of an Operating System?",
 "question_hi": "ऑपरेटिंग सिस्टम का मुख्य कार्य क्या है?",
 "A_en": "To store data", "A_hi": "डेटा स्टोर करना",
 "B_en": "To connect to the internet", "B_hi": "इंटरनेट से कनेक्ट करना",
 "C_en": "To manage computer hardware and software resources", "C_hi": "कंप्यूटर हार्डवेयर और सॉफ्टवेयर संसाधनों का प्रबंधन करना",
 "D_en": "To play games", "D_hi": "गेम खेलना",
 "answer": "C",
 "explanation_en": "An Operating System manages computer hardware and software resources, providing a platform for running applications and managing system operations.",
 "explanation_hi": "ऑपरेटिंग सिस्टम कंप्यूटर हार्डवेयर और सॉफ्टवेयर संसाधनों का प्रबंधन करता है, और अनुप्रयोगों को चलाने और प्रणाली कार्यों को संभालने के लिए एक मंच प्रदान करता है।"
},
{
 "subject": "Computer",
 "topic": "Networking",
 "question_en": "What is the primary function of a Router?",
 "question_hi": "राउटर का मुख्य कार्य क्या है? ",
 "A_en": "To connect devices to the internet", "A_hi": "डिवाइस को इंटरनेट से कनेक्ट करना",
 "B_en": "To connect devices to a local network", "B_hi": "डिवाइस को लोकल नेटवर्क से कनेक्ट करना",
 "C_en": "To manage network traffic", "C_hi": "नेटवर्क ट्रैफिक का प्रबंधन करना",
 "D_en": "To provide power supply to devices", "D_hi": "डिवाइस को पॉवर सप्लाई प्रदान करना",
 "answer": "A",
 "explanation_en": "A router is a networking device that connects devices to the internet and manages network traffic.",
 "explanation_hi": "राउटर एक नेटवर्किंग डिवाइस है जो डिवाइस को इंटरनेट से कनेक्ट करता है और नेटवर्क ट्रैफिक का प्रबंधन करता है।"
},
{
 "subject": "Computer",
 "topic": "Database Management",
 "question_en": "What is a Relational Database Management System?",
 "question_hi": "संबंधी डेटाबेस मैनेजमेंट सिस्टम क्या है? ",
 "A_en": "A system that stores data in tables", "A_hi": "एक सिस्टम जो डेटा को टेबल्स में स्टोर करता है",
 "B_en": "A system that stores data in files", "B_hi": "एक सिस्टम जो डेटा को फ़ाइल्स में स्टोर करता है",
 "C_en": "A system that manages data relationships", "C_hi": "एक सिस्टम जो डेटा के संबंधों का प्रबंधन करता है",
 "D_en": "A system that provides data security", "D_hi": "एक सिस्टम जो डेटा सुरक्षा प्रदान करता है",
 "answer": "C",
 "explanation_en": "A Relational Database Management System (RDBMS) is a system that manages data relationships and stores data in tables.",
 "explanation_hi": "संबंधी डेटाबेस मैनेजमेंट सिस्टम (RDBMS) एक सिस्टम है जो डेटा के संबंधों का प्रबंधन करता है और डेटा को टेबल्स में स्टोर करता है।"
},
{
 "subject": "Computer",
 "topic": "Data Structures",
 "question_en": "What is a Stack Data Structure?",
 "question_hi": "स्टैक डेटा संरचना क्या है? ",
 "A_en": "A data structure that stores data in a linear fashion", "A_hi": "एक डेटा संरचना जो डेटा को लाइनियर फ़ैशन में स्टोर करता है",
 "B_en": "A data structure that stores data in a hierarchical fashion", "B_hi": "एक डेटा संरचना जो डेटा को हायरार्चिकल फ़ैशन में स्टोर करता है",
 "C_en": "A data structure that follows the Last-In-First-Out (LIFO) principle", "C_hi": "एक डेटा संरचना जो लास्ट-इन-फ़र्स्ट-आउट (LIFO) सिद्धांत का पालन करता है",
 "D_en": "A data structure that stores data in a graph", "D_hi": "एक डेटा संरचना जो डेटा को ग्राफ़ में स्टोर करता है",
 "answer": "C",
 "explanation_en": "A Stack Data Structure is a data structure that follows the Last-In-First-Out (LIFO) principle, where the last element added is the first one to be removed.",
 "explanation_hi": "स्टैक डेटा संरचना एक डेटा संरचना है जो लास्ट-इन-फ़र्स्ट-आउट (LIFO) सिद्धांत का पालन करती है, जहां अंतिम एलीमेंट जोड़ा जाता है वह पहला एलीमेंट होता है जो हटाया जाता है।"
},
{
 "subject": "Computer",
 "topic": "File Management",
 "question_en": "What is the primary function of a File System?",
 "question_hi": "फ़ाइल सिस्टम का मुख्य कार्य क्या है? ",
 "A_en": "To manage files on a computer", "A_hi": "कंप्यूटर पर फ़ाइलों का प्रबंधन करना",
 "B_en": "To provide file security", "B_hi": "फ़ाइल सुरक्षा प्रदान करना",
 "C_en": "To manage file permissions and access", "C_hi": "फ़ाइल की अनुमतियों और एक्सेस का प्रबंधन करना",
 "D_en": "To compress and decompress files", "D_hi": "फ़ाइलों को कंप्रेस और डीकंप्रेस करना",
 "answer": "A",
 "explanation_en": "A File System is a system that manages files on a computer, providing a platform for storing, organizing, and retrieving files.",
 "explanation_hi": "फ़ाइल सिस्टम एक सिस्टम है जो कंप्यूटर पर फ़ाइलों का प्रबंधन करता है, जो फ़ाइलों को स्टोर करने, आयोजित करने और प्राप्त करने के लिए एक मंच प्रदान करता है।"
},
{
 "subject": "Computer",
 "topic": "Operating System",
 "question_en": "What is the primary function of a Bootloader?",
 "question_hi": "बूटलोडर का मुख्य कार्य क्या है? ",
 "A_en": "To manage file systems", "A_hi": "फ़ाइल सिस्टम का प्रबंधन करना",
 "B_en": "To provide file security", "B_hi": "फ़ाइल सुरक्षा प्रदान करना",
 "C_en": "To load the operating system into memory", "C_hi": "ऑपरेटिंग सिस्टम को मेमोरी में लोड करना",
 "D_en": "To manage network connections", "D_hi": "नेटवर्क कनेक्शन का प्रबंधन करना",
 "answer": "C",
 "explanation_en": "A Bootloader is a program that loads the operating system into memory, allowing the computer to boot up and start running applications.",
 "explanation_hi": "बूटलोडर एक कार्यक्रम है जो ऑपरेटिंग सिस्टम को मेमोरी में लोड करता है, जिससे कंप्यूटर शुरू होता है और अनुप्रयोगों को चलाने की अनुमति मिलती है।"
},
{
 "subject": "Computer",
 "topic": "Database Management",
 "question_en": "What is a Database Index?",
 "question_hi": "डेटाबेस इंडेक्स क्या है? ",
 "A_en": "A data structure that stores data in a table", "A_hi": "एक डेटा संरचना जो डेटा को टेबल में स्टोर करती है",
 "B_en": "A data structure that stores data in a file", "B_hi": "एक डेटा संरचना जो डेटा को फ़ाइल में स्टोर करती है",
 "C_en": "A data structure that improves query performance", "C_hi": "एक डेटा संरचना जो क्वेरी प्रदर्शन को बेहतर बनाती है",
 "D_en": "A data structure that stores data in a graph", "D_hi": "एक डेटा संरचना जो डेटा को ग्राफ़ में स्टोर करती है",
 "answer": "C",
 "explanation_en": "A Database Index is a data structure that improves query performance by allowing the database to quickly locate and retrieve data.",
 "explanation_hi": "डेटाबेस इंडेक्स एक डेटा संरचना है जो क्वेरी प्रदर्शन को बेहतर बनाती है और डेटाबेस को जल्दी से डेटा को लोकेट और प्राप्त करने की अनुमति देती है।"
},
{
 "subject": "Computer",
 "topic": "Computer Networking",
 "question_en": "What is a Network Protocol?",
 "question_hi": "नेटवर्क प्रोटोकॉल क्या है? ",
 "A_en": "A set of rules for data transmission", "A_hi": "डेटा ट्रांसमिशन के लिए एक सेट ऑफ नियम",
 "B_en": "A set of rules for data storage", "B_hi": "डेटा स्टोरेज के लिए एक सेट ऑफ नियम",
 "C_en": "A set of rules for data security", "C_hi": "डेटा सुरक्षा के लिए एक सेट ऑफ नियम",
 "D_en": "A set of rules for data communication", "D_hi": "डेटा कम्युनिकेशन के लिए एक सेट ऑफ नियम",
 "answer": "D",
 "explanation_en": "A Network Protocol is a set of rules for data communication that defines how data is formatted, transmitted, and received over a network.",
 "explanation_hi": "नेटवर्क प्रोटोकॉल डेटा कम्युनिकेशन के लिए एक सेट ऑफ नियम है जो डेटा को कैसे फ़ॉर्मैट किया जाता है, ट्रांसमिशन किया जाता है, और रिसीव किया जाता है, यह परिभाषित करता है।"
}
]