[
{
"subject": "Computer",
"topic": "Data Types",
"question_en": "What is the purpose of a 'byte' in computer programming?",
"question_hi": "कंप्यूटर प्रोग्रामिंग में 'बाइट' का उद्देश्य क्या है?",
"A_en": "To store a single character", "A_hi": "एक अक्षर को स्टोर करने के लिए",
"B_en": "To store a number", "B_hi": "एक संख्या को स्टोर करने के लिए",
"C_en": "To store a collection of characters", "C_hi": "एक संग्रहण के लिए अक्षर",
"D_en": "To store a collection of numbers", "D_hi": "एक संग्रहण के लिए संख्या",
"answer": "C",
"explanation_en": "A byte is a collection of 8 bits used to store a character or a small amount of data.",
"explanation_hi": "एक बाइट 8 बिटों का एक संग्रह है जिसका उपयोग एक अक्षर या थोड़ी मात्रा में डेटा को स्टोर करने के लिए किया जाता है।"
}, 
{
"subject": "Computer",
"topic": "Data Types",
"question_en": "What is the data type 'float' used for in programming?",
"question_hi": "प्रोग्रामिंग में 'फ्लोट' डेटा टाइप का उपयोग क्या है?",
"A_en": "To store integers", "A_hi": "पूर्ण संख्याओं को स्टोर करने के लिए",
"B_en": "To store decimal numbers", "B_hi": "दशमलव संख्याओं को स्टोर करने के लिए",
"C_en": "To store characters", "C_hi": "अक्षरों को स्टोर करने के लिए",
"D_en": "To store boolean values", "D_hi": "बूलियन मूल्यों को स्टोर करने के लिए",
"answer": "B",
"explanation_en": "The float data type is used to store decimal numbers or floating point numbers.",
"explanation_hi": "फ्लोट डेटा टाइप का उपयोग दशमलव संख्याओं या परस्पर संबंधित संख्याओं को स्टोर करने के लिए किया जाता है।"
}, 
{
"subject": "Computer",
"topic": "Algorithms",
"question_en": "What is the time complexity of the QuickSort algorithm?",
"question_hi": "क्विकसॉर्ट एल्गोरिदम की समय संवेदनशीलता क्या है?",
"A_en": "O(n^2)", "A_hi": "O(n^2)",
"B_en": "O(n log n)", "B_hi": "O(n log n)",
"C_en": "O(n)", "C_hi": "O(n)",
"D_en": "O(1)", "D_hi": "O(1)",
"answer": "B",
"explanation_en": "The average time complexity of the QuickSort algorithm is O(n log n), although it can be O(n^2) in the worst case.",
"explanation_hi": "क्विकसॉर्ट एल्गोरिदम की औसत समय संवेदनशीलता O(n log n) है, भले ही वह सबसे खराब स्थिति में O(n^2) हो सकती है।"
}, 
{
"subject": "Computer",
"topic": "Algorithms",
"question_en": "What is the purpose of the Bubble Sort algorithm?",
"question_hi": "बबल सॉर्ट एल्गोरिदम का उद्देश्य क्या है?",
"A_en": "To sort a list of numbers in ascending order", "A_hi": "एक सूची को वृद्धि क्रम में सॉर्ट करने के लिए",
"B_en": "To sort a list of characters in alphabetical order", "B_hi": "एक सूची को वर्णमाला क्रम में सॉर्ट करने के लिए",
"C_en": "To find the maximum element in a list", "C_hi": "एक सूची में सबसे बड़ा तत्व ढूंढने के लिए",
"D_en": "To find the minimum element in a list", "D_hi": "एक सूची में सबसे छोटा तत्व ढूंढने के लिए",
"answer": "A",
"explanation_en": "The Bubble Sort algorithm is used to sort a list of numbers in ascending order.",
"explanation_hi": "बबल सॉर्ट एल्गोरिदम का उपयोग एक सूची को वृद्धि क्रम में सॉर्ट करने के लिए किया जाता है।"
}, 
{
"subject": "Computer",
"topic": "Data Structures",
"question_en": "What is a Linked List?",
"question_hi": "लिंक्ड लिस्ट क्या है?",
"A_en": "A data structure in which elements are stored in a single array", "A_hi": "एक डेटा संरचना जिसमें तत्व एकल एक्सेपरेंसी में संग्रहीत होते हैं",
"B_en": "A data structure in which elements are stored in a sequence of nodes", "B_hi": "एक डेटा संरचना जिसमें तत्व एक श्रृंखला में नोडों में संग्रहीत होते हैं",
"C_en": "A data structure in which elements are stored in a graph", "C_hi": "एक डेटा संरचना जिसमें तत्व एक ग्राफ में संग्रहीत होते हैं",
"D_en": "A data structure in which elements are stored in a stack", "D_hi": "एक डेटा संरचना जिसमें तत्व एक स्टैक में संग्रहीत होते हैं",
"answer": "B",
"explanation_en": "A Linked List is a data structure in which elements are stored in a sequence of nodes.",
"explanation_hi": "लिंक्ड लिस्ट एक डेटा संरचना है जिसमें तत्व एक श्रृंखला में नोडों में संग्रहीत होते हैं।"
}, 
{
"subject": "Computer",
"topic": "Data Structures",
"question_en": "What is the advantage of using a Stack data structure?",
"question_hi": "स्टैक डेटा संरचना का उपयोग करने का लाभ क्या है?",
"A_en": "It allows for efficient insertion and deletion of elements", "A_hi": "यह तत्वों के प्रवेश और हटाने के लिए कुशल होता है",
"B_en": "It allows for efficient searching of elements", "B_hi": "यह तत्वों की खोज करने के लिए कुशल होता है",
"C_en": "It allows for efficient sorting of elements", "C_hi": "यह तत्वों को सॉर्ट करने के लिए कुशल होता है",
"D_en": "It allows for efficient insertion and deletion of elements at the end", "D_hi": "यह निष्क्रमण से तत्वों के लिए कुशल होता है",
"answer": "A",
"explanation_en": "Using a Stack data structure allows for efficient insertion and deletion of elements at the top of the stack.",
"explanation_hi": "स्टैक डेटा संरचना का उपयोग तत्वों के शीर्ष पर प्रवेश करने और हटाने के लिए कुशल होता है।"
}, 
{
"subject": "Computer",
"topic": "Operating Systems",
"question_en": "What is the purpose of the File Allocation Table (FAT) in an operating system?",
"question_hi": "ऑपरेटिंग सिस्टम में फाइल अलोकेशन टेबल (FAT) का उद्देश्य क्या है?",
"A_en": "To manage memory allocation for running programs", "A_hi": "चालू कार्यक्रमों के लिए मेमोरी अलोकेशन प्रबंधित करने के लिए",
"B_en": "To manage file allocation on a disk", "B_hi": "डिस्क पर फाइल अलोकेशन प्रबंधित करने के लिए",
"C_en": "To manage user authentication and authorization", "C_hi": "उपयोगकर्ता प्रमाणीकरण और अनुमतियों का प्रबंधन करने के लिए",
"D_en": "To manage process scheduling", "D_hi": "प्रक्रिया शेड्यूलिंग प्रबंधित करने के लिए",
"answer": "B",
"explanation_en": "The File Allocation Table (FAT) is used to manage file allocation on a disk, including the location and size of files.",
"explanation_hi": "फाइल अलोकेशन टेबल (FAT) का उपयोग डिस्क पर फाइल अलोकेशन प्रबंधित करने के लिए किया जाता है, जिसमें फाइलों की स्थिति और आकार शामिल है।"
}, 
{
"subject": "Computer",
"topic": "Networking",
"question_en": "What is the difference between a network cable and a network adapter?",
"question_hi": "नेटवर्क केबल और नेटवर्क एडाप्टर के बीच अंतर क्या है?",
"A_en": "A network cable carries data between devices, while a network adapter connects devices to a network", "A_hi": "एक नेटवर्क केबल डिवाइस के बीच डेटा को ले जाता है, जबकि एक नेटवर्क एडाप्टर डिवाइस को नेटवर्क से जोड़ता है",
"B_en": "A network cable connects devices to a network, while a network adapter carries data between devices", "B_hi": "एक नेटवर्क केबल डिवाइस को नेटवर्क से जोड़ता है, जबकि एक नेटवर्क एडाप्टर डिवाइस के बीच डेटा को ले जाता है",
"C_en": "A network cable is used for wireless networking, while a network adapter is used for wired networking", "C_hi": "एक नेटवर्क केबल का उपयोग वायरलेस नेटवर्किंग के लिए किया जाता है, जबकि नेटवर्क एडाप्टर वायर्ड नेटवर्किंग के लिए उपयोग किया जाता है",
"D_en": "A network cable and a network adapter are interchangeable terms", "D_hi": "नेटवर्क केबल और नेटवर्क एडाप्टर एक दूसरे के लिए उपयोग की जाने वाली शब्दावली है",
"answer": "A",
"explanation_en": "A network cable carries data between devices, while a network adapter connects devices to a network.",
"explanation_hi": "एक नेटवर्क केबल डिवाइस के बीच डेटा को ले जाता है, जबकि एक नेटवर्क एडाप्टर डिवाइस को नेटवर्क से जोड़ता है।"
}, 
{
"subject": "Computer",
"topic": "Networking",
"question_en": "What is the purpose of a subnet mask in IP addressing?",
"question_hi": "आईपी पता प्रणाली में सबनेट मास्क का उद्देश्य क्या है?",
"A_en": "To identify the network ID", "A_hi": "नेटवर्क आईडी की पहचान करने के लिए",
"B_en": "To identify the host ID", "B_hi": "होस्ट आईडी की पहचान करने के लिए",
"C_en": "To determine the subnet address", "C_hi": "सबनेट पता निर्धारित करने के लिए",
"D_en": "To determine the network and host address", "D_hi": "नेटवर्क और होस्ट पता निर्धारित करने के लिए",
"answer": "D",
"explanation_en": "The subnet mask is used to determine the network and host address in IP addressing.",
"explanation_hi": "सबनेट मास्क का उपयोग आईपी पता प्रणाली में नेटवर्क और होस्ट पता निर्धारित करने के लिए किया जाता है।"
}, 
{
"subject": "Computer",
"topic": "Security",
"question_en": "What is the purpose of a firewall in computer security?",
"question_hi": "कंप्यूटर सुरक्षा में फायरवॉल का उद्देश्य क्या है?",
"A_en": "To prevent unauthorized access to a network", "A_hi": "एक नेटवर्क तक अनधिकृत पहुंच को रोकने के लिए",
"B_en": "To prevent malware from entering a network", "B_hi": "एक नेटवर्क में मैलवेयर को प्रवेश करने से रोकने के लिए",
"C_en": "To prevent unauthorized changes to a network", "C_hi": "एक नेटवर्क में अनधिकृत परिवर्तन को रोकने के लिए",
"D_en": "To prevent unauthorized access to a network and malware entry", "D_hi": "एक नेटवर्क तक अनधिकृत पहुंच और मैलवेयर प्रवेश को रोकने के लिए",
"answer": "D",
"explanation_en": "A firewall is used to prevent unauthorized access to a network and malware entry.",
"explanation_hi": "फायरवॉल का उपयोग एक नेटवर्क तक अनधिकृत पहुंच और मैलवेयर प्रवेश को रोकने के लिए किया जाता है।"
} ]