<think>
Okay, I need to create 10 high-quality MCQs on Rajasthan Polity for exams like LDC, CET, RAS, SSC, and Railway. Let me start by recalling the key topics within Rajasthan Polity. The subject includes the state's constitutional structure, local governance, constitutional amendments specific to Rajasthan, important acts, and key officials.

First, I should list important areas: Constitution, Governor, Council of Ministers, Legislative Assembly, Local Bodies, Constitutional Amendments, Important Acts, Key Officials, Judicial System, and Revenue Structure. Each of these can be a topic for a question.

For each question, the format needs to be in Hindi and English, with options in both languages. The answer and explanations also need to be in both languages. Let me start drafting the first question on the Constitution of Rajasthan. The Rajasthan Constitution Act, 1956 is a key point here. The options can include other constitutional development years like 1950, 1952, etc.

Next, the role of the Governor. The Governor is the nominal head, so a question on the Governor's role and appointment by the President would be relevant. The answer should state that the Governor is appointed by the President of India, and the explanation can elaborate on the constitutional provision.

The Council of Ministers is led by the Chief Minister. So a question on who constitutes the executive head would have the Chief Minister as the answer. Another question could be about the minimum number of members required for the Council of Ministers, which is 1/10th of the Assembly strength.

For the Legislative Assembly, the maximum strength is 200, so that's a good question. Local governance structures like Zila Parishad and Panchayat Raj can be another area. The 73rd Constitutional Amendment Act is crucial for Panchayati Raj, so a question on that would be useful.

The Rajasthan Lokayukta Act, 2000 is important for anti-corruption, making that a relevant topic. The Chief Minister's role in the state government is another key point. The State Election Commission comes under the Constitution's Schedule, specifically the 8th Schedule, but wait, actually, the Election Commission of India is under the Constitution, and the State Election Commission is a different body. Wait, maybe I should check that. No, the State Election Commission is established under the Constitution (Article 324), but the specific schedule might be part of the Representation of the People Act. Hmm, perhaps I need to clarify that. Alternatively, the State Election Commission is appointed by the Governor, so a question on that.

Revenue structure involves the Governor as the head, so a question on who administers the revenue system. The Rajya Sabha representation from Rajasthan is 10 seats, so that's another point. The District Collector's role as the administrative head of the district is important too.

Now, ensuring that each question is in both languages, with accurate explanations. Also, checking for any factual errors. For example, the Rajasthan Constitution Act was 1956, but the Constitution of India was adopted in 1950. The 73rd Amendment Act is correct for Panchayati Raj. The Lokayukta Act is 2000. The Chief Minister is the head of the Council of Ministers.

I need to verify the exact numbers, like the maximum members of the Legislative Assembly (200), the minimum members in the Council of Ministers (20), and the Rajya Sabha seats (10). Also, the District Collector's role as administrative head is correct.

Now, structuring each question with the required JSON format. Making sure that the answer is correctly marked and explanations are concise. Checking for any repeated topics or overlapping questions. Ensuring that the difficulty level is appropriate for Rajasthan State Exams, which typically test basic to intermediate knowledge.

Finally, double-checking the JSON structure to match the example provided, ensuring no extra fields and proper language in both Hindi and English.
</think>

[
  {
    "subject": "Rajasthan Polity",
    "topic": "Rajasthan Constitution",
    "question_en": "Which year saw the enactment of the Rajasthan Constitution Act?",
    "question_hi": "राजस्थान संविधान अधिनियम को किस वर्ष लागू किया गया था?",
    "A_en": "1950", "A_hi": "1950",
    "B_en": "1952", "B_hi": "1952",
    "C_en": "1956", "C_hi": "1956",
    "D_en": "1960", "D_hi": "1960",
    "answer": "C",
    "explanation_en": "The Rajasthan Constitution Act was enacted in 1956 under the provisions of the Indian Constitution (Article 239A).",
    "explanation_hi": "राजस्थान संविधान अधिनियम को 1956 में भारतीय संविधान (अनुच्छेद 239A) के प्रावधानों के तहत लागू किया गया था।"
  },
  {
    "subject": "Rajasthan Polity",
    "topic": "Governor and Chief Minister",
    "question_en": "Who appoints the Governor of Rajasthan?",
    "question_hi": "राजस्थान के राज्यपाल की नियुक्ति कौन करता है?",
    "A_en": "President of India", "A_hi": "भारत के राष्ट्रपति",
    "B_en": "Prime Minister of India", "B_hi": "भारत के प्रधान मंत्री",
    "C_en": "Chief Minister of Rajasthan", "C_hi": "राजस्थान के मुख्यमंत्री",
    "D_en": "Chief Justice of India", "D_hi": "भारत के मुख्य न्यायाधीश",
    "answer": "A",
    "explanation_en": "The Governor of Rajasthan is appointed by the President of India under Article 155 of the Indian Constitution.",
    "explanation_hi": "राजस्थान के राज्यपाल की नियुक्ति भारतीय संविधान के अनुच्छेद 155 के तहत भारत के राष्ट्रपति द्वारा की जाती है।"
  },
  {
    "subject": "Rajasthan Polity",
    "topic": "Council of Ministers",
    "question_en": "What is the minimum number of members required in the Council of Ministers of Rajasthan?",
    "question_hi": "राजस्थान के मंत्रिमंडल में सदस्यों की न्यूनतम संख्या क्या है?",
    "A_en": "10", "A_hi": "10",
    "B_en": "15", "B_hi": "15",
    "C_en": "20", "C_hi": "20",
    "D_en": "25", "D_hi": "25",
    "answer": "C",
    "explanation_en": "The Council of Ministers in Rajasthan must have at least 20 members, as per 1/10th of the total strength of the Legislative Assembly.",
    "explanation_hi": "राजस्थान में मंत्रिमंडल में कम से कम 20 सदस्यों के होने की आवश्यकता है, जो विधानसभा की कुल संख्या के 1/10वें के अनुसार है।"
  },
  {
    "subject": "Rajasthan Polity",
    "topic": "Legislative Assembly",
    "question_en": "What is the maximum strength of the Rajasthan Legislative Assembly?",
    "question_hi": "राजस्थान विधानसभा की अधिकतम शक्ति क्या है?",
    "A_en": "200", "A_hi": "200",
    "B_en": "250", "B_hi": "250",
    "C_en": "300", "C_hi": "300",
    "D_en": "350", "D_hi": "350",
    "answer": "A",
    "explanation_en": "The Rajasthan Legislative Assembly has a maximum of 200 members, including 200 directly elected and 20 nominated from Anglo-Indian community.",
    "explanation_hi": "राजस्थान विधानसभा में 200 सदस्यों की अधिकतम संख्या होती है, जिसमें 200 निर्वाचित और 20 अंग्रेजी-भाषी समुदाय से नामित सदस्य शामिल होते हैं।"
  },
  {
    "subject": "Rajasthan Polity",
    "topic": "Panchayati Raj",
    "question_en": "Which constitutional amendment introduced the Panchayati Raj system in Rajasthan?",
    "question_hi": "राजस्थान में पंचायती राज प्रणाली को पेश करने वाला संविधान संशोधन कौन-सा है?",
    "A_en": "73rd Amendment Act", "A_hi": "73वां संशोधन अधिनियम",
    "B_en": "74th Amendment Act", "B_hi": "74वां संशोधन अधिनियम",
    "C_en": "72nd Amendment Act", "C_hi": "72वां संशोधन अधिनियम",
    "D_en": "70th Amendment Act", "D_hi": "70वां संशोधन अधिनियम",
    "answer": "A",
    "explanation_en": "The 73rd Constitutional Amendment Act of 1992 introduced the Panchayati Raj system to strengthen local self-governance in Rajasthan.",
    "explanation_hi": "1992 के 73वें संविधान संशोधन अधिनियम ने राजस्थान में स्थानीय स्वशासन को मजबूत करने के लिए पंचायती राज प्रणाली को पेश किया।"
  },
  {
    "subject": "Rajasthan Polity",
    "topic": "Lokayukta",
    "question_en": "In which year was the Rajasthan Lokayukta Act enacted?",
    "question_hi": "राजस्थान लोकायुक्त अधिनियम को किस वर्ष लागू किया गया था?",
    "A_en": "2000", "A_hi": "2000",
    "B_en": "2005", "B_hi": "2005",
    "C_en": "2010", "C_hi": "2010",
    "D_en": "2015", "D_hi": "2015",
    "answer": "A",
    "explanation_en": "The Rajasthan Lokayukta Act was enacted in 2000 to combat corruption and ensure accountability in the state government.",
    "explanation_hi": "राजस्थान लोकायुक्त अधिनियम को 2000 में राज्य सरकार में भ्रष्टाचार के खिलाफ लड़ाई लड़ने और जवाबदेही सुनिश्चित करने के लिए लागू किया गया था।"
  },
  {
    "subject": "Rajasthan Polity",
    "topic": "Chief Minister",
    "question_en": "Who is the ex-officio Chairman of the Rajasthan Legislative Council?",
    "question_hi": "राजस्थान विधान परिषद के कार्यवाहक अध्यक्ष कौन होते हैं?",
    "A_en": "Governor of Rajasthan", "A_hi": "राजस्थान के राज्यपाल",
    "B_en": "Chief Minister of Rajasthan", "B_hi": "राजस्थान के मुख्यमंत्री",
    "C_en": "Speaker of Legislative Assembly", "C_hi": "विधानसभा के अध्यक्ष",
    "D_en": "Chief Justice of Rajasthan", "D_hi": "राजस्थान के मुख्य न्यायाधीश",
    "answer": "B",
    "explanation_en": "The Chief Minister of Rajasthan serves as the ex-officio Chairman of the Legislative Council.",
    "explanation_hi": "राजस्थान के मुख्यमंत्री विधान परिषद के कार्यवाहक अध्यक्ष के रूप में कार्य करते हैं।"
  },
  {
    "subject": "Rajasthan Polity",
    "topic": "State Election Commission",
    "question_en": "Under which article of the Indian Constitution is the Rajasthan State Election Commission established?",
    "question_hi": "भारतीय संविधान के किस अनुच्छेद के तहत राजस्थान राज्य चुनाव आयोग की स्थापना की गई है?",
    "A_en": "Article 324", "A_hi": "अनुच्छेद 324",
    "B_en": "Article 243K", "B_hi": "अनुच्छेद 243के",
    "C_en": "Article 325", "C_hi": "अनुच्छेद 325",
    "D_en": "Article 243D", "D_hi": "अनुच्छेद 243डी",
    "answer": "B",
    "explanation_en": "The Rajasthan State Election Commission is established under Article 243K of the Indian Constitution.",
    "explanation_hi": "राजस्थान राज्य चुनाव आयोग की स्थापना भारतीय संविधान के अनुच्छेद 243के के तहत की गई है।"
  },
  {
    "subject": "Rajasthan Polity",
    "topic": "Revenue System",
    "question_en": "Who is the head of the Revenue System in Rajasthan?",
    "question_hi": "राजस्थान में राजस्व प्रणाली का प्रमुख कौन होता है?",
    "A_en": "Governor", "A_hi": "राज्यपाल",
    "B_en": "Chief Minister", "B_hi": "मुख्यमंत्री",
    "C_en": "Collector", "C_hi": "कलेक्टर",
    "D_en": "District Magistrate", "D_hi": "जिला अधिकारी",
    "answer": "A",
    "explanation_en": "The Governor of Rajasthan is the head of the state's revenue system, overseeing all revenue administration.",
    "explanation_hi": "राजस्थान के राज्यपाल राज्य की राजस्व प्रणाली के प्रमुख होते हैं और सभी राजस्व प्रशासन की देखरेख करते हैं।"
  },
  {
    "subject": "Rajasthan Polity",
    "topic": "Rajya Sabha Representation",
    "question_en": "How many members from Rajasthan