[
{
"subject": "Rajasthan Polity",
"topic": "Rajya Nirman Aayog",
"question_en": "What is the main objective of the Rajasthan State Commission for Backward Classes?",
"question_hi": "राजस्थान राज्य पिछड़े वर्ग आयोग का मुख्य उद्देश्य क्या है?",
"A_en": "To promote the welfare of SCs and STs", "A_hi": "एससी और एसटी के कल्याण को बढ़ावा देना",
"B_en": "To protect the rights of backward classes", "B_hi": "पिछड़े वर्गों के अधिकारों की रक्षा करना",
"C_en": "To provide reservations to backward classes in government jobs", "C_hi": "पिछड़े वर्गों को सरकारी नौकरियों में आरक्षण प्रदान करना",
"D_en": "To promote education and employment opportunities for backward classes", "D_hi": "पिछड़े वर्गों के लिए शिक्षा और रोजगार के अवसरों को बढ़ावा देना",
"answer": "D",
"explanation_en": "The main objective of the Rajasthan State Commission for Backward Classes is to promote education and employment opportunities for backward classes.",
"explanation_hi": "राजस्थान राज्य पिछड़े वर्ग आयोग का मुख्य उद्देश्य पिछड़े वर्गों के लिए शिक्षा और रोजगार के अवसरों को बढ़ावा देना है।"
},
{
"subject": "Rajasthan Polity",
"topic": "Rajya Nirman Aayog",
"question_en": "What is the role of the Rajasthan Housing Board?",
"question_hi": "राजस्थान आवास बोर्ड की भूमिका क्या है?",
"A_en": "To provide affordable housing to the people of Rajasthan", "A_hi": "राजस्थान के लोगों को सस्ती आवास प्रदान करना",
"B_en": "To develop infrastructure in urban areas", "B_hi": "शहरी क्षेत्रों में आधुनिकरण विकास करना",
"C_en": "To provide loans to the people of Rajasthan", "C_hi": "राजस्थान के लोगों को ऋण प्रदान करना",
"D_en": "To promote tourism in Rajasthan", "D_hi": "राजस्थान में पर्यटन को बढ़ावा देना",
"answer": "A",
"explanation_en": "The Rajasthan Housing Board is responsible for providing affordable housing to the people of Rajasthan.",
"explanation_hi": "राजस्थान आवास बोर्ड राजस्थान के लोगों को सस्ती आवास प्रदान करने के लिए जिम्मेदार है।"
},
{
"subject": "Rajasthan Polity",
"topic": "Rajya Nirman Aayog",
"question_en": "What is the main function of the Rajasthan State Election Commission?",
"question_hi": "राजस्थान राज्य चुनाव आयोग की मुख्य कार्यवाही क्या है?",
"A_en": "To conduct elections to the Rajasthan Legislative Assembly", "A_hi": "राजस्थान विधानसभा के चुनावों का आयोजन करना",
"B_en": "To prepare electoral rolls", "B_hi": "चुनावी रोल तैयार करना",
"C_en": "To demarcate electoral boundaries", "C_hi": "चुनावी सीमाएं निर्धारित करना",
"D_en": "To provide information about election candidates", "D_hi": "चुनावी प्रत्याशियों के बारे में जानकारी प्रदान करना",
"answer": "A",
"explanation_en": "The main function of the Rajasthan State Election Commission is to conduct elections to the Rajasthan Legislative Assembly.",
"explanation_hi": "राजस्थान राज्य चुनाव आयोग की मुख्य कार्यवाही राजस्थान विधानसभा के चुनावों का आयोजन करना है।"
},
{
"subject": "Rajasthan Polity",
"topic": "Rajya Nirman Aayog",
"question_en": "What is the role of the Rajasthan Public Service Commission?",
"question_hi": "राजस्थान लोक सेवा आयोग की भूमिका क्या है?",
"A_en": "To conduct examinations for recruitment to government services", "A_hi": "सरकारी सेवाओं में भर्ती के लिए परीक्षाएं आयोजित करना",
"B_en": "To advise the government on matters of public interest", "B_hi": "सार्वजनिक रुचि के मामलों पर सरकार को सलाह देना",
"C_en": "To provide training to government officials", "C_hi": "सरकारी अधिकारियों को प्रशिक्षण प्रदान करना",
"D_en": "To promote good governance in Rajasthan", "D_hi": "राजस्थान में अच्छी प्रशासनिक व्यवस्था को बढ़ावा देना",
"answer": "A",
"explanation_en": "The role of the Rajasthan Public Service Commission is to conduct examinations for recruitment to government services.",
"explanation_hi": "राजस्थान लोक सेवा आयोग की भूमिका सरकारी सेवाओं में भर्ती के लिए परीक्षाएं आयोजित करना है।"
},
{
"subject": "Rajasthan Polity",
"topic": "Rajya Nirman Aayog",
"question_en": "What is the main objective of the Rajasthan State Human Rights Commission?",
"question_hi": "राजस्थान राज्य मानवाधिकार आयोग का मुख्य उद्देश्य क्या है?",
"A_en": "To protect the human rights of citizens of Rajasthan", "A_hi": "राजस्थान के नागरिकों के मानवाधिकारों की रक्षा करना",
"B_en": "To promote education and employment opportunities for citizens of Rajasthan", "B_hi": "राजस्थान के नागरिकों के लिए शिक्षा और रोजगार के अवसरों को बढ़ावा देना",
"C_en": "To provide relief to victims of human rights violations", "C_hi": "मानवाधिकारों के उल्लंघन के शिकारों को राहत प्रदान करना",
"D_en": "To conduct investigations into human rights violations", "D_hi": "मानवाधिकारों के उल्लंघन की जांच करना",
"answer": "A",
"explanation_en": "The main objective of the Rajasthan State Human Rights Commission is to protect the human rights of citizens of Rajasthan.",
"explanation_hi": "राजस्थान राज्य मानवाधिकार आयोग का मुख्य उद्देश्य राजस्थान के नागरिकों के मानवाधिकारों की रक्षा करना है।"
},
{
"subject": "Rajasthan Polity",
"topic": "Rajya Nirman Aayog",
"question_en": "What is the role of the Rajasthan State Information Commission?",
"question_hi": "राजस्थान राज्य सूचना आयोग की भूमिका क्या है?",
"A_en": "To provide information to citizens of Rajasthan", "A_hi": "राजस्थान के नागरिकों को जानकारी प्रदान करना",
"B_en": "To regulate the Right to Information Act", "B_hi": "सूचना अधिकार अधिनियम को नियंत्रित करना",
"C_en": "To provide training to government officials", "C_hi": "सरकारी अधिकारियों को प्रशिक्षण प्रदान करना",
"D_en": "To promote transparency in government departments", "D_hi": "सरकारी विभागों में पारदर्शिता को बढ़ावा देना",
"answer": "A",
"explanation_en": "The role of the Rajasthan State Information Commission is to provide information to citizens of Rajasthan.",
"explanation_hi": "राजस्थान राज्य सूचना आयोग की भूमिका राजस्थान के नागरिकों को जानकारी प्रदान करना है।"
},
{
"subject": "Rajasthan Polity",
"topic": "Rajya Nirman Aayog",
"question_en": "What is the main function of the Rajasthan State Consumer Disputes Redressal Commission?",
"question_hi": "राजस्थान राज्य उपभोक्ता विवाद निवारण आयोग की मुख्य कार्यवाही क्या है? ",
"A_en": "To resolve consumer disputes", "A_hi": "उपभोक्ता विवादों का समाधान करना",
"B_en": "To provide training to consumer protection officers", "B_hi": "उपभोक्ता संरक्षण अधिकारियों को प्रशिक्षण प्रदान करना",
"C_en": "To regulate consumer protection laws", "C_hi": "उपभोक्ता संरक्षण कानूनों को नियंत्रित करना",
"D_en": "To promote consumer awareness", "D_hi": "उपभोक्ता जागरूकता को बढ़ावा देना",
"answer": "A",
"explanation_en": "The main function of the Rajasthan State Consumer Disputes Redressal Commission is to resolve consumer disputes.",
"explanation_hi": "राजस्थान राज्य उपभोक्ता विवाद निवारण आयोग की मुख्य कार्यवाही उपभोक्ता विवादों का समाधान करना है।"
},
{
"subject": "Rajasthan Polity",
"topic": "Rajya Nirman Aayog",
"question_en": "What is the role of the Rajasthan State Environment and Science Technology Department?",
"question_hi": "राजस्थान राज्य वातावरण और विज्ञान प्रौद्योगिकी विभाग की भूमिका क्या है?",
"A_en": "To protect and preserve the environment", "A_hi": "वातावरण की रक्षा और संरक्षण करना",
"B_en": "To promote science and technology education", "B_hi": "विज्ञान और प्रौद्योगिकी शिक्षा को बढ़ावा देना",
"C_en": "To provide financial assistance to environmental projects", "C_hi": "वातावरण संबंधी परियोजनाओं को वित्तीय सहायता प्रदान करना",
"D_en": "To conduct research on environmental issues", "D_hi": "वातावरण संबंधी मुद्दों पर शोध करना",
"answer": "A",
"explanation_en": "The role of the Rajasthan State Environment and Science Technology Department is to protect and preserve the environment.",
"explanation_hi": "राजस्थान राज्य वातावरण और विज्ञान प्रौद्योगिकी विभाग की भूमिका वातावरण की रक्षा और संरक्षण करना है।"
},
{
"subject": "Rajasthan Polity",
"topic": "Rajya Nirman Aayog",
"question_en": "What is the main function of the Rajasthan State Women's Commission?",
"question_hi": "राजस्थान राज्य महिला आयोग की मुख्य कार्यवाही क्या है?",
"A_en": "To protect the rights of women in Rajasthan", "A_hi": "राजस्थान की महिलाओं के अधिकारों की रक्षा करना",
"B_en": "To promote women's education and employment", "B_hi": "महिला शिक्षा और रोजगार को बढ़ावा देना",
"C_en": "To provide relief to victims of domestic violence", "C_hi": "घरेलू हिंसा के शिकारों को राहत प्रदान करना",
"D_en": "To conduct investigations into cases of violence against women", "D_hi": "महिलाओं के खिलाफ हिंसा की जांच करना",
"answer": "A",
"explanation_en": "The main function of the Rajasthan State Women's Commission is to protect the rights of women in Rajasthan.",
"explanation_hi": "राजस्थान राज्य महिला आयोग की मुख्य कार्यवाही राजस्थान की महिलाओं के अधिकारों की रक्षा करना है।"
},
{
"subject": "Rajasthan Polity",
"topic": "Rajya Nirman Aayog",
"question_en": "What is the role of the Rajasthan State Social Welfare Department?",
"question_hi": "राजस्थान राज्य सामाजिक कल्याण विभाग की भूमिका क्या है?",
"A_en": "To provide financial assistance to poor families", "A_hi": "गरीब परिवारों को वित्तीय सहायता प्रदान करना",
"B_en": "To promote education and employment opportunities for the poor", "B_hi": "गरीबों के लिए शिक्षा और रोजगार के अवसरों को बढ़ावा देना",
"C_en": "To provide relief to victims of natural disasters", "C_hi": "प्राकृतिक आपदाओं के शिकारों को राहत प्रदान करना",
"D_en": "To conduct investigations into cases of poverty and inequality", "D_hi": "गरीबी और असमानता के मामलों की जांच करना",
"answer": "A",
"explanation_en": "The role of the Rajasthan State Social Welfare Department is to provide financial assistance to poor families.",
"explanation_hi": "राजस्थान राज्य सामाजिक कल्याण विभाग की भूमिका गरीब परिवारों को वित्तीय सहायता प्रदान करना है।"
}