[
{
"subject": "Reasoning",
"topic": "Syllogisms",
"question_en": "Which of the following conclusions can be drawn from the statements: All cats are animals. All dogs are animals.",
"question_hi": "निम्नलिखित निष्कर्षों में से कौन सा कथनों से निकाला जा सकता है: सभी बिल्लियाँ जानवर हैं। सभी कुत्ते जानवर हैं।",
"A_en": "All cats are dogs.", "A_hi": "सभी बिल्लियाँ कुत्ते हैं।",
"B_en": "All animals are cats or dogs.", "B_hi": "सभी जानवर बिल्लियाँ या कुत्ते हैं।",
"C_en": "Some animals are cats or dogs.", "C_hi": "कुछ जानवर बिल्लियाँ या कुत्ते हैं।",
"D_en": "All cats and dogs are animals.", "D_hi": "सभी बिल्लियाँ और कुत्ते जानवर हैं।",
"answer": "D",
"explanation_en": "The statements clearly indicate that both cats and dogs are animals, so the conclusion that all cats and dogs are animals is logically drawn.",
"explanation_hi": "कथनों से स्पष्ट रूप से पता चलता है कि बिल्लियाँ और कुत्ते दोनों जानवर हैं, इसलिए यह निष्कर्ष निकाला जा सकता है कि सभी बिल्लियाँ और कुत्ते जानवर हैं।",
"level": "Easy"
},
{
"subject": "Reasoning",
"topic": "Syllogisms",
"question_en": "If all A are B, and all B are C, then which of the following is true?",
"question_hi": "यदि सभी A बी हैं, और सभी बी सी हैं, तो निम्नलिखित में से कौन सा सच है?",
"A_en": "All A are C", "A_hi": "सभी ए सी हैं",
"B_en": "All C are A", "B_hi": "सभी सी ए हैं",
"C_en": "All B are A", "C_hi": "सभी बी ए हैं",
"D_en": "Some A are C", "D_hi": "कुछ ए सी हैं",
"answer": "A",
"explanation_en": "Given that all A are B and all B are C, it logically follows that all A are C.",
"explanation_hi": "सभी ए बी हैं और सभी बी सी हैं, यह तार्किक रूप से इसका पालन करता है कि सभी ए सी हैं।",
"level": "Medium"
},
{
"subject": "Reasoning",
"topic": "Number Series",
"question_en": "Find the next number in the series: 2, 4, 8, 16, 32, ...",
"question_hi": "श्रृंखला में अगली संख्या खोजें: 2, 4, 8, 16, 32, ...",
"A_en": "48", "A_hi": "48",
"B_en": "64", "B_hi": "64",
"C_en": "128", "C_hi": "128",
"D_en": "256", "D_hi": "256",
"answer": "B",
"explanation_en": "The pattern of the series is obtained by multiplying the previous term by 2.",
"explanation_hi": "श्रृंखला का पैटर्न पिछले पद को 2 से गुणा करके प्राप्त किया जाता है।",
"level": "Easy"
},
{
"subject": "Reasoning",
"topic": "Analogies",
"question_en": "Bird : Nest :: Fish : ?",
"question_hi": "पक्षी : घोंसला :: मछली : ?",
"A_en": "Water", "A_hi": "पानी",
"B_en": "Net", "B_hi": "जाल",
"C_en": "Cave", "C_hi": "गुफा",
"D_en": "Aquarium", "D_hi": "एक्वेरियम",
"answer": "A",
"explanation_en": "Just as birds live in nests, fish live in water.",
"explanation_hi": "जैसे पक्षी घोंसले में रहते हैं, वैसे ही मछली पानी में रहती है।",
"level": "Easy"
},
{
"subject": "Reasoning",
"topic": "Coding-Decoding",
"question_en": "If 'CAT' is coded as 'DBU', then 'DOG' will be coded as:",
"question_hi": "यदि 'CAT' को 'DBU' के रूप में संक्षिप्त किया जाए, तो 'DOG' को कैसे संक्षिप्त किया जाएगा:",
"A_en": "DPE", "A_hi": "डीपीई",
"B_en": "EPH", "B_hi": "ईपीएच",
"C_en": "EPH", "C_hi": "ईपीएच",
"D_en": "EIQ", "D_hi": "ईआईक्यू",
"answer": "C",
"explanation_en": "Each letter in 'CAT' is shifted one position forward to get 'DBU', so applying the same rule to 'DOG' gives 'EPH'.",
"explanation_hi": "'CAT' में प्रत्येक अक्षर को आगे की ओर एक स्थिति में बदलकर 'DBU' मिलता है, इसलिए 'DOG' पर इसी नियम को लागू करने से 'EPH' मिलता है।",
"level": "Medium"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "A is the father of B, and C is the daughter of B. What is the relationship between A and C?",
"question_hi": "ए बी का पिता है, और सी बी की बेटी है। ए और सी के बीच क्या संबंध है?",
"A_en": "Father-Daughter", "A_hi": "पिता-पुत्री",
"B_en": "Mother-Son", "B_hi": "माता-पुत्र",
"C_en": "Brother-Sister", "C_hi": "भाई-बहन",
"D_en": "Grandfather-Granddaughter", "D_hi": "दादा-पोती",
"answer": "A",
"explanation_en": "Given that A is the father of B, and C is the daughter of B, it means A is the grandfather of C, but since the option of grandfather is not available, the closest relation provided is Father-Daughter, which is incorrect based on the information given but is the closest in the context of the provided options.",
"explanation_hi": "यह दिया गया है कि ए बी का पिता है, और सी बी की बेटी है, इसका अर्थ है कि ए सी का दादा है, लेकिन चूंकि दादा का विकल्प उपलब्ध नहीं है, इसलिए दिए गए विकल्पों में से सबसे करीबी संबंध पिता-पुत्री है, जो दी गई जानकारी के आधार पर गलत है लेकिन दिए गए विकल्पों के संदर्भ में सबसे करीबी है।",
"level": "Medium"
},
{
"subject": "Reasoning",
"topic": "Logical Deductions",
"question_en": "If it is true that all students who study French also study Spanish, and John studies French, what can be concluded about John?",
"question_hi": "यदि यह सच है कि जो छात्र फ्रेंच का अध्ययन करते हैं वे स्पेनिश का भी अध्ययन करते हैं, और जॉन फ्रेंच का अध्ययन करता है, तो जॉन के बारे में क्या निष्कर्ष निकाला जा सकता है?",
"A_en": "John studies Spanish.", "A_hi": "जॉन स्पेनिश का अध्ययन करता है।",
"B_en": "John does not study Spanish.", "B_hi": "जॉन स्पेनिश का अध्ययन नहीं करता है।",
"C_en": "John studies only French.", "C_hi": "जॉन केवल फ्रेंच का अध्ययन करता है।",
"D_en": "John does not study French or Spanish.", "D_hi": "जॉन फ्रेंच या स्पेनिश का अध्ययन नहीं करता है।",
"answer": "A",
"explanation_en": "Given that all students who study French also study Spanish, and John studies French, it logically follows that John studies Spanish.",
"explanation_hi": "यह दिया गया है कि जो छात्र फ्रेंच का अध्ययन करते हैं वे स्पेनिश का भी अध्ययन करते हैं, और जॉन फ्रेंच का अध्ययन करता है, इसलिए यह तार्किक रूप से इसका पालन करता है कि जॉन स्पेनिश का अध्ययन करता है।",
"level": "Easy"
},
{
"subject": "Reasoning",
"topic": "Pattern Completion",
"question_en": "Complete the pattern: 3, 6, 9, 12, 15, ?",
"question_hi": "पैटर्न पूरा करें: 3, 6, 9, 12, 15, ?",
"A_en": "16", "A_hi": "16",
"B_en": "18", "B_hi": "18",
"C_en": "20", "C_hi": "20",
"D_en": "21", "D_hi": "21",
"answer": "B",
"explanation_en": "The pattern is formed by adding 3 to the previous term.",
"explanation_hi": "पैटर्न पिछले पद में 3 जोड़कर बनाया जाता है।",
"level": "Easy"
},
{
"subject": "Reasoning",
"topic": "Direction Sense",
"question_en": "Rahul is facing North. He turns 90 degrees to his left. Which direction is he facing now?",
"question_hi": "राहुल उत्तर की ओर मुख कर रहा है। वह अपने बाएं ओर 90 डिग्री मुड़ता है। वह अब किस दिशा में मुख कर रहा है?",
"A_en": "East", "A_hi": "पूर्व",
"B_en": "West", "B_hi": "पश्चिम",
"C_en": "South", "C_hi": "दक्षिण",
"D_en": "North", "D_hi": "उत्तर",
"answer": "B",
"explanation_en": "When Rahul turns 90 degrees to his left from facing North, he will be facing West.",
"explanation_hi": "जब राहुल उत्तर की ओर मुख करते हुए अपने बाएं ओर 90 डिग्री मुड़ता है, तो वह पश्चिम की ओर मुख करेगा।",
"level": "Easy"
},
{
"subject": "Reasoning",
"topic": "Seating Arrangement",
"question_en": "Five friends - A, B, C, D, and E are sitting in a row. A is sitting at one of the ends. C is sitting to the immediate right of B. D is sitting to the immediate left of E. If B is not sitting at either end, where is C sitting?",
"question_hi": "पाँच मित्र - ए, बी, सी, डी, और ई एक पंक्ति में बैठे हैं। ए एक छोर पर बैठा है। सी बी के तत्काल दाएं बैठा है। डी ई के तत्काल बाएं बैठा है। यदि बी किसी भी छोर पर नहीं बैठा है, तो सी कहाँ बैठा है?",
"A_en": "At one of the ends", "A_hi": "एक छोर पर",
"B_en": "To the immediate left of B", "B_hi": "बी के तत्काल बाएं",
"C_en": "To the immediate right of B", "C_hi": "बी के तत्काल दाएं",
"D_en": "To the immediate left of D", "D_hi": "डी के तत्काल बाएं",
"answer": "C",
"explanation_en": "Given that C is sitting to the immediate right of B, and B is not sitting at either end, C must be sitting to the immediate right of B.",
"explanation_hi": "यह दिया गया है कि सी बी के तत्काल दाएं बैठा है, और बी किसी भी छोर पर नहीं बैठा है, इसलिए सी बी के तत्काल दाएं बैठा होगा।",
"level": "Medium"
}
]