[
{
"subject": "Reasoning",
"topic": "Logical Reasoning",
"question_en": "A bat and a ball together cost $1.10. The bat costs $1.00 more than the ball. How much does the ball cost?",
"question_hi": "एक बल्ला और एक गेंद मिलाकर $1.10 की लगत है। बल्ला गेंद से $1.00 अधिक महंगा है। गेंद की कीमत कितनी है?",
"A_en": "5 cents", "A_hi": "5 सेंट",
"B_en": "10 cents", "B_hi": "10 सेंट",
"C_en": "15 cents", "C_hi": "15 सेंट",
"D_en": "20 cents", "D_hi": "20 सेंट",
"answer": "A",
"explanation_en": "Let's assume the cost of the ball is x. Since the bat costs $1.00 more than the ball, the cost of the bat is x + $1.00. The total cost of the bat and the ball is $1.10, so we can set up the equation x + (x + $1.00) = $1.10. Solving for x, we get 2x + $1.00 = $1.10, 2x = $0.10, x = $0.05.",
"explanation_hi": "मान लें कि गेंद की कीमत x है। चूंकि बल्ला गेंद से $1.00 अधिक महंगा है, इसलिए बल्ले की कीमत x + $1.00 है। बल्ले और गेंद की कुल कीमत $1.10 है, इसलिए हम समीकरण x + (x + $1.00) = $1.10 बना सकते हैं। x के लिए हल करने पर, हमें 2x + $1.00 = $1.10, 2x = $0.10, x = $0.05 मिलता है।"
},
{
"subject": "Reasoning",
"topic": "Logical Reasoning",
"question_en": "If it takes 5 machines 5 minutes to make 5 widgets, how long would it take 100 machines to make 100 widgets?",
"question_hi": "यदि 5 मशीनों को 5 मिनट में 5 विजेट बनाने में लगता है, तो 100 मशीनों को 100 विजेट बनाने में कितना समय लगेगा?",
"A_en": "5 minutes", "A_hi": "5 मिनट",
"B_en": "10 minutes", "B_hi": "10 मिनट",
"C_en": "15 minutes", "C_hi": "15 मिनट",
"D_en": "20 minutes", "D_hi": "20 मिनट",
"answer": "A",
"explanation_en": "If 5 machines can make 5 widgets in 5 minutes, then 1 machine can make 1 widget in 5 minutes. Therefore, 100 machines can make 100 widgets in 5 minutes.",
"explanation_hi": "यदि 5 मशीनें 5 मिनट में 5 विजेट बना सकती हैं, तो 1 मशीन 5 मिनट में 1 विजेट बना सकती है। इसलिए, 100 मशीनें 5 मिनट में 100 विजेट बना सकती हैं।"
},
{
"subject": "Reasoning",
"topic": "Logical Reasoning",
"question_en": "A snail is at the bottom of a 20-foot well. Each day, it climbs up 3 feet, but at night, it slips back 2 feet. How many days will it take for the snail to reach the top of the well?",
"question_hi": "एक स्नेल 20 फुट गहरे कुएं के नीचे है। प्रतिदिन, यह 3 फुट ऊपर चढ़ता है, लेकिन रात में यह 2 फुट नीचे फिसल जाता है। स्नेल को कुएं के शीर्ष तक पहुंचने में कितने दिन लगेंगे?",
"A_en": "18 days", "A_hi": "18 दिन",
"B_en": "20 days", "B_hi": "20 दिन",
"C_en": "22 days", "C_hi": "22 दिन",
"D_en": "28 days", "D_hi": "28 दिन",
"answer": "B",
"explanation_en": "The snail climbs 3 feet up and slips 2 feet back, so it effectively moves 1 foot up each day. To reach the top of the 20-foot well, it will take 18 days to climb 18 feet, and on the 19th day, it will climb the final 2 feet to reach the top. However, since it climbs 3 feet on the 19th day, it will reach the top on the 18th day and then climb 3 feet on the 19th day, so it will take 18 + 2 = 20 days to reach the top and then climb back down 2 feet.",
"explanation_hi": "स्नेल 3 फुट ऊपर चढ़ता है और 2 फुट नीचे फिसल जाता है, इसलिए यह प्रभावी रूप से प्रतिदिन 1 फुट ऊपर जाता है। 20 फुट गहरे कुएं के शीर्ष तक पहुंचने के लिए, यह 18 दिनों में 18 फुट चढ़ने में लगेगा, और 19वें दिन, यह शीर्ष तक पहुंचने के लिए अंतिम 2 फुट चढ़ेगा। हालांकि, चूंकि यह 19वें दिन 3 फुट चढ़ता है, यह 18वें दिन शीर्ष तक पहुंच जाएगा और फिर 19वें दिन 3 फुट चढ़ेगा, इसलिए शीर्ष तक पहुंचने और फिर 2 फुट नीचे उतरने में 18 + 2 = 20 दिन लगेंगे।"
},
{
"subject": "Reasoning",
"topic": "Logical Reasoning",
"question_en": "A woman has two coins that add up to 30 cents. One coin is not a nickel. What are the two coins?",
"question_hi": "एक महिला के पास दो सिक्के हैं जो 30 सेंट के बराबर हैं। एक सिक्का निकेल नहीं है। दो सिक्के कौन से हैं?",
"A_en": "Quarter and nickel", "A_hi": "चौथाई और निकेल",
"B_en": "Dime and twenty cents", "B_hi": "दस सेंट और बीस सेंट",
"C_en": "Quarter and dime", "C_hi": "चौथाई और दस सेंट",
"D_en": "Half dollar and twenty cents", "D_hi": "अर्ध डॉलर और बीस सेंट",
"answer": "C",
"explanation_en": "Since one of the coins is not a nickel, the other coin can be a nickel. However, the combination of a nickel and another coin that adds up to 30 cents is not possible. The only possible combination is a quarter (25 cents) and a nickel (5 cents), but this is not an option. The next possible combination is a quarter (25 cents) and a dime (5 cents) is not correct, but a quarter (25 cents) and a nickel (5 cents) is correct, so the correct answer is a quarter and a nickel, but since one coin is not a nickel, the correct answer is a quarter and a dime, which is 25 + 5 = 30 cents.",
"explanation_hi": "चूंकि एक सिक्का निकेल नहीं है, दूसरा सिक्का निकेल हो सकता है। हालांकि, 30 सेंट तक जोड़ने वाले सिक्के और एक अन्य सिक्के का संयोजन संभव नहीं है। एकमात्र संभावित संयोजन एक चौथाई (25 सेंट) और एक निकेल (5 सेंट) है, लेकिन यह एक विकल्प नहीं है। अगला संभावित संयोजन एक चौथाई (25 सेंट) और एक दशम (5 सेंट) है, जो सही नहीं है, लेकिन एक चौथाई (25 सेंट) और एक निकेल (5 सेंट) सही है, इसलिए सही उत्तर एक चौथाई और एक निकेल है, लेकिन चूंकि एक सिक्का निकेल नहीं है, सही उत्तर एक चौथाई और एक दशम है, जो 25 + 5 = 30 सेंट है।"
},
{
"subject": "Reasoning",
"topic": "Logical Reasoning",
"question_en": "You are in a room with three light switches. Each switch corresponds to one of three light bulbs in a room. Each light bulb is either on or off. You can't see the light bulbs from where you are, but you can turn the switches on and off as many times as you want. How can you figure out which switch corresponds to which light bulb?",
"question_hi": "आप एक कमरे में तीन लाइट स्विच के साथ हैं। प्रत्येक स्विच तीन लाइट बल्बों में से एक से मेल खाता है। प्रत्येक लाइट बल्ब या तो चालू है या बंद है। आप जहां हैं वहां से लाइट बल्ब नहीं देख सकते हैं, लेकिन आप स्विच को चालू और बंद कर सकते हैं जितनी बार चाहें। आप यह कैसे पता कर सकते हैं कि कौन सा स्विच किस लाइट बल्ब से मेल खाता है?",
"A_en": "Turn switch 1 to on for 5 minutes, then turn it off and turn switch 2 to on. Go into the room and feel the bulbs.", "A_hi": "स्विच 1 को 5 मिनट के लिए चालू करें, फिर इसे बंद करें और स्विच 2 को चालू करें। कमरे में जाएं और बल्बों को महसूस करें।",
"B_en": "Turn switch 1 to on, then turn it off and turn switch 2 to on. Go into the room and look at the bulbs.", "B_hi": "स्विच 1 को चालू करें, फिर इसे बंद करें और स्विच 2 को चालू करें। कमरे में जाएं और बल्बों को देखें।",
"C_en": "Turn switch 1 to on for 5 minutes, then turn it off and turn switch 3 to on. Go into the room and feel the bulbs.", "C_hi": "स्विच 1 को 5 मिनट के लिए चालू करें, फिर इसे बंद करें और स्विच 3 को चालू करें। कमरे में जाएं और बल्बों को महसूस करें।",
"D_en": "Turn switch 1 to on, then turn it off and turn switch 3 to on. Go into the room and look at the bulbs.", "D_hi": "स्विच 1 को चालू करें, फिर इसे बंद करें और स्विच 3 को चालू करें। कमरे में जाएं और बल्बों को देखें।",
"answer": "A",
"explanation_en": "Turn switch 1 to on for 5 minutes, then turn it off and turn switch 2 to on. Go into the room and feel the bulbs. The bulb that is on will be switch 2, the bulb that is warm but off will be switch 1, and the bulb that is cold and off will be switch 3.",
"explanation_hi": "स्विच 1 को 5 मिनट के लिए चालू करें, फिर इसे बंद करें और स्विच 2 को चालू करें। कमरे में जाएं और बल्बों को महसूस करें। जो बल्ब चालू है वह स्विच 2 होगा, जो बल्ब गर्म लेकिन बंद है वह स्विच 1 होगा, और जो बल्ब ठंडा और बंद है वह स्विच 3 होगा।"
},
{
"subject": "Reasoning",
"topic": "Logical Reasoning",
"question_en": "You have 8 balls, and one of them will be slightly heavier or lighter than the others. How can you find the heavier or lighter ball in only 2 weighings?",
"question_hi": "आपके पास 8 गेंदें हैं, और उनमें से एक थोड़ी भारी या हल्की होगी। आप केवल 2 तौलने में भारी या हल्की गेंद कैसे पा सकते हैं?",
"A_en": "Weigh 3 balls against 3 balls. If one side is heavier, then the heavier ball is one of those 3. Weigh 2 of the 3 balls against each other. If one is heavier, it is the heavier ball. If they are the same, the remaining ball is the heavier ball.", "A_hi": "3 गेंदों को 3 गेंदों के खिलाफ तौलें। यदि एक तरफ भारी है, तो भारी गेंद उन 3 में से एक है। 3 में से 2 गेंदों को एक दूसरे के खिलाफ तौलें। यदि एक भारी है, तो यह भारी गेंद है। यदि वे समान हैं, तो शेष गेंद भारी गेंद है।",
"B_en": "Weigh 4 balls against 4 balls. If one side is heavier, then the heavier ball is one of those 4. Weigh 2 of the 4 balls against each other. If one is heavier, it is the heavier ball. If they are the same, the remaining ball is the heavier ball.", "B_hi": "4 गेंदों को 4 गेंदों के खिलाफ तौलें। यदि एक तरफ भारी है, तो भारी गेंद उन 4 में से एक है। 4 में से 2 गेंदों को एक दूसरे के खिलाफ तौलें। यदि एक भारी है, तो यह भारी गेंद है। यदि वे समान हैं, तो शेष गेंद भारी गेंद है।",
"C_en": "Weigh 2 balls against 2 balls. If one side is heavier, then the heavier ball is one of those 2. Weigh 1 of the 2 balls against the other. If one is heavier, it is the heavier ball.", "C_hi": "2 गेंदों को 2 गेंदों के खिलाफ तौलें। यदि एक तरफ भारी है, तो भारी गेंद उन 2 में से एक है। 2 में से 1 गेंद को दूसरे के खिलाफ तौलें। यदि एक भारी है, तो यह भारी गेंद है।",
"D_en": "Weigh 1 ball against 1 ball. If one is heavier, it is the heavier ball.", "D_hi": "1 गेंद को 1 गेंद के खिलाफ तौलें। यदि एक भारी है, तो यह भारी गेंद है।",
"answer": "A",
"explanation_en": "Weigh 3 balls against 3 balls. If one side is heavier, then the heavier ball is one of those 3. Weigh 2 of the 3 balls against each other. If one is heavier, it is the heavier ball. If they are the same, the remaining ball is the heavier ball.",
"explanation_hi": "3 गेंदों को 3 गेंदों के खिलाफ तौलें। यदि एक तरफ भारी है, तो भारी गेंद उन 3 में से एक है। 3 में से 2 गेंदों को एक दूसरे के खिलाफ तौलें। यदि एक भारी है, तो यह भारी गेंद है। यदि वे समान हैं, तो शेष गेंद भारी गेंद है।"
},
{
"subject": "Reasoning",
"topic": "Logical Reasoning",
"question_en": "A man is looking at a photograph of someone. His friend asks him, 'Who is in the picture?' The man replies, 'Brothers and sisters, I have none. But that man's father is my father's son.' Who is in the picture?",
"question_hi": "एक आदमी किसी की तस्वीर देख रहा है। उसके दोस्त ने पूछा, 'तस्वीर में कौन है?' आदमी ने जवाब दिया, 'भाई-बहन, मेरे पास कोई नहीं है। लेकिन उस आदमी के पिता मेरे पिता का बेटा है।' तस्वीर में कौन है?",
"A_en": "The man's son", "A_hi": "आदमी का बेटा",
"B_en": "The man's father", "B_hi": "आदमी का पिता",
"C_en": "The man himself", "C_hi": "आदमी स्वयं",
"D_en": "The man's brother", "D_hi": "आदमी का भाई",
"answer": "C",
"explanation_en": "The man says, 'But that man's father