[
{
"subject": "Reasoning",
"topic": "Analogy",
"question_en": "A is to B as C is to D?",
"question_hi": "A बी के बराबर क्या है, C D के बराबर है?",
"A_en": "Father : Son", "A_hi": "पिता : पुत्र",
"B_en": "Grandfather : Grandson", "B_hi": "दादा : पौत्र",
"C_en": "Mother", "C_hi": "माता",
"D_en": "Daughter", "D_hi": "बेटी",
"answer": "B",
"explanation_en": "In an analogy, the relationship between the first pair of words is similar to the relationship between the second pair of words.",
"explanation_hi": "एक अनुमान में, पहले शब्दों के बीच का संबंध दूसरे शब्दों के बीच के संबंध जैसा होता है।"
},
{
"subject": "Reasoning",
"topic": "Syllogism",
"question_en": "All Indians are not Englishmen. All Englishmen are not Americans. Therefore, some Indians are Americans?",
"question_hi": "सभी भारतीय अंग्रेज नहीं हैं। सभी अंग्रेज अमेरिकी नहीं हैं। इसलिए, कुछ भारतीय अमेरिकी हैं?",
"A_en": "Affirmative", "A_hi": "सहमत",
"B_en": "Negative", "B_hi": "नकारात्मक",
"C_en": "Neither Affirmative nor Negative", "C_hi": "कभी सहमत कभी नकारात्मक",
"D_en": "Some Indians are Americans", "D_hi": "कुछ भारतीय अमेरिकी हैं",
"answer": "B",
"explanation_en": "The conclusion "Some Indians are Americans" is not valid because it is not possible to conclude that some Indians are Americans from the given premises.",
"explanation_hi": "दिए गए सिद्धांतों से कुछ भारतीय अमेरिकी हैं की निष्कर्ष निश्चित नहीं है, इसलिए यह निष्कर्ष स्वीकार्य नहीं है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "I am the daughter of my mother's father. How am I related to my father?",
"question_hi": "मैं मेरे माता के पिता की बेटी हूं। तो मैं अपने पिता से किस प्रकार संबंधित हूं?",
"A_en": "Brother", "A_hi": "भाई",
"B_en": "Sister", "B_hi": "बहन",
"C_en": "Father", "C_hi": "पिता",
"D_en": "Mother", "D_hi": "माता",
"answer": "C",
"explanation_en": "Since I am the daughter of my mother's father, I am the granddaughter of my paternal grandfather and the daughter of my father.",
"explanation_hi": "क्योंकि मैं मेरे माता के पिता की बेटी हूं, मैं मेरे पितामह की पोती और पिता की बेटी हूं।"
},
{
"subject": "Reasoning",
"topic": "Direction Sense",
"question_en": "If you are facing North, in which direction will you go if you take 5 steps to your left?",
"question_hi": "यदि आप दक्षिण की ओर हों, तो यदि आप 5 कदम बाएं से जाते हैं, तो आप किस दिशा में जाएंगे?",
"A_en": "East", "A_hi": "पूर्व",
"B_en": "North", "B_hi": "उत्तर",
"C_en": "South", "C_hi": "दक्षिण",
"D_en": "West", "D_hi": "पश्चिम",
"answer": "C",
"explanation_en": "If you take 5 steps to your left while facing North, you will be facing South.",
"explanation_hi": "उत्तर की ओर देखकर यदि आप 5 कदम बाएं लेते हैं, तो आप दक्षिण की ओर देखेंगे।"
},
{
"subject": "Reasoning",
"topic": "Seating Arrangement",
"question_en": "In a row of 5 chairs, A is to the left of B, B is to the left of C and C is to the left of D. If E is to the right of D, who is sitting at the extreme right?",
"question_hi": "5 कुर्सी वाली एक पंक्ति में, A B के बाएं है, B C के बाएं है और C D के बाएं है। यदि E D के दाहिने है, तो पंक्ति के सबसे दाहिनी कुर्सी पर कौन बैठा है?",
"A_en": "A", "A_hi": "ए",
"B_en": "B", "B_hi": "बी",
"C_en": "C", "C_hi": "सी",
"D_en": "D", "D_hi": "डी",
"E_en": "E", "E_hi": "ई",
"answer": "E",
"explanation_en": "Since E is to the right of D, and D is to the left of C, C must be sitting at the extreme left. Similarly, B is to the left of C, so B is sitting second from the left. A is to the left of B, so A is sitting at the extreme left. Therefore, E is sitting at the extreme right.",
"explanation_hi": "क्योंकि ई डी के दाहिने है, और डी सी के बाएं है, तो सी सबसे बाएं बैठा होगा। इसी प्रकार, बी सी के दाहिने है, तो बी दूसरे से बाएं बैठेगा। ए बी के दाहिने है, तो ए सबसे बाएं बैठेगा। इसलिए, ई सबसे दाहिनी बैठेगा।"
},
{
"subject": "Reasoning",
"topic": "Mixture and Alligation",
"question_en": "A mixture of milk and water contains 30% milk and 70% water. How much water must be added to make the mixture 20% milk and 80% water?",
"question_hi": "दूध और पानी के मिश्रण में 30% दूध और 70% पानी है। इस मिश्रण को 20% दूध और 80% पानी बनाने के लिए कितना पानी जोड़ना होगा?",
"A_en": "40%", "A_hi": "40%",
"B_en": "50%", "B_hi": "50%",
"C_en": "60%", "C_hi": "60%",
"D_en": "80%", "D_hi": "80%",
"answer": "C",
"explanation_en": "Let the amount of water to be added be x. The total amount of the mixture will be 1 + x. The amount of milk in the final mixture will be 30% of (1 + x) and the amount of water will be 70% of (1 + x). The amount of milk in the initial mixture is 30% of 1. The amount of water in the initial mixture is 70% of 1. We want the final mixture to contain 20% milk and 80% water. Therefore, we set up the equation: 30% of (1 + x) = 20% of (1 + x) + (30% of 1). Solving this equation, we get x = 60.",
"explanation_hi": "कम्पनी की कम्पनी का मिश्रण 30% दूध और 70% पानी है। इस मिश्रण को 20% दूध और 80% पानी बनाने के लिए कितना पानी जोड़ना होगा, इसका पता लगाने के लिए हम x की मात्रा का प्रयोग करते हैं। मिश्रण की कुल मात्रा 1 + x हो जाएगी। अंतिम मिश्रण में दूध की मात्रा 30% (1 + x) होगी और पानी की मात्रा 70% (1 + x) होगी। मूल मिश्रण में दूध की मात्रा 30% 1 है, और पानी की मात्रा 70% 1 है। हम चाहते हैं कि अंतिम मिश्रण 20% दूध और 80% पानी हो। इसलिए, हम समीकरण स्थापित करते हैं: 30% (1 + x) = 20% (1 + x) + (30% 1)। इस समीकरण को हल करने पर हमें x = 60 मिलता है।"
},
{
"subject": "Reasoning",
"topic": "Number Series",
"question_en": "Find the missing term in the series: 1, 4, 9, 16, 25, ?",
"question_hi": "श्रृंखला में खाली स्थान भरें: 1, 4, 9, 16, 25, ?",
"A_en": "36", "A_hi": "36",
"B_en": "49", "B_hi": "49",
"C_en": "64", "C_hi": "64",
"D_en": "81", "D_hi": "81",
"answer": "D",
"explanation_en": "The series is a sequence of perfect squares: 1^2, 2^2, 3^2, 4^2, 5^2, 6^2. Therefore, the next term in the series is 6^2 = 36.",
"explanation_hi": "श्रृंखला एक आदर्श वर्गों की श्रृंखला है: 1^2, 2^2, 3^2, 4^2, 5^2, 6^2। इसलिए, श्रृंखला का अगला पद 6^2 = 36 होगा।"
},
{
"subject": "Reasoning",
"topic": "Alphabetical Order",
"question_en": "In what order should the following letters be arranged in alphabetical order: C, E, T, A, R, S, O, N?",
"question_hi": "निम्नलिखित अक्षरों को क्रम में कैसे व्यवस्थित किया जाए: सी, ई, टी, ए, आर, एस, ओ, एन?",
"A_en": "ACE, NOS, RT", "A_hi": "एसीई, एनओएस, आरटी",
"B_en": "ACE, NRT, OS", "B_hi": "एसीई, एनआरटी, ओएस",
"C_en": "ACE, OS, NRT", "C_hi": "एसीई, ओएस, एनआरटी",
"D_en": "A, C, E, N, O, R, S, T", "D_hi": "ए, सी, ई, एन, ओ, आर, एस, टी",
"answer": "D",
"explanation_en": "The correct order of the letters is: A, C, E, N, O, R, S, T.",
"explanation_hi": "सही क्रम इस प्रकार है: ए, सी, ई, एन, ओ, आर, एस, टी।"
},
{
"subject": "Reasoning",
"topic": "Classification",
"question_en": "Classify the following animals as Carnivores, Herbivores, Omnivores, or Unknown: Lion, Elephant, Human, Snake, Dolphin.",
"question_hi": "निम्नलिखित जानवरों को कार्निवोर, हर्बिवोर, ओम्निवोर, या अनजाने के रूप में वर्गीकृत कीजिए: शेर, हाथी, मानव, सांप, डॉल्फिन",
"A_en": "Lion: Carnivore, Elephant: Herbivore, Human: Omnivore, Snake: Carnivore, Dolphin: Unknown", "A_hi": "शेर: कार्निवोर, हाथी: हर्बिवोर, मानव: ओम्निवोर, सांप: कार्निवोर, डॉल्फिन: अनजान",
"B_en": "Lion: Carnivore, Elephant: Herbivore, Human: Omnivore, Snake: Unknown, Dolphin: Carnivore", "B_hi": "शेर: कार्निवोर, हाथी: हर्बिवोर, मानव: ओम्निवोर, सांप: अनजान, डॉल्फिन: कार्निवोर",
"C_en": "Lion: Carnivore, Elephant: Herbivore, Human: Omnivore, Snake: Carnivore, Dolphin: Carnivore", "C_hi": "शेर: कार्निवोर, हाथी: हर्बिवोर, मानव: ओम्निवोर, सांप: कार्निवोर, डॉल्फिन: कार्निवोर",
"D_en": "Lion: Herbivore, Elephant: Carnivore, Human: Unknown, Snake: Omnivore, Dolphin: Carnivore", "D_hi": "शेर: हर्बिवोर, हाथी: कार्निवोर, मानव: अनजान, सांप: ओम्निवोर, डॉल्फिन: कार्निवोर",
"answer": "C",
"explanation_en": "The correct classification is: Lion: Carnivore, Elephant: Herbivore, Human: Omnivore, Snake: Carnivore, Dolphin: Carnivore.",
"explanation_hi": "सही वर्गीकरण है: शेर: कार्निवोर, हाथी: हर्बिवोर, मानव: ओम्निवोर, सांप: कार्निवोर, डॉल्फिन: कार्निवोर।"
},
{
"subject": "Reasoning",
"topic": "Order and Ranking",
"question_en": "Rank the following cities in order of increasing population: Delhi, Mumbai, Bangalore, Chennai, Hyderabad, Ahmedabad.",
"question_hi": "निम्नलिखित शहरों को घटती जनसंख्या के अनुसार क्रमबद्ध कीजिए: दिल्ली, मुंबई, बैंगलोर, चेन्नई, हैदराबाद, अहमदाबाद",
"A_en": "Delhi, Mumbai, Hyderabad, Bangalore, Ahmedabad, Chennai", "A_hi": "दिल्ली, मुंबई, हैदराबाद, बैंगलोर, अहमदाबाद, चेन्नई",
"B_en": "Mumbai, Delhi, Bangalore, Hyderabad, Ahmedabad, Chennai", "B_hi": "मुंबई, दिल्ली, बैंगलोर, हैदराबाद, अहमदाबाद, चेन्नई",
"C_en": "Delhi, Mumbai, Bangalore, Ahmedabad, Hyderabad, Chennai", "C_hi": "दिल्ली, मुंबई, बैंगलोर, अहमदाबाद, हैदराबाद, चेन्नई",
"D_en": "Delhi, Bangalore, Mumbai, Ahmedabad, Hyderabad, Chennai", "D_hi": "दिल्ली, बैंगलोर, मुंबई, अहमदाबाद, हैदराबाद, चेन्नई",
"answer": "A",
"explanation_en": "The correct order of the cities by increasing population is: Delhi, Mumbai, Bangalore, Hyderabad, Ahmedabad, Chennai.",
"explanation_hi": "जनसंख्या में वृद्धि के अनुसार सही क्रम है: दिल्ली, मुंबई, बैंगलोर, हैदराबाद, अहमदाबाद, चेन्नई।"
}