[
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Pointing to a man in a photograph, a woman says, ‘His mother’s only daughter is my mother.’ How is the woman related to the man?",
"question_hi": "एक फ़ोटो में एक आदमी की ओर इशारा करते हुए एक महिला कहती है, ‘उसकी माँ की इकलौती बेटी मेरी माँ है।’ वह महिला उस आदमी से कैसे सम्बन्धित है?",
"A_en": "Wife", "A_hi": "पत्नी",
"B_en": "Sister", "B_hi": "बहन",
"C_en": "Cousin", "C_hi": "कज़िन",
"D_en": "Niece", "D_hi": "भांजी/भतीजी",
"answer": "B",
"explanation_en": "The man’s mother’s only daughter implies the man’s sister, who is also the woman’s mother. Hence the woman and the man are siblings.",
"explanation_hi": "आदमी की माँ की इकलौती बेटी का अर्थ है आदमी की बहन, जो महिला की माँ भी है। इसलिए दोनों भाई-बहन हैं।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "If A is the brother of B; B is the sister of C; and C is the father of D, how is D related to A?",
"question_hi": "यदि A, B का भाई है; B, C की बहन है; और C, D का पिता है, तो D, A से कैसे सम्बन्धित है?",
"A_en": "Nephew", "A_hi": "भतीजा",
"B_en": "Niece", "B_hi": "भांजी",
"C_en": "Cannot be determined", "C_hi": "निर्धारित नहीं किया जा सकता",
"D_en": "Cousin", "D_hi": "कज़िन",
"answer": "C",
"explanation_en": "Gender of D is not given, so we cannot specify whether D is nephew or niece of A.",
"explanation_hi": "D का लिंग दिया नहीं गया है, इसलिए हम नहीं बता सकते कि D, A का भतीजा है या भांजी।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "A’s father is B’s son-in-law. C is the father of B and has only two children. How is A related to C?",
"question_hi": "A का पिता, B का दामाद है। C, B का पिता है और केवल दो संतानें हैं। A, C से कैसे सम्बन्धित है?",
"A_en": "Grandson", "A_hi": "पोता",
"B_en": "Granddaughter", "B_hi": "पोती",
"C_en": "Son", "C_hi": "बेटा",
"D_en": "Daughter", "D_hi": "बेटी",
"answer": "A",
"explanation_en": "B’s son-in-law is A’s father, so B is A’s maternal grandmother. C is B’s father, thus C is A’s maternal grandfather; A is C’s grandson.",
"explanation_hi": "B का दामाद A का पिता है, इसलिए B, A की नानी है। C, B का पिता अर्थात् A का नाना है; A, C का पोता है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Introducing a boy, a girl said, ‘He is the son of the daughter of the father of my uncle.’ What is the boy to the girl?",
"question_hi": "एक लड़के का परिचय देते हुए एक लड़की ने कहा, ‘वह मेरे अंकल के पिता की बेटी का बेटा है।’ वह लड़का लड़की का क्या है?",
"A_en": "Brother", "A_hi": "भाई",
"B_en": "Cousin brother", "B_hi": "कज़िन भाई",
"C_en": "Uncle", "C_hi": "अंकल",
"D_en": "Nephew", "D_hi": "भतीजा",
"answer": "A",
"explanation_en": "Father of her uncle is her grandfather; daughter of grandfather is her mother; son of mother is her brother.",
"explanation_hi": "उसके अंकल के पिता उसके दादा हैं; दादा की बेटी उसकी माँ है; माँ का बेटा उसका भाई है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "P is the brother of Q. R is the sister of P. S is the brother of T. T is the mother of Q. How is S related to R?",
"question_hi": "P, Q का भाई है। R, P की बहन है। S, T का भाई है। T, Q की माँ है। S, R से कैसे सम्बन्धित है?",
"A_en": "Uncle", "A_hi": "मामा",
"B_en": "Father", "B_hi": "पिता",
"C_en": "Brother", "B_hi": "भाई",
"D_en": "Grandfather", "D_hi": "दादा",
"answer": "A",
"explanation_en": "T is mother of Q and S is brother of T, so S is maternal uncle of Q and hence uncle of R.",
"explanation_hi": "T, Q की माँ है और S, T का भाई है, इसलिए S, Q का मामा है और R का भी मामा।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "If X is the only son of Y, who is the daughter of Z, and Z has only one son and one daughter, then how is X related to Z?",
"question_hi": "यदि X, Y का इकलौता बेटा है, जो कि Z की बेटी है, और Z की केवल एक बेटा और एक बेटी है, तो X, Z से कैसे सम्बन्धित है?",
"A_en": "Grandson", "A_hi": "पोता",
"B_en": "Son", "B_hi": "बेटा",
"C_en": "Nephew", "C_hi": "भतीजा",
"D_en": "Cousin", "D_hi": "कज़िन",
"answer": "A",
"explanation_en": "Z’s daughter is Y, Y’s son is X, so X is grandson of Z.",
"explanation_hi": "Z की बेटी Y है, Y का बेटा X है, इसलिए X, Z का पोता है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "A woman said to a man, ‘Your father’s only sister is my mother.’ How is the man related to the woman?",
"question_hi": "एक महिला ने एक आदमी से कहा, ‘तुम्हारे पिता की इकलौती बहन मेरी माँ है।’ वह आदमी महिला से कैसे सम्बन्धित है?",
"A_en": "Cousin", "A_hi": "कज़िन",
"B_en": "Brother", "B_hi": "भाई",
"C_en": "Nephew", "B_hi": "भतीजा",
"D_en": "Uncle", "D_hi": "मामा",
"answer": "A",
"explanation_en": "Father’s only sister is paternal aunt; aunt’s daughter is cousin sister, so both are cousins.",
"explanation_hi": "पिता की इकलौती बहन पिता की बहन है; उसकी बेटी कज़िन सिस्टर है, इसलिए दोनों कज़िन हैं।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "M is the father of N. N is the brother of K. K is the mother of L. How is M related to L?",
"question_hi": "M, N का पिता है। N, K का भाई है। K, L की माँ है। M, L से कैसे सम्बन्धित है?",
"A_en": "Grandfather", "A_hi": "दादा",
"B_en": "Uncle", "B_hi": "अंकल",
"C_en": "Father", "B_hi": "पिता",
"D_en": "Cousin", "D_hi": "कज़िन",
"answer": "A",
"explanation_en": "M is father of K (since N and K are siblings), K is mother of L, so M is grandfather of L.",
"explanation_hi": "M, K का पिता है (क्योंकि N और K भाई-बहन हैं), K, L की माँ है, इसलिए M, L का दादा है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "How is my father’s brother’s only sibling’s son related to me?",
"question_hi": "मेरे पिता के भाई का इकलौता भाई-बहन का बेटा मुझसे कैसे सम्बन्धित है?",
"A_en": "Brother", "A_hi": "भाई",
"B_en": "Cousin", "B_hi": "कज़िन",
"C_en": "Uncle", "B_hi": "चाचा",
"D_en": "Nephew", "D_hi": "भतीजा",
"answer": "A",
"explanation_en": "Father’s brother’s only sibling is my father himself; his son is my brother.",
"explanation_hi": "पिता के भाई का इकलौता भाई-बहन स्वयं मेरे पिता हैं; उनका बेटा मेरा भाई है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "A is the mother of B, who is the husband of C. C is the daughter of D. How is D related to A?",
"question_hi": "A, B की माँ है, जो C का पति है। C, D की बेटी है। D, A से कैसे सम्बन्धित है?",
"A_en": "Son-in-law", "A_hi": "दामाद",
"B_en": "Daughter-in-law", "B_hi": "बहू",
"C_en": "Father-in-law", "C_hi": "ससुर",
"D_en": "Father", "D_hi": "पिता",
"answer": "C",
"explanation_en": "C is daughter-in-law of A, so D is father of daughter-in-law, i.e., father-in-law of A.",
"explanation_hi": "A की बहू C है, इसलिए D, बहू का पिता अर्थात् A का ससुर है।"
}
]