[
{
"subject": "Reasoning",
"topic": "Syllogism",
"question_en": "Statements: All books are pens. Some pens are pencils. Conclusions: I. Some books are pencils. II. Some pencils are pens.",
"question_hi": "कथन: सभी किताबें कलम हैं। कुछ कलम पेंसिल हैं। निष्कर्ष: I. कुछ किताबें पेंसिल हैं। II. कुछ पेंसिल कलम हैं।",
"A_en": "Only conclusion I follows", "A_hi": "केवल निष्कर्ष I सही है",
"B_en": "Only conclusion II follows", "B_hi": "केवल निष्कर्ष II सही है",
"C_en": "Either I or II follows", "C_hi": "या तो I या II सही है",
"D_en": "Neither I nor II follows", "D_hi": "न तो I और न ही II सही है",
"answer": "B",
"explanation_en": "The middle term 'pens' is not distributed in the first statement, so no definite conclusion can be drawn between books and pencils; only II follows.",
"explanation_hi": "मध्य पद 'कलम' पहले कथन में वितरित नहीं है, इसलिए किताबों और पेंसिल के बीच कोई निश्चित निष्कर्ष नहीं निकाला जा सकता; केवल II सही है।"
},
{
"subject": "Reasoning",
"topic": "Syllogism",
"question_en": "Statements: No dog is cat. Some cats are rats. Conclusions: I. Some rats are not dogs. II. Some dogs are rats.",
"question_hi": "कथन: कोई भी कुत्ता बिल्ली नहीं है। कुछ बिल्लियां चूहे हैं। निष्कर्ष: I. कुछ चूहे कुत्ते नहीं हैं। II. कुछ कुत्ते चूहे हैं।",
"A_en": "Only I follows", "A_hi": "केवल I सही है",
"B_en": "Only II follows", "B_hi": "केवल II सही है",
"C_en": "Both I and II follow", "C_hi": "I और II दोनों सही हैं",
"D_en": "Neither I nor II follows", "D_hi": "न तो I और न ही II सही है",
"answer": "A",
"explanation_en": "Since no dog is cat and some cats are rats, those rats that are cats cannot be dogs; hence only I follows.",
"explanation_hi": "चूँकि कोई भी कुत्ता बिल्ली नहीं है और कुछ बिल्लियां चूहे हैं, वे चूहे जो बिल्लियां हैं वे कुत्ते नहीं हो सकते; इसलिए केवल I सही है।"
},
{
"subject": "Reasoning",
"topic": "Syllogism",
"question_en": "Statements: All cars are bikes. No bike is truck. Conclusions: I. No car is truck. II. Some trucks are cars.",
"question_hi": "कथन: सभी कारें बाइक हैं। कोई भी बाइक ट्रक नहीं है। निष्कर्ष: I. कोई भी कार ट्रक नहीं है। II. कुछ ट्रक कारें हैं।",
"A_en": "Only I follows", "A_hi": "केवल I सही है",
"B_en": "Only II follows", "B_hi": "केवल II सही है",
"C_en": "Both I and II follow", "C_hi": "I और II दोनों सही हैं",
"D_en": "Neither I nor II follows", "D_hi": "न तो I और न ही II सही है",
"answer": "A",
"explanation_en": "All cars are bikes and no bike is truck implies no car is truck; II contradicts the statements.",
"explanation_hi": "सभी कारें बाइक हैं और कोई भी बाइक ट्रक नहीं है, इसका मतलब कोई भी कार ट्रक नहीं है; II कथनों का विरोध करता है।"
},
{
"subject": "Reasoning",
"topic": "Syllogism",
"question_en": "Statements: Some tables are chairs. All chairs are desks. Conclusions: I. Some tables are desks. II. All desks are tables.",
"question_hi": "कथन: कुछ मेज़ कुर्सियाँ हैं। सभी कुर्सियाँ डेस्क हैं। निष्कर्ष: I. कुछ मेज़ डेस्क हैं। II. सभी डेस्क मेज़ हैं।",
"A_en": "Only I follows", "A_hi": "केवल I सही है",
"B_en": "Only II follows", "B_hi": "केवल II सही है",
"C_en": "Both I and II follow", "C_hi": "I और II दोनों सही हैं",
"D_en": "Neither I nor II follows", "D_hi": "न तो I और न ही II सही है",
"answer": "A",
"explanation_en": "Since some tables are chairs and all chairs are desks, those tables must also be desks; II is an invalid conversion.",
"explanation_hi": "चूँकि कुछ मेज़ कुर्सियाँ हैं और सभी कुर्सियाँ डेस्क हैं, वे मेज़ भी डेस्क होंगी; II एक अमान्य उलट है।"
},
{
"subject": "Reasoning",
"topic": "Syllogism",
"question_en": "Statements: No rose is lily. Some lilies are lotus. Conclusions: I. Some lotus are not roses. II. Some roses are lotus.",
"question_hi": "कथन: कोई भी गुलाब लिली नहीं है। कुछ लिलियां लोटस हैं। निष्कर्ष: I. कुछ लोटस गुलाब नहीं हैं। II. कुछ गुलाब लोटस हैं।",
"A_en": "Only I follows", "A_hi": "केवल I सही है",
"B_en": "Only II follows", "B_hi": "केवल II सही है",
"C_en": "Both I and II follow", "C_hi": "I और II दोनों सही हैं",
"D_en": "Neither I nor II follows", "D_hi": "न तो I और न ही II सही है",
"answer": "A",
"explanation_en": "Some lilies being lotus and no rose being lily implies those lotus that are lilies cannot be roses; II is invalid.",
"explanation_hi": "कुछ लिलियां लोटस हैं और कोई भी गुलाब लिली नहीं है, इसका मतलब वे लोटस जो लिलियां हैं वे गुलाब नहीं हो सकते; II अमान्य है।"
},
{
"subject": "Reasoning",
"topic": "Syllogism",
"question_en": "Statements: All phones are cameras. Some cameras are radios. Conclusions: I. Some phones are radios. II. Some radios are cameras.",
"question_hi": "कथन: सभी फोन कैमरे हैं। कुछ कैमरे रेडियो हैं। निष्कर्ष: I. कुछ फोन रेडियो हैं। II. कुछ रेडियो कैमरे हैं।",
"A_en": "Only I follows", "A_hi": "केवल I सही है",
"B_en": "Only II follows", "B_hi": "केवल II सही है",
"C_en": "Both I and II follow", "C_hi": "I और II दोनों सही हैं",
"D_en": "Neither I nor II follows", "D_hi": "न तो I और न ही II सही है",
"answer": "B",
"explanation_en": "The middle term 'cameras' is not distributed in the first statement, so I does not follow; II simply restates the second premise.",
"explanation_hi": "मध्य पद 'कैमरा' पहले कथन में वितरित नहीं है, इसलिए I सही नहीं है; II केवल दूसरे कथन को दोहराता है।"
},
{
"subject": "Reasoning",
"topic": "Syllogism",
"question_en": "Statements: Some men are doctors. All doctors are educated. Conclusions: I. Some men are educated. II. All educated are men.",
"question_hi": "कथन: कुछ पुरुष डॉक्टर हैं। सभी डॉक्टर शिक्षित हैं। निष्कर्ष: I. कुछ पुरुष शिक्षित हैं। II. सभी शिक्षित पुरुष हैं।",
"A_en": "Only I follows", "A_hi": "केवल I सही है",
"B_en": "Only II follows", "B_hi": "केवल II सही है",
"C_en": "Both I and II follow", "C_hi": "I और II दोनों सही हैं",
"D_en": "Neither I nor II follows", "D_hi": "न तो I और न ही II सही है",
"answer": "A",
"explanation_en": "Some men are doctors and all doctors are educated implies some men are educated; II is an invalid conversion.",
"explanation_hi": "कुछ पुरुष डॉक्टर हैं और सभी डॉक्टर शिक्षित हैं, इसका मतलब कुछ पुरुष शिक्षित हैं; II एक अमान्य उलट है।"
},
{
"subject": "Reasoning",
"topic": "Syllogism",
"question_en": "Statements: No tree is plant. Some plants are herbs. Conclusions: I. Some herbs are not trees. II. Some trees are herbs.",
"question_hi": "कथन: कोई भी पेड़ पौधा नहीं है। कुछ पौधे जड़ी-बूटी हैं। निष्कर्ष: I. कुछ जड़ी-बूटी पेड़ नहीं हैं। II. कुछ पेड़ जड़ी-बूटी हैं।",
"A_en": "Only I follows", "A_hi": "केवल I सही है",
"B_en": "Only II follows", "B_hi": "केवल II सही है",
"C_en": "Both I and II follow", "C_hi": "I और II दोनों सही हैं",
"D_en": "Neither I nor II follows", "D_hi": "न तो I और न ही II सही है",
"answer": "A",
"explanation_en": "Some herbs being plants and no plant being tree implies those herbs cannot be trees; II contradicts the first statement.",
"explanation_hi": "कुछ जड़ी-बूटी पौधे हैं और कोई भी पौधा पेड़ नहीं है, इसका मतलब वे जड़ी-बूटी पेड़ नहीं हो सकते; II पहले कथन का विरोध करता है।"
},
{
"subject": "Reasoning",
"topic": "Syllogism",
"question_en": "Statements: All gold is silver. No silver is diamond. Conclusions: I. No gold is diamond. II. Some diamonds are gold.",
"question_hi": "कथन: सभी सोना चांदी है। कोई भी चांदी हीरा नहीं है। निष्कर्ष: I. कोई भी सोना हीरा नहीं है। II. कुछ हीरे सोना हैं।",
"A_en": "Only I follows", "A_hi": "केवल I सही है",
"B_en": "Only II follows", "B_hi": "केवल II सही है",
"C_en": "Both I and II follow", "C_hi": "I और II दोनों सही हैं",
"D_en": "Neither I nor II follows", "D_hi": "न तो I और न ही II सही है",
"answer": "A",
"explanation_en": "All gold is silver and no silver is diamond implies no gold is diamond; II is the opposite of this conclusion.",
"explanation_hi": "सभी सोना चांदी है और कोई भी चांदी हीरा नहीं है, इसका मतलब कोई भी सोना हीरा नहीं है; II इस निष्कर्ष के विपरीत है।"
},
{
"subject": "Reasoning",
"topic": "Syllogism",
"question_en": "Statements: Some squares are circles. All circles are triangles. Conclusions: I. Some triangles are squares. II. All squares are triangles.",
"question_hi": "कथन: कुछ वर्ग वृत्त हैं। सभी वृत्त त्रिभुज हैं। निष्कर्ष: I. कुछ त्रिभुज वर्ग हैं। II. सभी वर्ग त्रिभुज हैं।",
"A_en": "Only I follows", "A_hi": "केवल I सही है",
"B_en": "Only II follows", "B_hi": "केवल II सही है",
"C_en": "Both I and II follow", "C_hi": "I और II दोनों सही हैं",
"D_en": "Neither I nor II follows", "D_hi": "न तो I और न ही II सही है",
"answer": "A",
"explanation_en": "Some squares being circles and all circles being triangles implies some triangles must be squares; II overextends the given statements.",
"explanation_hi": "कुछ वर्ग वृत्त हैं और सभी वृत्त त्रिभुज हैं, इसका मतलब कुछ त्रिभुज वर्ग होने चाहिए; II कथनों से आगे बढ़ जाता है।"
}
]