[
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Pointing to a man, Suman said, \"His mother is the only daughter of my mother.\" How is Suman related to that man?",
"question_hi": "एक व्यक्ति की ओर इशारा करते हुए सुमन ने कहा, \"उसकी मेरी माँ की इकलौती बेटी है।\" सुमन उस व्यक्ति से किस प्रकार सम्बन्धित है?",
"A_en": "Sister", "A_hi": "बहन",
"B_en": "Mother", "B_hi": "माँ",
"C_en": "Grandmother", "C_hi": "दादी",
"D_en": "Aunt", "D_hi": "चाची",
"answer": "B",
"explanation_en": "Only daughter of Suman’s mother is Suman herself, so she is the man’s mother.",
"explanation_hi": "सुमन की माँ की इकलौती बेटी स्वयं सुमन है, इसलिए वह व्यक्ति की माँ है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "A is the brother of B. C is the sister of A. D is the brother of C. How is B related to D?",
"question_hi": "A, B का भाई है। C, A की बहन है। D, C का भाई है। B, D से कैसे सम्बन्धित है?",
"A_en": "Sister", "A_hi": "बहन",
"B_en": "Brother", "B_hi": "भाई",
"C_en": "Cannot be determined", "C_hi": "निर्धारित नहीं किया जा सकता",
"D_en": "Cousin", "D_hi": "कजिन",
"answer": "C",
"explanation_en": "Gender of B is not given, so relation cannot be determined.",
"explanation_hi": "B का लिंग नहीं दिया गया है, इसलिए सम्बन्ध निर्धारित नहीं किया जा सकता।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "If ‘P + Q’ means P is the father of Q, ‘P – Q’ means P is the sister of Q, then which of the following means M is the uncle of N?",
"question_hi": "यदि ‘P + Q’ का अर्थ P, Q का पिता है, ‘P – Q’ का अर्थ P, Q की बहन है, तो निम्लिखित में से किसका अर्थ है M, N का चाचा है?",
"A_en": "M – N + O", "A_hi": "M – N + O",
"B_en": "M + O – N", "B_hi": "M + O – N",
"C_en": "M × N ÷ O", "C_hi": "M × N ÷ O",
"D_en": "M – O + N", "D_hi": "M – O + N",
"answer": "B",
"explanation_en": "M + O means M is father of O, and O – N means O is sister of N, so M is uncle of N.",
"explanation_hi": "M + O का अर्थ M, O का पिता है, और O – N का अर्थ O, N की बहन है, इसलिए M, N का चाचा है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Ravi’s father’s only daughter is Ravi’s ___?",
"question_hi": "रवि के पिता की इकलौती बेटी रवि की ___ है?",
"A_en": "Mother", "A_hi": "माँ",
"B_en": "Sister", "B_hi": "बहन",
"C_en": "Self", "B_hi": "स्वयं",
"D_en": "Niece", "D_hi": "भांजी",
"answer": "C",
"explanation_en": "Ravi’s father’s only daughter must be Ravi himself if Ravi is a girl, otherwise no such person exists; but commonly interpreted as Ravi’s sister, yet option self is closest to intended meaning.",
"explanation_hi": "रवि के पिता की इकलौती बेटी या तो रवि स्वयं है (यदि रवि लड़की है) अन्यथा कोई नहीं; पर प्रचलित अर्थ में रवि की बहन, पर विकल्प में स्वयं निकटतम है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Introducing a boy, a girl said, \"He is the son of the daughter of my father.\" What is the girl’s relation to the boy?",
"question_hi": "एक लड़के का परिचय देते हुए एक लड़की ने कहा, \"वह मेरे पिता की बेटी का पुत्र है।\" लड़की लड़के से क्या लगती है?",
"A_en": "Mother", "A_hi": "माँ",
"B_en": "Sister", "B_hi": "बहन",
"C_en": "Aunt", "B_hi": "बुआ/चाची",
"D_en": "Cousin", "D_hi": "कजिन",
"answer": "C",
"explanation_en": "Daughter of her father is herself or her sister; if sister then boy is nephew, so girl becomes aunt.",
"explanation_hi": "उसके पिता की बेटी वह स्वयं या उसकी बहन हो सकती है; यदि बहन तो लड़का भतीजा है, इसलिए लड़की चाची/बुआ है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "How is my father’s mother’s only daughter-in-law related to me?",
"question_hi": "मेरे पिता की माँ की इकलौती बहू मुझसे कैसे सम्बन्धित है?",
"A_en": "Mother", "A_hi": "माँ",
"B_en": "Sister", "B_hi": "बहन",
"C_en": "Wife", "D_hi": "पत्नी",
"D_en": "Daughter", "D_hi": "बेटी",
"answer": "A",
"explanation_en": "Father’s mother’s only daughter-in-law is father’s wife, i.e., mother.",
"explanation_hi": "पिता की माँ की इकलौती बहू पिता की पत्नी है, अर्थात् माँ।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "A family consists of a man, his wife, their three sons and two daughters. How many children does the man have?",
"question_hi": "एक परिवार में एक व्यक्ति, उसकी पत्नी, उनके तीन पुत्र और दो पुत्रियाँ हैं। उस व्यक्ति के कुल कितने बच्चे हैं?",
"A_en": "3", "A_hi": "3",
"B_en": "5", "B_hi": "5",
"C_en": "2", "B_hi": "2",
"D_en": "4", "D_hi": "4",
"answer": "B",
"explanation_en": "Three sons and two daughters total 5 children.",
"explanation_hi": "तीन पुत्र और दो पुत्रियाँ मिलाकर कुल 5 बच्चे।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "If X is the brother of the son of Y, then what is X to Y?",
"question_hi": "यदि X, Y के पुत्र का भाई है, तो X, Y का क्या लगता है?",
"A_en": "Son", "A_hi": "पुत्र",
"B_en": "Brother", "B_hi": "भाई",
"C_en": "Grandson", "B_hi": "पोता",
"D_en": "Uncle", "D_hi": "चाचा",
"answer": "A",
"explanation_en": "Son of Y is Y’s child; brother of that child is also Y’s son.",
"explanation_hi": "Y का पुत्र Y का बच्चा है; उस बच्चे का भाई भी Y का पुत्र है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "What is the relation of my father’s sister’s only brother to me?",
"question_hi": "मेरे पिता की बहन के इकलौते भाई का मुझसे क्या सम्बन्ध है?",
"A_en": "Father", "A_hi": "पिता",
"B_en": "Uncle", "B_hi": "चाचा",
"C_en": "Brother", "B_hi": "भाई",
"D_en": "Grandfather", "D_hi": "दादा",
"answer": "A",
"explanation_en": "Father’s sister’s only brother is father himself.",
"explanation_hi": "पिता की बहन का इकलौता भाई स्वयं पिता है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Given that A is the father of B, C is the daughter of B, and D is the son of C. What is A to D?",
"question_hi": "यदि A, B का पिता है, C, B की बेटी है, और D, C का पुत्र है। A, D का क्या लगता है?",
"A_en": "Grandfather", "A_hi": "दादा",
"B_en": "Father", "B_hi": "पिता",
"C_en": "Great-grandfather", "B_hi": "परदादा",
"D_en": "Uncle", "D_hi": "चाचा",
"answer": "C",
"explanation_en": "A is father of B, B is father of C, C is mother of D; thus A is great-grandfather of D.",
"explanation_hi": "A, B का पिता है, B, C का पिता है, C, D की माँ है; इस प्रकार A, D का परदादा है।"
}
]