[
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Pointing to a man, Rani said, 'His only brother is the father of my daughter's father.' How is the man related to Rani?",
"question_hi": "एक व्यक्ति की ओर इशारा करते हुए रानी ने कहा, 'उसका इकलौता भाई मेरी बेटी के पिता का पिता है।' वह व्यक्ति रानी से कैसे संबंधित है?",
"A_en": "Uncle", "A_hi": "चाचा",
"B_en": "Grandfather", "B_hi": "दादा",
"C_en": "Father", "C_hi": "पिता",
"D_en": "Brother-in-law", "D_hi": "बहनोई",
"answer": "A",
"explanation_en": "Rani’s daughter’s father is Rani’s husband. Husband’s father is Rani’s father-in-law. Father-in-law’s only brother is Rani’s uncle (husband’s uncle).",
"explanation_hi": "रानी की बेटी का पिता रानी का पति है। पति का पिता रानी का ससुर है। ससुर का इकलौता भाई रानी का चाचा (पति का चाचा) होता है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "A is the brother of B. C is the sister of A. D is the brother of E. E is the mother of B. How is D related to A?",
"question_hi": "A, B का भाई है। C, A की बहन है। D, E का भाई है। E, B की माँ है। D, A से कैसे संबंधित है?",
"A_en": "Uncle", "A_hi": "मामा",
"B_en": "Brother", "B_hi": "भाई",
"C_en": "Cousin", "C_hi": "कजिन",
"D_en": "Nephew", "D_hi": "भतीजा",
"answer": "A",
"explanation_en": "E is mother of B, so D (brother of E) is maternal uncle of A and B.",
"explanation_hi": "E, B की माँ है, इसलिए D (E का भाई) A और B का मामा है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "If ‘A × B’ means A is the son of B, ‘A + B’ means A is the wife of B, then which of the following means P is the father-in-law of Q?",
"question_hi": "यदि ‘A × B’ का अर्थ A, B का पुत्र है, ‘A + B’ का अर्थ A, B की पत्नी है, तो निम्न में कौन-सा विकल्प बताता है कि P, Q का ससुर है?",
"A_en": "Q + R × P", "A_hi": "Q + R × P",
"B_en": "P × R + Q", "B_hi": "P × R + Q",
"C_en": "Q × R + P", "C_hi": "Q × R + P",
"D_en": "R + Q × P", "D_hi": "R + Q × P",
"answer": "A",
"explanation_en": "Q + R means Q is wife of R; R × P means R is son of P, so P is father of R and hence father-in-law of Q.",
"explanation_hi": "Q + R का अर्थ Q, R की पत्नी है; R × P का अर्थ R, P का पुत्र है, इसलिए P, R का पिता और Q का ससुर है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Introducing a girl, Rajesh said, 'Her mother is the only daughter of my mother-in-law.' How is Rajesh related to the girl?",
"question_hi": "एक लड़की का परिचय देते हुए राजेश ने कहा, 'उसकी माँ मेरी सास की इकलौती पुत्री है।' राजेश लड़की से कैसे संबंधित है?",
"A_en": "Father", "A_hi": "पिता",
"B_en": "Uncle", "B_hi": "चाचा",
"C_en": "Brother", "B_hi": "भाई",
"D_en": "Husband", "D_hi": "पति",
"answer": "A",
"explanation_en": "Only daughter of mother-in-law is wife, so wife is mother of girl, hence Rajesh is father.",
"explanation_hi": "सास की इकलौती पुत्री पत्नी है, इसलिए पत्नी लड़की की माँ है, अतः राजेश पिता है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Rahul’s father’s wife’s only daughter is Rita. How is Rita related to Rahul?",
"question_hi": "राहुल के पिता की पत्नी की इकलौती पुत्री रीता है। रीता, राहुल से कैसे संबंधित है?",
"A_en": "Sister", "A_hi": "बहन",
"B_en": "Cousin", "B_hi": "कजिन",
"C_en": "Niece", "C_hi": "भांजी",
"D_en": "Aunt", "D_hi": "बुआ",
"answer": "A",
"explanation_en": "Father’s wife is mother and her only daughter is Rahul’s sister.",
"explanation_hi": "पिता की पत्नी माँ है और उसकी इकलौती पुत्री राहुल की बहन है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "A man said to a woman, 'The only son of your mother is my father.' How is the woman related to the man?",
"question_hi": "एक व्यक्ति ने एक महिला से कहा, 'तुम्हारी माँ का इकलौता पुत्र मेरा पिता है।' वह महिला व्यक्ति से कैसे संबंधित है?",
"A_en": "Sister", "A_hi": "बहन",
"B_en": "Mother", "B_hi": "माँ",
"C_en": "Aunt", "C_hi": "बुआ",
"D_en": "Grandmother", "D_hi": "दादी",
"answer": "C",
"explanation_en": "Only son of woman’s mother is woman’s brother, who is man’s father, so woman is man’s aunt.",
"explanation_hi": "महिला की माँ का इकलौता पुत्र महिला का भाई है जो व्यक्ति का पिता है, इसलिए महिला व्यक्ति की बुआ है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "P is the brother of Q. R is the sister of P. S is the brother of T. T is the daughter of Q. How is P related to T?",
"question_hi": "P, Q का भाई है। R, P की बहन है। S, T का भाई है। T, Q की पुत्री है। P, T से कैसे संबंधित है?",
"A_en": "Uncle", "A_hi": "चाचा",
"B_en": "Father", "B_hi": "पिता",
"C_en": "Brother", "B_hi": "भाई",
"D_en": "Grandfather", "D_hi": "दादा",
"answer": "A",
"explanation_en": "P is brother of Q and T is daughter of Q, so P is uncle of T.",
"explanation_hi": "P, Q का भाई है और T, Q की पुत्री है, इसलिए P, T का चाचा है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "If P + Q means P is the mother of Q, P – Q means P is the brother of Q, P × Q means P is the sister of Q, then which of the following means M is the maternal uncle of N?",
"question_hi": "यदि P + Q का अर्थ P, Q की माँ है, P – Q का अर्थ P, Q का भाई है, P × Q का अर्थ P, Q की बहन है, तो निम्न में कौन-सा विकल्प बताता है कि M, N का मामा है?",
"A_en": "M – P + N", "A_hi": "M – P + N",
"B_en": "M + P – N", "B_hi": "M + P – N",
"C_en": "N × P – M", "C_hi": "N × P – M",
"D_en": "M × P + N", "D_hi": "M × P + N",
"answer": "A",
"explanation_en": "M – P means M is brother of P, P + N means P is mother of N, so M is maternal uncle of N.",
"explanation_hi": "M – P का अर्थ M, P का भाई है, P + N का अर्थ P, N की माँ है, इसलिए M, N का मामा है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "In a family of 6 members A, B, C, D, E, F, there are 3 males and 3 females. A is married to D. E is the son of A. C is the sister of E. B is the mother of C. F is the husband of B. How is D related to C?",
"question_hi": "6 सदस्यों A, B, C, D, E, F के परिवार में 3 पुरुष और 3 महिलाएँ हैं। A, D से विवाहित है। E, A का पुत्र है। C, E की बहन है। B, C की माँ है। F, B का पति है। D, C से कैसे संबंधित है?",
"A_en": "Mother", "A_hi": "माँ",
"B_en": "Father", "B_hi": "पिता",
"C_en": "Grandmother", "C_hi": "दादी",
"D_en": "Grandfather", "D_hi": "दादा",
"answer": "B",
"explanation_en": "A is father of E and C, married to D, so D is mother of C and A is father.",
"explanation_hi": "A, E और C का पिता है, D से विवाहित है, इसलिए D, C की माँ है और A पिता है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Pointing to a photograph, a man said, 'She is the daughter of my grandfather’s only son.' How is the girl related to the man?",
"question_hi": "एक तस्वीर की ओर इशारा करते हुए एक व्यक्ति ने कहा, 'वह मेरे दादा के इकलौते पुत्र की पुत्री है।' लड़की व्यक्ति से कैसे संबंधित है?",
"A_en": "Sister", "A_hi": "बहन",
"B_en": "Cousin", "B_hi": "कजिन",
"C_en": "Niece", "C_hi": "भतीजी",
"D_en": "Daughter", "D_hi": "बेटी",
"answer": "A",
"explanation_en": "Grandfather’s only son is father, so daughter of father is sister.",
"explanation_hi": "दादा का इकलौता पुत्र पिता है, इसलिए पिता की पुत्री बहन है।"
}
]