[
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Pointing to a man, Suman said, ‘His mother is the only daughter of my mother.’ How is the man related to Suman?",
"question_hi": "एक व्यक्ति की ओर इशारा करते हुए सुमन ने कहा, ‘उसकी माता मेरी माता की इकलौती पुत्री है।’ वह व्यक्ति सुमन से कैसे सम्बन्धित है?",
"A_en": "Brother", "A_hi": "भाई",
"B_en": "Son", "B_hi": "पुत्र",
"C_en": "Nephew", "C_hi": "भतीजा",
"D_en": "Uncle", "D_hi": "चाचा",
"answer": "B",
"explanation_en": "Only daughter of Suman’s mother is Suman herself. Therefore, the man is Suman’s son.",
"explanation_hi": "सुमन की माता की इकलौती पुत्री स्वयं सुमन है, इसलिए वह व्यक्ति सुमन का पुत्र है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "A is B’s sister. C is B’s mother. D is C’s father. E is D’s mother. How is A related to D?",
"question_hi": "A, B की बहन है। C, B की माता है। D, C का पिता है। E, D की माता है। A, D से कैसे सम्बन्धित है?",
"A_en": "Granddaughter", "A_hi": "ग्रैंडडॉटर",
"B_en": "Daughter", "B_hi": "पुत्री",
"C_en": "Grandson", "C_hi": "ग्रैंडसन",
"D_en": "Niece", "D_hi": "भांजी",
"answer": "A",
"explanation_en": "D is C’s father and C is B’s mother. So D is A’s maternal grandfather. Hence A is D’s granddaughter.",
"explanation_hi": "D, C का पिता है और C, B की माता है। अतः D, A का नाना है। इसलिए A, D की ग्रैंडडॉटर है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "If P + Q means P is the mother of Q, P – Q means P is the brother of Q, P × Q means P is the wife of Q, then which of the following means M is the grandmother of N?",
"question_hi": "यदि P + Q का अर्थ P, Q की माता है, P – Q का अर्थ P, Q का भाई है, P × Q का अर्थ P, Q की पत्नी है, तो निम्नलिखित में कौन-सा यह दर्शाता है कि M, N की दादी है?",
"A_en": "M × L + N", "A_hi": "M × L + N",
"B_en": "M + L × N", "B_hi": "M + L × N",
"C_en": "M – L + N", "C_hi": "M – L + N",
"D_en": "M × L – N", "D_hi": "M × L – N",
"answer": "B",
"explanation_en": "M + L means M is mother of L, and L × N means L is wife of N’s father, so M becomes grandmother of N.",
"explanation_hi": "M + L का अर्थ M, L की माता है और L × N का अर्थ L, N के पिता की पत्नी है, अतः M, N की दादी बनती है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Introducing Reena, Monika said, ‘She is the only daughter of my father’s only daughter.’ How is Monika related to Reena?",
"question_hi": "रीना का परिचय देते हुए मोनिका ने कहा, ‘वह मेरे पिता की इकलौती पुत्री की इकलौती पुत्री है।’ मोनिका, रीना से कैसे सम्बन्धित है?",
"A_en": "Mother", "A_hi": "माता",
"B_en": "Aunt", "B_hi": "बुआ",
"C_en": "Sister", "C_hi": "बहन",
"D_en": "Cousin", "C_hi": "कजिन",
"answer": "A",
"explanation_en": "Monika’s father’s only daughter is Monika herself, so Reena is Monika’s daughter. Hence Monika is Reena’s mother.",
"explanation_hi": "मोनिका के पिता की इकलौती पुत्री स्वयं मोनिका है, इसलिए रीना मोनिका की पुत्री है। अतः मोनिका, रीना की माता है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Rahul is the brother of Amit. Kusum is the sister of Rahul. Deepak is the brother of Neha and Neha is the daughter of Amit. Who is Deepak to Kusum?",
"question_hi": "राहुल, अमित का भाई है। कुसुम, राहुल की बहन है। दीपक, नेहा का भाई है और नेहा, अमित की पुत्री है। दीपक, कुसum का क्या लगता है?",
"A_en": "Nephew", "A_hi": "भांजा",
"B_en": "Uncle", "B_hi": "मामा",
"C_en": "Cousin", "C_hi": "कजिन",
"D_en": "Brother", "B_hi": "भाई",
"answer": "A",
"explanation_en": "Neha is Amit’s daughter, so Deepak is Amit’s son. Kusum is Amit’s sister, hence Deepak is Kusum’s nephew.",
"explanation_hi": "नेहा, अमित की पुत्री है, इसलिए दीपक, अमित का पुत्र है। कुसुम, अमित की बहन है, अतः दीपक, कुसुम का भांजा है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "A family consists of two parents and three children. The average age of the parents is 36 years and that of the children is 12 years. What is the average age of the family?",
"question_hi": "एक परिवार में दो माता-पिता और तीन बच्चे हैं। माता-पिता की औसत आयु 36 वर्ष है और बच्चों की औसत आयु 12 वर्ष है। परिवार की औसत आयु कितनी है?",
"A_en": "20 years", "A_hi": "20 वर्ष",
"B_en": "22 years", "B_hi": "22 वर्ष",
"C_en": "24 years", "C_hi": "24 वर्ष",
"D_en": "18 years", "D_hi": "18 वर्ष",
"answer": "A",
"explanation_en": "Total age of parents = 2 × 36 = 72. Total age of children = 3 × 12 = 36. Total family age = 72 + 36 = 108. Average = 108 ÷ 5 = 21.6 ≈ 20 years (nearest option).",
"explanation_hi": "माता-पिता की कुल आयु = 2 × 36 = 72। बच्चों की कुल आयु = 3 × 12 = 36। परिवार की कुल आयु = 72 + 36 = 108। औसत = 108 ÷ 5 = 21.6 ≈ 20 वर्ष।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "If A is the uncle of B, and B is the niece of C, which of the following must be FALSE?",
"question_hi": "यदि A, B का चाचा है, और B, C की भांजी है, तो निम्नलिखित में कौन-सा कथन असत्य होगा?",
"A_en": "C is the sister of A", "A_hi": "C, A की बहन है",
"B_en": "C is the wife of A’s brother", "B_hi": "C, A के भाई की पत्नी है",
"C_en": "A is the brother of B’s mother", "C_hi": "A, B की माता का भाई है",
"D_en": "C is the mother of A", "D_hi": "C, A की माता है",
"answer": "D",
"explanation_en": "If C were the mother of A, then A would be the uncle of B only if C is also the mother of B’s parent, making C the grandmother of B, which contradicts B being C’s niece.",
"explanation_hi": "यदि C, A की माता है, तो A का B का चाचा होने के लिए C को B के माता-पिता की भी माता होना पड़ेगा, जिससे C, B की दादी बन जाती है और B को C की भांजी कहना संभव नहीं रहता।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Pointing to a photograph, a man said, ‘I have no brother or sister but that man’s father is my father’s son.’ Whose photograph was it?",
"question_hi": "एक फोटोग्राफ की ओर इशारा करते हुए एक व्यक्ति ने कहा, ‘मेरा कोई भाई या बहन नहीं है, पर वह व्यक्ति जिसके पिता मेरे पिता के पुत्र हैं।’ यह फोटोग्राफ किसका था?",
"A_en": "His own son", "A_hi": "उसका अपना पुत्र",
"B_en": "His father", "B_hi": "उसका पिता",
"C_en": "His nephew", "D_hi": "उसका भतीजा",
"D_en": "His cousin", "D_hi": "उसका कजिन",
"answer": "A",
"explanation_en": "The speaker has no siblings, so ‘my father’s son’ is himself. Hence that man’s father is the speaker, making the photograph of his own son.",
"explanation_hi": "वक्ता का कोई भाई-बहन नहीं है, इसलिए ‘मेरे पिता के पुत्र’ वह स्वयं हैं। इसलिए उस व्यक्ति के पिता वक्ता स्वयं हैं, अतः फोटोग्राफ उसके पुत्र का है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "In a family of 6 members (A, B, C, D, E, F), A is the father of B but B is not his son. C is the sister of B. D is the wife of A. E is the sister of A and F is the son of E. How is B related to F?",
"question_hi": "6 सदस्यों (A, B, C, D, E, F) के परिवार में, A, B का पिता है पर B उसका पुत्र नहीं है। C, B की बहन है। D, A की पत्नी है। E, A की बहन है और F, E का पुत्र है। B, F से कैसे सम्बन्धित है?",
"A_en": "Cousin", "A_hi": "कजिन",
"B_en": "Brother", "B_hi": "भाई",
"C_en": "Sister", "C_hi": "बहन",
"D_en": "Uncle", "D_hi": "चाचा",
"answer": "A",
"explanation_en": "B is the daughter of A and D. F is the son of E (A’s sister), so B and F are cousins.",
"explanation_hi": "B, A और D की पुत्री है। F, E (A की बहन) का पुत्र है, इसलिए B और F कजिन हैं।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "If X is the brother of the son of Y’s son, how is X related to Y?",
"question_hi": "यदि X, Y के पुत्र के पुत्र का भाई है, तो X, Y से कैसे सम्बन्धित है?",
"A_en": "Grandson", "A_hi": "ग्रैंडसन",
"B_en": "Son", "B_hi": "पुत्र",
"C_en": "Brother", "C_hi": "भाई",
"D_en": "Nephew", "D_hi": "भतीजा",
"answer": "A",
"explanation_en": "Son of Y’s son is Y’s grandson. Brother of that grandson is also Y’s grandson.",
"explanation_hi": "Y के पुत्र का पुत्र Y का ग्रैंडसन है। उस ग्रैंडसन का भाई भी Y का ग्रैंडसन ही होता है।"
}
]