[
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Pointing to a man in the photograph, a woman says: ‘The only son of my mother’s brother is the brother of my sister.’ How is the man related to the woman?",
"question_hi": "एक तस्वीर में एक आदमी की ओर इशारा करते हुए एक महिला कहती है: ‘मेरी माँ के भाई का इकलौता पुत्र मेरी बहन का भाई है।’ वह आदमी महिला से कैसे संबंधित है?",
"A_en": "Brother", "A_hi": "भाई",
"B_en": "Uncle", "B_hi": "चाचा",
"C_en": "Nephew", "C_hi": "भतीजा",
"D_en": "Cousin", "D_hi": "कजिन",
"answer": "D",
"explanation_en": "The woman’s mother’s brother’s only son is her cousin, and that cousin is the brother of her sister, so the man is also her cousin.",
"explanation_hi": "महिला की माँ के भाई का इकलौता पुत्र उसका कजिन है, और वह कजिन उसकी बहन का भाई है, इसलिए वह आदमी भी उसका कजिन है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "A is the brother of B. C is the sister of A. D is the brother of E. E is the daughter of B. Who is the uncle of D?",
"question_hi": "A, B का भाई है। C, A की बहन है। D, E का भाई है। E, B की पुत्री है। D का चाचा कौन है?",
"A_en": "A", "A_hi": "A",
"B_en": "B", "B_hi": "B",
"C_en": "C", "C_hi": "C",
"D_en": "E", "D_hi": "E",
"answer": "A",
"explanation_en": "A is the brother of B, and D is the son of B, so A is the uncle of D.",
"explanation_hi": "A, B का भाई है, और D, B का पुत्र है, इसलिए A, D का चाचा है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "If ‘A + B’ means A is the father of B, ‘A – B’ means A is the sister of B, ‘A × B’ means A is the husband of B, then which of the following shows that P is the mother-in-law of Q?",
"question_hi": "यदि ‘A + B’ का अर्थ A, B का पिता है, ‘A – B’ का अर्थ A, B की बहन है, ‘A × B’ का अर्थ A, B का पति है, तो निम्नलिखित में से कौन दर्शाता है कि P, Q की सास है?",
"A_en": "P + R × Q – S", "A_hi": "P + R × Q – S",
"B_en": "P – R + Q × S", "B_hi": "P – R + Q × S",
"C_en": "P × R – Q + S", "C_hi": "P × R – Q + S",
"D_en": "P – R × Q + S", "D_hi": "P – R × Q + S",
"answer": "C",
"explanation_en": "P × R means P is wife of R, R – Q means R is sister of Q, so P is aunt of Q, and Q + S means Q is father of S, making P mother-in-law of Q.",
"explanation_hi": "P × R का अर्थ P, R की पत्नी है, R – Q का अर्थ R, Q की बहन है, इसलिए P, Q की चाची है, और Q + S का अर्थ Q, S का पिता है, जिससे P, Q की सास बनती है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Introducing a boy, a girl said, ‘He is the only son of my mother’s husband.’ How is the boy related to the girl?",
"question_hi": "एक लड़के का परिचय देते हुए एक लड़की ने कहा, ‘वह मेरी माँ के पति का इकलौता पुत्र है।’ वह लड़का लड़की से कैसे संबंधित है?",
"A_en": "Brother", "A_hi": "भाई",
"B_en": "Cousin", "B_hi": "कजिन",
"C_en": "Uncle", "C_hi": "चाचा",
"D_en": "Nephew", "D_hi": "भतीजा",
"answer": "A",
"explanation_en": "The mother’s husband is the girl’s father and his only son is her brother.",
"explanation_hi": "माँ का पति लड़की का पिता है और उसका इकलौता पुत्र उसका भाई है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "Rama is the mother of A. B is the son of A. C is the brother of B. D is the daughter of A. How is C related to Rama?",
"question_hi": "रमा, A की माँ है। B, A का पुत्र है। C, B का भाई है। D, A की पुत्री है। C, रमा से कैसे संबंधित है?",
"A_en": "Grandson", "A_hi": "पोता",
"B_en": "Son", "B_hi": "पुत्र",
"C_en": "Nephew", "C_hi": "भतीजा",
"D_en": "Cousin", "D_hi": "कजिन",
"answer": "A",
"explanation_en": "C is the son of A and Rama is the mother of A, so C is the grandson of Rama.",
"explanation_hi": "C, A का पुत्र है और रमा, A की माँ है, इसलिए C, रमा का पोता है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "If P is the husband of Q, R is the brother of Q, S is the father of R, then how is S related to P?",
"question_hi": "यदि P, Q का पति है, R, Q का भाई है, S, R का पिता है, तो S, P से कैसे संबंधित है?",
"A_en": "Father-in-law", "A_hi": "ससुर",
"B_en": "Brother-in-law", "B_hi": "साला",
"C_en": "Uncle", "C_hi": "चाचा",
"D_en": "Grandfather", "D_hi": "दादा",
"answer": "A",
"explanation_en": "S is the father of R and R is the brother of Q, so S is the father of Q, making him the father-in-law of P.",
"explanation_hi": "S, R का पिता है और R, Q का भाई है, इसलिए S, Q का पिता है, जिससे वह P का ससुर बनता है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "A family has a man, his wife, their three sons and two daughters. How many children does the man have?",
"question_hi": "एक परिवार में एक आदमी, उसकी पत्नी, उनके तीन पुत्र और दो पुत्रियाँ हैं। उस आदमी के कितने बच्चे हैं?",
"A_en": "3", "A_hi": "3",
"B_en": "4", "B_hi": "4",
"C_en": "5", "C_hi": "5",
"D_en": "6", "D_hi": "6",
"answer": "C",
"explanation_en": "Three sons and two daughters total 5 children.",
"explanation_hi": "तीन पुत्र और दो पुत्रियाँ मिलाकर कुल 5 बच्चे हैं।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "X said to Y, ‘Your mother’s only sister is my aunt.’ How is Y related to X?",
"question_hi": "X ने Y से कहा, ‘तुम्हारी माँ की इकलौती बहन मेरी चाची है।’ Y, X से कैसे संबंधित है?",
"A_en": "Cousin", "A_hi": "कजिन",
"B_en": "Brother", "B_hi": "भाई",
"C_en": "Nephew", "C_hi": "भतीजा",
"D_en": "Uncle", "D_hi": "चाचा",
"answer": "A",
"explanation_en": "The only sister of Y’s mother is X’s aunt, so Y and X are cousins.",
"explanation_hi": "Y की माँ की इकलौती बहन X की चाची है, इसलिए Y और X कजिन हैं।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "A woman introduces a man as the son of the brother of her mother. How is the man related to her?",
"question_hi": "एक महिला एक आदमी का परिचय अपनी माँ के भाई के पुत्र के रूप में देती है। वह आदमी उससे कैसे संबंधित है?",
"A_en": "Cousin", "A_hi": "कजिन",
"B_en": "Nephew", "B_hi": "भतीजा",
"C_en": "Uncle", "C_hi": "चाचा",
"D_en": "Brother", "D_hi": "भाई",
"answer": "A",
"explanation_en": "The brother of her mother is her maternal uncle and his son is her cousin.",
"explanation_hi": "उसकी माँ का भाई उसका मामा है और उसका पुत्र उसका कजिन है।"
},
{
"subject": "Reasoning",
"topic": "Blood Relations",
"question_en": "If P’s father is the brother of Q’s mother and Q has no sister, how is P related to Q?",
"question_hi": "यदि P के पिता, Q की माँ के भाई हैं और Q की कोई बहन नहीं है, तो P, Q से कैसे संबंधित है?",
"A_en": "Cousin", "A_hi": "कजिन",
"B_en": "Brother", "B_hi": "भाई",
"C_en": "Uncle", "C_hi": "चाचा",
"D_en": "Cannot be determined", "D_hi": "निर्धारित नहीं किया जा सकता",
"answer": "A",
"explanation_en": "P’s father and Q’s mother are siblings, so P and Q are cousins.",
"explanation_hi": "P के पिता और Q की माँ भाई-बहन हैं, इसलिए P और Q कजिन हैं।"
}
]