[
{
"subject": "Reasoning",
"topic": "Baithak Vyavastha (Seating Arrangement)",
"question_en": "Eight friends P, Q, R, S, T, U, V, W are sitting in a circle facing the centre. P is second to the right of T who is the neighbour of R and V. S is not the neighbour of P. V is the neighbour of U. Q is not between S and W. W is not between U and S. Who is immediately to the right of V?",
"question_hi": "आठ मित्र P, Q, R, S, T, U, V, W केंद्र की ओर मुख करके एक वृत्त में बैठे हैं। P, T के दायें दूसरा है जो R और V का पड़ोसी है। S, P का पड़ोसी नहीं है। V, U का पड़ोसी है। Q, S और W के बीच नहीं है। W, U और S के बीच नहीं है। V के ठीक दायें कौन है?",
"A_en": "Q", "A_hi": "Q",
"B_en": "P", "B_hi": "P",
"C_en": "U", "B_hi": "U",
"D_en": "T", "D_hi": "T",
"answer": "A",
"explanation_en": "After arranging all as per the conditions, Q is found immediately to the right of V.",
"explanation_hi": "सभी शर्तों के अनुसार व्यवस्था करने पर Q, V के ठीक दायें पाया जाता है।"
},
{
"subject": "Reasoning",
"topic": "Baithak Vyavastha (Seating Arrangement)",
"question_en": "In a row of 25 children facing south, R is 16th from the right end and S is 18th from the left end. How many children are sitting between R and S?",
"question_hi": "दक्षिण की ओर मुख करके 25 बच्चों की एक पंक्ति में R दायें छोर से 16वां है और S बायें छोर से 18वां है। R और S के बीच कितने बच्चे बैठे हैं?",
"A_en": "7", "A_hi": "7",
"B_en": "8", "B_hi": "8",
"C_en": "9", "B_hi": "9",
"D_en": "10", "D_hi": "10",
"answer": "A",
"explanation_en": "Positions from left for R = 25 − 16 + 1 = 10. S is 18th from left, so between 10 and 18 there are 7 children.",
"explanation_hi": "बायें से R का स्थान = 25 − 16 + 1 = 10। S बायें से 18वां है, इसलिए 10 और 18 के बीच 7 बच्चे हैं।"
},
{
"subject": "Reasoning",
"topic": "Baithak Vyavastha (Seating Arrangement)",
"question_en": "Five friends A, B, C, D, E are sitting on a bench facing north. A is to the immediate right of B. D is at the extreme right end. C is between B and D. Who is sitting second from the left end?",
"question_hi": "पाँच मित्र A, B, C, D, E उत्तर की ओर मुख करके एक बेंच पर बैठे हैं। A, B के ठीक दायें है। D अंतिम दायें छोर पर है। C, B और D के बीच है। बायें छोर से दूसरे स्थान पर कौन है?",
"A_en": "B", "A_hi": "B",
"B_en": "C", "B_hi": "C",
"C_en": "A", "B_hi": "A",
"D_en": "D", "D_hi": "D",
"answer": "A",
"explanation_en": "Order from left: B, A, C, D, E. Thus second from left is A.",
"explanation_hi": "बायें से क्रम: B, A, C, D, E। इसलिए बायें से दूसरा A है।"
},
{
"subject": "Reasoning",
"topic": "Baithak Vyavastha (Seating Arrangement)",
"question_en": "Eight persons are sitting in two parallel rows containing four persons each, in such a way that there is an equal distance between adjacent persons. In row 1 A, B, C, D are seated and all of them are facing south. In row 2 P, Q, R, S are seated and all of them are facing north. B is sitting extreme left of row 1. R is sitting second to the left of the person who faces B. Who faces R?",
"question_hi": "आठ व्यक्ति दो समानांतर पंक्तियों में चार-चार करके इस प्रकार बैठे हैं कि आसन्न व्यक्तियों के बीच समान दूरी है। पंक्ति 1 में A, B, C, D दक्षिण की ओर मुख करके बैठे हैं। पंक्ति 2 में P, Q, R, S उत्तर की ओर मुख करके बैठे हैं। B पंक्ति 1 के अंतिम बायें है। R उस व्यक्ति के बायें दूसरे स्थान पर है जो B का सामना करता है। R का सामना कौन करता है?",
"A_en": "C", "A_hi": "C",
"B_en": "A", "B_hi": "A",
"C_en": "D", "B_hi": "D",
"D_en": "B", "D_hi": "B",
"answer": "A",
"explanation_en": "B is at left end of row 1; the person second to left of the one facing B is R, so R faces C.",
"explanation_hi": "B पंक्ति 1 के बायें छोर पर है; जो B का सामना करता है उसके बायें दूसरे स्थान पर R है, इसलिए R का सामना C करता है।"
},
{
"subject": "Reasoning",
"topic": "Baithak Vyavastha (Seating Arrangement)",
"question_en": "Six persons are sitting around a hexagonal table facing the centre. U is between V and W. Q is second to the right of W. P is third to the left of Q. Who is sitting opposite P?",
"question_hi": "छह व्यक्ति केंद्र की ओर मुख करके षट्कोणीय मेज़ के चारों ओर बैठे हैं। V और W के बीच U है। Q, W के दायें दूसरा है। P, Q के बायें तीसरा है। P के विपरीत कौन बैठा है?",
"A_en": "V", "A_hi": "V",
"B_en": "U", "B_hi": "U",
"C_en": "W", "B_hi": "W",
"D_en": "Q", "D_hi": "Q",
"answer": "A",
"explanation_en": "Arranging in the hexagon, V comes exactly opposite to P.",
"explanation_hi": "षट्कोण में व्यवस्था करने पर V ठीक P के विपरीत आता है।"
},
{
"subject": "Reasoning",
"topic": "Baithak Vyavastha (Seating Arrangement)",
"question_en": "In a linear row of boys facing north, Jack is 15th from the left end and Mike is 20th from the right end. If they interchange their positions, Jack becomes 25th from the left. How many boys are there in the row?",
"question_hi": "उत्तर की ओर मुख करके लड़कों की एक रेखीय पंक्ति में जैक बायें से 15वां है और माइक दायें से 20वां है। यदि वे अपने स्थान बदल लें तो जैक बायें से 25वां हो जाता है। पंक्ति में कुल कितने लड़के हैं?",
"A_en": "44", "A_hi": "44",
"B_en": "45", "B_hi": "45",
"C_en": "46", "B_hi": "46",
"D_en": "47", "D_hi": "47",
"answer": "A",
"explanation_en": "After swap, Jack’s new position 25th from left equals Mike’s old position 20th from right. Total = 25 + 20 − 1 = 44.",
"explanation_hi": "स्थान बदलने के बाद जैक की नई स्थिति बायें से 25वां माइक की पुरानी स्थिति दायें से 20वां है। कुल = 25 + 20 − 1 = 44।"
},
{
"subject": "Reasoning",
"topic": "Baithak Vyavastha (Seating Arrangement)",
"question_en": "Eight students A, B, C, D, E, F, G, H are sitting around a circular table facing the centre. A is third to the left of G. F is second to the right of C. C is between G and B. D is not a neighbour of G. Who is sitting third to the right of G?",
"question_hi": "आठ छात्र A, B, C, D, E, F, G, H केंद्र की ओर मुख करके गोल मेज़ के चारों ओर बैठे हैं। A, G के बायें तीसरा है। F, C के दायें दूसरा है। C, G और B के बीच है। D, G का पड़ोसी नहीं है। G के दायें तीसरा कौन है?",
"A_en": "D", "A_hi": "D",
"B_en": "E", "B_hi": "E",
"C_en": "F", "B_hi": "F",
"D_en": "H", "D_hi": "H",
"answer": "A",
"explanation_en": "Circular arrangement shows D is third to the right of G.",
"explanation_hi": "वृत्ताकार व्यवस्था में D, G के दायें तीसरा है।"
},
{
"subject": "Reasoning",
"topic": "Baithak Vyavastha (Seating Arrangement)",
"question_en": "Five girls are sitting on a bench to be photographed facing north. Shikha is to the left of Reena and to the right of Sapna. Amita is to the right of Reena. Ritu is between Reena and Amita. Who is second from the left in the photograph?",
"question_hi": "पाँच लड़कियाँ फोटो खिंचवाने के लिए उत्तर की ओर मुख करके बेंच पर बैठी हैं। शिखा, रीना के बायें और सपना के दायें है। अमिता, रीना के दायें है। रीतु, रीना और अमिता के बीच है। फोटो में बायें से दूसरी कौन है?",
"A_en": "Reena", "A_hi": "रीना",
"B_en": "Sapna", "B_hi": "सपना",
"C_en": "Ritu", "B_hi": "रीतु",
"D_en": "Shikha", "D_hi": "शिखा",
"answer": "A",
"explanation_en": "Order from left: Sapna, Shikha, Reena, Ritu, Amita. Hence second from left is Shikha.",
"explanation_hi": "बायें से क्रम: सपना, शिखा, रीना, रीतु, अमिता। इसलिए बायें से दूसरी शिखा है।"
},
{
"subject": "Reasoning",
"topic": "Baithak Vyavastha (Seating Arrangement)",
"question_en": "In a row of 40 children facing north, R is 12th from the left end and T is 27th from the right end. How many children are sitting between R and T?",
"question_hi": "उत्तर की ओर मुख करके 40 बच्चों की पंक्ति में R बायें से 12वां है और T दायें से 27वां है। R और T के बीच कितने बच्चे बैठे हैं?",
"A_en": "1", "A_hi": "1",
"B_en": "2", "B_hi": "2",
"C_en": "0", "B_hi": "0",
"D_en": "3", "D_hi": "3",
"answer": "C",
"explanation_en": "T is 27th from right so 14th from left. R is 12th, so T is next to R; no child between them.",
"explanation_hi": "T दायें से 27वां है इसलिए बायें से 14वां है। R 12वां है, अतः T ठीक R के बगल में है; बीच में कोई नहीं।"
},
{
"subject": "Reasoning",
"topic": "Baithak Vyavastha (Seating Arrangement)",
"question_en": "Seven friends P, Q, R, S, T, U, V are sitting in a straight line facing north. R is at the extreme left end. Q is between R and S. T is immediately after S. U is between T and V. If V is at the extreme right end, who is sitting in the exact middle?",
"question_hi": "सात मित्र P, Q, R, S, T, U, V उत्तर की ओर मुख करके सीधी रेखा में बैठे हैं। R अंतिम बायें छोर पर है। Q, R और S के बीच है। T, S के ठीक बाद है। U, T और V के बीच है। यदि V अंतिम दायें छोर पर है, तो ठीक बीच में कौन है?",
"A_en": "S", "A_hi": "S",
"B_en": "T", "B_hi": "T",
"C_en": "U", "B_hi": "U",
"D_en": "Q", "D_hi": "Q",
"answer": "B",
"explanation_en": "Sequence: R, Q, S, T, U, P, V. The 4th position is T, hence T is in the exact middle.",
"explanation_hi": "क्रम: R, Q, S, T, U, P, V। चौथा स्थान T है, इसलिए T ठीक बीच में है।"
}
]