[
{
"subject": "Reasoning",
"topic": "Kathan aur Tark, Nishkarsh (Arguments & Conclusions)",
"question_en": "Statement: All rivers are lakes. Some lakes are ponds. Conclusion: I. All rivers are ponds. II. Some ponds are rivers.",
"question_hi": "कथन: सभी नदियाँ झीलें हैं। कुछ झीलें तालाब हैं। निष्कर्ष: I. सभी नदियाँ तालाब हैं। II. कुछ तालाब नदियाँ हैं।",
"A_en": "Only I follows", "A_hi": "केवल I अनुसरण करता है",
"B_en": "Only II follows", "B_hi": "केवल II अनुसरण करता है",
"C_en": "Neither I nor II follows", "C_hi": "न तो I न ही II अनुसरण करता है",
"D_en": "Both I and II follow", "D_hi": "I और II दोनों अनुसरण करते हैं",
"answer": "C",
"explanation_en": "From the statements, no direct relation establishes all rivers as ponds or some ponds as rivers, so neither conclusion follows.",
"explanation_hi": "कथनों से कोई प्रत्यक्ष संबंध यह स्थापित नहीं करता कि सभी नदियाँ तालाब हैं या कुछ तालाब नदियाँ हैं, इसलिए कोई भी निष्कर्ष अनुसरण नहीं करता।"
},
{
"subject": "Reasoning",
"topic": "Kathan aur Tark, Nishkarsh (Arguments & Conclusions)",
"question_en": "Statement: No mobile is a laptop. Some laptops are tablets. Conclusion: I. Some tablets are not mobiles. II. No tablet is a mobile.",
"question_hi": "कथन: कोई मोबाइल लैपटॉप नहीं है। कुछ लैपटॉप टैबलेट हैं। निष्कर्ष: I. कुछ टैबलेट मोबाइल नहीं हैं। II. कोई टैबलेट मोबाइल नहीं है।",
"A_en": "Only I follows", "A_hi": "केवल I अनुसरण करता है",
"B_en": "Only II follows", "B_hi": "केवल II अनुसरण करता है",
"C_en": "Either I or II follows", "C_hi": "या तो I या II अनुसरण करता है",
"D_en": "Neither I nor II follows", "D_hi": "न तो I न ही II अनुसरण करता है",
"answer": "A",
"explanation_en": "Since some laptops are tablets and no mobile is a laptop, at least those tablets that are laptops cannot be mobiles, so I follows; II is extreme and not necessarily true.",
"explanation_hi": "चूँकि कुछ लैपटॉप टैबलेट हैं और कोई मोबाइल लैपटॉप नहीं है, कम से कम वे टैबलेट जो लैपटॉप हैं मोबाइल नहीं हो सकते, इसलिए I अनुसरण करता है; II अत्यधिक है और आवश्यक रूप से सत्य नहीं।"
},
{
"subject": "Reasoning",
"topic": "Kathan aur Tark, Nishkarsh (Arguments & Conclusions)",
"question_en": "Statement: If it rains, the match will be cancelled. The match was not cancelled. Conclusion: I. It did not rain. II. The match was played.",
"question_hi": "कथन: यदि बारिश होती है, तो मैच रद्द कर दिया जाएगा। मैच रद्द नहीं किया गया। निष्कर्ष: I. बारिश नहीं हुई। II. मैच खेला गया।",
"A_en": "Only I follows", "A_hi": "केवल I अनुसरण करता है",
"B_en": "Only II follows", "B_hi": "केवल II अनुसरण करता है",
"C_en": "Both I and II follow", "D_hi": "I और II दोनों अनुसरण करते हैं",
"D_en": "Neither I nor II follows", "D_hi": "न तो I न ही II अनुसरण करता है",
"answer": "A",
"explanation_en": "From the contrapositive rule, if the match was not cancelled, it implies it did not rain; nothing is certain about the match being played.",
"explanation_hi": "विपर्यय नियम से, यदि मैच रद्द नहीं किया गया, तो इसका अर्थ है बारिश नहीं हुई; मैच के खेले जाने के बारे में कुछ निश्चित नहीं है।"
},
{
"subject": "Reasoning",
"topic": "Kathan aur Tark, Nishkarsh (Arguments & Conclusions)",
"question_en": "Statement: All pens are inks. Some inks are not papers. Conclusion: I. Some pens are not papers. II. All papers are pens.",
"question_hi": "कथन: सभी पेन इंक हैं। कुछ इंक पेपर नहीं हैं। निष्कर्ष: I. कुछ पेन पेपर नहीं हैं। II. सभी पेपर पेन हैं।",
"A_en": "Only I follows", "A_hi": "केवल I अनुसरण करता है",
"B_en": "Only II follows", "B_hi": "केवल II अनुसरण करता है",
"C_en": "Neither I nor II follows", "C_hi": "न तो I न ही II अनुसरण करता है",
"D_en": "Both I and II follow", "D_hi": "I और II दोनों अनुसरण करते हैं",
"answer": "A",
"explanation_en": "Since all pens are inks and some inks are not papers, those pens that are such inks are not papers, so I follows; II reverses the relation and is invalid.",
"explanation_hi": "चूँकि सभी पेन इंक हैं और कुछ इंक पेपर नहीं हैं, वे पेन जो ऐसे इंक हैं वे पेपर नहीं हैं, इसलिए I अनुसरण करता है; II संबंध को उलट देता है और अमान्य है।"
},
{
"subject": "Reasoning",
"topic": "Kathan aur Tark, Nishkarsh (Arguments & Conclusions)",
"question_en": "Statement: Some cats are dogs. All dogs are rats. Conclusion: I. Some cats are rats. II. All rats are cats.",
"question_hi": "कथन: कुछ बिल्लियाँ कुत्ते हैं। सभी कुत्ते चूहे हैं। निष्कर्ष: I. कुछ बिल्लियाँ चूहे हैं। II. सभी चूहे बिल्लियाँ हैं।",
"A_en": "Only I follows", "A_hi": "केवल I अनुसरण करता है",
"B_en": "Only II follows", "B_hi": "केवल II अनुसरण करता है",
"C_en": "Both I and II follow", "D_hi": "I और II दोनों अनुसरण करते हैं",
"D_en": "Neither I nor II follows", "D_hi": "न तो I न ही II अनुसरण करता है",
"answer": "A",
"explanation_en": "The overlap of some cats being dogs and all dogs being rats ensures some cats are rats; II is an invalid converse.",
"explanation_hi": "कुछ बिल्लियों के कुत्ते होने और सभी कुत्तों के चूहे होने से कुछ बिल्लियाँ चूहे होना सुनिश्चित होता है; II एक अमान्य व्युत्क्रम है।"
},
{
"subject": "Reasoning",
"topic": "Kathan aur Tark, Nishkarsh (Arguments & Conclusions)",
"question_en": "Statement: Every book is a page. Some pages are covers. Conclusion: I. Some books are covers. II. No book is a cover.",
"question_hi": "कथन: प्रत्येक पुस्तक एक पेज है। कुछ पेज कवर हैं। निष्कर्ष: I. कुछ पुस्तकें कवर हैं। II. कोई पुस्तक कवर नहीं है।",
"A_en": "Only I follows", "A_hi": "केवल I अनुसरण करता है",
"B_en": "Only II follows", "B_hi": "केवल II अनुसरण करता है",
"C_en": "Either I or II follows", "C_hi": "या तो I या II अनुसरण करता है",
"D_en": "Neither I nor II follows", "D_hi": "न तो I न ही II अनुसरण करता है",
"answer": "C",
"explanation_en": "Since the middle term is not distributed, no definite conclusion can be drawn, leading to a complementary pair where either I or II follows.",
"explanation_hi": "चूँकि मध्य पद वितरित नहीं है, कोई निश्चित निष्कर्ष नहीं निकाला जा सकता, जिससे एक पूरक युग्म बनता है जहाँ या तो I या II अनुसरण करता है।"
},
{
"subject": "Reasoning",
"topic": "Kathan aur Tark, Nishkarsh (Arguments & Conclusions)",
"question_en": "Statement: No tree is a plant. Some plants are herbs. Conclusion: I. Some herbs are not trees. II. All herbs are trees.",
"question_hi": "कथन: कोई पेड़ पौधा नहीं है। कुछ पौधे जड़ी-बूटियाँ हैं। निष्कर्ष: I. कुछ जड़ी-बूटियाँ पेड़ नहीं हैं। II. सभी जड़ी-बूटियाँ पेड़ हैं।",
"A_en": "Only I follows", "A_hi": "केवल I अनुसरण करता है",
"B_en": "Only II follows", "B_hi": "केवल II अनुसरण करता है",
"C_en": "Neither I nor II follows", "C_hi": "न तो I न ही II अनुसरण करता है",
"D_en": "Both I and II follow", "D_hi": "I और II दोनों अनुसरण करते हैं",
"answer": "A",
"explanation_en": "The herbs that are plants cannot be trees, so some herbs are not trees; II contradicts the premises.",
"explanation_hi": "वे जड़ी-बूटियाँ जो पौधे हैं पेड़ नहीं हो सकतीं, इसलिए कुछ जड़ी-बूटियाँ पेड़ नहीं हैं; II प्रस्तावों का विरोध करता है।"
},
{
"subject": "Reasoning",
"topic": "Kathan aur Tark, Nishkarsh (Arguments & Conclusions)",
"question_en": "Statement: Most students are diligent. All diligent people are punctual. Conclusion: I. Most students are punctual. II. Some punctual are students.",
"question_hi": "कथन: अधिकांश छात्र परिश्रमी हैं। सभी परिश्रमी लोग समयबद्ध हैं। निष्कर्ष: I. अधिकांश छात्र समयबद्ध हैं। II. कुछ समयबद्ध छात्र हैं।",
"A_en": "Only I follows", "A_hi": "केवल I अनुसरण करता है",
"B_en": "Only II follows", "B_hi": "केवल II अनुसरण करता है",
"C_en": "Both I and II follow", "D_hi": "I और II दोनों अनुसरण करते हैं",
"D_en": "Neither I nor II follows", "D_hi": "न तो I न ही II अनुसरण करता है",
"answer": "C",
"explanation_en": "The majority of students being diligent and all diligent being punctual ensures both conclusions hold.",
"explanation_hi": "अधिकांश छात्रों के परिश्रमी होने और सभी परिश्रमी लोगों के समयबद्ध होने से दोनों निष्कर्ष सत्य होते हैं।"
},
{
"subject": "Reasoning",
"topic": "Kathan aur Tark, Nishkarsh (Arguments & Conclusions)",
"question_en": "Statement: Some A are B. No B is C. Conclusion: I. Some A are not C. II. All A are C.",
"question_hi": "कथन: कुछ A, B हैं। कोई B, C नहीं है। निष्कर्ष: I. कुछ A, C नहीं हैं। II. सभी A, C हैं।",
"A_en": "Only I follows", "A_hi": "केवल I अनुसरण करता है",
"B_en": "Only II follows", "B_hi": "केवल II अनुसरण करता है",
"C_en": "Either I or II follows", "C_hi": "या तो I या II अनुसरण करता है",
"D_en": "Neither I nor II follows", "D_hi": "न तो I न ही II अनुसरण करता है",
"answer": "A",
"explanation_en": "The overlap of A and B combined with no B being C guarantees some A are not C; II contradicts the premises.",
"explanation_hi": "A और B के अतिव्यापन के साथ कोई B, C नहीं होने से कुछ A, C नहीं हैं यह सुनिश्चित होता है; II प्रस्तावों का विरोध करता है।"
},
{
"subject": "Reasoning",
"topic": "Kathan aur Tark, Nishkarsh (Arguments & Conclusions)",
"question_en": "Statement: All cities are towns. Some towns are villages. Conclusion: I. Some cities are villages. II. No city is a village.",
"question_hi": "कथन: सभी शहर कस्बे हैं। कुछ कस्बे गाँव हैं। निष्कर्ष: I. कुछ शहर गाँव हैं। II. कोई शहर गाँव नहीं है।",
"A_en": "Only I follows", "A_hi": "केवल I अनुसरण करता है",
"B_en": "Only II follows", "B_hi": "केवल II अनुसरण करता है",
"C_en": "Either I or II follows", "C_hi": "या तो I या II अनुसरण करता है",
"D_en": "Neither I nor II follows", "D_hi": "न तो I न ही II अनुसरण करता है",
"answer": "C",
"explanation_en": "The middle term is not distributed, creating a complementary pair where either conclusion could be true but not both.",
"explanation_hi": "मध्य पद वितरित नहीं है, जिससे एक पूरक युग्म बनता है जहाँ या तो निष्कर्ष सत्य हो सकता है पर दोनों नहीं।"
}
]