[
{
"subject": "Reasoning",
"topic": "Rakta Sambandh (Blood Relations) aur Disha Gyan (Direction)",
"question_en": "Pointing to a man in the photograph, Rani said, 'His mother’s only daughter is my mother.' How is the man related to Rani?",
"question_hi": "फोटो में एक आदमी की ओर इशारा करते हुए रानी कहती है, 'उसकी माँ की इकलौती बेटी मेरी माँ है।' वह आदमी रानी से कैसे सम्बंधित है?",
"A_en": "Uncle", "A_hi": "चाचा",
"B_en": "Brother", "B_hi": "भाई",
"C_en": "Cousin", "C_hi": "कजिन",
"D_en": "Nephew", "D_hi": "भतीजा",
"answer": "A",
"explanation_en": "The man’s mother’s only daughter is the man’s sister, who is also Rani’s mother. Hence, the man is Rani’s maternal uncle.",
"explanation_hi": "आदमी की माँ की इकलौती बेटी आदमी की बहन है जो रानी की माँ भी है, इसलिए वह आदमी रानी का मामा है।"
},
{
"subject": "Reasoning",
"topic": "Rakta Sambandh (Blood Relations) aur Disha Gyan (Direction)",
"question_en": "A man walks 8 km towards the north, then turns left and walks 5 km. Then he turns left again and walks 8 km. How far is he from the starting point?",
"question_hi": "एक आदमी उत्तर की ओर 8 किमी चलता है, फिर बाएँ मुड़ता है और 5 किमी चलता है। फिर वह फिर बाएँ मुड़ता है और 8 किमी चलता है। वह प्रारंभिक बिंदु से कितनी दूरी पर है?",
"A_en": "5 km", "A_hi": "5 किमी",
"B_en": "8 km", "B_hi": "8 किमी",
"C_en": "10 km", "C_hi": "10 किमी",
"D_en": "13 km", "D_hi": "13 किमी",
"answer": "A",
"explanation_en": "After three moves he is only 5 km horizontally away from the starting point.",
"explanation_hi": "तीन चालों के बाद वह प्रारंभिक बिंदु से केवल 5 किमी क्षैतिज दूरी पर है।"
},
{
"subject": "Reasoning",
"topic": "Rakta Sambandh (Blood Relations) aur Disha Gyan (Direction)",
"question_en": "If P is the brother of Q, Q is the sister of R, and R is the father of S, how is P related to S?",
"question_hi": "यदि P, Q का भाई है, Q, R की बहन है और R, S का पिता है, तो P, S से कैसे सम्बंधित है?",
"A_en": "Uncle", "A_hi": "चाचा",
"B_en": "Father", "B_hi": "पिता",
"C_en": "Grandfather", "C_hi": "दादा",
"D_en": "Cousin", "C_hi": "कजिन",
"answer": "A",
"explanation_en": "P is the brother of Q and R is their brother, making P the paternal uncle of S.",
"explanation_hi": "P, Q का भाई है और R उनका भाई है, इसलिए P, S का पिता का भाई (चाचा) है।"
},
{
"subject": "Reasoning",
"topic": "Rakta Sambandh (Blood Relations) aur Disha Gyan (Direction)",
"question_en": "A car starts from a point and moves 10 km south, then it turns right and goes 5 km, then again turns right and moves 10 km. In which direction is the car from the starting point?",
"question_hi": "एक कार एक बिंदु से चलना शुरू करती है और 10 किमी दक्षिण जाती है, फिर दाएँ मुड़ती है और 5 किमी जाती है, फिर फिर दाएँ मुड़ती है और 10 किमी जाती है। कार प्रारंभिक बिंदु से किस दिशा में है?",
"A_en": "North", "A_hi": "उत्तर",
"B_en": "South", "B_hi": "दक्षिण",
"C_en": "East", "C_hi": "पूर्व",
"D_en": "West", "D_hi": "पश्चिम",
"answer": "C",
"explanation_en": "After the described moves the car is 5 km due east of the start.",
"explanation_hi": "वर्णित चालों के बाद कार प्रारंभिक बिंदु से 5 किमी पूर्व में है।"
},
{
"subject": "Reasoning",
"topic": "Rakta Sambandh (Blood Relations) aur Disha Gyan (Direction)",
"question_en": "Introducing a boy, a girl said, 'He is the son of the daughter of the father of my uncle.' How is the boy related to the girl?",
"question_hi": "एक लड़का का परिचय देते हुए एक लड़की कहती है, 'वह मेरे चाचा के पिता की बेटी का बेटा है।' वह लड़का लड़की से कैसे सम्बंधित है?",
"A_en": "Brother", "A_hi": "भाई",
"B_en": "Cousin", "B_hi": "कजिन",
"C_en": "Nephew", "C_hi": "भतीजा",
"D_en": "Uncle", "D_hi": "चाचा",
"answer": "A",
"explanation_en": "The father of the girl’s uncle is her grandfather; his daughter is her mother and the boy is that mother’s son, i.e. her brother.",
"explanation_hi": "लड़की के चाचा का पिता उसका दादा है; उसकी बेटी उसकी माँ है और लड़का उस माँ का बेटा है, अर्थात् उसका भाई।"
},
{
"subject": "Reasoning",
"topic": "Rakta Sambandh (Blood Relations) aur Disha Gyan (Direction)",
"question_en": "A person walks 20 m towards the east, then turns left and walks 15 m, then turns right and walks 20 m. How far is he from the start and in which direction?",
"question_hi": "एक व्यक्ति पूर्व की ओर 20 मी चलता है, फिर बाएँ मुड़ता है और 15 मी चलता है, फिर दाएँ मुड़ता है और 20 मी चलता है। वह प्रारंभ से कितनी दूरी पर और किस दिशा में है?",
"A_en": "35 m East", "A_hi": "35 मी पूर्व",
"B_en": "35 m North", "B_hi": "35 मी उत्तर",
"C_en": "25 m North", "B_hi": "25 मी उत्तर",
"D_en": "25 m East", "D_hi": "25 मी पूर्व",
"answer": "B",
"explanation_en": "Net movement is 15 m north and 20 m east, giving 25 m northeast, but straight-line distance is √(15²+20²)=25 m and direction is north-east, hence closest option is 25 m North.",
"explanation_hi": "कुल विस्थापन 15 मी उत्तर और 20 मी पूर्व है, सरल रेखा दूरी 25 मी है और दिशा उत्तर-पूर्व है, अतः निकटतम विकल्प 25 मी उत्तर है।"
},
{
"subject": "Reasoning",
"topic": "Rakta Sambandh (Blood Relations) aur Disha Gyan (Direction)",
"question_en": "A is B’s sister. C is B’s mother. D is C’s father. E is D’s mother. How is A related to D?",
"question_hi": "A, B की बहन है। C, B की माँ है। D, C का पिता है। E, D की माँ है। A, D से कैसे सम्बंधित है?",
"A_en": "Granddaughter", "A_hi": "ग्रैंडडॉटर",
"B_en": "Daughter", "B_hi": "बेटी",
"C_en":"Grandson", "C_hi": "ग्रैंडसन",
"D_en": "Niece", "D_hi": "भांजी",
"answer": "A",
"explanation_en": "D is the grandfather of A, so A is the granddaughter of D.",
"explanation_hi": "D, A का नाना है, इसलिए A, D की ग्रैंडडॉटर है।"
},
{
"subject": "Reasoning",
"topic": "Rakta Sambandh (Blood Relations) aur Disha Gyan (Direction)",
"question_en": "Raju’s father’s only grandson is Manish. How is Manish related to Raju?",
"question_hi": "राजू के पिता का इकलौता ग्रैंडसन मनीष है। मनीष राजू से कैसे सम्बंधित है?",
"A_en": "Son", "A_hi": "बेटा",
"B_en": "Nephew", "B_hi": "भतीजा",
"C_en": "Brother", "C_hi": "भाई",
"D_en": "Cannot be determined", "D_hi": "निर्धारित नहीं किया जा सकता",
"answer": "A",
"explanation_en": "The only grandson of Raju’s father is Raju’s own son, hence Manish is Raju’s son.",
"explanation_hi": "राजू के पिता का इकलौता ग्रैंडसन राजू का अपना बेटा है, इसलिए मनीष राजू का बेटा है।"
},
{
"subject": "Reasoning",
"topic": "Rakta Sambandh (Blood Relations) aur Disha Gyan (Direction)",
"question_en": "A man goes 5 km west, then 5 km south, then 5 km east and finally 5 km north. How far is he from the starting point?",
"question_hi": "एक आदमी 5 किमी पश्चिम जाता है, फिर 5 किमी दक्षिण, फिर 5 किमी पूर्व और अंत में 5 किमी उत्तर। वह प्रारंभिक बिंदु से कितनी दूरी पर है?",
"A_en": "0 km", "A_hi": "0 किमी",
"B_en": "5 km", "B_hi": "5 किमी",
"C_en": "10 km", "C_hi": "10 किमी",
"D_en": "15 km", "D_hi": "15 किमी",
"answer": "A",
"explanation_en": "The path forms a rectangle bringing him back to the start.",
"explanation_hi": "यह पथ एक आयत बनाता है जो उसे वापस प्रारंभिक बिंदु पर ले आता है।"
},
{
"subject": "Reasoning",
"topic": "Rakta Sambandh (Blood Relations) aur Disha Gyan (Direction)",
"question_en": "In a family of 6 members A, B, C, D, E, F, A and F are father and mother of D; B is brother of A; C is wife of B; E is grandson of A. How is C related to E?",
"question_hi": "6 सदस्यों A, B, C, D, E, F के परिवार में A और F, D के माता-पिता हैं; B, A का भाई है; C, B की पत्नी है; E, A का ग्रैंडसन है। C, E से कैसे सम्बंधित है?",
"A_en": "Grandmother", "A_hi": "दादी",
"B_en": "Aunt", "B_hi": "बुआ",
"C_en": "Mother", "C_hi": "माँ",
"D_en": "Cousin", "D_hi": "कजिन",
"answer": "B",
"explanation_en": "C is the wife of B who is the paternal uncle of E, so C is E’s aunt.",
"explanation_hi": "C, B की पत्नी है जो E का पिता का भाई है, इसलिए C, E की बुआ है।"
}
]