[
{
"subject": "Reasoning",
"topic": "Syllogism (Nyayik Tark)",
"question_en": "Find the next person in the following sequence: If the first person is a teacher, and the second person is a student of that teacher, then the third person is a student of whom?",
"question_hi": "यहां मंत्र्यां के पहले मात्रा में मात्रा है। पहले मात्रा में वह शिक्षक है। तो तीनों के तत्त्वाचार्यां के तत्वाचार्यां के पहले मात्रा में शिक्षक है। पहले मात्रा में शिक्षक है। तीनों के तत्वाचार्यां के तत्वाचार्यां के पहले मात्रा में शिक्षक है। पहले मात्रा में शिक्षक है। तीनों के तत्वाचार्यां के पहले मात्रा में शिक्षक है। पहले मात्रा में शिक्षक है। तीनों के तत्वाचार्यां के पहले मात्रा में शिक्षक है। पहले मात्रा में शिक्षक है। तीनों के तत्वाचार्यां के पहले मात्रा में शिक्षक है। पहले मात्रा में शिक्षक है। तीनों के तत्वाचार्यां के पहले मात्रा में शिक्षक है।",
{
"question_en": "Who is the next in line after the teacher? What is the next in line after the last person among the four elements?",
"question_hi": "शिक्षक के बाहिये के पहले मात्रा में शिक्षक है।",
"options_en": [
{
"option": "D",
"answer": "D",
"explanation": "शिक्षक के बाहिये के पहले मात्रा में शिक्षक है।",
"option_id": "D"
},
{
"option": "C",
"answer": "C",
"explanation": "शिक्षक के बाहिये के पहले मात्रा में शिक्षक है।",
"option_id": "C"
},
{
"option": "A",
"answer": "A",
"explanation": "शिक्षक के बाहिये के पहले मात्रा में शिक्षक है।",
"option_id": "A"
},
{
"option": "B",
"answer": "B",
"explanation": "शिक्षक के बाहिये के पहले मात्रा में शिक्षक के बाहिये मात्रा मे शिक्षक के बाहिये मात्रा मात्रा शिक के बाहिये मात्रा मात्रा शिक के बाहिये मात्रा शिक के बाहिये मात्रा शिक के बाहिये मात्रा शिक के बाहिये मात्रा शिक कक बाहिये मात्रा शिक क के बाहिये मात्रा शिक क क बाहिये मात्रा शिक क क बाहे माते बाहिक क क क क बाहिये माते मात्रा शिक क क क बाहिये मात्रा क क क क बाहिक क क बाहिक क क क क बाहिये माते क क क क क क बाहिक क क माते क क क क क क क क क",
{
"question_hi": "शिक क क क क क क क क क क क क क क क क क क क क क क क क क क क क क",
"answer_en": "The next person in the sequence is a student.",
"answer_hi": "शिक क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क",
"options_en": [
{
"option": "शिक क क क क क क क क क क क क क क क क क