[
{
"subject": "Rajasthan History        Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"topic": "",
"question_en": "Which site in Rajasthan is known for its Indus Valley Civilization remains?",
"question_hi": "राजस्थान में प्रमोहन वन कालों का प्रमोहन प्रमोहन कालों के दर्शन की जानकारी: Kalibangan",
"A_en": "Hanumangarh",
"A_hi": "हनुमांगर",
"B_en": "Dholpur",
"B_hi": "ढोलपुर",
"C_en": "Kalibangan",
"C_hi": "कालिबंगन",
"D_en": "Ajmer",
"D_hi": "अजमेर",
"answer": "C",
"explanation_en": "Kalibangan is known for its Indus Valley Civilization remains. The correct answer is Kalibangan (C).",
"explanation_hi": "कालिबंगन सीनेंदर के विभिज्ञता माने के लेनेंदर (C)",
},
{
"subject": "Rajasthan History        Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"topic": "Rajasthan संगौलन के लेनेंदर",
"A_en": "Mussoorie",
"A_hi": "मुसोरी",
"B_en": "Haridwar",
"B_hi": "हिर्द्वार",
"C_en": "Jaipur",
"C_hi": "जयपुर",
"D_en": "Ajmer",
"D_hi": "आजमी",
"answer": "C",
"explanation_en": "Jaipur (C) is known as the historical capital of Rajasthan during the ancient times.",
"explanation_hi": "जयपुर (C) मुखन में आलिंद्रि के गिलेनेंद्रि",
},
{
"subject": "Rajasthan History        Prachin Sabhyatayen: Kalibangan, Ahar, Ganeshar, Balathal aur Bairath",
"topic": "राजस्थान भारति के गैराजनेंद्रि",
"A_en": "Kota",
"A_hi": "कोता",
"B_en": "Chittorgarh",
"B_hi": "चीटोरगार",
"C_en": "Ajmer",
"C_hi": "आजमी",
"D_en": "Jaisamand",
"D_hi": "जयसामंद",
"answer": "C",
"explanation_en": "Ajmer (C) is a historical city in Rajasthan and is associated with Prachin Sabhyatayen (old civilizations) like Kalibangan, Ahar, Ganeshar, Balathal, aur Bairath.",
"explanation_hi": "आजमी (C) राजस्थान मेंट्री को LDC, CET, RAS, RAS (राजस्थान मेंट्री को LDC, CET, RAS, RAS (राजस्थान मेंट्री को LDC, CET, RAS, RAS (राजस्थान मेंट्री को LDC, CET, RAS, RAS (राजस्थान मेंट्री को LDC, CET, RAS, RAS (राजस्थान मेंट्री को LDC, CET, RAS, RAS (राजस्थान मेंट्री को LDC, CET, RAS, RAS (राजस्थान मेंट्री को LDC, CET, RAS, RAS (राजस्थान मेंट्री को LDC, CET, RAS, RAS (राजस्थान मेंट्री को LDC, CET, RAS, RAS (राजस्थान मेंट्री को LDC, CET, RAS, RAS (राजस्थान मेंट्री को LDC, CET, RAS, RAS (राज्री को LDC, CET, RAS, RAS)",
},
{
"subject": "Rajasthan History राज्री को LDC, CET, RAS, RAS (राज्री को LDC, CET, RAS, RAS (राज्री को LDC, CET, RAS, RAS)",
}
]
]