<think>
Okay, I need to create 10 high-quality MCQs for Rajasthan Geography, specifically on the topic provided. The user mentioned topics like LDC, CET, RAS, SSC, and Railway exams, so the difficulty level should be moderate. Let me start by recalling key points about Rajasthan's geography.

First, rivers in Rajasthan. The Luni River is important. It's the largest river in Rajasthan. The options should include other major rivers like Chambal, Mahi, and Sabarmati. The correct answer is Luni.

Next, the highest peak. Mount Abu is the highest peak, part of the Aravalli Range. Other options could be Udaipur, Jodhpur, and Jaipur, but those are cities. So the answer is Mount Abu.

Then, the desert. Thar Desert is the main one in Rajasthan. Options could include other deserts like Kutch, but the answer is Thar.

For the capital, it's Jaipur. The options are other cities like Jodhpur, Udaipur, Bikaner. Jaipur is correct.

Rajasthan's state animal is the chinkara. Other options might include blackbuck, cheetah, and blue bull. Chinkara is right.

The largest district by area is Jaisalmer. Other districts like Jodhpur, Kota, and Banswara are smaller. Jaisalmer is the correct answer.

The longest river in Rajasthan is the Chambal. Wait, earlier I mentioned Luni as the largest, but longest might be Chambal. Need to check. Chambal flows through Rajasthan and Madhya Pradesh. So the answer here is Chambal.

The main source of water is the Brahmani River? Wait, no. Rajasthan's main rivers are from the Aravallis. The Chambal, Banas, and Mahi are important. Maybe the correct answer is Banas? Wait, I need to confirm. The Banas River is a major river in Rajasthan. Alternatively, the Chambal is a key one. Hmm, perhaps the main source is the Chambal. Wait, maybe the correct answer here is Chambal. Let me verify. Chambal is a major river, but the main source of water could be the dams like Bhakra Nangal, but that's in Haryana. Maybe the correct answer is Chambal. Let me think again. The main river in Rajasthan is the Chambal. So answer is Chambal.

Rajasthan's state tree is the khejri. Other options could be banyan, neem, or peepal. Khejri is correct.

The lowest point in Rajasthan is the Chambal River bed, but wait, the lowest elevation is at the point where the Chambal flows into Madhya Pradesh. Alternatively, the lowest point might be the Chambal basin. Alternatively, the lowest point is in the Thar Desert. Wait, I need to check. The lowest point in Rajasthan is the Chambal River's elevation. Alternatively, it might be the point where the Chambal leaves Rajasthan. Let me confirm. The lowest point is in the Chambal River near its exit into MP. So the answer is Chambal River basin.

Wait, for the question about the main source of water, maybe the correct answer is Banas. Let me check again. Banas is a major river in Rajasthan, flowing into the Chambal. The main source could be Banas. Hmm, conflicting information. Maybe the correct answer is Chambal. Alternatively, the main river is Chambal. Let me stick with Chambal for the main source.

Also, for the longest river, Chambal is longer in Rajasthan than Luni. So answer is Chambal.

I need to ensure all answers are accurate. Let me cross-verify each point:

1. Largest river: Luni is the largest by area, but Chambal is the longest. So the question should specify "largest by area" or "longest". The user's first question was about the largest river, which might refer to the longest or the largest by area. The answer depends on that. Since Luni is the longest in Rajasthan, maybe the answer is Luni. Wait, no. Chambal flows through Rajasthan and is longer in length. Need to clarify. Let me check: The Luni River is 495 km long, while the Chambal is 960 km in total, but within Rajasthan, it's about 440 km. Wait, maybe the longest river in Rajasthan is the Chambal. Let me confirm. The Luni is the longest river entirely within Rajasthan, while the Chambal flows through both Rajasthan and Madhya Pradesh. So if the question is about the longest river within Rajasthan, it's Luni. If it's the longest river passing through Rajasthan, it's Chambal. The user's first question is about "largest river", which is ambiguous. But commonly, largest by area would be Luni. However, if the question is about the longest river in Rajasthan, then it's Luni. So I'll proceed with Luni as the answer for the largest river in Rajasthan.

Another point: The main source of water for Rajasthan is the Banas River. Let me check. The Banas is a tributary of the Chambal and is a significant river in Rajasthan. So perhaps the main source is Banas. Alternatively, the Chambal is more prominent. This needs verification. Maybe the correct answer is Chambal. Since I'm not 100% sure, I might need to adjust the question to avoid confusion. Alternatively, the main river is Chambal, so the answer is Chambal.

I think I need to finalize each answer based on standard references. Let's proceed with the initial answers and ensure they are accurate.
</think>

[
  {
    "subject": "Rajasthan Geography",
    "topic": "Rivers of Rajasthan",
    "question_en": "Which river is the longest river in Rajasthan?",
    "question_hi": "राजस्थान की सबसे लंबी नदी कौन सी है?",
    "A_en": "Luni", "A_hi": "लूनी",
    "B_en": "Chambal", "B_hi": "चंबल",
    "C_en": "Mahi", "C_hi": "माही",
    "D_en": "Sabarmati", "D_hi": "साबरमती",
    "answer": "A",
    "explanation_en": "The Luni River is the longest river entirely within Rajasthan.",
    "explanation_hi": "लूनी नदी राजस्थान में पूर्णतः सबसे लंबी नदी है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Mountains and Peaks",
    "question_en": "Which is the highest peak in Rajasthan?",
    "question_hi": "राजस्थान में सबसे ऊंची चोटी कौन सी है?",
    "A_en": "Mount Abu", "A_hi": "माउंट अबू",
    "B_en": "Udaipur", "B_hi": "उदयपुर",
    "C_en": "Jodhpur", "C_hi": "जोधपुर",
    "D_en": "Jaipur", "D_hi": "जयपुर",
    "answer": "A",
    "explanation_en": "Mount Abu is the highest peak in Rajasthan, part of the Aravalli Range.",
    "explanation_hi": "माउंट अबू राजस्थान की सबसे ऊँची चोटी है, जो अरावली पर्वत का हिस्सा है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Deserts and Landforms",
    "question_en": "Which desert is located in Rajasthan?",
    "question_hi": "राजस्थान में कौन सा रेगिस्तान स्थित है?",
    "A_en": "Thar Desert", "A_hi": "थार रेगिस्तान",
    "B_en": "Kutch Desert", "B_hi": "कच्छ रेगिस्तान",
    "C_en": "Sahyadri Desert", "C_hi": "सह्याद्रि रेगिस्तान",
    "D_en": "Cholistan Desert", "D_hi": "चोलिस्तान रेगिस्तान",
    "answer": "A",
    "explanation_en": "The Thar Desert is the main desert in Rajasthan, covering a large portion of the state.",
    "explanation_hi": "थार रेगिस्तान राजस्थान में मुख्य रेगिस्तान है, जो राज्य के बड़े हिस्से को घेरे हुए है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "State Capital",
    "question_en": "What is the capital city of Rajasthan?",
    "question_hi": "राजस्थान की राजधानी शहर कौन सा है?",
    "A_en": "Jodhpur", "A_hi": "जोधपुर",
    "B_en": "Jaipur", "B_hi": "जयपुर",
    "C_en": "Udaipur", "C_hi": "उदयपुर",
    "D_en": "Bikaner", "D_hi": "बीकानेर",
    "answer": "B",
    "explanation_en": "Jaipur is the capital of Rajasthan, known as the 'Pink City'.",
    "explanation_hi": "जयपुर राजस्थान की राजधानी है, जिसे 'गुलाबी नगरी' के नाम से जाना जाता है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "State Animal",
    "question_en": "Which animal is the state animal of Rajasthan?",
    "question_hi": "राजस्थान का राज्य पशु कौन सा है?",
    "A_en": "Chinkara", "A_hi": "चींकारा",
    "B_en": "Blackbuck", "B_hi": "काला मूर्गा",
    "C_en": "Cheetah", "C_hi": "चीता",
    "D_en": "Blue Bull", "D_hi": "नीले गाय",
    "answer": "A",
    "explanation_en": "Chinkara is the state animal of Rajasthan, found in the Thar Desert.",
    "explanation_hi": "चींकारा राजस्थान का राज्य पशु है, जो थार रेगिस्तान में पाया जाता है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Largest District",
    "question_en": "Which district is the largest in Rajasthan by area?",
    "question_hi": "क्षेत्रफल के हिसाब से राजस्थान का सबसे बड़ा जिला कौन सा है?",
    "A_en": "Jaisalmer", "A_hi": "जैसलमेर",
    "B_en": "Jodhpur", "B_hi": "जोधपुर",
    "C_en": "Kota", "C_hi": "कोटा",
    "D_en": "Banswara", "D_hi": "बांसवाड़ा",
    "answer": "A",
    "explanation_en": "Jaisalmer is the largest district in Rajasthan by area.",
    "explanation_hi": "जैसलमेर राजस्थान में क्षेत्रफल के हिसाब से सबसे बड़ा जिला है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Major Rivers",
    "question_en": "Which river is known as the 'Sorrow of Rajasthan'?",
    "question_hi": "राजस्थान का 'शोक नदी' कौन सी नदी कहलाती है?",
    "A_en": "Chambal", "A_hi": "चंबल",
    "B_en": "Banana", "B_hi": "बनाना",
    "C_en": "Luni", "C_hi": "लूनी",
    "D_en": "Narmada", "D_hi": "नर्मदा",
    "answer": "C",
    "explanation_en": "The Luni River is referred to as the 'Sorrow of Rajasthan' due to its frequent floods.",
    "explanation_hi": "लूनी नदी को 'राजस्थान का शोक' कहा जाता है क्योंकि इसकी बाढ़ लगातार होती है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "State Tree",
    "question_en": "What is the state tree of Rajasthan?",
    "question_hi": "राजस्थान का राज्य वृक्ष कौन सा है?",
    "A_en": "Banyan", "A_hi": "बरगद",
    "B_en": "Neem", "B_hi": "नीम",
    "C_en": "Khejri", "C_hi": "खजूरी",
    "D_en": "Peepal", "D_hi": "पीपल",
    "answer": "C",
    "explanation_en": "The khejri tree is the state tree of Rajasthan, symbolizing resilience in arid conditions.",
    "explanation_hi": "खजूरी वृक्ष राजस्थान का राज्य वृक्ष है, जो शुष्क स्थितियों में टिकाऊपन का प्रतीक है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Lowest Point",
    "question_en": "Where is the lowest point in Rajasthan located?",
    "question_hi": "राजस्थान में सबसे नीचे का बिंदु कहाँ स्थित है?",
    "A_en": "Chambal River Basin", "A_hi": "चंबल नदी के मैदान",
    "B_en": "Thar Desert", "B_hi": "थार रेगिस्तान",
    "C_en": "Mount Abu", "C_hi": "माउंट अबू",
    "D_en": "Jaipur", "D_hi": "जयपुर",
    "answer": "A",
    "explanation_en": "The lowest point in Rajasthan is located in the Chambal River basin.",
    "explanation_hi": "राजस्थान में सबसे नीचा बिंदु चंबल नदी के मैदान में स्थित है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Major Landmarks",
    "question_en": "Which fort is the largest in Rajasthan?",
    "question_hi": "राजस्थान में सबसे बड़ा किला कौन सा है?",
    "A_en": "Chittorgarh Fort", "A_hi": "चित्तौड़गढ़ किला",
    "B_en": "Amber Fort", "B_hi": "अंबर किला",
    "C_en": "Gangaur Fort", "C_hi": "गंगौर किला",
    "D_en": "Jaisalmer Fort", "D_hi": "जैसलमेर किला",
    "answer": "A",
    "explanation_en": "Chittorgarh Fort is the largest fort in Rajasthan and a UNESCO World Heritage Site.",
    "explanation_hi": "चित्तौड़गढ़ किला राजस्थान में सबसे बड़ा किला है और यूनेस्को विश्व धरोहर स्थल है।"
  }
]