<think>
Okay, let's tackle this. The user wants 10 high-quality MCQs on Rajasthan Geography for exams like LDC, CET, RAS, SSC, and Railway NTPC. The questions need to be in both Hindi and English, following a specific JSON structure. First, I need to identify key topics within Rajasthan Geography. Major areas could include physical geography, rivers, historical sites, climate, wildlife sanctuaries, etc.

Starting with physical features, maybe the Thar Desert is a good topic. Then rivers like Chambal, Luni, and Mahi. Historical places like Chittorgarh Fort. Wildlife sanctuaries such as Ranthambore and Sariska. Capital cities of districts, like Ajmer or Kota. Minerals in Rajasthan—maybe marble from Makrana. Soils like Bhangar. Traditional art forms, like Kishangarh miniature paintings. Also, important dams like Chambal Dam.

For each question, I need to ensure the options are plausible but distinct. For example, when asking about the longest river, options could be Chambal, Luni, Mahi, and Sabarmati. The answer would be Chambal. For the marble source, Makrana is correct. Then, the traditional dance—Ghoomar is specific to Rajasthan. Checking facts for accuracy is crucial. Also, explanations need to be concise but informative. Make sure the difficulty level is appropriate for the exams mentioned. Avoid very obscure facts but include some that test specific knowledge. Let me structure each question step by step, ensuring Hindi and English versions are correctly translated and the answers are accurate. Double-checking each fact with reliable sources to avoid errors.
</think>

[
  {
    "subject": "Rajasthan Geography",
    "topic": "Rivers and Drainage",
    "question_en": "Which river is known as the 'Lifeline of Rajasthan'?",
    "question_hi": "राजस्थान की नदियों में से किसे 'राजस्थान की जीवन रेखा' के रूप में जाना जाता है?",
    "A_en": "Chambal",
    "A_hi": "चंबल",
    "B_en": "Luni",
    "B_hi": "लूनी",
    "C_en": "Mahi",
    "C_hi": "माही",
    "D_en": "Sabarmati",
    "D_hi": "साबरमती",
    "answer": "A",
    "explanation_en": "Chambal is considered the lifeline of Rajasthan as it provides water for irrigation and supports agriculture in the region.",
    "explanation_hi": "चंबल को राजस्थान की जीवन रेखा माना जाता है क्योंकि यह पानी की आपूर्ति करता है जिससे कृषि का समर्थन होता है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Physical Features",
    "question_en": "Which desert is the major geographical feature of Rajasthan?",
    "question_hi": "राजस्थान का मुख्य भौगोलिक विशेषता कौन-सा रेगिस्तान है?",
    "A_en": "Thar Desert",
    "A_hi": "थार का रेगिस्तान",
    "B_en": "Kutch Desert",
    "B_hi": "कच्छ का रेगिस्तान",
    "C_en": "Sahyadri Desert",
    "C_hi": "सह्याद्रि रेगिस्तान",
    "D_en": "Deccan Desert",
    "D_hi": "दक्कन का रेगिस्तान",
    "answer": "A",
    "explanation_en": "Thar Desert covers a large portion of western Rajasthan and is a defining geographical feature of the state.",
    "explanation_hi": "थार का रेगिस्तान पश्चिमी राजस्थान का मुख्य भौगोलिक विशेषता है और राज्य का बड़ा हिस्सा घेरता है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Wildlife Sanctuaries",
    "question_en": "Which wildlife sanctuary is famous for tiger conservation in Rajasthan?",
    "question_hi": "राजस्थान में हाथी के संरक्षण के लिए कौन-सा वन्यजीव अभयारण्य प्रसिद्ध है?",
    "A_en": "Ranthambore National Park",
    "A_hi": "रणथंभौर राष्ट्रीय उद्यान",
    "B_en": "Sariska Tiger Reserve",
    "B_hi": "सारिस्का हाथी अभयारण्य",
    "C_en": "Keoladeo National Park",
    "C_hi": "केवलादेव राष्ट्रीय उद्यान",
    "D_en": "Mohan Sanctuary",
    "D_hi": "मोहन अभयारण्य",
    "answer": "A",
    "explanation_en": "Ranthambore National Park is renowned for its tiger conservation efforts and is a major wildlife sanctuary in Rajasthan.",
    "explanation_hi": "रणथंभौर राष्ट्रीय उद्यान हाथी के संरक्षण के लिए प्रसिद्ध है और राजस्थान में एक प्रमुख वन्यजीव अभयारण्य है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Cultural Geography",
    "question_en": "Which traditional dance is associated with the Kalbeliya community of Rajasthan?",
    "question_hi": "राजस्थान के कलबेलिया समुदाय के संगत लोक नृत्य कौन-सा है?",
    "A_en": "Ghoomar",
    "A_hi": "घूमर",
    "B_en": "Kathak",
    "B_hi": "कथक",
    "C_en": "Kalbeliya",
    "C_hi": "कलबेलिया",
    "D_en": "Bhangra",
    "D_hi": "भंगड़ा",
    "answer": "C",
    "explanation_en": "Kalbeliya is a traditional dance form performed by the Kalbeliya community, known for its association with snake charming and folk culture.",
    "explanation_hi": "कलबेलिया राजस्थान के कलबेलिया समुदाय के पारंपरिक नृत्य रूप है जो सांप बजाने और लोक संस्कृति के साथ जुड़ा हुआ है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Historical Geography",
    "question_en": "Which hill station in Rajasthan is known as the 'Queen of the Aravallis'?",
    "question_hi": "राजस्थान के किस पहाड़ी स्टेशन को 'अरावली की रानी' के रूप में जाना जाता है?",
    "A_en": "Mount Abu",
    "A_hi": "माउंट आबू",
    "B_en": "Udaipur",
    "B_hi": "उदयपुर",
    "C_en": "Jaipur",
    "C_hi": "जयपुर",
    "D_en": "Bharatpur",
    "D_hi": "भरतपुर",
    "answer": "A",
    "explanation_en": "Mount Abu is the only hill station in Rajasthan and is often referred to as the 'Queen of the Aravallis'.",
    "explanation_hi": "माउंट आबू राजस्थान का एकमात्र पहाड़ी स्टेशन है और इसे 'अरावली की रानी' कहा जाता है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Economic Geography",
    "question_en": "Which district of Rajasthan is known for marble exports?",
    "question_hi": "राजस्थान के कौन-से जिले में संगमृद्धि के निर्यात के लिए प्रसिद्ध है?",
    "A_en": "Makrana",
    "A_hi": "मकराना",
    "B_en": "Udaipur",
    "B_hi": "उदयपुर",
    "C_en": "Jodhpur",
    "C_hi": "जोधपुर",
    "D_en": "Kota",
    "D_hi": "कोटा",
    "answer": "A",
    "explanation_en": "Makrana in Nagaur district is famous for exporting high-quality marble, including white marble used in the Taj Mahal.",
    "explanation_hi": "मकराना राजस्थान के नागौर जिले में स्थित है और इसे टैजमहल में उपयोग होने वाली संगमृद्धि के निर्यात के लिए प्रसिद्ध बनाता है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Climate",
    "question_en": "Which part of Rajasthan receives the highest annual rainfall?",
    "question_hi": "राजस्थान के किस भाग में सबसे अधिक वार्षिक वर्षा होती है?",
    "A_en": "Mount Abu",
    "A_hi": "माउंट आबू",
    "B_en": "Bikaner",
    "B_hi": "बीकानेर",
    "C_en": "Churu",
    "C_hi": "चूरू",
    "D_en": "Jaisalmer",
    "D_hi": "जैसलमेर",
    "answer": "A",
    "explanation_en": "Mount Abu, being a hill station, receives the highest rainfall in Rajasthan due to its elevation and monsoon patterns.",
    "explanation_hi": "माउंट आबू एक पहाड़ी स्टेशन है और राजस्थान में वार्षिक वर्षा के आधार पर यह सबसे अधिक वर्षा वाला क्षेत्र है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Tourism",
    "question_en": "Which fort in Rajasthan is a UNESCO World Heritage Site?",
    "question_hi": "राजस्थान में कौन-सा प्राचीन किला यूनेस्को विश्व धरोहर स्थल है?",
    "A_en": "Chittorgarh Fort",
    "A_hi": "चित्तौड़गढ़ किला",
    "B_en": "Amber Fort",
    "B_hi": "अम्बर किला",
    "C_en": "Gwalior Fort",
    "C_hi": "ग्वालियर किला",
    "D_en": "Jaisalmer Fort",
    "D_hi": "जैसलमेर किला",
    "answer": "A",
    "explanation_en": "Chittorgarh Fort is a UNESCO World Heritage Site and symbolizes the rich history and architectural grandeur of Rajasthan.",
    "explanation_hi": "चित्तौड़गढ़ किला यूनेस्को विश्व धरोहर स्थल है और राजस्थान के ऐतिहासिक और सांस्कृतिक महत्व को दर्शाता है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Geography of Districts",
    "question_en": "Which district is known as the 'Land of Lakes' in Rajasthan?",
    "question_hi": "राजस्थान में कौन-से जिले को 'झीलों की भूमि' के रूप में जाना जाता है?",
    "A_en": "Bharatpur",
    "A_hi": "भरतपुर",
    "B_en": "Jodhpur",
    "B_hi": "जोधपुर",
    "C_en": "Kota",
    "C_hi": "कोटा",
    "D_en": "Udaipur",
    "D_hi": "उदयपुर",
    "answer": "A",
    "explanation_en": "Bharatpur is known as the 'Land of Lakes' due to its numerous natural and artificial lakes, including the famous Keoladeo National Park.",
    "explanation_hi": "भरतपुर 'झीलों की भूमि' के रूप में जाना जाता है क्योंकि इसमें कई प्राकृतिक और कृत्रिम झीलें हैं, जिनमें केवलादेव राष्ट्रीय उद्यान प्रमुख है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Flora and Fauna",
    "question_en": "Which tree is the state tree of Rajasthan?",
    "question_hi": "राजस्थान का राज्य वृक्ष कौन-सा है?",
    "A_en": "Neem",
    "A_hi": "नीम",
    "B_en": "Banyan",
    "B_hi": "बरगद",
    "C_en": "Khejri",
    "C_hi": "खेजड़ी",
    "D_en": "Peepal",
    "D_hi": "पीपल",
    "answer": "C",
    "explanation_en": "Khejri is the state tree of Rajasthan and is well-adapted to the arid climate of the region.",
    "explanation_hi": "खेजड़ी राजस्थान का राज्य वृक्ष है और इसका अरिद क्लाइमेट में लचीलापन राज्य के जलवायु विशेषताओं में महत्वपूर्ण भूमिका है।"
  }
]