<think>
Okay, I need to create 10 high-quality MCQs for Rajasthan Geography, covering topics relevant to exams like Rajasthan State Exams, SSC, and Railway. Let's start by brainstorming topics within Rajasthan Geography. The user mentioned the subject but didn't specify a topic, so I should cover various aspects like physical geography, rivers, climate, important cities, historical places, etc.

First, I'll list some key areas: 
1. Administrative divisions (like districts, regions)
2. Major rivers and their tributaries (Chambal, Luni, Mahi)
3. Important historical sites and cities (e.g., Ajmer, Jodhpur)
4. Climate and physiography (desert areas, Thar Desert)
5. Agriculture and natural resources
6. Wildlife sanctuaries and national parks
7. Famous festivals or cultural aspects
8. Important lakes (like Pichola, Dal)
9. Geographical landmarks (Mount Abu, Aravalli Range)
10. Historical places (Chittorgarh Fort, Mehrangarh Fort)

Now, I need to ensure each question is in both Hindi and English, with options in both languages. The answers should be accurate, and explanations should be concise. Let me start drafting the first question. 

For example, a question about the capital of Rajasthan. The options would be Jaipur, Jodhpur, Udaipur, Bikaner. Answer is Jaipur. That's straightforward.

Next, maybe a question on rivers. Which river flows through Rajasthan? Chambal, Luni, Mahi, Narmada. Chambal is a major river in Rajasthan, so that's a good option.

Another question could be about the highest peak in Rajasthan. The Aravalli Range has Guru Shikhar, which is the highest peak. So options could include Guru Shikhar, Mount Abu, etc.

I need to ensure that the difficulty is set according to Rajasthan exams, so some questions might require specific knowledge of the state's geography. For example, asking about the state's position in India—eastern or western. Rajasthan is in the western part.

Another question could be about the largest district in Rajasthan. Jaisalmer is the largest by area.

For the desert area, Thar Desert is located in the northwest of Rajasthan. So a question asking which region is the Thar Desert located in.

Agriculture-related question: which district is known as the "Wheat Granary of Rajasthan"? Alwar is known for wheat production.

Wildlife sanctuaries: Keoladeo National Park is in Bharatpur, so a question about that.

Cultural aspect: Which city is known as the "City of Lakes"? Udaipur has several lakes.

I need to check each answer for accuracy. Let me verify each fact:

1. Capital is Jaipur. Correct.
2. Chambal flows through Rajasthan. Correct.
3. Guru Shikhar is the highest peak. Correct.
4. Thar Desert is in the northwest. Correct.
5. Jaisalmer is the largest district. Correct.
6. Alwar is the wheat granary. Correct.
7. Bharatpur has Keoladeo. Correct.
8. Mount Abu is the only hill station. Correct.
9. Udaipur is the City of Lakes. Correct.
10. Rajasthan is in the western part. Correct.

Now, translating all these into Hindi, ensuring the options are correctly translated. Also, explanations in both languages. Let me structure each question in JSON format as per the example. Make sure the answer options are shuffled but the correct one is accurate. Each question must have the subject, topic (left blank as per example), question in both languages, options, answer, and explanations. Finally, validate the JSON structure to avoid errors.
</think>

[
{
"subject": "Rajasthan Geography",
"topic": "",
"question_en": "Which of the following is the capital of Rajasthan?",
"question_hi": "राजस्थान की राजधानी निम्नलिखित में से कौन-सी है?",
"A_en": "Jodhpur", "A_hi": "जोधपुर",
"B_en": "Jaipur", "B_hi": "जयपुर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Bikaner", "D_hi": "बीकानेर",
"answer": "B",
"explanation_en": "Jaipur is the capital of Rajasthan, established in the 18th century by Maharaja Sawai Jai Singh II.",
"explanation_hi": "जयपुर राजस्थान की राजधानी है, जिसकी स्थापना 18वीं शताब्दी में महाराजा सवाई जय सिंह द्वितीय द्वारा की गई थी।"
},
{
"subject": "Rajasthan Geography",
"topic": "",
"question_en": "Which river is known as the 'Lifeline of Rajasthan'?",
"question_hi": "राजस्थान की कौन-सी नदी 'राजस्थान की नाभि' के रूप में जानी जाती है?",
"A_en": "Chambal", "A_hi": "चम्बल",
"B_en": "Luni", "B_hi": "लूनी",
"C_en": "Mahi", "C_hi": "माही",
"D_en": "Sabarmati", "D_hi": "साबरमती",
"answer": "A",
"explanation_en": "Chambal is often referred to as the lifeline of Rajasthan due to its significant role in irrigation and power generation.",
"explanation_hi": "चम्बल को आमतौर पर राजस्थान की नाभि के रूप में जाना जाता है क्योंकि इसकी भूमिका सिंचाई और बिजली उत्पादन में महत्वपूर्ण है।"
},
{
"subject": "Rajasthan Geography",
"topic": "",
"question_en": "Which of the following is the highest peak in the Aravalli Range in Rajasthan?",
"question_hi": "राजस्थान में अरावली पर्वत के निम्नलिखित में से कौन-सा शीर्ष सबसे ऊँचा है?",
"A_en": "Mount Abu", "A_hi": "माउंट आबू",
"B_en": "Tataki Hill", "B_hi": "तातकी हिल",
"C_en": "Guru Shikhar", "C_hi": "गुरु शिखर",
"D_en": "Dudhiya Hill", "D_hi": "दुदिया हिल",
"answer": "C",
"explanation_en": "Guru Shikhar is the highest peak in the Aravalli Range, located in Mount Abu, with an elevation of 1,722 meters.",
"explanation_hi": "गुरु शिखर अरावली पर्वत श्रेणी की सबसे ऊँची चोटी है, जो माउंट आबू में स्थित है और इसकी ऊँचाई 1,722 मीटर है।"
},
{
"subject": "Rajasthan Geography",
"topic": "",
"question_en": "Which district of Rajasthan is known as the 'Land of the Thar Desert'?",
"question_hi": "राजस्थान के किस जिले को 'थार मरूभूमि की भूमि' के रूप में जाना जाता है?",
"A_en": "Jaisalmer", "A_hi": "जैसलमेर",
"B_en": "Barmer", "B_hi": "बाड़मेर",
"C_en": "Bikaner", "C_hi": "बीकानेर",
"D_en": "All of the above", "D_hi": "ऊपर के सभी",
"answer": "D",
"explanation_en": "The Thar Desert covers parts of Jaisalmer, Barmer, and Bikaner districts in Rajasthan.",
"explanation_hi": "थार मरूभूमि राजस्थान में जैसलमेर, बाड़मेर और बीकानेर जिलों के हिस्सों में फैली हुई है।"
},
{
"subject": "Rajasthan Geography",
"topic": "",
"question_en": "Which of the following is the largest district in Rajasthan by area?",
"question_hi": "राजस्थान में निम्नलिखित में से कौन-सा जिला क्षेत्रफल के अनुसार सबसे बड़ा है?",
"A_en": "Jaisalmer", "A_hi": "जैसलमेर",
"B_en": "Kota", "B_hi": "कोटा",
"C_en": "Churu", "C_hi": "चूरू",
"D_en": "Banswara", "D_hi": "बांसवाड़ा",
"answer": "A",
"explanation_en": "Jaisalmer is the largest district in Rajasthan by area, covering approximately 38,454 square kilometers.",
"explanation_hi": "जैसलमेर राजस्थान में क्षेत्रफल के अनुसार सबसे बड़ा जिला है, जो लगभग 38,454 वर्ग किलोमीटर क्षेत्र को कवर करता है।"
},
{
"subject": "Rajasthan Geography",
"topic": "",
"question_en": "Which of the following districts is known as the 'Wheat Granary of Rajasthan'?",
"question_hi": "राजस्थान के निम्नलिखित में से किस जिले को 'गेहूं का भंडार' के रूप में जाना जाता है?",
"A_en": "Alwar", "A_hi": "अलवर",
"B_en": "Kota", "B_hi": "कोटा",
"C_en": "Ajmer", "C_hi": "अजमेर",
"D_en": "Bundi", "D_hi": "बूंदी",
"answer": "A",
"explanation_en": "Alwar is known as the 'Wheat Granary of Rajasthan' due to its high wheat production.",
"explanation_hi": "अलवर को 'गेहूं का भंडार' के रूप में जाना जाता है क्योंकि इसके गेहूं उत्पादन में उच्चता है।"
},
{
"subject": "Rajasthan Geography",
"topic": "",
"question_en": "Which of the following is the only hill station in Rajasthan?",
"question_hi": "राजस्थान में निम्नलिखित में से कौन-सा एकमात्र पहाड़ी स्टेशन है?",
"A_en": "Mount Abu", "A_hi": "माउंट आबू",
"B_en": "Udaipur", "B_hi": "उदयपुर",
"C_en": "Chittorgarh", "C_hi": "चित्तौड़गढ़",
"D_en": "Jodhpur", "D_hi": "जोधपुर",
"answer": "A",
"explanation_en": "Mount Abu is the only hill station in Rajasthan, located in the Aravalli Range.",
"explanation_hi": "माउंट आबू राजस्थान में एकमात्र पहाड़ी स्टेशन है, जो अरावली पर्वत श्रेणी में स्थित है।"
},
{
"subject": "Rajasthan Geography",
"topic": "",
"question_en": "Which of the following cities is known as the 'City of Lakes'?",
"question_hi": "निम्नलिखित में से किस शहर को 'झीलों का शहर' के रूप में जाना जाता है?",
"A_en": "Udaipur", "A_hi": "उदयपुर",
"B_en": "Jaipur", "B_hi": "जयपुर",
"C_en": "Kota", "C_hi": "कोटा",
"D_en": "Ajmer", "D_hi": "अजमेर",
"answer": "A",
"explanation_en": "Udaipur is known for its numerous lakes, including Lake Pichola and Fateh Sagar.",
"explanation_hi": "उदयपुर अपनी झीलों के लिए प्रसिद्ध है, जिनमें झील पिचोला और फतेह सागर शामिल हैं।"
},
{
"subject": "Rajasthan Geography",
"topic": "",
"question_en": "Which of the following is the longest canal in Rajasthan?",
"question_hi": "राजस्थान में निम्नलिखित में से कौन-सा नहर सबसे लंबा है?",
"A_en": "Choudhary Canal", "A_hi": "चौधरी नहर",
"B_en": "Banswara Canal", "B_hi": "बांसवाड़ा नहर",
"C_en": "Rajasthan Canal", "C_hi": "राजस्थान नहर",
"D_en": "Suratgarh Canal", "D_hi": "सुरतगढ़ नहर",
"answer": "A",
"explanation_en": "The Choudhary Canal is the longest canal in Rajasthan, stretching over 216 kilometers.",
"explanation_hi": "चौधरी नहर राजस्थान में सबसे लंबी नहर है, जो 216 किलोमीटर तक फैली हुई है।"
},
{
"subject": "Rajasthan Geography",
"topic": "",
"question_en": "Which of the following is the largest wildlife sanctuary in Rajasthan?",
"question_hi": "राजस्थान में निम्नलिखित में से कौन-सा जीव-जंतु अभयारण्य सबसे बड़ा है?",
"A_en": "Kailana Lake Sanctuary", "A_hi": "कैलाणा झील अभयारण्य",
"B_en": "Sariska National Park", "B_hi": "सरिस्का राष्ट्रीय उद्यान",
"C_en": "Ranthambore National Park", "C_hi": "रणथंबोर राष्ट्रीय उद्यान",
"D_en": "Keoladeo National Park", "D_hi": "केओलादेव राष्ट्रीय उद्यान",
"answer": "A",
"explanation_en": "Kailana Lake Sanctuary is the largest wildlife sanctuary in Rajasthan, covering an area of 190 square kilometers.",
"explanation_hi": "कैलाणा झील अभयारण्य राजस्थान में सबसे बड़ा जीव-जंतु अभयारण्य है, जो 190 वर्ग किलोमीटर क्षेत्र को कवर करता है।"
}
]