[
  {
    "subject": "Rajasthan Geography",
    "topic": "Mitti ke Prakar (Soil Types) aur Krishi Yogayata",
    "question_en": "Which type of soil is most common in the Thar Desert region of Rajasthan?",
    "question_hi": "राजस्थान के थार रेगिस्तान क्षेत्र में सबसे अधिक पाया जाने वाला मिट्टी का प्रकार कौन सा है?",
    "A_en": "Sandy soil", "A_hi": "रेतीली मिट्टी",
    "B_en": "Black soil", "B_hi": "काली मिट्टी",
    "C_en": "Alluvial soil", "C_hi": "कुंवर मिट्टी",
    "D_en": "Laterite soil", "D_hi": "लाल मिट्टी",
    "answer": "A",
    "explanation_en": "The Thar Desert has predominantly sandy soils due to high sand content and low organic matter.",
    "explanation_hi": "थार रेगिस्तान में मिट्टी का प्रमुख हिस्सा रेतीली मिट्टी है क्योंकि इसमें रेत की मात्रा अधिक और जैविक पदार्थ कम होता है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Mitti ke Prakar (Soil Types) aur Krishi Yogayata",
    "question_en": "Black soil, also known as Regur, is highly suitable for cultivating which major cash crop in Rajasthan?",
    "question_hi": "काली मिट्टी, जिसे रेगुर भी कहा जाता है, राजस्थान में किस प्रमुख नकदी फसल के लिए अत्यधिक उपयुक्त है?",
    "A_en": "Wheat", "A_hi": "गेहूं",
    "B_en": "Cotton", "B_hi": "सूती",
    "C_en": "Rice", "C_hi": "चावल",
    "D_en": "Maize", "D_hi": "मक्का",
    "answer": "B",
    "explanation_en": "Black soil retains moisture and has high clay content, making it ideal for cotton cultivation.",
    "explanation_hi": "काली मिट्टी नमी को बनाए रखती है और इसमें चूना तथा मिट्टी की मात्रा अधिक होती है, इसलिए सूती के लिए यह सबसे उपयुक्त है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Mitti ke Prakar (Soil Types) aur Krishi Yogayata",
    "question_en": "Which soil type in Rajasthan is known for its high loam content and is considered the most fertile?",
    "question_hi": "राजस्थान में किस मिट्टी का प्रकार उच्च लम मिट्टी के कारण सबसे उपजाऊ माना जाता है?",
    "A_en": "Laterite soil", "A_hi": "लाल मिट्टी",
    "B_en": "Alluvial soil", "B_hi": "कुंवर मिट्टी",
    "C_en": "Sandy soil", "C_hi": "रेतीली मिट्टी",
    "D_en": "Saline soil", "D_hi": "नमकीन मिट्टी",
    "answer": "B",
    "explanation_en": "Alluvial soils, formed by river deposits, contain rich loam and nutrients, making them highly fertile.",
    "explanation_hi": "कुंवर मिट्टी, जो नदियों के तलछट से बनती है, उसमें लम और पोषक तत्व प्रचुर मात्रा में होते हैं, अतः यह सबसे उपजाऊ है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Mitti ke Prakar (Soil Types) aur Krishi Yogayata",
    "question_en": "The reddish color and high iron content of a soil type is characteristic of which soil found in Rajasthan?",
    "question_hi": "लाल रंग और उच्च लोहे के कारण किस मिट्टी का प्रकार राजस्थान में पाया जाता है?",
    "A_en": "Sandy soil", "A_hi": "रेतीली मिट्टी",
    "B_en": "Red soil", "B_hi": "लाल मिट्टी",
    "C_en": "Black soil", "C_hi": "काली मिट्टी",
    "D_en": "Alluvial soil", "D_hi": "कुंवर मिट्टी",
    "answer": "B",
    "explanation_en": "Red soils are rich in iron oxides, giving them a distinct reddish hue and are common in semi-arid regions of Rajasthan.",
    "explanation_hi": "लाल मिट्टी में लोहे के ऑक्साइड की मात्रा अधिक होती है, जिससे उसका रंग लाल हो जाता है और यह राजस्थान के अर्ध-शुष्क क्षेत्र में आम है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Mitti ke Prakar (Soil Types) aur Krishi Yogayata",
    "question_en": "Which soil type in Rajasthan is prone to salinity and often requires gypsum or lime for improvement?",
    "question_hi": "राजस्थान में कौन सी मिट्टी नमकीनता की ओर झुकाव रखती है और सुधार के लिए जिप्सम या लाइम की आवश्यकता होती है?",
    "A_en": "Laterite soil", "A_hi": "लाल मिट्टी",
    "B_en": "Black soil", "B_hi": "काली मिट्टी",
    "C_en": "Saline soil", "C_hi": "नमकीन मिट्टी",
    "D_en": "Alluvial soil", "D_hi": "कुंवर मिट्टी",
    "answer": "C",
    "explanation_en": "Saline soils contain high salt content; gypsum or lime helps leach salts and improve fertility.",
    "explanation_hi": "नमकीन मिट्टी में नमक की मात्रा अधिक होती है; जिप्सम या लाइम के उपयोग से नमक को धोया जा सकता है और उर्वरता बढ़ाई जा सकती है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Mitti ke Prakar (Soil Types) aur Krishi Yogayata",
    "question_en": "Lateritic soils in Rajasthan are primarily found in which geographical region?",
    "question_hi": "राजस्थान में लाल मिट्टी (लैटराइट) मुख्यतः किस भूगोलिक क्षेत्र में पाई जाती है?",
    "A_en": "Thar Desert", "A_hi": "थार रेगिस्तान",
    "B_en": "Aravalli Range", "B_hi": "अरावली पर्वत",
    "C_en": "Sundarban", "C_hi": "सुनदरबन",
    "D_en": "Ganga Valley", "D_hi": "गंगा घाटी",
    "answer": "B",
    "explanation_en": "Lateritic soils develop in hilly terrains like the Aravalli Range where iron and aluminium are leached out.",
    "explanation_hi": "लाल मिट्टी पहाड़ी इलाकों में बनती है, जैसे कि अरावली पर्वत, जहाँ से लोहे और एल्युमिनियम की परतें निकल जाती हैं।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Mitti ke Prakar (Soil Types) aur Krishi Yogayata",
    "question_en": "Which crop is not suitable for sandy soils typical of Rajasthan due to poor water retention?",
    "question_hi": "कौन सी फसल रेत वाली मिट्टी के लिए उपयुक्त नहीं है, जिसके कारण पानी को अच्छी तरह से बनाए नहीं रख पाती?",
    "A_en": "Pulses", "A_hi": "दालें",
    "B_en": "Millets", "B_hi": "जौ",
    "C_en": "Paddy (Rice)", "C_hi": "चावल",
    "D_en": "Barley", "D_hi": "जौ",
    "answer": "C",
    "explanation_en": "Rice requires continuous water; sandy soils drain quickly and cannot sustain paddy cultivation.",
    "explanation_hi": "चावल को निरंतर पानी की आवश्यकता होती है, जबकि रेतीली मिट्टी जल्दी सूख जाती है, इसलिए यह उपयुक्त नहीं है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Mitti ke Prakar (Soil Types) aur Krishi Yogayata",
    "question_en": "Alluvial soils in Rajasthan are most productive for which of the following crops?",
    "question_hi": "राजस्थान में कुंवर मिट्टी किस फसल के लिए सबसे अधिक उपजाऊ है?",
    "A_en": "Sugarcane", "A_hi": "गन्ना",
    "B_en": "Cotton", "B_hi": "सूती",
    "C_en": "Wheat", "C_hi": "गेहूं",
    "D_en": "Potato", "D_hi": "आलू",
    "answer": "A",
    "explanation_en": "Alluvial soils are rich in nutrients and support high-yield crops like sugarcane.",
    "explanation_hi": "कुंवर मिट्टी पोषक तत्वों से भरपूर होती है और गन्ने जैसी ऊँची उपज वाली फसलों के लिए उपयुक्त है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Mitti ke Prakar (Soil Types) aur Krishi Yogayata",
    "question_en": "Which soil type in Rajasthan has low fertility and requires frequent application of organic fertilizers?",
    "question_hi": "राजस्थान में कौन सी मिट्टी कम उर्वरता वाली है और उसे अक्सर जैविक उर्वरक देने की आवश्यकता होती है?",
    "A_en": "Laterite soil", "A_hi": "लाल मिट्टी",
    "B_en": "Black soil", "B_hi": "काली मिट्टी",
    "C_en": "Sandy soil", "C_hi": "रेतीली मिट्टी",
    "D_en": "Alluvial soil", "D_hi": "कुंवर मिट्टी",
    "answer": "C",
    "explanation_en": "Sandy soils have low organic matter and nutrient retention, making them less fertile.",
    "explanation_hi": "रेतीली मिट्टी में जैविक पदार्थ और पोषक तत्व कम होते हैं, इसलिए इसे अधिक उर्वरक की आवश्यकता होती है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Mitti ke Prakar (Soil Types) aur Krishi Yogayata",
    "question_en": "Which crop is predominantly grown on black soil in Rajasthan due to its high clay content?",
    "question_hi": "काली मिट्टी में उच्च चिकनी मात्रा के कारण राजस्थान में किस फसल को प्रमुखता से उगाया जाता है?",
    "A_en": "Maize", "A_hi": "मक्का",
    "B_en": "Cotton", "B_hi": "सूती",
    "C_en": "Rice", "C_hi": "चावल",
    "D_en": "Potato", "D_hi": "आलू",
    "answer": "B",
    "explanation_en": "Black soil's high clay content retains moisture and nutrients, ideal for cotton growth.",
    "explanation_hi": "काली मिट्टी में चिकनी की मात्रा अधिक होने से नमी और पोषक तत्व बने रहते हैं, जो सूती के लिए उपयुक्त है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Mitti ke Prakar (Soil Types) aur Krishi Yogayata",
    "question_en": "Which of the following soils is most suitable for growing millet varieties in Rajasthan?",
    "question_hi": "राजस्थान में जौ जैसी जौ की फसलों के लिए कौन सी मिट्टी सबसे उपयुक्त है?",
    "A_en": "Alluvial soil", "A_hi": "कुंवर मिट्टी",
    "B_en": "Laterite soil", "B_hi": "लाल मिट्टी",
    "C_en": "Sandy soil", "C_hi": "रेतीली मिट्टी",
    "D_en": "Black soil", "D_hi": "काली मिट्टी",
    "answer": "C",
    "explanation_en": "Millets thrive in well-drained sandy soils which prevent waterlogging and support drought tolerance.",
    "explanation_hi": "जौ अच्छी जल निकासी वाली रेतीली मिट्टी में पनपते हैं, जिससे जलभराव से बचाव होता है और सूखा सहनशीलता बढ़ती है।"
  }
]