[
{
"subject": "Rajasthan Geography",
"topic": "Thar Marusthal: Visheshatayen aur Vikas",
"question_en": "Kya Thar Marusthal Rajasthan ke liye khaas mahatva daata hai?",
"question_hi": "थार मरुस्थल राजस्थान के लिए क्या विशेष महत्व रखता है?",
"A_en": "Haan, yeh Rajasthan ke liye prakritik samsadhan ka ek mukhya srot hai.",
"A_hi": "हाँ, यह राजस्थान के लिए प्राकृतिक संसाधन का एक मुख्य स्रोत है।",
"B_en": "Nahin, yeh Rajasthan ke liye koi mahatva nahin rakhta.",
"B_hi": "नहीं, यह राजस्थान के लिए कोई महत्व नहीं रखता।",
"C_en": "Iske alawa, yeh Rajasthan ke liye koi anya sambandh nahin hain.",
"C_hi": "इसके अलावा, यह राजस्थान के लिए कोई अन्य संबंध नहीं है।",
"D_en": "Thar Marusthal Rajasthan ke liye sirf ek parvaton ka sthal hai.",
"D_hi": "थार मरुस्थल राजस्थान के लिए सिर्फ एक पर्वतों का स्थल है।",
"answer": "A",
"explanation_en": "Thar Marusthal Rajasthan ke liye ek mahatvapoorna prakritik samsadhan ka srot hai, jisse kheti, pashupalan adi kiye jate hain.",
"explanation_hi": "थार मरुस्थल राजस्थान के लिए एक महत्वपूर्ण प्राकृतिक संसाधन का स्रोत है, जिससे खेती, पशुपालन आदि किए जाते हैं।"
},
{
"subject": "Rajasthan Geography",
"topic": "Thar Marusthal: Visheshatayen aur Vikas",
"question_en": "Kya Thar Marusthal ko kisi anya naam se bhi jaana jaata hai?",
"question_hi": "थार मरुस्थल को किसी अन्य नाम से भी जाना जाता है?",
"A_en": "Haan, yeh Rajasthan ka Cholistan Marusthal bhi kaha jaata hai.",
"A_hi": "हाँ, यह राजस्थान का चोलिस्तान मरुस्थल भी कहा जाता है।",
"B_en": "Nahin, yeh Rajasthan ka sirf ek hi Marusthal hai.",
"B_hi": "नहीं, यह राजस्थान का सिर्फ एक ही मरुस्थल है।",
"C_en": "Iske alawa, yeh Rajasthan ka anya koi naam nahin hai.",
"C_hi": "इसके अलावा, यह राजस्थान का अन्य कोई नाम नहीं है।",
"D_en": "Thar Marusthal ko Rajasthan ka sirf ek chhota Marusthal hi mana jata hai.",
"D_hi": "थार मरुस्थल को राजस्थान का सिर्फ एक छोटा मरुस्थल ही माना जाता है।",
"answer": "A",
"explanation_en": "Thar Marusthal ko Rajasthan ka Cholistan Marusthal bhi kaha jaata hai, jisne iski aitihaasik mahatva ko darshaya hai.",
"explanation_hi": "थार मरुस्थल को राजस्थान का चोलिस्तान मरुस्थल भी कहा जाता है, जिसने इसकी ऐतिहासिक महत्व को दर्शाया है।"
},
{
"subject": "Rajasthan Geography",
"topic": "Thar Marusthal: Visheshatayen aur Vikas",
"question_en": "Thar Marusthal ke kshetra mein kis prakaar ki kheti ki jaati hai?",
"question_hi": "थार मरुस्थल के क्षेत्र में किस प्रकार की खेती की जाती है?",
"A_en": "Subakheti, jaise ki jowar, bajra aur gram kheti.",
"A_hi": "सबाक खेती, जैसे कि जौ, बाजरा और ग्राम खेती।",
"B_en": "Vanaspatisya kheti, jaise ki tees, isabgol aur aam.",
"B_hi": "वनस्पतिसमय खेती, जैसे कि तीस, इसबगोल और आम।",
"C_en": "Vanajadi kheti, jaise ki tees, aam aur kachalu.",
"C_hi": "वनजादी खेती, जैसे कि तीस, आम और कचालू।",
"D_en": "Thar Marusthal mein koi bhi kheti nahin ki jaati hai.",
"D_hi": "थार मरुस्थल में कोई भी खेती नहीं की जाती है।",
"answer": "A",
"explanation_en": "Thar Marusthal mein subakheti ki jaati hai, jaise ki jowar, bajra aur gram, jo iski kheti ke liye mahatvapoorna hain.",
"explanation_hi": "थार मरुस्थल में सबाक खेती की जाती है, जैसे कि जौ, बाजरा और ग्राम, जो इसकी खेती के लिए महत्वपूर्ण हैं।"
},
{
"subject": "Rajasthan Geography",
"topic": "Thar Marusthal: Visheshatayen aur Vikas",
"question_en": "Thar Marusthal ki umdhaan ka kya hote hain?",
"question_hi": "थार मरुस्थल की उन्मद्धन का क्या होते हैं?",
"A_en": "Thar Marusthal mein umdhaan ka karyakram shuru kiya gaya hai.",
"A_hi": "थार मरुस्थल में उन्मद्धन का कार्यक्रम शुरू किया गया है।",
"B_en": "Thar Marusthal mein umdhaan shuru hone se pehle hi jalee ka mukhya srot tha.",
"B_hi": "थार मरुस्थल में उन्मद्धन शुरू होने से पहले ही जली का मुख्य स्रोत था।",
"C_en": "Thar Marusthal ka umdhaan Abhi bhi shuru nahin hua hai.",
"C_hi": "थार मरुस्थल का उन्मद्धन अभी भी शुरू नहीं हुआ है।",
"D_en": "Thar Marusthal mein umdhaan ki aavashyakta nahin hai.",
"D_hi": "थार मरुस्थल में उन्मद्धन की आवश्यकता नहीं है।",
"answer": "C",
"explanation_en": "Thar Marusthal ka umdhaan abhi bhi shuru nahin hua hai, lekin iske liye karyakram chalaye ja rahe hain.",
"explanation_hi": "थार मरुस्थल का उन्मद्धन अभी भी शुरू नहीं हुआ है, लेकिन इसके लिए कार्यक्रम चलाए जा रहे हैं।"
},
{
"subject": "Rajasthan Geography",
"topic": "Thar Marusthal: Visheshatayen aur Vikas",
"question_en": "Thar Marusthal ki vaishvik mahatva kaun se hain?",
"question_hi": "थार मरुस्थल की वैश्विक महत्व कौन से हैं?",
"A_en": "Thar Marusthal mein jalvayu parivartan ka kendra hai.",
"A_hi": "थार मरुस्थल में जलवायु परिवर्तन का केंद्र है।",
"B_en": "Thar Marusthal mein jalvayu parivartan ka kendra nahin hai.",
"B_hi": "थार मरुस्थल में जलवायु परिवर्तन का केंद्र नहीं है।",
"C_en": "Thar Marusthal ka jalvayu parivartan ka kendra Bharat ke liye hai.",
"C_hi": "थार मरुस्थल का जलवायु परिवर्तन का केंद्र भारत के लिए है।",
"D_en": "Thar Marusthal ka jalvayu parivartan ka kendra vishwa ke liye hai.",
"D_hi": "थार मरुस्थल का जलवायु परिवर्तन का केंद्र विश्व के लिए है।",
"answer": "D",
"explanation_en": "Thar Marusthal ka jalvayu parivartan ka kendra vishwa ke liye hai, kyunki yahaan jalvayu parivartan ke sabse zyada prabhav dekha jaata hai.",
"explanation_hi": "थार मरुस्थल का जलवायु परिवर्तन का केंद्र विश्व के लिए है, क्योंकि यहाँ जलवायु परिवर्तन के सबसे ज्यादा प्रभाव देखे जाते हैं।"
},
{
"subject": "Rajasthan Geography",
"topic": "Thar Marusthal: Visheshatayen aur Vikas",
"question_en": "Thar Marusthal mein kis prakaar ki khaadya upajayein hoti hain?",
"question_hi": "थार मरुस्थल में किस प्रकार की खाद्य उपजाएं होती हैं?",
"A_en": "Thar Marusthal mein gram, jowar aur bajra ki khaadya upajayein hoti hain.",
"A_hi": "थार मरुस्थल में ग्राम, जौ और बाजरा की खाद्य उपजाएं होती हैं।",
"B_en": "Thar Marusthal mein tees, isabgol aur aam ki khaadya upajayein hoti hain.",
"B_hi": "थार मरुस्थल में तीस, इसबगोल और आम की खाद्य उपजाएं होती हैं।",
"C_en": "Thar Marusthal mein vanaspati, jaise ki kachalu aur gajar ke upajayein hoti hain.",
"C_hi": "थार मरुस्थल में वनस्पति, जैसे कि कचलू और गाजर के उपजाएं होती हैं।",
"D_en": "Thar Marusthal mein koi bhi khaadya upajayein nahin hoti hain.",
"D_hi": "थार मरुस्थल में कोई भी खाद्य उपजाएं नहीं होती हैं।",
"answer": "A",
"explanation_en": "Thar Marusthal mein gram, jowar aur bajra ki khaadya upajayein hoti hain, jo iske kheti ke liye mahatvapoorna hain.",
"explanation_hi": "थार मरुस्थल में ग्राम, जौ और बाजरा की खाद्य उपजाएं होती हैं, जो इसकी खेती के लिए महत्वपूर्ण हैं।"
},
{
"subject": "Rajasthan Geography",
"topic": "Thar Marusthal: Visheshatayen aur Vikas",
"question_en": "Thar Marusthal ka kya mahatva hai?",
"question_hi": "थार मरुस्थल का क्या महत्व है?",
"A_en": "Thar Marusthal ka mahatva hai Rajasthan ke liye prakritik samsadhan ka srot hai.",
"A_hi": "थार मरुस्थल का महत्व है राजस्थान के लिए प्राकृतिक संसाधन का स्रोत है।",
"B_en": "Thar Marusthal ka mahatva hai Rajasthan ke liye sirf ek prakritik sthal hai.",
"B_hi": "थार मरुस्थल का महत्व है राजस्थान के लिए सिर्फ एक प्राकृतिक स्थल है।",
"C_en": "Thar Marusthal ka mahatva hai Rajasthan ke liye koi bhi mahatva nahin hai.",
"C_hi": "थार मरुस्थल का महत्व है राजस्थान के लिए कोई भी महत्व नहीं है।",
"D_en": "Thar Marusthal ka mahatva hai Rajasthan ke liye ek parvaton ka sthal hai.",
"D_hi": "थार मरुस्थल का महत्व है राजस्थान के लिए एक पर्वतों का स्थल है।",
"answer": "A",
"explanation_en": "Thar Marusthal ka mahatva hai Rajasthan ke liye prakritik samsadhan ka srot hai, jisse kheti, pashupalan adi kiye jate hain.",
"explanation_hi": "थार मरुस्थल का महत्व है राजस्थान के लिए प्राकृतिक संसाधन का स्रोत है, जिससे खेती, पशुपालन आदि किए जाते हैं।"
},
{
"subject": "Rajasthan Geography",
"topic": "Thar Marusthal: Visheshatayen aur Vikas",
"question_en": "Thar Marusthal mein kis prakaar ki jalvayu hoti hai?",
"question_hi": "थार मरुस्थल में किस प्रकार की जलवायु होती है?",
"A_en": "Thar Marusthal mein garmi aur thandi jalvayu hoti hai.",
"A_hi": "थार मरुस्थल में गर्मी और ठंडी जलवायु होती है।",
"B_en": "Thar Marusthal mein saraswat jalvayu hoti hai.",
"B_hi": "थार मरुस्थल में सरस्वत जलवायु होती है।",
"C_en": "Thar Marusthal mein saish jalvayu hoti hai.",
"C_hi": "थार मरुस्थल में शुष्क जलवायु होती है।",
"D_en": "Thar Marusthal mein koi bhi jalvayu nahin hoti hai.",
"D_hi": "थार मरुस्थल में कोई भी जलवायु नहीं होती है।",
"answer": "C",
"explanation_en": "Thar Marusthal mein saish jalvayu hoti hai, jisse yahaan jalvayu parivartan ka prabhav dekha jata hai.",
"explanation_hi": "थार मरुस्थल में शुष्क जलवायु होती है, जिससे यहाँ जलवायु परिवर्तन का प्रभाव देखा जाता है।"
},
{
"subject": "Rajasthan Geography",
"topic": "Thar Marusthal: Visheshatayen aur Vikas",
"question_en": "Thar Marusthal mein kya prakritik drishya hota hai?",
"question_hi": "थार मरुस्थल में क्या प्राकृतिक दृश्य होता है?",
"A_en": "Thar Marusthal mein khaad, dunes aur chappar hota hai.",
"A_hi": "थार मरुस्थल में खाद, ड्यून्स और चपर होता है।",
"B_en": "Thar Marusthal mein parvat, jharna aur prakritik jal hota hai.",
"B_hi": "थार मरुस्थल में पर्वत, झरना और प्राकृतिक जल होता है।",
"C_en": "Thar Marusthal mein koi bhi prakritik drishya nahin hota hai.",
"C_hi": "थार मरुस्थल में कोई भी प्राकृतिक दृश्य नहीं होता है।",
"D_en": "Thar Marusthal mein jalvayu drishya hota hai.",
"D_hi": "थार मरुस्थल में जलवायु दृश्य होता है।",
"answer": "A",
"explanation_en": "Thar Marusthal mein khaad, dunes aur chappar hota hai, jo iske prakritik drishya ke liye mahatvapoorna hain.",
"explanation_hi": "थार मरुस्थल में खाद, ड्यून्स और चपर होता है, जो इसके प्राकृतिक दृश्य के लिए महत्वपूर्ण हैं।"
}
]