[
  {
    "subject": "Rajasthan Geography",
    "topic": "Udyog aur Audyogik Vikas ke Kendra",
    "question_en": "Which city is known as the 'Silicon City' of Rajasthan due to its IT parks?",
    "question_hi": "कौन सा शहर अपने आईटी पार्कों के कारण राजस्थान का 'सिलिकॉन सिटी' कहलाता है?",
    "A_en": "Jaipur",
    "A_hi": "जयपुर",
    "B_en": "Kota",
    "B_hi": "कोटा",
    "C_en": "Udaipur",
    "C_hi": "उदयपुर",
    "D_en": "Ajmer",
    "D_hi": "अजमेर",
    "answer": "A",
    "explanation_en": "Jaipur hosts several IT parks like the Jaipur International Airport IT Park and the Rajasthan State IT Park, earning it the nickname 'Silicon City'.",
    "explanation_hi": "जयपुर में कई आईटी पार्क हैं जैसे जयपुर अंतरराष्ट्रीय हवाई अड्डा आईटी पार्क और राजस्थान राज्य आईटी पार्क, जिससे इसे 'सिलिकॉन सिटी' का उपनाम मिला है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Udyog aur Audyogik Vikas ke Kendra",
    "question_en": "Which city is the largest industrial hub in Rajasthan, hosting major sectors such as automotive, textiles, and pharmaceuticals?",
    "question_hi": "कौन सा शहर राजस्थान का सबसे बड़ा औद्योगिक केंद्र है, जहाँ ऑटोमोटिव, टेक्सटाइल और फार्मास्यूटिकल जैसे प्रमुख सेक्टर हैं?",
    "A_en": "Jaipur",
    "A_hi": "जयपुर",
    "B_en": "Jodhpur",
    "B_hi": "जोधपुर",
    "C_en": "Kota",
    "C_hi": "कोटा",
    "D_en": "Bikaner",
    "D_hi": "बीकानेर",
    "answer": "A",
    "explanation_en": "Jaipur has a diversified industrial base with automobile plants, textile mills, and pharmaceutical units, making it the largest industrial centre in the state.",
    "explanation_hi": "जयपुर में ऑटोमोबाइल संयंत्र, टेक्सटाइल मिल और फार्मास्यूटिकल इकाइयाँ हैं, जिससे यह राज्य का सबसे बड़ा औद्योगिक केंद्र बनता है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Udyog aur Audyogik Vikas ke Kendra",
    "question_en": "Which city is renowned for its leather industry and hosts the largest leather market in Rajasthan?",
    "question_hi": "कौन सा शहर अपने चमड़े के उद्योग के लिए प्रसिद्ध है और राजस्थान का सबसे बड़ा चमड़े का बाजार यहाँ स्थित है?",
    "A_en": "Jaipur",
    "A_hi": "जयपुर",
    "B_en": "Jodhpur",
    "B_hi": "जोधपुर",
    "C_en": "Udaipur",
    "C_hi": "उदयपुर",
    "D_en": "Bikaner",
    "D_hi": "बीकानेर",
    "answer": "A",
    "explanation_en": "The Jaipur Leather Market is the largest in Rajasthan and a major hub for leather trading and manufacturing.",
    "explanation_hi": "जयपुर का चमड़ा बाजार राजस्थान का सबसे बड़ा है और चमड़े के व्यापार व निर्माण का प्रमुख केंद्र है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Udyog aur Audyogik Vikas ke Kendra",
    "question_en": "Which city is the major centre for textile manufacturing, especially cotton and ready‑made garments?",
    "question_hi": "कौन सा शहर कपास और तैयार‑मेड वस्त्रों के उत्पादन के लिए प्रमुख केंद्र है?",
    "A_en": "Kota",
    "A_hi": "कोटा",
    "B_en": "Ajmer",
    "B_hi": "अजमेर",
    "C_en": "Udaipur",
    "C_hi": "उदयपुर",
    "D_en": "Bikaner",
    "D_hi": "बीकानेर",
    "answer": "A",
    "explanation_en": "Kota is known as the 'Textile City' of Rajasthan, housing numerous textile mills and garment factories.",
    "explanation_hi": "कोटा को राजस्थान का 'टेक्सटाइल सिटी' कहा जाता है, जहाँ कई टेक्सटाइल मिल और वस्त्र कारखाने हैं।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Udyog aur Audyogik Vikas ke Kendra",
    "question_en": "Which city hosts the headquarters of Rajasthan State Industrial Development and Investment Corporation (RIICO)?",
    "question_hi": "राष्ट्रपति राज्य औद्योगिक विकास और निवेश निगम (RIICO) का मुख्यालय किस शहर में है?",
    "A_en": "Jaipur",
    "A_hi": "जयपुर",
    "B_en": "Ajmer",
    "B_hi": "अजमेर",
    "C_en": "Kota",
    "C_hi": "कोटा",
    "D_en": "Bikaner",
    "D_hi": "बीकानेर",
    "answer": "A",
    "explanation_en": "RIICO's headquarters is situated in Jaipur, making the city a pivotal point for industrial planning in Rajasthan.",
    "explanation_hi": "RIICO का मुख्यालय जयपुर में है, जिससे यह शहर राजस्थान में औद्योगिक योजना का एक प्रमुख केंद्र बनता है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Udyog aur Audyogik Vikas ke Kendra",
    "question_en": "Which city is known for its cement production and houses the largest cement plant in Rajasthan?",
    "question_hi": "कौन सा शहर सीमेंट उत्पादन के लिए प्रसिद्ध है और राजस्थान का सबसे बड़ा सीमेंट संयंत्र यहाँ स्थित है?",
    "A_en": "Bikaner",
    "A_hi": "बीकानेर",
    "B_en": "Jodhpur",
    "B_hi": "जोधपुर",
    "C_en": "Kota",
    "C_hi": "कोटा",
    "D_en": "Jaipur",
    "D_hi": "जयपुर",
    "answer": "A",
    "explanation_en": "Bikaner hosts the largest cement plant operated by the Bikaner Cement Company, a major contributor to the state's industrial output.",
    "explanation_hi": "बीकानेर में सबसे बड़ा सीमेंट संयंत्र स्थित है, जो बीकानेर सीमेंट कंपनी द्वारा संचालित है और राज्य के औद्योगिक उत्पादन में महत्वपूर्ण योगदान देता है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Udyog aur Audyogik Vikas ke Kendra",
    "question_en": "Which city is renowned for the production of marble and granite, supplying major construction projects across India?",
    "question_hi": "कौन सा शहर संगमरमर और ग्रेनाइट उत्पादन के लिए प्रसिद्ध है, जो पूरे भारत में बड़े निर्माण परियोजनाओं को सप्लाई करता है?",
    "A_en": "Jaipur",
    "A_hi": "जयपुर",
    "B_en": "Udaipur",
    "B_hi": "उदयपुर",
    "C_en": "Ajmer",
    "C_hi": "अजमेर",
    "D_en": "Jodhpur",
    "D_hi": "जोधपुर",
    "answer": "A",
    "explanation_en": "Jaipur is a major marble hub, with numerous quarries and processing units supplying marble to national projects.",
    "explanation_hi": "जयपुर संगमरमर का प्रमुख केंद्र है, जहाँ कई खदानें और प्रसंस्करण इकाइयाँ राष्ट्रीय परियोजनाओं को संगमरमर सप्लाई करती हैं।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Udyog aur Audyogik Vikas ke Kendra",
    "question_en": "Which city is a major hub for automobile components manufacturing, including parts for Maruti Suzuki?",
    "question_hi": "कौन सा शहर ऑटोमोबाइल घटकों के उत्पादन का प्रमुख केंद्र है, जिसमें मारुति सुजुकी के हिस्से भी शामिल हैं?",
    "A_en": "Jaipur",
    "A_hi": "जयपुर",
    "B_en": "Kota",
    "B_hi": "कोटा",
    "C_en": "Bikaner",
    "C_hi": "बीकानेर",
    "D_en": "Jodhpur",
    "D_hi": "जोधपुर",
    "answer": "A",
    "explanation_en": "Jaipur hosts several auto component plants such as Maruti Suzuki’s assembly units and related suppliers.",
    "explanation_hi": "जयपुर में कई ऑटो घटक संयंत्र हैं, जैसे मारुति सुजुकी के असेंबली यूनिट और संबंधित सप्लायर।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Udyog aur Audyogik Vikas ke Kendra",
    "question_en": "Which city is known for its small‑scale industries and has a dedicated Industrial Development Centre?",
    "question_hi": "कौन सा शहर अपने छोटे उद्योगों के लिए प्रसिद्ध है और यहाँ एक समर्पित औद्योगिक विकास केंद्र है?",
    "A_en": "Ajmer",
    "A_hi": "अजमेर",
    "B_en": "Kota",
    "B_hi": "कोटा",
    "C_en": "Udaipur",
    "C_hi": "उदयपुर",
    "D_en": "Bikaner",
    "D_hi": "बीकानेर",
    "answer": "A",
    "explanation_en": "Ajmer hosts the Rajasthan Industrial Development Centre (RIDC) which supports numerous small‑scale enterprises.",
    "explanation_hi": "अजमेर में राजस्थान औद्योगिक विकास केंद्र (RIDC) है, जो कई छोटे उद्योगों का समर्थन करता है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Udyog aur Audyogik Vikas ke Kendra",
    "question_en": "Which city is a major centre for furniture manufacturing, especially wooden and teak furniture?",
    "question_hi": "कौन सा शहर लकड़ी और टीक फर्नीचर के उत्पादन का प्रमुख केंद्र है?",
    "A_en": "Udaipur",
    "A_hi": "उदयपुर",
    "B_en": "Kota",
    "B_hi": "कोटा",
    "C_en": "Jodhpur",
    "C_hi": "जोधपुर",
    "D_en": "Bikaner",
    "D_hi": "बीकानेर",
    "answer": "A",
    "explanation_en": "Udaipur is known for its traditional wooden and teak furniture industry, supplying both domestic and international markets.",
    "explanation_hi": "उदयपुर अपने पारंपरिक लकड़ी और टीक फर्नीचर उद्योग के लिए जाना जाता है, जो घरेलू और अंतरराष्ट्रीय बाजारों को सप्लाई करता है।"
  },
  {
    "subject": "Rajasthan Geography",
    "topic": "Udyog aur Audyogik Vikas ke Kendra",
    "question_en": "Which city hosts the largest industrial estate in Rajasthan, covering over 3000 acres?",
    "question_hi": "कौन सा शहर राजस्थान का सबसे बड़ा औ