[
{
"subject": "Indian History",
"topic": "Maharajas of Rajasthan",
"question_en": "Which of the following Maharajas of Rajasthan is known for his bravery and military campaigns?",
"question_hi": "राजस्थान के महाराजाओं में से जिसने अपनी बहादुरी और सैन्य अभियानों के लिए जाना जाता है, वह है?",
"A_en": "Raja Man Singh", "A_hi": "राजा मन सिंह",
"B_en": "Raja Jai Singh", "B_hi": "राजा जय सिंह",
"C_en": "Raja Sawai Jai Singh", "C_hi": "राजा सावाई जय सिंह",
"D_en": "Rana Pratap", "D_hi": "राणा प्रताप",
"answer": "C",
"explanation_en": "Raja Sawai Jai Singh was a brave and skilled military leader who expanded the Mughal Empire.",
"explanation_hi": "राजा सावाई जय सिंह एक बहादुर और कुशल सैन्य नेता थे जिन्होंने मुगल साम्राज्य का विस्तार किया।"
},
{
"subject": "Indian History",
"topic": "Mughal Empire",
"question_en": "Which of the following Mughal Emperors was known for his tolerant and inclusive policies?",
"question_hi": "मुगल साम्राज्य के जिन शासकों ने सहिष्णुता और समावेशी नीतियों के लिए जाना जाता है, वह कौन सा था?",
"A_en": "Akbar", "A_hi": "अकबर",
"B_en": "Jahangir", "B_hi": "जहांगीर",
"C_en": "Shah Jahan", "C_hi": "शाहजहां",
"D_en": "Aurangzeb", "D_hi": "आुरंगजेब",
"answer": "A",
"explanation_en": "Akbar was known for his tolerant and inclusive policies, which allowed for the coexistence of different religions and cultures.",
"explanation_hi": "अकबर को उनकी सहिष्णुता और समावेशी नीतियों के लिए जाना जाता है, जिन्होंने विभिन्न धर्मों और संस्कृतियों के सहसंबंध को संभव बनाया।"
},
{
"subject": "Indian History",
"topic": "Independence Movement",
"question_en": "Which of the following leaders played a key role in the Non-Cooperation Movement?",
"question_hi": "नॉन-कोऑपरेशन आंदोलन में जो नेता की कुंभ निभाई, वह है?",
"A_en": "Mahatma Gandhi", "A_hi": "महात्मा गांधी",
"B_en": "Subhas Chandra Bose", "B_hi": "सुभाष चंद्र बोस",
"C_en": "Jawaharlal Nehru", "C_hi": "जवाहरलाल नेहरू",
"D_en": "Lala Lajpat Rai", "D_hi": "लाला लाजपत राय",
"answer": "A",
"explanation_en": "Mahatma Gandhi played a key role in the Non-Cooperation Movement, which aimed to challenge British colonial rule in India.",
"explanation_hi": "महात्मा गांधी ने नॉन-कोऑपरेशन आंदोलन की महत्वपूर्ण भूमिका निभाई, जिसका उद्देश्य भारत में ब्रिटिश शासन को चुनौती देना था।"
},
{
"subject": "Indian History",
"topic": "Ancient India",
"question_en": "Which of the following Indus Valley Civilization cities is known for its sophisticated water management system?",
"question_hi": "हड़प्पा सभ्यता के शहरों में से जिसने अपनी जटिल जल प्रबंधन प्रणाली के लिए जाना जाता है, वह है?",
"A_en": "Mohenjo-Daro", "A_hi": "मोहेंजो-दारो",
"B_en": "Harappa", "B_hi": "हड़प्पा",
"C_en": "Lothal", "C_hi": "लोथल",
"D_en": "Kalibangan", "D_hi": "कालीबंगा",
"answer": "C",
"explanation_en": "Lothal is known for its sophisticated water management system, which included a complex network of canals and drains.",
"explanation_hi": "लोथल को अपनी जटिल जल प्रबंधन प्रणाली के लिए जाना जाता है, जिसमें जटिल नेटवर्क के साथ-साथ नालों और नालियों का एक जटिल संकेत है।"
},
{
"subject": "Indian History",
"topic": "Maratha Empire",
"question_en": "Which of the following Maratha rulers expanded the empire to its greatest extent?",
"question_hi": "महाराष्ट्र साम्राज्य के शासकों में से जिसने साम्राज्य को अपने सबसे बड़े विस्तार तक ले जाया था, वह है?",
"A_en": "Chhatrapati Shivaji", "A_hi": "छत्रपति शिवाजी",
"B_en": "Sambhaji", "B_hi": "संभाजी",
"C_en": "Rajaram", "C_hi": "राजाराम",
"D_en": "Peshwa Baji Rao I", "D_hi": "पेशवा बाजीराव I",
"answer": "D",
"explanation_en": "Peshwa Baji Rao I expanded the Maratha Empire to its greatest extent, conquering large areas of present-day India.",
"explanation_hi": "पेशवा बाजीराव I ने महाराष्ट्र साम्राज्य को अपने सबसे बड़े विस्तार तक ले जाया, जिसमें वर्तमान भारत के विशाल क्षेत्रों को जीता गया था।"
},
{
"subject": "Indian History",
"topic": "Rajput Kingdoms",
"question_en": "Which of the following Rajput kingdoms was known for its architectural marvels, such as the Amer Fort?",
"question_hi": "राजपूत राज्यों में से जिसने अपने प्रतिष्ठित भवनों के लिए जाना जाता है, जैसे कि अमेर किला?",
"A_en": "Mewar", "A_hi": "मेवाड़",
"B_en": "Marwar", "B_hi": "मारवाड़",
"C_en": "Jaipur", "C_hi": "जयपुर",
"D_en": "Dungarpur", "D_hi": "डूंगरपुर",
"answer": "C",
"explanation_en": "Jaipur is known for its architectural marvels, such as the Amer Fort, which is a testament to the region's rich cultural heritage.",
"explanation_hi": "जयपुर अपने प्रतिष्ठित भवनों के लिए जाना जाता है, जैसे कि अमेर किला, जो क्षेत्र की समृद्ध सांस्कृतिक विरासत का प्रमाण है।"
},
{
"subject": "Indian History",
"topic": "Freedom Fighters",
"question_en": "Which of the following freedom fighters was known for his non-violent resistance and civil disobedience?",
"question_hi": "जिस स्वतंत्रता सेनानी को उनकी अहिंसक प्रतिरोध और नागरिक असहयोग के लिए जाना जाता है, वह है?",
"A_en": "Lala Lajpat Rai", "A_hi": "लाला लाजपत राय",
"B_en": "Bhagat Singh", "B_hi": "भगत सिंह",
"C_en": "Chandra Shekhar Azad", "C_hi": "चंद्रशेखर आज़ाद",
"D_en": "Mahatma Gandhi", "D_hi": "महात्मा गांधी",
"answer": "D",
"explanation_en": "Mahatma Gandhi was known for his non-violent resistance and civil disobedience, which played a key role in the Indian independence movement.",
"explanation_hi": "महात्मा गांधी को उनकी अहिंसक प्रतिरोध और नागरिक असहयोग के लिए जाना जाता है, जिसने भारतीय स्वतंत्रता आंदोलन में एक महत्वपूर्ण भूमिका निभाई।"
},
{
"subject": "Indian History",
"topic": "Ancient India",
"question_en": "Which of the following ancient Indian kingdoms was known for its trade and cultural exchange with the ancient Greeks?",
"question_hi": "प्राचीन भारतीय राज्यों में से जिसने प्राचीन यूनानियों के साथ व्यापार और सांस्कृतिक आदान-प्रदान के लिए जाना जाता है, वह है?",
"A_en": "Mauryan Empire", "A_hi": "मौर्य साम्राज्य",
"B_en": "Gupta Empire", "B_hi": "गुप्त साम्राज्य",
"C_en": "Kushan Empire", "C_hi": "कुषाण साम्राज्य",
"D_en": "Satavahana Dynasty", "D_hi": "सतावहाना वंश",
"answer": "C",
"explanation_en": "The Kushan Empire was known for its trade and cultural exchange with the ancient Greeks, which had a significant impact on Indian art and culture.",
"explanation_hi": "कुषाण साम्राज्य को प्राचीन यूनानियों के साथ व्यापार और सांस्कृतिक आदान-प्रदान के लिए जाना जाता है, जिसने भारतीय कला और संस्कृति पर महत्वपूर्ण प्रभाव डाला।"
},
{
"subject": "Indian History",
"topic": "Rajput Kingdoms",
"question_en": "Which of the following Rajput kingdoms was known for its strategic location and military prowess?",
"question_hi": "राजपूत राज्यों में से जिसने अपनी रणनीतिक स्थिति और सैन्य कौशल के लिए जाना जाता है, वह है?",
"A_en": "Mewar", "A_hi": "मेवाड़",
"B_en": "Marwar", "B_hi": "मारवाड़",
"C_en": "Jaipur", "C_hi": "जयपुर",
"D_en": "Dungarpur", "D_hi": "डूंगरपुर",
"answer": "B",
"explanation_en": "Marwar was known for its strategic location and military prowess, which allowed it to expand its territories and maintain its independence.",
"explanation_hi": "मारवाड़ को अपनी रणनीतिक स्थिति और सैन्य कौशल के लिए जाना जाता है, जिसने उसे अपने प्रभुत्व को बढ़ाने और स्वतंत्र बने रहने की अनुमति दी।"
},
{
"subject": "Indian History",
"topic": "Freedom Fighters",
"question_en": "Which of the following freedom fighters was known for his revolutionary activities and involvement in the Hindustan Socialist Republic Association?",
"question_hi": "जिस स्वतंत्रता सेनानी को उनकी क्रांतिकारी गतिविधियों और हिंदुस्तान सोशलिस्ट रिपब्लिक एसोसिएशन में शामिल होने के लिए जाना जाता है, वह है?",
"A_en": "Lala Lajpat Rai", "A_hi": "लाला लाजपत राय",
"B_en": "Bhagat Singh", "B_hi": "भगत सिंह",
"C_en": "Chandra Shekhar Azad", "C_hi": "चंद्रशेखर आज़ाद",
"D_en": "Sukhdev", "D_hi": "सुखदेव",
"answer": "B",
"explanation_en": "Bhagat Singh was known for his revolutionary activities and involvement in the Hindustan Socialist Republic Association, which aimed to overthrow British colonial rule in India.",
"explanation_hi": "भगत सिंह को उनकी क्रांतिकारी गतिविधियों और हिंदुस्तान सोशलिस्ट रिपब्लिक एसोसिएशन में शामिल होने के लिए जाना जाता है, जिसका उद्देश्य भारत में ब्रिटिश शासन को उखाड़ फेंकना था।"
},
{
"subject": "Indian History",
"topic": "Ancient India",
"question_en": "Which of the following ancient Indian cities was known for its advanced irrigation systems and agricultural practices?",
"question_hi": "प्राचीन भारतीय शहरों में से जिसने अपने उन्नत जल प्रबंधन प्रणालियों और कृषि अभ्यासों के लिए जाना जाता है, वह है?",
"A_en": "Mohenjo-Daro", "A_hi": "मोहेंजो-दारो",
"B_en": "Harappa", "B_hi": "हड़प्पा",
"C_en": "Lothal", "C_hi": "लोथल",
"D_en": "Kalibangan", "D_hi": "कालीबंगा",
"answer": "A",
"explanation_en": "Mohenjo-Daro was known for its advanced irrigation systems and agricultural practices, which allowed for the growth of a thriving civilization.",
"explanation_hi": "मोहेंजो-दारो को अपने उन्नत जल प्रबंधन प्रणालियों और कृषि अभ्यासों के लिए जाना जाता है, जिसने एक समृद्ध सभ्यता को विकसित करने की अनुमति दी।"
}