[
{
"subject": "Indian History",
"topic": "",
"question_en": "Which among the following Indus Valley sites is located in Rajasthan?",
"question_hi": "निम्नलिखित में से कौन-सा सिंधु घाटी का स्थल राजस्थान में स्थित है?",
"A_en": "Kalibangan", "A_hi": "कालीबंगा",
"B_en": "Mohenjo-daro", "B_hi": "मोहनजोदड़ो",
"C_en": "Harappa", "B_hi": "हड़प्पा",
"D_en": "Lothal", "D_hi": "लोथल",
"answer": "A",
"explanation_en": "Kalibangan is an Indus Valley site located in Hanumangarh district of Rajasthan.",
"explanation_hi": "कालीबंगा राजस्थान के हनुमानगढ़ ज़िले में स्थित एक सिंधु घाटी स्थल है।"
},
{
"subject": "Indian History",
"topic": "",
"question_en": "The Khari Khabar pass that connected India with Central Asia is situated in which mountain range?",
"question_hi": "भारत को मध्य एशिया से जोड़ने वाला खरि खाबर दर्रा किस पर्वत श्रृंखला में स्थित है?",
"A_en": "Karakoram", "A_hi": "काराकोरम",
"B_en": "Hindu Kush", "B_hi": "हिंदुकुश",
"C_en": "Zaskar", "B_hi": "ज़ास्कर",
"D_en": "Ladakh", "D_hi": "लद्दाख",
"answer": "B",
"explanation_en": "The Khari Khabar pass lies in the Hindu Kush range and was an important trade route.",
"explanation_hi": "खरि खाबर दर्रा हिंदुकुश श्रृंखला में स्थित है और एक महत्वपूर्ण व्यापार मार्ग था।"
},
{
"subject": "Indian History",
"topic": "",
"question_en": "Which river is closely associated with the rise of the Vedic civilization?",
"question_hi": "किस नदी का संबंध वैदिक सभ्यता के उदय से घनिष्ठ रूप से है?",
"A_en": "Yamuna", "A_hi": "यमुना",
"B_en": "Ganga", "B_hi": "गंगा",
"C_en": "Sindhu", "B_hi": "सिंधु",
"D_en": "Brahmaputra", "D_hi": "ब्रह्मपुत्र",
"answer": "C",
"explanation_en": "The Vedic texts mention the Sindhu (Indus) and its tributaries as the heartland of early Aryan settlements.",
"explanation_hi": "वैदिक ग्रंथ सिंधु (इंडस) और उसकी सहायक नदियों को प्रारंभिक आर्य बस्तियों का केंद्र मानते हैं।"
},
{
"subject": "Indian History",
"topic": "",
"question_en": "The Iron Pillar of Delhi, known for its corrosion resistance, was originally erected at which site?",
"question_hi": "दिल्ली का लौह स्तंभ, जो अपने संक्षारण-प्रतिरोध के लिए प्रसिद्ध है, मूल रूप से कहाँ स्थापित किया गया था?",
"A_en": "Udayagiri caves", "A_hi": "उदयगिरि गुफाएँ",
"B_en": "Vaishali", "B_hi": "वैशाली",
"C_en": "Pataliputra", "B_hi": "पाटलिपुत्र",
"D_en": "Mathura", "D_hi": "मथुरा",
"answer": "A",
"explanation_en": "The pillar was first set up at Udayagiri by Chandragupta II and later moved to Delhi.",
"explanation_hi": "स्तंभ को प्रारंभ में चंद्रगुप्त द्वितीय द्वारा उदयगिरि में स्थापित किया गया था और बाद में दिल्ली लाया गया।"
},
{
"subject": "Indian History",
"topic": "",
"question_en": "Which dynasty issued the first known gold coins in India?",
"question_hi": "भारत में पहले ज्ञात स्वर्ण सिक्के किस वंश ने जारी किए?",
"A_en": "Maurya", "A_hi": "मौर्य",
"B_en": "Shunga", "B_hi": "शुंग",
"C_en": "Kushana", "B_hi": "कुषाण",
"D_en": "Gupta", "D_hi": "गुप्त",
"answer": "C",
"explanation_en": "The Kushanas, especially Kanishka, introduced gold coins modelled on Roman aurei.",
"explanation_hi": "कुषाणों, विशेषकर कनिष्क ने रोमन ऑरियस के आधार पर सोने के सिक्के चलाए।"
},
{
"subject": "Indian History",
"topic": "",
"question_en": "Who among the following was the court poet of Samudragupta?",
"question_hi": "निम्नलिखित में से कौन समुद्रगुप्त का दरबारी कवि था?",
"A_en": "Amarsimha", "A_hi": "अमरसिंह",
"B_en": "Harisena", "B_hi": "हरिषेण",
"C_en": "Banabhatta", "B_hi": "बाणभट्ट",
"D_en": "Kalidasa", "D_hi": "कालिदास",
"answer": "B",
"explanation_en": "Harisena composed the Allahabad Pillar inscription praising Samudragupta’s conquests.",
"explanation_hi": "हरिषेण ने समुद्रगुप्त की विजयों की प्रशंसा करते हुए प्रयाग प्रस्तर अभिलेख रचा।"
},
{
"subject": "Indian History",
"topic": "",
"question_en": "The ancient port of Muziris, mentioned in the Sangam texts, was located in which present-day state?",
"question_hi": "संगम ग्रंथों में वर्णित प्राचीन बंदरगाह मुज़िरिस आज के किस राज्य में स्थित था?",
"A_en": "Tamil Nadu", "A_hi": "तमिलनाडु",
"B_en": "Kerala", "B_hi": "केरल",
"C_en": "Karnataka", "B_hi": "कर्नाटक",
"D_en": "Andhra Pradesh", "D_hi": "आंध्र प्रदेश",
"answer": "B",
"explanation_en": "Excavations at Pattanam in Kerala identify it with the legendary port Muziris.",
"explanation_hi": "केरल के पट्टनम में उत्खनन इसे पौराणिक बंदरगाह मुज़िरिस के रूप में चिह्नित करते हैं।"
},
{
"subject": "Indian History",
"topic": "",
"question_en": "Which inscription proves that a council under King Kanishka compiled the Buddhist commentaries?",
"question_hi": "कौन-सा अभिलेख यह सिद्ध करता है कि कनिष्क राजा के अधीन एक परिषद ने बौद्ध टीकाओं का संकलन किया?",
"A_en": "Rabatak Inscription", "A_hi": "राबतक अभिलेख",
"B_en": "Sarnath Inscription", "B_hi": "सारनाथ अभिलेख",
"C_en": "Maski Inscription", "B_hi": "मaski अभिलेख",
"D_en": "Junagadh Inscription", "D_hi": "जूनागढ़ अभिलेख",
"answer": "A",
"explanation_en": "The Rabatak inscription lists the names of scholars who revised the Buddhist canon under Kanishka.",
"explanation_hi": "राबतक अभिलेख उन विद्वानों के नाम देता है जिन्होंने कनिष्क के अधीन बौद्ध धर्मशास्त्रों का पुनरीक्षण किया।"
},
{
"subject": "Indian History",
"topic": "",
"question_en": "The practice of ‘Asvamedha’ is most elaborately described in which Vedic text?",
"question_hi": "'अश्वमेध' की क्रिया का सबसे विस्तृत वर्णन किस वैदिक ग्रंथ में है?",
"A_en": "Rig Veda", "A_hi": "ऋग्वेद",
"B_en": "Sama Veda", "B_hi": "सामवेद",
"C_en": "Yajur Veda", "B_hi": "यजुर्वेद",
"D_en": "Atharva Veda", "D_hi": "अथर्ववेद",
"answer": "C",
"explanation_en": "The Yajur Veda, particularly the Shatapatha Brahmana, gives minute details of the Asvamedha ritual.",
"explanation_hi": "यजुर्वेद, विशेषतः शतपथ ब्राह्मण, अश्वमेध अनुष्ठान का सूक्ष्म विवरण देता है।"
},
{
"subject": "Indian History",
"topic": "",
"question_en": "The military general who helped Chandragupta Maurya overthrow the Nandas was",
"question_hi": "वह सेनापति जिसने चंद्रगुप्त मौर्य को नंदों का पतन करने में सहायता की थी",
"A_en": "Radhagupta", "A_hi": "राधागुप्त",
"B_en": "Akshapatala", "B_hi": "अक्षपटल",
"C_en": "Chanakya", "B_hi": "चाणक्य",
"D_en": "Bhadrasala", "D_hi": "भद्रसाल",
"answer": "C",
"explanation_en": "Chanakya, also called Kautilya, acted as mentor and strategist to Chandragupta in ending Nanda rule.",
"explanation_hi": "चाणक्य, जिन्हें कौटिल्य भी कहा जाता है, ने चंद्रगुप्त को नंद शासन समाप्त करने में मार्गदर्शन रणनीति दी।"
}
]