[
{
"subject": "Indian History",
"topic": "Dilli Sultanat: Prashasan aur Samaj",
"question_en": "Dilli Sultanat ke shasan ke dauran, kya tha shiksha evam vikaas ke liye prarambhik yojana?",
"question_hi": "दिल्ली सल्तनत के शासन के दौरान, शिक्षा और विकास के लिए क्या थी प्रारंभिक योजना?",
"A_en": "Shiksha ki prarambhik yojana, jismein vyayamshala aur madhyamik shiksha ki shuruwat thi",
"A_hi": "शिक्षा की प्रारंभिक योजना, जिसमें व्यायामशाला और माध्यमिक शिक्षा की शुरुआत थी",
"B_en": "Viksit shahar aur vittiya vikas par dhyan dene ki yojana",
"B_hi": "विकसित शहर और वित्तीय विकास पर ध्यान देने की योजना",
"C_en": "Shiksha aur vikas ke liye samuhik yojana, jismein prathamik shiksha aur gyan prabandhan shamil tha",
"C_hi": "शिक्षा और विकास के लिए समूहिक योजना, जिसमें प्राथमिक शिक्षा और ज्ञान प्रबंधन सम्मिलित था",
"D_en": "Gyan aur vikaas ke liye samanya yojana",
"D_hi": "ज्ञान और विकास के लिए सामान्य योजना",
"answer": "C",
"explanation_en": "Dilli Sultanat ke shasan ke dauran, shiksha aur vikas ke liye samuhik yojana thi, jismein prathamik shiksha aur gyan prabandhan shamil tha.",
"explanation_hi": "दिल्ली सल्तनत के शासन के दौरान शिक्षा और विकास के लिए समूहिक योजना थी, जिसमें प्राथमिक शिक्षा और ज्ञान प्रबंधन सम्मिलित था।"
},
{
"subject": "Indian History",
"topic": "Dilli Sultanat: Prashasan aur Samaj",
"question_en": "Kya Dilli Sultanat ke shasan ke dauran samajik sthiti mein koi pramukh parivartan hua?",
"question_hi": "क्या दिल्ली सल्तनत के शासन के दौरान समाजिक स्थिति में कोई प्रमुख परिवर्तन हुआ?",
"A_en": "Samaj mein shiksha ki prachar mein vriddhi",
"A_hi": "समाज में शिक्षा की प्रचार में वृद्धि",
"B_en": "Samaj mein vittiya vikas aur shahari vikas mein vriddhi",
"B_hi": "समाज में वित्तीय विकास और शहरी विकास में वृद्धि",
"C_en": "Samaj mein samajik sthiti mein vriddhi, jismein samajik anyay aur shiksha ke liye avsar",
"C_hi": "समाज में समाजिक स्थिति में वृद्धि, जिसमें सामाजिक अन्याय और शिक्षा के लिए अवसर",
"D_en": "Samaj mein samajik sthiti mein ghatna, jismein vyakti ki mukti aur shiksha ki prachar",
"D_hi": "समाज में समाजिक स्थिति में गिरावट, जिसमें व्यक्ति की मुक्ति और शिक्षा की प्रचार",
"answer": "C",
"explanation_en": "Dilli Sultanat ke shasan ke dauran samajik sthiti mein pramukh parivartan hua, jismein samajik anyay aur shiksha ke liye avsar shamil the.",
"explanation_hi": "दिल्ली सल्तनत के शासन के दौरान समाजिक स्थिति में प्रमुख परिवर्तन हुआ, जिसमें सामाजिक अन्याय और शिक्षा के लिए अवसर सम्मिलित थे।"
},
{
"subject": "Indian History",
"topic": "Dilli Sultanat: Prashasan aur Samaj",
"question_en": "Dilli Sultanat ke shasan ke dauran rajnitik sthiti ko kaise samajhenge?",
"question_hi": "दिल्ली सल्तनत के शासन के दौरान राजनीतिक स्थिति को कैसे समझेंगे?",
"A_en": "Rajnitik sthiti mein vyaktigat shasan ka prabhav",
"A_hi": "राजनीतिक स्थिति में व्यक्तिगत शासन का प्रभाव",
"B_en": "Rajnitik sthiti mein samuhik shasan ka prabhav",
"B_hi": "राजनीतिक स्थिति में सामूहिक शासन का प्रभाव",
"C_en": "Rajnitik sthiti mein shasan ki sanrachna ka prabhav",
"C_hi": "राजनीतिक स्थिति में शासन की संरचना का प्रभाव",
"D_en": "Rajnitik sthiti mein vaidh shasan ka prabhav",
"D_hi": "राजनीतिक स्थिति में वैध शासन का प्रभाव",
"answer": "C",
"explanation_en": "Dilli Sultanat ke shasan ke dauran rajnitik sthiti ko shasan ki sanrachna ka prabhav se samajhenge.",
"explanation_hi": "दिल्ली सल्तनत के शासन के दौरान राजनीतिक स्थिति को शासन की संरचना का प्रभाव से समझेंगे।"
},
{
"subject": "Indian History",
"topic": "Dilli Sultanat: Prashasan aur Samaj",
"question_en": "Kya Dilli Sultanat ke shasan ke dauran anya rajyaon ke saath sambandh the?",
"question_hi": "क्या दिल्ली सल्तनत के शासन के दौरान अन्य राज्यों के साथ संबंध थे?",
"A_en": "Haan, anya rajyaon ke saath shanti samjhauta the",
"A_hi": "हाँ, अन्य राज्यों के साथ शांति समझौता थे",
"B_en": "Nahin, anya rajyaon ke saath yuddh the",
"B_hi": "नहीं, अन्य राज्यों के साथ युद्ध थे",
"C_en": "Haan, anya rajyaon ke saath vyapar aur sahyog the",
"C_hi": "हाँ, अन्य राज्यों के साथ व्यापार और सहयोग थे",
"D_en": "Nahin, anya rajyaon ke saath koi sambandh nahin the",
"D_hi": "नहीं, अन्य राज्यों के साथ कोई संबंध नहीं थे",
"answer": "C",
"explanation_en": "Dilli Sultanat ke shasan ke dauran anya rajyaon ke saath vyapar aur sahyog the.",
"explanation_hi": "दिल्ली सल्तनत के शासन के दौरान अन्य राज्यों के साथ व्यापार और सहयोग थे।"
},
{
"subject": "Indian History",
"topic": "Dilli Sultanat: Prashasan aur Samaj",
"question_en": "Dilli Sultanat ke shasan ke dauran samajik nyay ko kaise prakashit kiya gaya?",
"question_hi": "दिल्ली सल्तनत के शासन के दौरान समाजिक न्याय को कैसे प्रकाशित किया गया?",
"A_en": "Samajik nyay ko sarkari prakriya ke madhyam se prakashit kiya gaya",
"A_hi": "समाजिक न्याय को सरकारी प्रक्रिया के माध्यम से प्रकाशित किया गया",
"B_en": "Samajik nyay ko adhivaktaon ke madhyam se prakashit kiya gaya",
"B_hi": "समाजिक न्याय को अधिवक्ताओं के माध्यम से प्रकाशित किया गया",
"C_en": "Samajik nyay ko shiksha ko majboot karna se prakashit kiya gaya",
"C_hi": "समाजिक न्याय को शिक्षा को मजबूत करने से प्रकाशित किया गया",
"D_en": "Samajik nyay ko anya rajyaon ke saath sahyog se prakashit kiya gaya",
"D_hi": "समाजिक न्याय को अन्य राज्यों के साथ सहयोग से प्रकाशित किया गया",
"answer": "C",
"explanation_en": "Dilli Sultanat ke shasan ke dauran samajik nyay ko shiksha ko majboot karna se prakashit kiya gaya.",
"explanation_hi": "दिल्ली सल्तनत के शासन के दौरान समाजिक न्याय को शिक्षा को मजबूत करने से प्रकाशित किया गया।"
},
{
"subject": "Indian History",
"topic": "Dilli Sultanat: Prashasan aur Samaj",
"question_en": "Kya Dilli Sultanat ke shasan ke dauran rajnitik nyay ko majboot kiya gaya?",
"question_hi": "क्या दिल्ली सल्तनत के शासन के दौरान राजनीतिक न्याय को मजबूत किया गया?",
"A_en": "Haan, rajnitik nyay ko majboot kiya gaya",
"A_hi": "हाँ, राजनीतिक न्याय को मजबूत किया गया",
"B_en": "Nahin, rajnitik nyay ko kamjor kiya gaya",
"B_hi": "नहीं, राजनीतिक न्याय को कमजोर किया गया",
"C_en": "Haan, rajnitik nyay ko shiksha ko majboot karna se majboot kiya gaya",
"C_hi": "हाँ, राजनीतिक न्याय को शिक्षा को मजबूत करने से मजबूत किया गया",
"D_en": "Nahin, rajnitik nyay ko anya rajyaon ke saath sahyog se majboot kiya gaya",
"D_hi": "नहीं, राजनीतिक न्याय को अन्य राज्यों के साथ सहयोग से मजबूत किया गया",
"answer": "C",
"explanation_en": "Dilli Sultanat ke shasan ke dauran rajnitik nyay ko shiksha ko majboot karna se majboot kiya gaya.",
"explanation_hi": "दिल्ली सल्तनत के शासन के दौरान राजनीतिक न्याय को शिक्षा को मजबूत करने से मजबूत किया गया।"
},
{
"subject": "Indian History",
"topic": "Dilli Sultanat: Prashasan aur Samaj",
"question_en": "Kya Dilli Sultanat ke shasan ke dauran shiksha ko majboot kiya gaya?",
"question_hi": "क्या दिल्ली सल्तनत के शासन के दौरान शिक्षा को मजबूत किया गया?",
"A_en": "Haan, shiksha ko majboot kiya gaya",
"A_hi": "हाँ, शिक्षा को मजबूत किया गया",
"B_en": "Nahin, shiksha ko kamjor kiya gaya",
"B_hi": "नहीं, शिक्षा को कमजोर किया गया",
"C_en": "Haan, shiksha ko shikshakon ke kshetra se majboot kiya gaya",
"C_hi": "हाँ, शिक्षा को शिक्षकों के क्षेत्र से मजबूत किया गया",
"D_en": "Nahin, shiksha ko anya rajyaon ke saath sahyog se majboot kiya gaya",
"D_hi": "नहीं, शिक्षा को अन्य राज्यों के साथ सहयोग से मजबूत किया गया",
"answer": "A",
"explanation_en": "Dilli Sultanat ke shasan ke dauran shiksha ko majboot kiya gaya.",
"explanation_hi": "दिल्ली सल्तनत के शासन के दौरान शिक्षा को मजबूत किया गया।"
},
{
"subject": "Indian History",
"topic": "Dilli Sultanat: Prashasan aur Samaj",
"question_en": "Kya Dilli Sultanat ke shasan ke dauran rajnitik sthiti mein koi parivartan hua?",
"question_hi": "क्या दिल्ली सल्तनत के शासन के दौरान राजनीतिक स्थिति में कोई परिवर्तन हुआ?",
"A_en": "Haan, rajnitik sthiti mein parivartan hua",
"A_hi": "हाँ, राजनीतिक स्थिति में परिवर्तन हुआ",
"B_en": "Nahin, rajnitik sthiti mein koi parivartan nahin hua",
"B_hi": "नहीं, राजनीतिक स्थिति में कोई परिवर्तन नहीं हुआ",
"C_en": "Haan, rajnitik sthiti mein kai parivartan hua",
"C_hi": "हाँ, राजनीतिक स्थिति में कई परिवर्तन हुआ",
"D_en": "Nahin, rajnitik sthiti mein koi parivartan nahin hua",
"D_hi": "नहीं, राजनीतिक स्थिति में कोई परिवर्तन नहीं हुआ",
"answer": "C",
"explanation_en": "Dilli Sultanat ke shasan ke dauran rajnitik sthiti mein kai parivartan hua.",
"explanation_hi": "दिल्ली सल्तनत के शासन के दौरान राजनीतिक स्थिति में कई परिवर्तन हुआ।"
},
{
"subject": "Indian History",
"topic": "Dilli Sultanat: Prashasan aur Samaj",
"question_en": "Kya Dilli Sultanat ke shasan ke dauran samajik nyay ko majboot kiya gaya?",
"question_hi": "क्या दिल्ली सल्तनत के शासन के दौरान समाजिक न्याय को मजबूत किया गया?",
"A_en": "Haan, samajik nyay ko majboot kiya gaya",
"A_hi": "हाँ, समाजिक न्याय को मजबूत किया गया",
"B_en": "Nahin, samajik nyay ko kamjor kiya gaya",
"B_hi": "नहीं, समाजिक न्याय को कमजोर किया गया",
"C_en": "Haan, samajik nyay ko shiksha ko majboot karna se majboot kiya gaya",
"C_hi": "हाँ, समाजिक न्याय को शिक्षा को मजबूत करने से मजबूत किया गया",
"D_en": "Nahin, samajik nyay ko anya rajyaon ke saath sahyog se majboot kiya gaya",
"D_hi": "नहीं, समाजिक न्याय को अन्य राज्यों के साथ सहयोग से मजबूत किया गया",
"answer": "C",
"explanation_en": "Dilli Sultanat ke shasan ke dauran samajik nyay ko shiksha ko majboot karna se majboot kiya gaya.",
"explanation_hi": "दिल्ली सल्तनत के शासन के दौरान समाजिक न्याय को शिक्षा को मजबूत करने से मजबूत किया गया।"
}