[
{
"subject": "Indian History",
"topic": "Gandhian Andolan: Asahyog, Civil Disobedience, Quit India",
"question_en": "What was the main objective of the Non-Cooperation Movement launched by Mahatma Gandhi in 1920?",
"question_hi": "महात्मा गांधी द्वारा 1920 में शुरू किए गए असहयोग आंदोलन का मुख्य उद्देश्य क्या था?",
"A_en": "To achieve complete independence from British rule", "A_hi": "ब्रिटिश शासन से पूर्ण स्वतंत्रता प्राप्त करना",
"B_en": "To reform the British Indian administration", "B_hi": "ब्रिटिश भारतीय प्रशासन को सुधारना",
"C_en": "To promote national education and economic development", "C_hi": "राष्ट्रीय शिक्षा और आर्थिक विकास को बढ़ावा देना",
"D_en": "To establish a separate Hindu state", "D_hi": "एक अलग हिंदू राज्य स्थापित करना",
"answer": "A",
"explanation_en": "The main objective of the Non-Cooperation Movement was to achieve complete independence from British rule through non-violent means.",
"explanation_hi": "असहयोग आंदोलन का मुख्य उद्देश्य ब्रिटिश शासन से पूर्ण स्वतंत्रता प्राप्त करना था, जो अहिंसक तरीकों से किया जाना था।"
},
{
"subject": "Indian History",
"topic": "Gandhian Andolan: Asahyog, Civil Disobedience, Quit India",
"question_en": "Which of the following acts was passed by the British government in 1932, leading to widespread protests and civil disobedience?",
"question_hi": "निम्नलिखित कानून को 1932 में ब्रिटिश सरकार ने पारित किया, जिससे व्यापक प्रदर्शन और असहयोग आंदोलन हुआ?",
"A_en": "Government of India Act", "A_hi": "भारत शासन अधिनियम",
"B_en": "Indian Act", "B_hi": "भारतीय अधिनियम",
"C_en": "Communal Award", "C_hi": "सामुदायिक पुरस्कार",
"D_en": "Poona Pact", "D_hi": "पूना पैक्ट",
"answer": "C",
"explanation_en": "The Communal Award was passed by the British government in 1932, which led to widespread protests and civil disobedience as it awarded separate electorates to different communities.",
"explanation_hi": "सामुदायिक पुरस्कार को 1932 में ब्रिटिश सरकार ने पारित किया, जिससे व्यापक प्रदर्शन और असहयोग आंदोलन हुआ, क्योंकि इसमें अलग-अलग समुदायों को अलग-अलग निर्वाचन क्षेत्र प्रदान किए गए थे।"
},
{
"subject": "Indian History",
"topic": "Gandhian Andolan: Asahyog, Civil Disobedience, Quit India",
"question_en": "Who led the Quit India Movement launched by Mahatma Gandhi in 1942?",
"question_hi": "महात्मा गांधी द्वारा 1942 में शुरू किए गए छोड़ो आंदोलन का नेतृत्व किसने किया?",
"A_en": "Subhas Chandra Bose", "A_hi": "सुभाष चंद्र बोस",
"B_en": "Jawaharlal Nehru", "B_hi": "जवाहरलाल नेहरू",
"C_en": "Mahatma Gandhi", "C_hi": "महात्मा गांधी",
"D_en": "Lal Bahadur Shastri", "D_hi": "लाल बहादुर शास्त्री",
"answer": "C",
"explanation_en": "Mahatma Gandhi led the Quit India Movement launched in 1942, which was a call to Indians to fight for independence from British rule.",
"explanation_hi": "महात्मा गांधी ने 1942 में शुरू किए गए छोड़ो आंदोलन का नेतृत्व किया, जो भारतीयों को ब्रिटिश शासन से स्वतंत्रता प्राप्त करने के लिए लड़ने का आह्वान था।"
},
{
"subject": "Indian History",
"topic": "Gandhian Andolan: Asahyog, Civil Disobedience, Quit India",
"question_en": "The Salt March, also known as the Dandi March, was a key event in the Non-Cooperation Movement. Where did Mahatma Gandhi start his 24-day march?",
"question_hi": "असहयोग आंदोलन की एक प्रमुख घटना साल्ट मार्च या दंडी मार्च थी। महात्मा गांधी ने अपने 24 दिनों के मार्च को कहाँ से शुरू किया?",
"A_en": "Ahmedabad", "A_hi": "अहमदाबाद",
"B_en": "Satyagraha Ashram", "B_hi": "सत्याग्रह आश्रम",
"C_en": "Dandi", "C_hi": "दांडी",
"D_en": "Sabarmati Ashram", "D_hi": "साबरमती आश्रम",
"answer": "C",
"explanation_en": "Mahatma Gandhi started his 24-day march from Dandi, which was a key event in the Non-Cooperation Movement.",
"explanation_hi": "महात्मा गांधी ने अपने 24 दिनों के मार्च को दांडी से शुरू किया, जो असहयोग आंदोलन की एक प्रमुख घटना थी।"
},
{
"subject": "Indian History",
"topic": "Gandhian Andolan: Asahyog, Civil Disobedience, Quit India",
"question_en": "Which of the following was a major consequence of the Quit India Movement?",
"question_hi": "निम्नलिखित छोड़ो आंदोलन का एक प्रमुख परिणाम था?",
"A_en": "Establishment of the Indian National Congress", "A_hi": "भारतीय राष्ट्रीय कांग्रेस की स्थापना",
"B_en": "Widespread protests and civil disobedience", "B_hi": "व्यापक प्रदर्शन और असहयोग आंदोलन",
"C_en": "Freedom of India from British rule", "C_hi": "भारत की ब्रिटिश शासन से स्वतंत्रता",
"D_en": "Division of India into two separate countries", "D_hi": "भारत को दो अलग-अलग देशों में विभाजित करना",
"answer": "C",
"explanation_en": "The Quit India Movement led to widespread protests and civil disobedience, ultimately paving the way for India's independence from British rule.",
"explanation_hi": "छोड़ो आंदोलन ने व्यापक प्रदर्शन और असहयोग आंदोलन का नेतृत्व किया, जिससे अंततः भारत को ब्रिटिश शासन से स्वतंत्रता मिली।"
},
{
"subject": "Indian History",
"topic": "Gandhian Andolan: Asahyog, Civil Disobedience, Quit India",
"question_en": "Who was the British Viceroy of India during the Quit India Movement?",
"question_hi": "छोड़ो आंदोलन के दौरान भारत के ब्रिटिश वायसराय कौन थे?",
"A_en": "Lord Linlithgow", "A_hi": "लॉर्ड लिंलिथगो",
"B_en": "Lord Wavell", "B_hi": "लॉर्ड वेवेल",
"C_en": "Lord Mountbatten", "C_hi": "लॉर्ड माउंटबेटन",
"D_en": "Lord Canning", "D_hi": "लॉर्ड कैनिंग",
"answer": "A",
"explanation_en": "Lord Linlithgow was the British Viceroy of India during the Quit India Movement.",
"explanation_hi": "लॉर्ड लिंलिथगो छोड़ो आंदोलन के दौरान भारत के ब्रिटिश वायसराय थे।"
},
{
"subject": "Indian History",
"topic": "Gandhian Andolan: Asahyog, Civil Disobedience, Quit India",
"question_en": "The Salt Act of 1919 was a key factor in the Non-Cooperation Movement. What was the main provision of this act?",
"question_hi": "असहयोग आंदोलन की एक प्रमुख घटना 1919 का नमक अधिनियम था। इस अधिनियम का मुख्य प्रावधान क्या था?",
"A_en": "To impose a tax on salt", "A_hi": "नमक पर कर लगाना",
"B_en": "To prohibit the production of salt in India", "B_hi": "भारत में नमक के उत्पादन पर प्रतिबंध लगाना",
"C_en": "To regulate the salt trade in India", "C_hi": "भारत में नमक के व्यापार को नियंत्रित करना",
"D_en": "To allow Indians to produce salt for personal use", "D_hi": "भारतीयों को व्यक्तिगत उपयोग के लिए नमक उत्पादित करने की अनुमति देना",
"answer": "B",
"explanation_en": "The Salt Act of 1919 prohibited the production of salt in India, which was a key factor in the Non-Cooperation Movement.",
"explanation_hi": "1919 का नमक अधिनियम ने भारत में नमक के उत्पादन पर प्रतिबंध लगाया, जो असहयोग आंदोलन की एक प्रमुख घटना थी।"
},
{
"subject": "Indian History",
"topic": "Gandhian Andolan: Asahyog, Civil Disobedience, Quit India",
"question_en": "What was the name of the pact signed between Mahatma Gandhi and Dr. B.R. Ambedkar in 1932?",
"question_hi": "महात्मा गांधी और डॉ बीआर अम्बेडकर के बीच 1932 में हस्ताक्षर किए गए पैक्ट का नाम क्या था?",
"A_en": "Poona Pact", "A_hi": "पूना पैक्ट",
"B_en": "Gandhi-Ambedkar Pact", "B_hi": "गांधी-अंबेडकर पैक्ट",
"C_en": "Indian National Congress Pact", "C_hi": "भारतीय राष्ट्रीय कांग्रेस पैक्ट",
"D_en": "Salt March Pact", "D_hi": "नमक मार्च पैक्ट",
"answer": "A",
"explanation_en": "The Poona Pact was signed between Mahatma Gandhi and Dr. B.R. Ambedkar in 1932, which provided for representation of depressed classes in the legislature.",
"explanation_hi": "पूना पैक्ट 1932 में महात्मा गांधी और डॉ बीआर अम्बेडकर के बीच हस्ताक्षर किया गया, जो अवामी वर्गों के प्रतिनिधित्व के लिए विधायिका में प्रदान किया गया था।"
},
{
"subject": "Indian History",
"topic": "Gandhian Andolan: Asahyog, Civil Disobedience, Quit India",
"question_en": "Who was the leader of the Indian National Congress during the Quit India Movement?",
"question_hi": "छोड़ो आंदोलन के दौरान भारतीय राष्ट्रीय कांग्रेस का नेतृत्व किसने किया?",
"A_en": "Jawaharlal Nehru", "A_hi": "जवाहरलाल नेहरू",
"B_en": "Subhas Chandra Bose", "B_hi": "सुभाष चंद्र बोस",
"C_en": "Mahatma Gandhi", "C_hi": "महात्मा गांधी",
"D_en": "Lal Bahadur Shastri", "D_hi": "लाल बहादुर शास्त्री",
"answer": "C",
"explanation_en": "Mahatma Gandhi was the leader of the Indian National Congress during the Quit India Movement.",
"explanation_hi": "महात्मा गांधी छोड़ो आंदोलन के दौरान भारतीय राष्ट्रीय कांग्रेस का नेतृत्व किया।"
}
]