[
{
"subject": "Indian History",
"topic": "Sindhu Sabhyata: Visheshatayen, Nagar Yojana, Arthvyavastha",
"question_en": "Which of the following cities was not a major urban center of the Indus Valley Civilization?",
"question_hi": "निम्नलिखित में से कौन सा शहर सिंधु घाटी सभ्यता का एक प्रमुख शहरी केंद्र नहीं था?",
"A_en": "Mohenjo-Daro", "A_hi": "मोहनजोदड़ो",
"B_en": "Harappa", "B_hi": "हरप्पा",
"C_en": "Taxila", "C_hi": "तक्षशिला",
"D_en": "Varanasi", "D_hi": "वाराणसी",
"answer": "D",
"explanation_en": "Varanasi was not a major urban center of the Indus Valley Civilization. The major urban centers of the Indus Valley Civilization were Mohenjo-Daro, Harappa, Dholavira, and Kalibangan.",
"explanation_hi": "वाराणसी सिंधु घाटी सभ्यता का एक प्रमुख शहरी केंद्र नहीं था। सिंधु घाटी सभ्यता के प्रमुख शहरी केंद्र मोहनजोदड़ो, हरप्पा, ढोलावीरा और कालीबंगा थे।"
},
{
"subject": "Indian History",
"topic": "Sindhu Sabhyata: Visheshatayen, Nagar Yojana, Arthvyavastha",
"question_en": "What was the primary purpose of the advanced drainage system in Indus Valley Civilization cities?",
"question_hi": "सिंधु घाटी सभ्यता के शहरों में उन्नत जल निकासी प्रणाली का मुख्य उद्देश्य क्या था?",
"A_en": "To provide water for irrigation", "A_hi": "सिंचाई के लिए पानी प्रदान करना",
"B_en": "To supply water for drinking", "B_hi": "पीने के लिए पानी की आपूर्ति करना",
"C_en": "To maintain cleanliness and prevent flooding", "C_hi": "स्वच्छता बनाए रखना और बाढ़ को रोकना",
"D_en": "To facilitate trade and commerce", "D_hi": "व्यापार और वाणिज्य को सुविधाजनक बनाना",
"answer": "C",
"explanation_en": "The advanced drainage system in Indus Valley Civilization cities was primarily designed to maintain cleanliness and prevent flooding. This sophisticated system included covered drains, manholes, and sewage treatment.",
"explanation_hi": "सिंधु घाटी सभ्यता के शहरों में उन्नत जल निकासी प्रणाली मुख्य रूप से स्वच्छता बनाए रखने और बाढ़ को रोकने के लिए डिज़ाइन की गई थी। इस परिष्कृत प्रणाली में ढके हुए नाले, मैनहोल और सीवेज उपचार शामिल थे।"
},
{
"subject": "Indian History",
"topic": "Sindhu Sabhyata: Visheshatayen, Nagar Yojana, Arthvyavastha",
"question_en": "What was the main source of livelihood for the people of the Indus Valley Civilization?",
"question_hi": "सिंधु घाटी सभ्यता के लोगों की मुख्य आजीविका का स्रोत क्या था?",
"A_en": "Agriculture", "A_hi": "कृषि",
"B_en": "Trade and commerce", "B_hi": "व्यापार और वाणिज्य",
"C_en": "Industry and manufacturing", "C_hi": "उद्योग और विनिर्माण",
"D_en": "Services and tourism", "D_hi": "सेवाएं और पर्यटन",
"answer": "A",
"explanation_en": "The main source of livelihood for the people of the Indus Valley Civilization was agriculture. The fertile Indus Valley region was suitable for growing crops like wheat, barley, and cotton.",
"explanation_hi": "सिंधु घाटी सभ्यता के लोगों की मुख्य आजीविका का स्रोत कृषि थी। उपजाऊ सिंधु घाटी क्षेत्र गेहूं, जौ और कपास जैसी फसलों की खेती के लिए उपयुक्त था।"
},
{
"subject": "Indian History",
"topic": "Sindhu Sabhyata: Visheshatayen, Nagar Yojana, Arthvyavastha",
"question_en": "Which of the following is a characteristic of the urban planning of the Indus Valley Civilization?",
"question_hi": "निम्नलिखित में से कौन सा सिंधु घाटी सभ्यता के शहरी नियोजन की एक विशेषता है?",
"A_en": "Random and irregular layout", "A_hi": "यादृच्छिक और अनियमित लेआउट",
"B_en": "Well-planned and organized layout", "B_hi": "अच्छी तरह से योजनाबद्ध और संगठित लेआउट",
"C_en": "Narrow and winding streets", "C_hi": "संकीर्ण और घुमावदार सड़कें",
"D_en": "Lack of public buildings and infrastructure", "D_hi": "सार्वजनिक भवनों और बुनियादी ढांचे की कमी",
"answer": "B",
"explanation_en": "The urban planning of the Indus Valley Civilization is characterized by a well-planned and organized layout. The cities had a sophisticated system of wide, straight roads, and well-planned buildings.",
"explanation_hi": "सिंधु घाटी सभ्यता के शहरी नियोजन की एक विशेषता अच्छी तरह से योजनाबद्ध और संगठित लेआउट है। शहरों में चौड़ी, सीधी सड़कें और अच्छी तरह से योजनाबद्ध भवन थे।"
},
{
"subject": "Indian History",
"topic": "Sindhu Sabhyata: Visheshatayen, Nagar Yojana, Arthvyavastha",
"question_en": "What was the primary material used for building houses in the Indus Valley Civilization?",
"question_hi": "सिंधु घाटी सभ्यता में घरों के निर्माण के लिए मुख्य रूप से किस सामग्री का उपयोग किया गया था?",
"A_en": "Wood", "A_hi": "लकड़ी",
"B_en": "Stone", "B_hi": "पत्थर",
"C_en": "Burnt bricks", "C_hi": "सिंटर हुए ईंटें",
"D_en": "Thatched leaves", "D_hi": "सुखी पत्तियां",
"answer": "C",
"explanation_en": "The primary material used for building houses in the Indus Valley Civilization was burnt bricks. The bricks were made from clay and were kiln-fired to create a durable and long-lasting building material.",
"explanation_hi": "सिंधु घाटी सभ्यता में घरों के निर्माण के लिए मुख्य रूप से सिंटर हुए ईंटों का उपयोग किया गया था। ईंटें मिट्टी से बनाई गई थीं और एक टिकाऊ और लंबे समय तक चलने वाली निर्माण सामग्री बनाने के लिए भट्ठे में पकाई गई थीं।"
},
{
"subject": "Indian History",
"topic": "Sindhu Sabhyata: Visheshatayen, Nagar Yojana, Arthvyavastha",
"question_en": "Which of the following was a notable feature of the economy of the Indus Valley Civilization?",
"question_hi": "निम्नलिखित में से कौन सा सिंधु घाटी सभ्यता की अर्थव्यवस्था की एक उल्लेखनीय विशेषता थी?",
"A_en": "Extensive use of coins", "A_hi": "मुद्राओं का व्यापक उपयोग",
"B_en": "Highly developed banking system", "B_hi": "उच्च विकसित बैंकिंग प्रणाली",
"C_en": "Advanced irrigation system", "C_hi": "उन्नत सिंचाई प्रणाली",
"D_en": "Trade and commerce with distant regions", "D_hi": "दूर के क्षेत्रों के साथ व्यापार और वाणिज्य",
"answer": "D",
"explanation_en": "A notable feature of the economy of the Indus Valley Civilization was trade and commerce with distant regions. Archaeological evidence suggests that they had trade links with Mesopotamia, Egypt, and other regions.",
"explanation_hi": "सिंधु घाटी सभ्यता की अर्थव्यवस्था की एक उल्लेखनीय विशेषता दूर के क्षेत्रों के साथ व्यापार और वाणिज्य था। पुरातात्विक साक्ष्य सुझाते हैं कि उनके मेसोपोटेमिया, मिस्र और अन्य क्षेत्रों के साथ व्यापारिक संबंध थे।"
},
{
"subject": "Indian History",
"topic": "Sindhu Sabhyata: Visheshatayen, Nagar Yojana, Arthvyavastha",
"question_en": "What was the significance of the discovery of the Indus Valley Civilization?",
"question_hi": "सिंधु घाटी सभ्यता की खोज का क्या महत्व था?",
"A_en": "It proved the existence of a powerful empire", "A_hi": "इसने एक शक्तिशाली साम्राज्य के अस्तित्व को साबित किया",
"B_en": "It provided evidence of India's rich cultural heritage", "B_hi": "इसने भारत की समृद्ध सांस्कृतिक विरासत के प्रमाण प्रदान किए",
"C_en": "It challenged the Aryan invasion theory", "C_hi": "इसने आर्यन आक्रमण सिद्धांत को चुनौती दी",
"D_en": "It showed that India was not a land of ancient civilizations", "D_hi": "इसने दिखाया कि भारत प्राचीन सभ्यताओं की भूमि नहीं था",
"answer": "C",
"explanation_en": "The discovery of the Indus Valley Civilization challenged the Aryan invasion theory, which had been widely accepted by historians. The civilization's existence before the Vedic period proved that India had a rich cultural heritage that predated the Vedic era.",
"explanation_hi": "सिंधु घाटी सभ्यता की खोज ने आर्यन आक्रमण सिद्धांत को चुनौती दी, जो इतिहासकारों द्वारा व्यापक रूप से स्वीकार किया गया था। सभ्यता का अस्तित्व वेदिक काल से पहले सिद्ध हुआ कि भारत में एक समृद्ध सांस्कृतिक विरासत थी जो वेदिक युग से पहले की थी।"
},
{
"subject": "Indian History",
"topic": "Sindhu Sabhyata: Visheshatayen, Nagar Yojana, Arthvyavastha",
"question_en": "Which of the following was a distinctive feature of the Indus Valley Civilization's writing system?",
"question_hi": "निम्नलिखित में से कौन सा सिंधु घाटी सभ्यता की लेखन प्रणाली की एक विशिष्ट विशेषता थी?",
"A_en": "Use of alphabets", "A_hi": "अक्षरों का उपयोग",
"B_en": "Use of pictograms and logograms", "B_hi": "चित्रलेख और ध्वन्यर्थक चिन्हों का उपयोग",
"C_en": "Use of hieroglyphics", "C_hi": "चित्रलिपि का उपयोग",
"D_en": "Use of numerical symbols", "D_hi": "संख्यात्मक प्रतीकों का उपयोग",
"answer": "B",
"explanation_en": "The Indus Valley Civilization's writing system was characterized by the use of pictograms and logograms. The script consisted of over 400 symbols, but it has not been fully deciphered.",
"explanation_hi": "सिंधु घाटी सभ्यता की लेखन प्रणाली चित्रलेख और ध्वन्यर्थक चिन्हों के उपयोग की विशेषता थी। लिपि में 400 से अधिक प्रतीक शामिल थे, लेकिन इसे पूरी तरह से समझा नहीं गया है।"
},
{
"subject": "Indian History",
"topic": "Sindhu Sabhyata: Visheshatayen, Nagar Yojana, Arthvyavastha",
"question_en": "What was the primary purpose of the Great Bath in Mohenjo-Daro?",
"question_hi": "मोहनजोदड़ो में महान स्नानागार का मुख्य उद्देश्य क्या था?",
"A_en": "For ritual bathing and ceremonial purposes", "A_hi": "संस्कारिक स्नान और औपचारिक उद्देश्यों के लिए",
"B_en": "For providing water for irrigation", "A_hi": "सिंचाई के लिए पानी प्रदान करने के लिए",
"C_en": "For storing water for drinking", "A_hi": "पीने के लिए पानी संग्रहीत करने के लिए",
"D_en": "For public bathing and hygiene", "A_hi": "सार्वजनिक स्नान और स्वच्छता के लिए",
"answer": "A",
"explanation_en": "The Great Bath in Mohenjo-Daro was primarily used for ritual bathing and ceremonial purposes. It was a large, well-constructed bath that was likely used for sacred rituals and ceremonies.",
"explanation_hi": "मोहनजोदड़ो में महान स्नानागार मुख्य रूप से संस्कारिक स्नान और औपचारिक उद्देश्यों के लिए उपयोग किया जाता था। यह एक बड़ा, अच्छी तरह से बनाया गया स्नानागार था जो संभवतः पवित्र अनुष्ठानों और समारोहों के लिए उपयोग किया जाता था।"
}
]