[
{
"subject": "Indian History",
"topic": "Vedic Kal: Samajik, Rajnaitik aur Dharmik Jeevan",
"question_en": "What was the primary occupation of people during the Vedic period?",
"question_hi": "वैदिक काल में लोगों का मुख्य व्यवसाय क्या था?",
"A_en": "Agriculture", "A_hi": "कृषि",
"B_en": "Trade", "B_hi": "व्यापार",
"C_en": "Hunting", "C_hi": "शिकार",
"D_en": "Pastoralism", "D_hi": "पशुपालन",
"answer": "A",
"explanation_en": "The primary occupation of people during the Vedic period was agriculture. The Vedic people were skilled in irrigation and used various tools for farming.",
"explanation_hi": "वैदिक काल में लोगों का मुख्य व्यवसाय कृषि था। वैदिक लोग सिंचाई में कुशल थे और उन्होंने खेती के लिए विभिन्न औजारों का उपयोग किया।"
},
{
"subject": "Indian History",
"topic": "Vedic Kal: Samajik, Rajnaitik aur Dharmik Jeevan",
"question_en": "What was the social status of women during the Vedic period?",
"question_hi": "वैदिक काल में महिलाओं की सामाजिक स्थिति क्या थी?",
"A_en": "High", "A_hi": "उच्च",
"B_en": "Low", "B_hi": "निम्न",
"C_en": "Equal to men", "C_hi": "पुरुषों के बराबर",
"D_en": "Restricted to household work", "D_hi": "घरेलू कार्यों तक सीमित",
"answer": "D",
"explanation_en": "During the Vedic period, women's social status was restricted to household work. They were not allowed to participate in public life and were confined to domestic duties.",
"explanation_hi": "वैदिक काल में महिलाओं की सामाजिक स्थिति घरेलू कार्यों तक सीमित थी। उन्हें सार्वजनिक जीवन में भाग लेने की अनुमति नहीं थी और वे घरेलू कार्यों तक सीमित थीं।"
},
{
"subject": "Indian History",
"topic": "Vedic Kal: Samajik, Rajnaitik aur Dharmik Jeevan",
"question_en": "What was the name of the Vedic king who performed the Ashvamedha yajna?",
"question_hi": "वैदिक राजा जिसने अश्वमेध यज्ञ किया था, उसका नाम क्या था?",
"A_en": "Janaka", "A_hi": "जनक",
"B_en": "Ashvapati", "A_hi": "अश्वपति",
"C_en": "Sagara", "A_hi": "सगर",
"D_en": "Pajji", "A_hi": "पज्जि",
"answer": "C",
"explanation_en": "The Vedic king who performed the Ashvamedha yajna was Sagara. He was a powerful king who ruled over a vast kingdom.",
"explanation_hi": "वैदिक राजा जिसने अश्वमेध यज्ञ किया था, वह सगर था। वह एक शक्तिशाली राजा था जिसने एक विशाल राज्य पर शासन किया।"
},
{
"subject": "Indian History",
"topic": "Vedic Kal: Samajik, Rajnaitik aur Dharmik Jeevan",
"question_en": "What was the main deity worshipped during the Early Vedic period?",
"question_hi": "प्रारंभिक वैदिक काल में मुख्य रूप से किस देवता की पूजा की जाती थी?",
"A_en": "Indra", "A_hi": "इंद्र",
"B_en": "Agni", "A_hi": "अग्नि",
"C_en": "Varuna", "A_hi": "वरुण",
"D_en": "Vishnu", "A_hi": "विष्णु",
"answer": "A",
"explanation_en": "The main deity worshipped during the Early Vedic period was Indra. He was considered the king of the gods and the god of thunder and lightning.",
"explanation_hi": "प्रारंभिक वैदिक काल में मुख्य रूप से इंद्र देवता की पूजा की जाती थी। उन्हें देवताओं का राजा और बिजली के देवता माना जाता था।"
},
{
"subject": "Indian History",
"topic": "Vedic Kal: Samajik, Rajnaitik aur Dharmik Jeevan",
"question_en": "What was the name of the Vedic text that deals with the rituals and sacrifices?",
"question_hi": "वैदिक ग्रंथ जिसका संबंध अनुष्ठानों और बलियों से है, उसका नाम क्या था?",
"A_en": "Brahmanas", "A_hi": "ब्राह्मण",
"B_en": "Upanishads", "A_hi": "उपनिषद",
"C_en": "Puranas", "A_hi": "पुराण",
"D_en": "Vedas", "A_hi": "वेद",
"answer": "A",
"explanation_en": "The Vedic text that deals with the rituals and sacrifices is the Brahmanas. They are a part of the Vedas and provide detailed descriptions of the rituals and sacrifices.",
"explanation_hi": "वैदिक ग्रंथ जिसका संबंध अनुष्ठानों और बलियों से है, वह ब्राह्मण है। वे वेदों का एक हिस्सा हैं और अनुष्ठानों और बलियों के विस्तृत विवरण प्रदान करते हैं।"
},
{
"subject": "Indian History",
"topic": "Vedic Kal: Samajik, Rajnaitik aur Dharmik Jeevan",
"question_en": "What was the position of the Rajan or king during the Vedic period?",
"question_hi": "वैदिक काल में राजन या राजा की स्थिति क्या थी?",
"A_en": "Head of the family", "A_hi": "परिवार का मुखिया",
"B_en": "Head of the village", "A_hi": "गांव का मुखिया",
"C_en": "Head of the state", "A_hi": "राज्य का मुखिया",
"D_en": "Head of the tribe", "A_hi": "जनजाति का मुखिया",
"answer": "D",
"explanation_en": "During the Vedic period, the Rajan or king was the head of the tribe. He was responsible for protecting the tribe and its members.",
"explanation_hi": "वैदिक काल में राजन या राजा जनजाति का मुखिया था। वह जनजाति और उसके सदस्यों की रक्षा के लिए जिम्मेदार था।"
},
{
"subject": "Indian History",
"topic": "Vedic Kal: Samajik, Rajnaitik aur Dharmik Jeevan",
"question_en": "What was the main source of livelihood for the people during the Vedic period?",
"question_hi": "वैदिक काल में लोगों की मुख्य आजीविका क्या थी?",
"A_en": "Trade and commerce", "A_hi": "व्यापार और वाणिज्य",
"B_en": "Agriculture and pastoralism", "A_hi": "कृषि और पशुपालन",
"C_en": "Hunting and gathering", "A_hi": "शिकार और संग्रहण",
"D_en": "Industry and manufacturing", "A_hi": "उद्योग और विनिर्माण",
"answer": "B",
"explanation_en": "The main source of livelihood for the people during the Vedic period was agriculture and pastoralism. The Vedic people were skilled in farming and cattle-rearing.",
"explanation_hi": "वैदिक काल में लोगों की मुख्य आजीविका कृषि और पशुपालन थी। वैदिक लोग खेती और पशुपालन में कुशल थे।"
},
{
"subject": "Indian History",
"topic": "Vedic Kal: Samajik, Rajnaitik aur Dharmik Jeevan",
"question_en": "What was the role of the Brahmins during the Vedic period?",
"question_hi": "वैदिक काल में ब्राह्मणों की भूमिका क्या थी?",
"A_en": "Warriors and rulers", "A_hi": "योद्धा और शासक",
"B_en": "Traders and merchants", "A_hi": "व्यापारी और merchant",
"C_en": "Priests and scholars", "A_hi": "पुरोहित और विद्वान",
"D_en": "Labourers and artisans", "A_hi": "श्रमिक और कारीगर",
"answer": "C",
"explanation_en": "During the Vedic period, the Brahmins played the role of priests and scholars. They were responsible for performing rituals and sacrifices.",
"explanation_hi": "वैदिक काल में ब्राह्मणों की भूमिका पुरोहित और विद्वान की थी। वे अनुष्ठानों और बलियों के लिए जिम्मेदार थे।"
},
{
"subject": "Indian History",
"topic": "Vedic Kal: Samajik, Rajnaitik aur Dharmik Jeevan",
"question_en": "What was the name of the Vedic assembly that advised the king?",
"question_hi": "वैदिक सभा जिसका राजा को सलाह देती थी, उसका नाम क्या था?",
"A_en": "Sabha", "A_hi": "सभा",
"B_en": "Samiti", "A_hi": " समिति",
"C_en": "Janapada", "A_hi": "जनपद",
"D_en": "Rajya", "A_hi": "राज्य",
"answer": "B",
"explanation_en": "The Vedic assembly that advised the king was the Samiti. It was a gathering of the people who advised the king on important matters.",
"explanation_hi": "वैदिक सभा जिसका राजा को सलाह देती थी, वह समिति थी। यह लोगों का एक समूह था जो राजा को महत्वपूर्ण मामलों पर सलाह देता था।"
},
{
"subject": "Indian History",
"topic": "Vedic Kal: Samajik, Rajnaitik aur Dharmik Jeevan",
"question_en": "What was the significance of the Vedic ritual of Soma?",
"question_hi": "सोम वैदिक अनुष्ठान का क्या महत्व था?",
"A_en": "To purify the soul", "A_hi": "आत्मा को शुद्ध करने के लिए",
"B_en": "To ensure fertility", "A_hi": "उर्वरता सुनिश्चित करने के लिए",
"C_en": "To promote spiritual growth", "A_hi": "आध्यात्मिक विकास को बढ़ावा देने के लिए",
"D_en": "To appease the gods", "A_hi": "देवताओं को प्रसन्न करने के लिए",
"answer": "D",
"explanation_en": "The Vedic ritual of Soma was performed to appease the gods. Soma was a sacred drink that was offered to the gods to seek their blessings.",
"explanation_hi": "सोम वैदिक अनुष्ठान देवताओं को प्रसन्न करने के लिए किया जाता था। सोम एक पवित्र पेय था जो देवताओं को उनकी कृपा प्राप्त करने के लिए चढ़ाया जाता था।"
} 
]