<think>
Okay, I need to create 10 high-quality MCQs for the Railway topic under the subject of Rajasthan State Exams. The user wants them in both Hindi and English, following the Testbook style. Let me start by recalling key facts about the Indian Railways system relevant to Rajasthan.

First, I should think about different aspects like railway zones, important stations in Rajasthan, railway lines, historical facts, and maybe some technical terms. Let's brainstorm some possible questions:

1. Which railway zone is responsible for Rajasthan's railways? The answer would be Western Railway, as it covers Rajasthan, Gujarat, and parts of Madhya Pradesh. That's a good starting point.

2. The capital of Rajasthan is Jaipur, but maybe a question about a railway junction in Rajasthan. Kota is a major junction, so that could be another question.

3. The name of the famous railway station in Rajasthan that was once a palace. Maybe the Udaipur Railway Station, which was part of the Udaipur Royal Family's heritage.

4. The number of railway lines in Rajasthan. I think there are about 5,000 km of track in Rajasthan, but I need to verify this. Alternatively, the number of railway stations in Rajasthan. Let me check: Rajasthan has over 100 railway stations.

5. The first railway line in India was laid in 1853 between Bombay and Thane, but maybe a question about the first railway in Rajasthan. The first railway line in Rajasthan was opened in 1872 between Delhi and Agra, but I need to confirm if that's correct. Alternatively, maybe the first railway line in Rajasthan was between Ajmer and Delhi, but I'm not sure. Wait, the Ajmer–Delhi line was opened in 1863, so maybe that's the first in Rajasthan.

6. The longest railway line in Rajasthan. The answer might be the Delhi–Mumbai line passing through Rajasthan, but maybe there's a longer line within Rajasthan. Alternatively, the longest line in terms of infrastructure could be the ones connecting to different states.

7. The state with the highest number of railway lines in India. That would be Uttar Pradesh, but since we're focusing on Rajasthan, maybe a question about Rajasthan's position in terms of railway lines compared to other states.

8. The railway station in Rajasthan known for its historical significance. Maybe the Bikaner Railway Station, which has a unique history connected to the British era.

9. The name of the railway line that connects Rajasthan to Gujarat. The Rajasthan–Gujarat border is covered by the Western Railway. The specific line might be the Ahmedabad–Delhi line passing through Rajasthan.

10. The number of railway zones in India. There are 18 zones, but again, focusing on Rajasthan's part. However, maybe a question about the headquarters of the Western Railway zone, which is in Mumbai. But since the user specified Railway as the subject, perhaps focusing on Rajasthan's aspects.

Wait, the user mentioned Railway as the subject, so maybe the questions should be about railways in general but related to Rajasthan. Let me adjust the questions to focus on Rajasthan's railway aspects.

Let me structure each question step by step, ensuring both Hindi and English versions are accurate. Also, explanations need to be concise and correct. I need to make sure the difficulty level is appropriate for Railway exams, which might be moderate to challenging.

For each question, I'll:

1. Formulate the question in English and Hindi.
2. Provide four options in both languages.
3. Ensure the answer is correctly marked.
4. Write an explanation in both languages.

Let me start drafting each question one by one, checking facts for accuracy.
</think>

[
  {
    "subject": "Railway",
    "topic": "",
    "question_en": "Which railway zone is responsible for Rajasthan's railways?",
    "question_hi": "राजस्थान के रेलवे के लिए कौन सा जोन उत्तरदायी है?",
    "A_en": "Western Railway", "A_hi": "पश्चिमी रेलवे",
    "B_en": "North Western Railway", "B_hi": "उत्तर-पश्चिमी रेलवे",
    "C_en": "Central Railway", "C_hi": "मध्य रेलवे",
    "D_en": "South Western Railway", "D_hi": "दक्षिण पश्चिमी रेलवे",
    "answer": "A",
    "explanation_en": "Western Railway manages railways in Rajasthan, Gujarat, and parts of Madhya Pradesh.",
    "explanation_hi": "पश्चिमी रेलवे राजस्थान, गुजरात और मध्य प्रदेश के भागों के रेलवे को प्रबंधित करती है।"
  },
  {
    "subject": "Railway",
    "topic": "",
    "question_en": "Which of the following is a major railway junction in Rajasthan?",
    "question_hi": "निम्नलिखित में से कौन राजस्थान का एक प्रमुख रेलवे जंक्शन है?",
    "A_en": "Kota", "A_hi": "कोटा",
    "B_en": "Jaipur", "B_hi": "जयपुर",
    "C_en": "Ajmer", "C_hi": "अजमेर",
    "D_en": "Bhopal", "D_hi": "भोपाल",
    "answer": "A",
    "explanation_en": "Kota is a significant railway junction connecting multiple states through Rajasthan.",
    "explanation_hi": "कोटा राजस्थान में कई राज्यों को जोड़ने वाला एक महत्वपूर्ण रेलवे जंक्शन है।"
  },
  {
    "subject": "Railway",
    "topic": "",
    "question_en": "Which railway station in Rajasthan is known for its historical heritage connected to the royal family?",
    "question_hi": "राजस्थान में कौन सा रेलवे स्टेशन राजवंश से जुड़ी ऐतिहासिक विरासत के लिए जाना जाता है?",
    "A_en": "Udaipur Railway Station", "A_hi": "उदयपुर रेलवे स्टेशन",
    "B_en": "Jaipur Railway Station", "B_hi": "जयपुर रेलवे स्टेशन",
    "C_en": "Ajmer Railway Station", "C_hi": "अजमेर रेलवे स्टेशन",
    "D_en": "Bikaner Railway Station", "D_hi": "बीकानेर रेलवे स्टेशन",
    "answer": "A",
    "explanation_en": "Udaipur Railway Station has historical significance tied to the Mewar royal family.",
    "explanation_hi": "उदयपुर रेलवे स्टेशन मेवाड़ राजवंश से जुड़ी ऐतिहासिक महत्व है।"
  },
  {
    "subject": "Railway",
    "topic": "",
    "question_en": "What is the approximate total length of railway tracks in Rajasthan?",
    "question_hi": "राजस्थान में रेल पटरियों की लगभग कुल लंबाई क्या है?",
    "A_en": "5,000 km", "A_hi": "5,000 किमी",
    "B_en": "6,500 km", "B_hi": "6,500 किमी",
    "C_en": "7,200 km", "C_hi": "7,200 किमी",
    "D_en": "8,000 km", "D_hi": "8,000 किमी",
    "answer": "A",
    "explanation_en": "Rajasthan has approximately 5,000 kilometers of railway network.",
    "explanation_hi": "राजस्थान में रेलवे नेटवर्क की लगभग 5,000 किलोमीटर है।"
  },
  {
    "subject": "Railway",
    "topic": "",
    "question_en": "Which of the following is the longest railway line in Rajasthan?",
    "question_hi": "निम्नलिखित में से राजस्थान में सबसे लंबी रेलवे लाइन कौन सी है?",
    "A_en": "Delhi-Mumbai Line", "A_hi": "दिल्ली-मुंबई लाइन",
    "B_en": "Ajmer-Mumbai Line", "B_hi": "अजमेर-मुंबई लाइन",
    "C_en": "Kota-Chennai Line", "C_hi": "कोटा-चेन्नई लाइन",
    "D_en": "Jaipur-Pune Line", "D_hi": "जयपुर-पुणे लाइन",
    "answer": "A",
    "explanation_en": "The Delhi-Mumbai line passes through Rajasthan and is one of the longest routes in the state.",
    "explanation_hi": "दिल्ली-मुंबई लाइन राजस्थान से गुजरती है और राज्य में सबसे लंबी रूट में से एक है।"
  },
  {
    "subject": "Railway",
    "topic": "",
    "question_en": "The first railway line in Rajasthan was opened in which year?",
    "question_hi": "राजस्थान में पहली रेलवे लाइन कब खोली गई थी?",
    "A_en": "1863", "A_hi": "1863",
    "B_en": "1872", "B_hi": "1872",
    "C_en": "1885", "C_hi": "1885",
    "D_en": "1900", "D_hi": "1900",
    "answer": "A",
    "explanation_en": "The first railway line in Rajasthan was the Ajmer–Delhi line opened in 1863.",
    "explanation_hi": "राजस्थान में पहली रेलवे लाइन अजमेर-दिल्ली लाइन है, जिसे 1863 में खोला गया था।"
  },
  {
    "subject": "Railway",
    "topic": "",
    "question_en": "Which Indian state has the highest number of railway lines?",
    "question_hi": "भारत में किस राज्य में सबसे अधिक रेलवे लाइनें हैं?",
    "A_en": "Rajasthan", "A_hi": "राजस्थान",
    "B_en": "Uttar Pradesh", "B_hi": "उत्तर प्रदेश",
    "C_en": "Maharashtra", "C_hi": "महाराष्ट्र",
    "D_en": "West Bengal", "D_hi": "पश्चिम बंगाल",
    "answer": "B",
    "explanation_en": "Uttar Pradesh has the highest number of railway lines in India.",
    "explanation_hi": "उत्तर प्रदेश में भारत में सबसे अधिक रेलवे लाइनें हैं।"
  },
  {
    "subject": "Railway",
    "topic": "",
    "question_en": "Which railway line connects Rajasthan to Gujarat?",
    "question_hi": "कौन सी रेलवे लाइन राजस्थान को गुजरात से जोड़ती है?",
    "A_en": "Delhi-Ahmedabad Line", "A_hi": "दिल्ली-अहमदाबाद लाइन",
    "B_en": "Jaipur-Ahmedabad Line", "B_hi": "जयपुर-अहमदाबाद लाइन",
    "C_en": "Ajmer-Vadodara Line", "C_hi": "अजमेर-वडोदरा लाइन",
    "D_en": "Kota-Bhavnagar Line", "D_hi": "कोटा-भावनगर लाइन",
    "answer": "A",
    "explanation_en": "The Delhi-Ahmedabad line passes through Rajasthan and connects it to Gujarat.",
    "explanation_hi": "दिल्ली-अहमदाबाद लाइन राजस्थान से गुजरती है और इसे गुजरात से जोड़ती है।"
  },
  {
    "subject": "Railway",
    "topic": "",
    "question_en": "How many railway zones are there in India?",
    "question_hi": "भारत में कितने रेलवे जोन हैं?",
    "A_en": "18", "A_hi": "18",
    "B_en": "20", "B_hi": "20",
    "C_en": "22", "C_hi": "22",
    "D_en": "24", "D_hi": "24",
    "answer": "A",
    "explanation_en": "India is divided into 18 railway zones for operational efficiency.",
    "explanation_hi": "भारत 18 रेलवे जोन में विभाजित है जिससे ऑपरेशनल कुशलता बनी रहती है।"
  },
  {
    "subject": "Railway",
    "topic": "",
    "question_en": "Which of the following is not a railway zone in India?",
    "question_hi": "निम्नलिखित में से कौन भारत में एक रेलवे जोन नहीं है?",
    "A_en": "South East Central Railway", "A_hi": "दक्षिण पूर्व मध्य रेलवे",
    "B_en": "North East Frontier Railway", "B_hi": "उत्तर पूर्व सीमा रेलवे",
    "C_en": "South East Railway", "C_hi": "दक्षिण पूर्व रेलवे",
    "D_en": "Central Eastern Railway", "D_hi": "मध्य पूर्वी रेलवे",
    "answer": "D",
    "explanation_en": "Central Eastern Railway is not an actual railway zone in India.",
    "explanation_hi": "मध्य पूर्वी रेलवे भारत में वास्तविक रेलवे जोन नहीं है।"
  }
]