<think>
Okay, let's tackle this task. The user wants me to create 10 high-quality MCQs on India Geography, specifically for Rajasthan State Exams, SSC, and Railway exams. First, I need to make sure the topics cover relevant areas of India's geography. Since the example provided was about Rajasthan's capital, maybe the user expects questions on major geographical features of India.

Wait, the Topic field in the example is empty. So maybe I should cover various topics like rivers, states, mountains, climate zones, etc. Let me brainstorm some key areas. India's geography includes the Himalayas in the north, the Thar Desert in the west, major rivers like Ganges and Brahmaputra, the Deccan Plateau, major crops, and important cities. Also, considering the exams mentioned, maybe some questions about mineral resources, important dams, or railway routes.

I need to ensure that the questions are of medium difficulty. The example had a simple question about the capital. Let's think of a mix of straightforward and slightly more complex questions. For example, a question on the longest river in India, or which state has the largest area. Also, some questions about geographical features specific to certain states.

Each question must have the subject as "India Geography" and the topic as per the user's instruction. Wait, the user left the topic empty in the example, so maybe I should leave it empty as well, or maybe fill it with relevant topics like "Major Rivers", "Deserts", etc. Let me check the example again. The example's topic field is empty, so maybe I should leave it empty for all questions.

Now, for the structure: each MCQ requires the question in both Hindi and English, options in both languages, the correct answer, and explanations in both languages. The JSON structure must be strict, and the output should be in raw JSON without any extra text.

Let me start drafting the first question. Maybe about the largest state in India by area. The answer is Rajasthan. Then another on the longest river, which is Ganges. Next, the highest peak in India, Kanchenjunga. Then, the largest desert in India, Thar Desert. Another question on the major river systems like Ganges, Brahmaputra, Indus. Then, the state with the longest coastline, Gujarat. Next, the major mountain ranges like the Himalayas. Then, the largest plateau, Deccan Plateau. Another question on the major crop in Haryana, wheat. Lastly, the largest lake in India, Chilika Lake.

Wait, need to verify each fact. For example, the largest state by area is Rajasthan. The longest river in India is Ganges, but sometimes there's debate between Ganges and Brahmaputra. Let me confirm. The Ganges is longer than the Brahmaputra, so it's safer to use Ganges. The highest peak in India is Kanchenjunga, not Everest, which is in Nepal. Thar Desert is indeed in Rajasthan. Largest desert in India. Gujarat has the longest coastline. Deccan Plateau is the largest plateau. Chilika Lake is the largest lagoon in India.

For each question, the options should be plausible. For example, for the largest state, options could be Rajasthan, Madhya Pradesh, Maharashtra, Tamil Nadu. For the longest river, Ganges, Yamuna, Godavari, Brahmaputra. For the highest peak, Kanchenjunga, Nanda Devi, Annapurna, Everest. For the largest desert, Thar, Rann of Kutch, Ladakh, Aravallis. For the longest coastline, Gujarat, Kerala, Tamil Nadu, Andhra Pradesh. For the mountain ranges, Himalayas, Vindhyas, Satpuras, Aravallis. Largest plateau, Deccan, Malwa, Chota Nagpur, Plateau of Tibet. Major crop in Haryana, wheat, rice, cotton, sugarcane. Largest lake, Chilika, Wular, Dal, Sambhar.

Now, translating all the options into Hindi. For example, Rajasthan is "राजस्थान", Ganges is "गंगा", Kanchenjunga is "कांचनजंघा", Thar Desert is "थार मरुस्थल", Gujarat is "गुजरात", Himalayas is "हिमालय", Deccan Plateau is "दक्कन पठार", Wheat is "गेहूं", Chilika Lake is "चिल्का झील".

I need to ensure that the explanations are concise and accurate. For example, for the largest state, the explanation would state that Rajasthan is the largest state by area. For the longest river, that the Ganges is the longest in India.

Let me check for any possible errors. For example, the Rann of Kutch is a desert, but it's not as large as the Thar Desert. The largest lake in India is Chilika Lake. The highest peak is Kanchenjunga. The largest plateau is the Deccan Plateau.

Now, compiling all these into the JSON structure as per the example. Each question should follow the format with subject, topic (empty), question in both languages, options, answer, and explanations in both languages.
</think>

```json
[
    {
        "subject": "India Geography",
        "topic": "",
        "question_en": "Which state is the largest in India by area?",
        "question_hi": "क्षेत्रफल के हिसाब से भारत का सबसे बड़ा राज्य कौन-सा है?",
        "A_en": "Rajasthan", "A_hi": "राजस्थान",
        "B_en": "Madhya Pradesh", "B_hi": "मध्य प्रदेश",
        "C_en": "Maharashtra", "C_hi": "महाराष्ट्र",
        "D_en": "Tamil Nadu", "D_hi": "तमिल नाडु",
        "answer": "A",
        "explanation_en": "Rajasthan is the largest state in India by area.",
        "explanation_hi": "राजस्थान क्षेत्रफल के हिसाब से भारत का सबसे बड़ा राज्य है।"
    },
    {
        "subject": "India Geography",
        "topic": "",
        "question_en": "Which river is the longest in India?",
        "question_hi": "भारत की सबसे लंबी नदी कौन-सी है?",
        "A_en": "Ganges", "A_hi": "गंगा",
        "B_en": "Yamuna", "B_hi": "यमुना",
        "C_en": "Godavari", "C_hi": "गोदावरी",
        "D_en": "Brahmaputra", "D_hi": "ब्रह्मपुत्रा",
        "answer": "A",
        "explanation_en": "The Ganges is the longest river in India.",
        "explanation_hi": "गंगा भारत की सबसे लंबी नदी है।"
    },
    {
        "subject": "India Geography",
        "topic": "",
        "question_en": "Which mountain peak is the highest in India?",
        "question_hi": "भारत में सबसे ऊँची पर्वत चोटी कौन-सी है?",
        "A_en": "Kanchenjunga", "A_hi": "कांचनजंघा",
        "B_en": "Nanda Devi", "B_hi": "नंदा देवी",
        "C_en": "Annapurna", "C_hi": "अन्नपूर्णा",
        "D_en": "Everest", "D_hi": "एवरेस्ट",
        "answer": "A",
        "explanation_en": "Kanchenjunga is the highest peak in India.",
        "explanation_hi": "कांचनजंघा भारत की सबसे ऊँची पर्वत चोटी है।"
    },
    {
        "subject": "India Geography",
        "topic": "",
        "question_en": "Which desert is the largest in India?",
        "question_hi": "भारत में सबसे बड़ा मरुस्थल कौन-सा है?",
        "A_en": "Thar Desert", "A_hi": "थार मरुस्थल",
        "B_en": "Rann of Kutch", "B_hi": "कच्छ की रण",
        "C_en": "Ladakh", "C_hi": "लद्दाख",
        "D_en": "Aravallis", "D_hi": "अरावली",
        "answer": "A",
        "explanation_en": "The Thar Desert is the largest desert in India.",
        "explanation_hi": "थार मरुस्थल भारत का सबसे बड़ा मरुस्थल है।"
    },
    {
        "subject": "India Geography",
        "topic": "",
        "question_en": "Which state has the longest coastline in India?",
        "question_hi": "भारत में सबसे लंबा तटरेखा वाला राज्य कौन-सा है?",
        "A_en": "Gujarat", "A_hi": "गुजरात",
        "B_en": "Kerala", "B_hi": "केरला",
        "C_en": "Tamil Nadu", "C_hi": "तमिल नाडु",
        "D_en": "Andhra Pradesh", "D_hi": "आंध्र प्रदेश",
        "answer": "A",
        "explanation_en": "Gujarat has the longest coastline in India.",
        "explanation_hi": "गुजरात में भारत की सबसे लंबी तटरेखा है।"
    },
    {
        "subject": "India Geography",
        "topic": "",
        "question_en": "Which mountain range is the most prominent in India?",
        "question_hi": "भारत में सबसे प्रमुख पर्वत श्रेणी कौन-सी है?",
        "A_en": "Himalayas", "A_hi": "हिमालय",
        "B_en": "Vindhya", "B_hi": "विंध्या",
        "C_en": "Satpura", "C_hi": "सतपुड़ा",
        "D_en": "Aravallis", "D_hi": "अरावली",
        "answer": "A",
        "explanation_en": "The Himalayas are the most prominent mountain range in India.",
        "explanation_hi": "हिमालय भारत में सबसे प्रमुख पर्वत श्रेणी है।"
    },
    {
        "subject": "India Geography",
        "topic": "",
        "question_en": "Which plateau is the largest in India?",
        "question_hi": "भारत में सबसे बड़ा पठार कौन-सा है?",
        "A_en": "Deccan Plateau", "A_hi": "दक्कन पठार",
        "B_en": "Malwa Plateau", "B_hi": "मालवा पठार",
        "C_en": "Chota Nagpur Plateau", "C_hi": "छोटा नागपुर पठार",
        "D_en": "Plateau of Tibet", "D_hi": "तिब्बत का पठार",
        "answer": "A",
        "explanation_en": "The Deccan Plateau is the largest plateau in India.",
        "explanation_hi": "दक्कन पठार भारत में सबसे बड़ा पठार है।"
    },
    {
        "subject": "India Geography",
        "topic": "",
        "question_en": "Which crop is most commonly grown in Haryana?",
        "question_hi": "हरियाणा में सबसे अधिक कौन-सी फसल उगाई जाती है?",
        "A_en": "Wheat", "A_hi": "गेहूं",
        "B_en": "Rice", "B_hi": "चावल",
        "C_en": "Cotton", "C_hi": "ऊन",
        "D_en": "Sugarcane", "D_hi": "गन्ना",
        "answer": "A",
        "explanation_en": "Wheat is the most commonly grown crop in Haryana.",
        "explanation_hi": "हरियाणा में गेहूं सबसे अधिक उगाई जाने वाली फसल है।"
    },
    {
        "subject": "India Geography",
        "topic": "",
        "question_en": "Which lake is the largest in India?",
        "question_hi": "भारत का सबसे बड़ा झील कौन-सा है?",
        "A_en": "Chilika Lake", "A_hi": "चिल्का झील",
        "B_en": "Wular Lake", "B_hi": "वुलर झील",
        "C_en": "Dal Lake", "C_hi": "दल झील",
        "D_en": "Sambhar Lake", "D_hi": "सांभर झील",
        "answer": "A",
        "explanation_en": "Chilika Lake is the largest lake in India.",
        "explanation_hi": "चिल्का झील भारत का सबसे बड़ा झील है।"
    },
    {
        "subject": "India Geography",
        "topic": "",
        "question_en": "Which river system is considered one of the most important in India?",
        "question_hi": "भारत में कौन-सी नदी प्रणाली सबसे महत्वपूर्ण मानी जाती है?",
        "A_en": "Ganges-Brahmaputra-Meghna", "A_hi": "गंगा-ब्रह्मपुत्र-मेघना",
        "B_en": "Godavari System", "B_hi": "गोदावरी प्रणाली",
        "C_en": "Yamuna System", "C_hi": "यमुना प्रणाली",
        "D_en": "Narmada System", "D_hi": "नर्मदा प्रणाली",
        "answer": "A",
        "explanation_en": "The Ganges-Brahmaputra-Meghna river system is one of the most important in India.",
        "explanation_hi": "गंगा-ब्रह्मपुत्र-मेघना नदी प्रणाली भारत की सबसे महत्वपूर्ण नदी प्रणाली में से एक है।"
    }
]
```