[
{
"subject": "India Geography",
"topic": "Aapda Prabandhan: Baadh, Sukha, Bhukamp, Cyclone",
"question_en": "What is the primary reason for the formation of a cyclone?",
"question_hi": "बचाव का मुख्य कारण क्या है?",
"A_en": "Tropical cyclones are formed due to the uneven heating of the Earth's surface.", "A_hi": "ग्रीष्मकालीन तूफान वायुमंडलीय तापमान में असमानता के कारण बनते हैं।",
"B_en": "Cyclones are caused by the movement of cold fronts.", "B_hi": "तूफान ठंडी हवाओं के आगमन से होते हैं।",
"C_en": "Cyclones are formed due to the rotation of the Earth.", "C_hi": "तूफान पृथ्वी की परिक्रमा के कारण बनते हैं।",
"D_en": "Cyclones are caused by the interaction of the ocean and the atmosphere.", "D_hi": "तूफान समुद्र और वायुमंडल के संपर्क में आने से होते हैं।",
"answer": "D",
"explanation_en": "Cyclones are formed when the warm, moist air from the ocean rises, creating a low-pressure area that draws in more air, which then rotates due to the Coriolis effect.",
"explanation_hi": "तूफान तब बनते हैं जब गर्म और नम हवा समुद्र से उठती है, जिससे एक निम्न दबाव का क्षेत्र बनता है जो और हवा को आकर्षित करता है, जो फिर कोरियोलिस प्रभाव के कारण घूमने लगती है।"
},
{
"subject": "India Geography",
"topic": "Aapda Prabandhan: Baadh, Sukha, Bhukamp, Cyclone",
"question_en": "Which of the following is an effect of a flood?",
"question_hi": "बाढ़ का निम्नलिखित प्रभाव है?",
"A_en": "Increased crop yield", "A_hi": "फसल उत्पादन में वृद्धि",
"B_en": "Loss of human life", "B_hi": "मानव जीवन की हानि",
"C_en": "Damage to infrastructure", "C_hi": "भवन निर्माण की क्षति",
"D_en": "All of the above", "D_hi": "ऊपर सभी",
"answer": "D",
"explanation_en": "Floods can cause loss of human life, damage to infrastructure, and negatively impact agriculture and the environment.",
"explanation_hi": "बाढ़ मानव जीवन की हानि, भवन निर्माण की क्षति, और कृषि और पर्यावरण पर नकारात्मक प्रभाव डाल सकती है।"
},
{
"subject": "India Geography",
"topic": "Aapda Prabandhan: Baadh, Sukha, Bhukamp, Cyclone",
"question_en": "What is the term for the movement of the Earth's crust that causes an earthquake?",
"question_hi": "भूकंप के कारण भूगर्भिक तल का हिलने को क्या कहते हैं?",
"A_en": "Plate tectonics", "A_hi": "प्लेट टेक्टोनिक्स",
"B_en": "Seismic activity", "B_hi": "भूकंप गतिविधि",
"C_en": "Volcanic activity", "C_hi": "वulkanिक गतिविधि",
"D_en": "Tectonic movement", "D_hi": "भूगर्भिक गति",
"answer": "D",
"explanation_en": "Tectonic movement refers to the movement of the Earth's crust that can cause earthquakes.",
"explanation_hi": "भूगर्भिक गति पृथ्वी की परतों के हिलने को संदर्भित करती है, जो भूकंप का कारण बनती है।"
},
{
"subject": "India Geography",
"topic": "Aapda Prabandhan: Baadh, Sukha, Bhukamp, Cyclone",
"question_en": "Which of the following is a type of natural disaster that occurs when a river overflows its banks?",
"question_hi": "निम्नलिखित एक प्रकार का प्राकृतिक आपदा है जो जब नदी अपने तटों से लांघ जाती है?",
"A_en": "Drought", "A_hi": "सूखा",
"B_en": "Flood", "B_hi": "बाढ़",
"C_en": "Earthquake", "C_hi": "भूकंप",
"D_en": "Cyclone", "D_hi": "तूफान",
"answer": "B",
"explanation_en": "A flood occurs when a river overflows its banks, causing damage to surrounding areas.",
"explanation_hi": "बाढ़ तब होती है जब नदी अपने तटों से लांघ जाती है, जिससे आसपास के क्षेत्रों को नुकसान होता है।"
},
{
"subject": "India Geography",
"topic": "Aapda Prabandhan: Baadh, Sukha, Bhukamp, Cyclone",
"question_en": "What is the term for the amount of rainfall that a region receives over a certain period?",
"question_hi": "एक क्षेत्र पर निश्चित कालावधि में प्राप्त वर्षा के मात्रा को क्या कहते हैं?",
"A_en": "Rainfall intensity", "A_hi": "वर्षा की तीव्रता",
"B_en": "Rainfall amount", "B_hi": "वर्षा की मात्रा",
"C_en": "Precipitation", "C_hi": "वर्षा",
"D_en": "None of the above", "D_hi": "ऊपर कोई नहीं",
"answer": "B",
"explanation_en": "The term for the amount of rainfall that a region receives over a certain period is called rainfall amount.",
"explanation_hi": "एक क्षेत्र पर निश्चित कालावधि में प्राप्त वर्षा की मात्रा को वर्षा की मात्रा कहते हैं।"
},
{
"subject": "India Geography",
"topic": "Aapda Prabandhan: Baadh, Sukha, Bhukamp, Cyclone",
"question_en": "Which of the following is a type of natural disaster that occurs when the ground shakes violently?",
"question_hi": "निम्नलिखित एक प्रकार की प्राकृतिक आपदा है जो जब जमीन विकर्षण के साथ हिल जाती है?",
"A_en": "Earthquake", "A_hi": "भूकंप",
"B_en": "Flood", "B_hi": "बाढ़",
"C_en": "Tornado", "C_hi": "तूफान",
"D_en": "Cyclone", "D_hi": "तूफान",
"answer": "A",
"explanation_en": "An earthquake occurs when the ground shakes violently, often causing damage to structures and the environment.",
"explanation_hi": "भूकंप तब होता है जब जमीन विकर्षण के साथ हिल जाती है, जिससे भवन और पर्यावरण पर नुकसान होता है।"
},
{
"subject": "India Geography",
"topic": "Aapda Prabandhan: Baadh, Sukha, Bhukamp, Cyclone",
"question_en": "What is the term for a long period of abnormally low rainfall?",
"question_hi": "असामान्य तौर पर कम वर्षा के लंबे समय को क्या कहते हैं?",
"A_en": "Drought", "A_hi": "सूखा",
"B_en": "Flood", "B_hi": "बाढ़",
"C_en": "Earthquake", "C_hi": "भूकंप",
"D_en": "Cyclone", "D_hi": "तूफान",
"answer": "A",
"explanation_en": "A drought is a long period of abnormally low rainfall, often causing water scarcity and negative impacts on agriculture and the environment.",
"explanation_hi": "सूखा एक लंबे समय के लिए असामान्य तौर पर कम वर्षा है, जिससे जल संकट और कृषि और पर्यावरण पर नकारात्मक प्रभाव पड़ता है।"
},
{
"subject": "India Geography",
"topic": "Aapda Prabandhan: Baadh, Sukha, Bhukamp, Cyclone",
"question_en": "Which of the following is a type of natural disaster that occurs when a large body of air rotates and moves rapidly?",
"question_hi": "निम्नलिखित एक प्रकार की प्राकृतिक आपदा है जो जब बड़ी हवा का एक वर्ग घूमता और तेजी से चलता है?",
"A_en": "Cyclone", "A_hi": "तूफान",
"B_en": "Flood", "B_hi": "बाढ़",
"C_en": "Earthquake", "C_hi": "भूकंप",
"D_en": "Tornado", "D_hi": "तूफान",
"answer": "A",
"explanation_en": "A cyclone is a type of natural disaster that occurs when a large body of air rotates and moves rapidly, often causing damage to structures and the environment.",
"explanation_hi": "तूफान एक प्रकार की प्राकृतिक आपदा है जो जब बड़ी हवा का एक वर्ग घूमता और तेजी से चलता है, जिससे भवन और पर्यावरण पर नुकसान होता है।"
},
{
"subject": "India Geography",
"topic": "Aapda Prabandhan: Baadh, Sukha, Bhukamp, Cyclone",
"question_en": "What is the term for the movement of air from high-pressure areas to low-pressure areas?",
"question_hi": "उच्च दबाव वाले क्षेत्रों से निम्न दबाव वाले क्षेत्रों की ओर हवा के गति को क्या कहते हैं?",
"A_en": "Wind", "A_hi": "वायु",
"B_en": "Atmospheric pressure", "B_hi": "वायुमंडलीय दबाव",
"C_en": "Weathering", "C_hi": "वायुमंडलीय दबाव",
"D_en": "None of the above", "D_hi": "ऊपर कोई नहीं",
"answer": "A",
"explanation_en": "Wind is the movement of air from high-pressure areas to low-pressure areas.",
"explanation_hi": "वायु उच्च दबाव वाले क्षेत्रों से निम्न दबाव वाले क्षेत्रों की ओर हवा का गति है।"
},
{
"subject": "India Geography",
"topic": "Aapda Prabandhan: Baadh, Sukha, Bhukamp, Cyclone",
"question_en": "Which of the following is a type of natural disaster that occurs when a tornado touches the ground?",
"question_hi": "निम्नलिखित एक प्रकार की प्राकृतिक आपदा है जो जब तूफान जमीन से टकराता है?",
"A_en": "Flood", "A_hi": "बाढ़",
"B_en": "Earthquake", "B_hi": "भूकंप",
"C_en": "Landslide", "C_hi": "भूस्खलन",
"D_en": "Tornado", "D_hi": "तूफान",
"answer": "D",
"explanation_en": "A tornado is a type of natural disaster that occurs when a tornado touches the ground, often causing damage to structures and the environment.",
"explanation_hi": "तूफान एक प्रकार की प्राकृतिक आपदा है जो जब तूफान जमीन से टकराता है, जिससे भवन और पर्यावरण पर नुकसान होता है।"
}