[
{
"subject": "India Geography",
"topic": "Himalaya Parvatmala: Utpatti, Vibhajan aur Mahatva",
"question_en": "What is the origin of the Himalayan mountain range?",
"question_hi": "हिमालय पर्वतमाला का मूल उत्पत्ति क्या है?",
"A_en": "Plate collision between Indian and Eurasian plates", "A_hi": "भारतीय और यूरेशियन प्लेटों के बीच प्लेट क्लैश",
"B_en": "Volcanic activity in the region", "B_hi": "क्षेत्र में ज्वालामुखी गतिविधि",
"C_en": "Tectonic activity in the Indian Ocean", "C_hi": "भारतीय महासागर में तरल गतिविधि",
"D_en": "Weathering and erosion of the Indian landmass", "D_hi": "भारतीय भूमि के वेदन और क्षरण",
"answer": "A",
"explanation_en": "The Himalayan mountain range was formed due to the collision between the Indian and Eurasian plates.",
"explanation_hi": "हिमालय पर्वतमाला भारतीय और यूरेशियन प्लेटों के बीच संपर्क के कारण बनी है।"
},
{
"subject": "India Geography",
"topic": "Himalaya Parvatmala: Utpatti, Vibhajan aur Mahatva",
"question_en": "What is the main division of the Himalayan mountain range?",
"question_hi": "हिमालय पर्वतमाला का मुख्य विभाजन क्या है?",
"A_en": "Western, Central and Eastern Himalayas", "A_hi": "पश्चिमी, मध्य और पूर्वी हिमालय",
"B_en": "Himalayas, Karakoram and the Hindu Kush", "B_hi": "हिमालय, कराकोरम और हिंदुकुश",
"C_en": "The Great Himalayas, the Lesser Himalayas and the Sub-Himalayas", "C_hi": "बढ़िया हिमालय, कम हिमालय और उप हिमालय",
"D_en": "The Western Himalayas, the Eastern Himalayas and the Tibetan Plateau", "D_hi": "पश्चिमी हिमालय, पूर्वी हिमालय और तिब्बती मैदान",
"answer": "C",
"explanation_en": "The Himalayan mountain range is divided into three main sections: the Great Himalayas, the Lesser Himalayas and the Sub-Himalayas.",
"explanation_hi": "हिमालय पर्वतमाला को तीन मुख्य भागों में विभाजित किया जाता है: बड़े हिमालय, कम हिमालय और उप हिमालय।"
},
{
"subject": "India Geography",
"topic": "Himalaya Parvatmala: Utpatti, Vibhajan aur Mahatva",
"question_en": "What is the significance of the Himalayan mountain range in the Indian subcontinent?",
"question_hi": "हिमालय पर्वतमाला का भारतीय उपमहाद्वीप में महत्व क्या है?",
"A_en": "It provides a natural barrier against cold winds from Central Asia", "A_hi": "यह मध्य एशिया से ठंडी हवाओं के प्राकृतिक बाधा प्रदान करता है",
"B_en": "It is the source of many major rivers in India", "B_hi": "यह भारत के कई प्रमुख नदियों का स्रोत है",
"C_en": "It is a major tourist destination in India", "C_hi": "यह भारत में एक प्रमुख पर्यटन स्थल है",
"D_en": "It has significant cultural and spiritual importance in India", "D_hi": "यह भारत में महत्वपूर्ण सांस्कृतिक और आध्यात्मिक महत्व रखता है",
"answer": "B",
"explanation_en": "The Himalayan mountain range is the source of many major rivers in India, including the Ganga, the Brahmaputra and the Indus.",
"explanation_hi": "हिमालय पर्वतमाला भारत के कई प्रमुख नदियों का स्रोत है, जिनमें गंगा, ब्रह्मपुत्र और सिंधु शामिल हैं।"
},
{
"subject": "India Geography",
"topic": "Himalaya Parvatmala: Utpatti, Vibhajan aur Mahatva",
"question_en": "What is the highest peak in the Himalayan mountain range?",
"question_hi": "हिमालय पर्वतमाला का सबसे उच्च शिखर क्या है?",
"A_en": "Mount Everest", "A_hi": "माउंट एवरेस्ट",
"B_en": "K2", "B_hi": "क2",
"C_en": "Nanga Parbat", "C_hi": "नंगा पर्वत",
"D_en": "Annapurna", "D_hi": "अन्नपूर्णा",
"answer": "A",
"explanation_en": "Mount Everest, also known as Sagarmatha, is the highest peak in the Himalayan mountain range.",
"explanation_hi": "माउंट एवरेस्ट, जिसे सगरमाथा भी कहा जाता है, हिमालय पर्वतमाला का सबसे उच्च शिखर है।"
},
{
"subject": "India Geography",
"topic": "Himalaya Parvatmala: Utpatti, Vibhajan aur Mahatva",
"question_en": "What is the average elevation of the Himalayan mountain range?",
"question_hi": "हिमालय पर्वतमाला का औसत ऊंचाई क्या है?",
"A_en": "500-600 meters", "A_hi": "500-600 मीटर",
"B_en": "2,000-3,000 meters", "B_hi": "2,000-3,000 मीटर",
"C_en": "4,000-5,000 meters", "C_hi": "4,000-5,000 मीटर",
"D_en": "6,000-7,000 meters", "D_hi": "6,000-7,000 मीटर",
"answer": "C",
"explanation_en": "The average elevation of the Himalayan mountain range is approximately 4,000-5,000 meters.",
"explanation_hi": "हिमालय पर्वतमाला का औसत ऊंचाई लगभग 4,000-5,000 मीटर है।"
},
{
"subject": "India Geography",
"topic": "Himalaya Parvatmala: Utpatti, Vibhajan aur Mahatva",
"question_en": "What is the longest river in the Himalayan mountain range?",
"question_hi": "हिमालय पर्वतमाला की सबसे लंबी नदी क्या है?",
"A_en": "Ganga", "A_hi": "गंगा",
"B_en": "Brahmaputra", "B_hi": "ब्रह्मपुत्र",
"C_en": "Indus", "C_hi": "सिंधु",
"D_en": "Sutlej", "D_hi": "सुतलेज",
"answer": "A",
"explanation_en": "The Ganga is the longest river in the Himalayan mountain range, stretching over 2,525 kilometers.",
"explanation_hi": "गंगा हिमालय पर्वतमाला की सबसे लंबी नदी है, जो लगभग 2,525 किलोमीटर तक फैली है।"
},
{
"subject": "India Geography",
"topic": "Himalaya Parvatmala: Utpatti, Vibhajan aur Mahatva",
"question_en": "What is the significance of the Himalayan mountain range in the Indian economy?",
"question_hi": "हिमालय पर्वतमाला का भारतीय अर्थव्यवस्था में महत्व क्या है?",
"A_en": "It is a major source of hydroelectric power", "A_hi": "यह एक प्रमुख जलविद्युत ऊर्जा का स्रोत है",
"B_en": "It is a major source of timber and forest products", "B_hi": "यह एक प्रमुख लकड़ी और वन उत्पादों का स्रोत है",
"C_en": "It is a major source of minerals and metals", "C_hi": "यह एक प्रमुख खनिजों और धातुओं का स्रोत है",
"D_en": "It is a major tourist destination", "D_hi": "यह एक प्रमुख पर्यटन स्थल है",
"answer": "A",
"explanation_en": "The Himalayan mountain range is a major source of hydroelectric power in India, with many dams and power plants located in the region.",
"explanation_hi": "हिमालय पर्वतमाला भारत में एक प्रमुख जलविद्युत ऊर्जा का स्रोत है, जिसमें क्षेत्र में कई बांध और बिजली संयंत्र स्थित हैं।"
},
{
"subject": "India Geography",
"topic": "Himalaya Parvatmala: Utpatti, Vibhajan aur Mahatva",
"question_en": "What is the significance of the Himalayan mountain range in the Indian culture?",
"question_hi": "हिमालय पर्वतमाला का भारतीय संस्कृति में महत्व क्या है?",
"A_en": "It is a sacred place for many religions", "A_hi": "यह कई धर्मों के लिए एक पवित्र स्थान है",
"B_en": "It is a symbol of Indian national pride", "B_hi": "यह भारतीय राष्ट्रीय गर्व का प्रतीक है",
"C_en": "It is a source of inspiration for many artists and writers", "C_hi": "यह कई कलाकारों और लेखकों के लिए प्रेरणा का स्रोत है",
"D_en": "It is a major pilgrimage center", "D_hi": "यह एक प्रमुख तीर्थ स्थल है",
"answer": "A",
"explanation_en": "The Himalayan mountain range is a sacred place for many religions in India, including Hinduism, Buddhism and Jainism.",
"explanation_hi": "हिमालय पर्वतमाला भारत में हिंदू धर्म, बौद्ध धर्म और जैन धर्म जैसे कई धर्मों के लिए एक पवित्र स्थान है।"
},
{
"subject": "India Geography",
"topic": "Himalaya Parvatmala: Utpatti, Vibhajan aur Mahatva",
"question_en": "What is the major challenge faced by the Himalayan mountain range?",
"question_hi": "हिमालय पर्वतमाला का मुख्य चुनौती क्या है?",
"A_en": "Climate change and global warming", "A_hi": "मौसम परिवर्तन और वैश्विक गर्मी",
"B_en": "Deforestation and soil erosion", "B_hi": "वनस्पति नष्ट होना और मिट्टी का कटाव",
"C_en": "Pollution and waste management", "C_hi": "भरी हुई जलवायु और कचरे का प्रबंधन",
"D_en": "Over-tourism and infrastructure development", "D_hi": "अत्यधिक पर्यटन और ढांचागत विकास",
"answer": "B",
"explanation_en": "The major challenge faced by the Himalayan mountain range is deforestation and soil erosion, which can lead to landslides and floods.",
"explanation_hi": "हिमालय पर्वतमाला का मुख्य चुनौती वनस्पति नष्ट होना और मिट्टी का कटाव है, जो भूलभुलैया और बाढ़ का कारण बन सकता है।"
},
{
"subject": "India Geography",
"topic": "Himalaya Parvatmala: Utpatti, Vibhajan aur Mahatva",
"question_en": "What is the significance of the Himalayan mountain range in the Indian wildlife?",
"question_hi": "हिमालय पर्वतमाला का भारतीय वन्यजीव में महत्व क्या है?",
"A_en": "It is a home to many endangered species", "A_hi": "यह कई विलुप्तप्राय प्रजातियों का घर है",
"B_en": "It is a habitat for many migratory birds", "B_hi": "यह कई प्रवासी पक्षियों के आवास है",
"C_en": "It is a source of many medicinal plants", "C_hi": "यह कई औषधीय पौधों का स्रोत है",
"D_en": "It is a major corridor for wildlife migration", "D_hi": "यह वन्यजीव प्रवास के लिए एक प्रमुख मार्ग है",
"answer": "A",
"explanation_en": "The Himalayan mountain range is home to many endangered species, including the snow leopard, the red panda and the Himalayan brown bear.",
"explanation_hi": "हिमालय पर्वतमाला कई विलुप्तप्राय प्रजातियों का घर है, जिनमें सिंह, लाल पाँडा और हिमालयी भूरा शेर शामिल हैं।"
}