[
{
"subject": "Mathematics",
"topic": "Algebraic Expressions",
"question_en": "What is the value of x in the equation 2x + 5 = 11?",
"question_hi": "समीकरण 2x + 5 = 11 में x का मान क्या है?",
"A_en": "3", "A_hi": "३",
"B_en": "4", "B_hi": "४",
"C_en": "5", "C_hi": "५",
"D_en": "6", "D_hi": "६",
"answer": "B",
"explanation_en": "To solve for x, we need to isolate x on one side of the equation. We can do this by subtracting 5 from both sides: 2x = 11 - 5, 2x = 6. Then, we can divide both sides by 2: x = 6/2, x = 3. However, this is not the correct answer. Let's try again.",
"explanation_hi": "समीकरण के लिए x का मान ज्ञात करने के लिए, हमें x को एक ही पक्ष पर अलग करना होगा। हम इसे करने के लिए दोनों पक्षों से 5 घटा सकते हैं: 2x = 11 - 5, 2x = 6. फिर, हम दोनों पक्षों को 2 से भाग कर सकते हैं: x = 6/2, x = 3। हालांकि, यह सही उत्तर नहीं है। चलिए फिर से कोशिश करते हैं।"
},
{
"subject": "Mathematics",
"topic": "Geometry",
"question_en": "What is the perimeter of a rectangle with a length of 6 cm and a width of 4 cm?",
"question_hi": "एक आयताकार आकार की लंबाई 6 सेमी और चौड़ाई 4 सेमी है, इसकी परिधि क्या है?",
"A_en": "10 cm", "A_hi": "10 सेमी",
"B_en": "12 cm", "B_hi": "12 सेमी",
"C_en": "14 cm", "C_hi": "14 सेमी",
"D_en": "16 cm", "D_hi": "16 सेमी",
"answer": "B",
"explanation_en": "To find the perimeter, we need to add up the lengths of all four sides. Since it's a rectangle, the opposite sides are equal. So, we can add the length and width twice: perimeter = 2(length + width) = 2(6 + 4) = 2 x 10 = 20 cm.",
"explanation_hi": "परिधि को ज्ञात करने के लिए, हमें चारों ओर की लंबाइयों को जोड़ना होगा। क्योंकि यह एक आयताकार है, इसके विपरीत पक्ष समान होते हैं। इसलिए, हम लंबाई और चौड़ाई को दोगुना जोड़ सकते हैं: परिधि = 2(लंबाई + चौड़ाई) = 2(6 + 4) = 2 x 10 = 20 सेमी।"
},
{
"subject": "Mathematics",
"topic": "Trigonometry",
"question_en": "What is the value of sin(60°)?",
"question_hi": "60° का साइन क्या है?",
"A_en": "0.5", "A_hi": "०.५",
"B_en": "0.6", "B_hi": "०.६",
"C_en": "0.7", "C_hi": "०.७",
"D_en": "0.8", "D_hi": "०.८",
"answer": "A",
"explanation_en": "We can use the unit circle to find the value of sin(60°). Since 60° is in the first quadrant, the sine value will be positive. From the unit circle, we can see that sin(60°) = √3/2, which is approximately 0.866. However, this is not one of the answer choices. Let's try again.",
"explanation_hi": "हम इकाई दائر का उपयोग कर सकते हैं 60° का मान ज्ञात करने के लिए। क्योंकि 60° पहले क्वाड्रेंट में है, साइन का मान सकारात्मक होगा। इकाई दायरे से देखकर, हम देख सकते हैं कि sin(60°) = √3/2, जो लगभग 0.866 है। हालांकि, यह उत्तर विकल्पों में से नहीं है। चलिए फिर से कोशिश करते हैं।"
},
{
"subject": "Mathematics",
"topic": "Statistics",
"question_en": "What is the mean of the following data set: 2, 4, 6, 8, 10?",
"question_hi": "निम्नलिखित डेटा सेट का औसत क्या है: 2, 4, 6, 8, 10?",
"A_en": "5", "A_hi": "५",
"B_en": "6", "B_hi": "६",
"C_en": "7", "C_hi": "७",
"D_en": "8", "D_hi": "८",
"answer": "B",
"explanation_en": "To find the mean, we need to add up all the values and then divide by the number of values. mean = (2 + 4 + 6 + 8 + 10) / 5 = 30 / 5 = 6.",
"explanation_hi": "औसत ज्ञात करने के लिए, हमें सभी मानों को जोड़ना होगा और फिर मानों की संख्या से भाग करना होगा। औसत = (2 + 4 + 6 + 8 + 10) / 5 = 30 / 5 = 6।"
},
{
"subject": "Mathematics",
"topic": "Algebra",
"question_en": "What is the solution to the equation x^2 + 4x + 4 = 0?",
"question_hi": "समीकरण x^2 + 4x + 4 = 0 का समाधान क्या है?",
"A_en": "x = -2", "A_hi": "x = -२",
"B_en": "x = 0", "B_hi": "x = ०",
"C_en": "x = 2", "C_hi": "x = २",
"D_en": "x = -4", "D_hi": "x = -४",
"answer": "A",
"explanation_en": "We can factor the quadratic equation to solve for x: (x + 2)^2 = 0. Taking the square root of both sides, we get x + 2 = 0. Subtracting 2 from both sides, we get x = -2.",
"explanation_hi": "हम द्विघात समीकरण को कारक करके समीकरण के लिए x का समाधान पा सकते हैं: (x + 2)^2 = 0। दोनों ओर का वर्गमूल निकालते हुए, हमें x + 2 = 0 मिलता है। दोनों ओर से 2 घटाते हुए, हमें x = -2 मिलता है।"
},
{
"subject": "Mathematics",
"topic": "Calculus",
"question_en": "What is the derivative of the function f(x) = 3x^2 + 2x - 5?",
"question_hi": "कार्य f(x) = 3x^2 + 2x - 5 का सापेक्ष अवकलज क्या है?",
"A_en": "f'(x) = 6x + 2", "A_hi": "f'(x) = ६x + २",
"B_en": "f'(x) = 6x - 2", "B_hi": "f'(x) = ६x - २",
"C_en": "f'(x) = 6x^2 + 2x", "C_hi": "f'(x) = ६x^२ + २x",
"D_en": "f'(x) = 6x^2 - 2x", "D_hi": "f'(x) = ६x^२ - २x",
"answer": "A",
"explanation_en": "To find the derivative, we need to apply the power rule of differentiation. The derivative of x^n is nx^(n-1). Using this rule, we can find the derivative of each term: f'(x) = d(3x^2)/dx + d(2x)/dx - d(5)/dx = 6x + 2.",
"explanation_hi": "अवकलज ज्ञात करने के लिए, हमें अवकलज के नियम को लागू करना होगा। x के nवें घात का अवकलज nx^(n-1) होता है। इस नियम का उपयोग करके, हम प्रत्येक पद का अवकलज ज्ञात कर सकते हैं: f'(x) = d(3x^2)/dx + d(2x)/dx - d(5)/dx = ६x + २।"
},
{
"subject": "Mathematics",
"topic": "Probability",
"question_en": "What is the probability of drawing a red card from a standard deck of 52 cards?",
"question_hi": "एक मानक 52 कार्डों के पैकेट से लाल कार्ड खींचने की संभावना क्या है?",
"A_en": "1/2", "A_hi": "१/२",
"B_en": "1/3", "B_hi": "१/३",
"C_en": "1/4", "C_hi": "१/४",
"D_en": "1/5", "D_hi": "१/५",
"answer": "B",
"explanation_en": "There are 26 red cards in a standard deck of 52 cards. To find the probability, we need to divide the number of red cards by the total number of cards: probability = 26/52 = 1/2. However, this is not one of the answer choices. Let's try again.",
"explanation_hi": "मानक 52 कार्डों के पैकेट में 26 लाल कार्ड होते हैं। संभावना ज्ञात करने के लिए, हमें लाल कार्डों की संख्या को कुल कार्डों की संख्या से विभाजित करना होगा: संभावना = 26/52 = १/२। हालांकि, यह उत्तर विकल्पों में से नहीं है। चलिए फिर से कोशिश करते हैं।"
},
{
"subject": "Mathematics",
"topic": "Coordinate Geometry",
"question_en": "What is the equation of the line passing through the points (2, 3) and (4, 5)?",
"question_hi": "बिंदुओं (2, 3) और (4, 5) से गुजरने वाली रेखा का समीकरण क्या है?",
"A_en": "y = 2x + 1", "A_hi": "y = २x + १",
"B_en": "y = 2x - 1", "B_hi": "y = २x - १",
"C_en": "y = x + 2", "C_hi": "y = x + २",
"D_en": "y = x - 2", "D_hi": "y = x - २",
"answer": "B",
"explanation_en": "To find the equation of the line, we need to find the slope and the y-intercept. The slope is given by the formula m = (y2 - y1) / (x2 - x1). Plugging in the values, we get m = (5 - 3) / (4 - 2) = 1. The y-intercept is given by the formula b = y1 - mx1. Plugging in the values, we get b = 3 - 1(2) = 1. Therefore, the equation of the line is y = 2x - 1.",
"explanation_hi": "रेखा का समीकरण ज्ञात करने के लिए, हमें ढाल और y-चौरस का पता लगाना होगा। ढाल द्वारा दी गई फॉर्मूला द्वारा ढाल दी जाती है: m = (y2 - y1) / (x2 - x1)। मानों को प्लग करके, हमें m = (5 - 3) / (4 - 2) = १ मिलता है। y-चौरस द्वारा दी गई फॉर्मूला द्वारा y-चौरस दिया जाता है: b = y1 - mx1। मानों को प्लग करके, हमें b = ३ - १(२) = १ मिलता है। इसलिए, रेखा का समीकरण है y = २x - १।"
},
{
"subject": "Mathematics",
"topic": "Number Theory",
"question_en": "What is the prime factorization of the number 315?",
"question_hi": "संख्या 315 का अभाज्य कारकन क्या है?",
"A_en": "3^2 * 5 * 7", "A_hi": "३^२ * ५ * ७",
"B_en": "3 * 5 * 7", "B_hi": "३ * ५ * ७",
"C_en": "3^2 * 5^2 * 7", "C_hi": "३^२ * ५^२ * ७",
"D_en": "3 * 5 * 7 * 11", "D_hi": "३ * ५ * ७ * ११",
"answer": "B",
"explanation_en": "To find the prime factorization, we need to break down the number into its prime factors. We can start by dividing the number by the smallest prime factor, which is 3. We get 315 = 3 * 105. Then, we can divide 105 by the next smallest prime factor, which is 5. We get 105 = 5 * 21. Finally, we can divide 21 by the next smallest prime factor, which is 3. We get 21 = 3 * 7. Therefore, the prime factorization of 315 is 3 * 5 * 7.",
"explanation_hi": "अभाज्य कारकन ज्ञात करने के लिए, हमें संख्या को अपने अभाज्य कारकों में तोड़ना होगा। हम शुरू करके संख्या को सबसे छोटे अभाज्य कारक से विभाजित कर सकते हैं, जो ३ है। हमें ३ * १०५ मिलता है। फिर, हम १०५ को अगले सबसे छोटे अभाज्य कारक, जो ५ है, से विभाजित कर सकते हैं। हमें ५ * २१ मिलता है। अंत में, हम २१ को अगले सबसे छोटे अभाज्य कारक, जो ३ है, से विभाजित कर सकते हैं। हमें ३ * ७ मिलता है। इसलिए, ३१५ का अभाज्य कारकन ३ * ५ * ७ है।"
}