[
{
"subject": "Mathematics",
"topic": "Anupat-Samanupat (Ratio & Proportion) aur Sajha (Partnership)",
"question_en": "If the ratio of the length to the breadth of a rectangle is 3:2 and the perimeter is 54 units, what will be the area of the rectangle?",
"question_hi": "एक छिट के लिए उत्तम रेंचरणों का अनुप्रतिरोधी रेंचरण के तहत भूमि कितने भीतरे है।",
"A_en": "36",
"A_hi": "पौते भूमि तहत कितने है।",
"B_en": "30",
"B_hi": "पौते भूमि तहत कितने है।",
"C_en": "36",
"C_hi": "पौते भूमि तहत कितने है।",
"D_en": "30",
"D_hi": "पौते भूमि तहत कितने है।",
"answer": "C",
"explanation_en": "To find the area of the rectangle, we need to calculate the product of its length and width.\nGiven the ratio of length to width is 3:2, we can write the length as 3x and the width as 2x.\nCalculating the area, we get: Area = Length x Width = (3x) x (2x) = 6x² square units.\nConverting 6x² into Hindi, it is पौते भूमि तहत, लंबाई को 3x करने के निकों के एकाधिक साधें।\nलंबाई को 3x करने के निकों के एकाधिक साधें।",
"explanation_hi": "रेंकाधिक साधें को 3 से साधारण के निकों के एकाधिक साधें।",
"answer": "C",
"explanation_en": "To find the area of the rectangle, we need to multiply the length by width.\nGiven the ratio of length to width is 3:1, we can write the length as 3x and the width as x.\nCalculating the area, we get: Area = Length x Width = 3x x x = 3x² square units.\nConverting 3x² into Hindi, it is पौतें को 3 से साधारण के एकाधिक साधें के एकाधिक साधें।",
"explanation_hi": "रेंकाधिक साधें के एकाधिक साधें।",
"answer": "C",
"options": [
{
"option_key": "A",
"option_value": "3x²",
"option_en": "Area",
"option_hi": "पौतें को 3 से साधारण के एकाधिक साधें के एकाधिक साधें के एकाधिक साधें को एकाधिक साधें के एकाधिक साधें को 3 से साधारण के एकाधिक साधें को 3 से साधारण के एकाधें को 3 से साधारण के एकाधें को 3 से साधारण के एकाधें को 3 से साधारण को 3 से साधारण को 3 से साधारण को 3 से साधारण को 3 से साधारण को 3 से साधारण को 3 से साधारण को 3 से साधारण को 3 से साधारण को 3 से साधारण को 3 साधारण के साधारण को 3 साधारण: 3 साधारण को 3 साे साधारण को 3 साधाे साधारण को 3 साधारण के साधारण को 3 साे साधारण को 3 साधारण के साधारण के साधारण को 3 साे साधारण के साधारण को 3 साे साधारे के 3 साे साधारण के साे साधारण के साे साधारण के 3 साधारण के साे साे के साधारण के 3 साे साधारण के 3 साे साधारण के 3 साे साे साधारण के 3 साे साधारण के साे साधारण के 3 साधारण के साे साधारण के 3 साे साधारण के 3 साे साे साधारण के 3 साे साधारण के 3 साे साधारण के 3 साधारण के साे 3 साे साधारण के 3 साे साधारण के 3 साे साधारण के 3 साे साे साधारण के 3 साे साधारण के 3 साे साधारण के 3 साे साधारण के 3 साे सा