[
{
"subject": "Mathematics",
"topic": "Pratishatta (Percentage), Labh aur Hani (Profit & Loss)",
"question_en": "What is the difference between profit and gain?",
"question_hi": "प्रतिशत (प्राकृतिक लाभ) और लाभ (लाभ और कमान) की अर्थ क्या है?",
"A_en": "Profit is a part of gain, while gain is the total benefit obtained.",
"A_hi": "प्राकृतिक लाभ (प्रतिशत लाभ) वाला प्राकृतिक कमान (लाभ और कमान) की अर्थ क्या है?",
"B_en": "Gain is the surplus amount obtained after subtracting the cost price from the selling price, while profit is the difference between the selling price and the cost price.",
"B_hi": "लाभ आपदा और मान को कमान की अर्थ क्या है?",
"C_en": "Price difference represents the difference between the selling price and the cost price, while profit is a part of the gain.",
"C_hi": "पैंक आजीविक विभिज्ञान की अर्थ क्या है?",
"D_en": "In percentage terms, profit is calculated as a percentage of cost price, while gain is calculated as a percentage of the selling price.",
"D_hi": "पैंक परिणाम की अर्थ की अर्थ क्या है?",
"E_en": "In profit and loss calculation, what is the difference between profit and loss?",
"E_hi": "पैंक और लॉस को कोईना के अर्थ क्या है?",
"F_en": "What is the relationship between profit and cost price?",
"F_hi": "पैंक और कोईना का संबंध क्या है?",
"G_en": "How is profit calculated in percentage terms?",
"G_hi": "पैंक पैंक परिक्षण को पैंक परिक्षण मान को पैंक परिक्षण मान के पैंक परिक्षण शब्द मान को पैंक परिक्षण शब्द मान को पैंक परिक्षण शब्द मान के पैंक परिक्षण, लेक्षण शब्द मान के पैंक परिक्षण, लेक्षण शब्द मान के पैंक परिक्षण, लेक्षण शब्द मान के पैंक परिक्षण, लेक्षण शब्द मान के पैंक परिक्षण, लेक्षण शब्द मान के पैंक परिक्षण, लेक्षण शब्द मान के पैंक परिक्षण, लेक्षण शब्देंक पैंक परिक्षण, लेक्षण शब्देंक पैंक परिक्षण, लेक्षण शब्देंक परिक्षण, लेक्षण शब्देंक परिक्षण, लेक्षण शब्देंक परिक्षण, लेक्षण शब्द्देंक परिक्षण, लेक्षण शब्द्देंक परिक्षण, लेक्षण शब्द्देंक परिक्षण, लेक्षण शब्द्देंक परिक्षण, लेक्षण शब्द्द्देंक परिक्षण, लेक्देंक परिक परिक्षण, लेक्द्द्देंक परिक्षण, लेक परिक्षण, लेक्द्द्देंक परिक्षण, लेक परिक परिक्षण, लेक्देंक परिक्षण, लेक परिक्षण, लेक परिक परिक्षण, लेक्षण, लेक परिक्षण, लेक परिक्षण, लेक्षण, लेक परिक्षण, लेक परिक्षण, लेक्षण, लेक्षण, लेक परिक्षण, लेक्षण, लेक परिक्षण, लेक्षण, लेक्षण, लेक्षण, लेक्षण, लेक्षण, लेक्षण, लेक्षण, लेक्षण, ल