[
{
"subject": "Mathematics",
"topic": "Sadharan aur Chakravriti Byaj (Simple & Compound Interest)",
"question_en": "What is the difference between simple and compound interest?",
"question_hi": "संसारी और कर्मा के अनुमान क्या अर्थ हैं?",
"A_en": "Simple Interest is calculated on the principal amount only.",
"A_hi": "संसारी अनुमान को पहले मान के अर्थ है।",
"B_en": "Compound Interest is calculated on the principal amount as well as the accrued interest.",
"B_hi": "कर्मा अनुमान को प्राप्त अनुमान के अर्थ है।",
"C_en": "Compound Interest calculates both the principal and interest separately.",
"C_hi": "कर्मा अनुमान प्राप्त अनुमान के अर्थ है।",
"D_en": "Simple Interest is calculated only on the principal amount.",
"D_hi": "संसारी अनुमान को प्राप्त अनुमान के अर्थ है।",
"E_en": "Compound Interest takes into account the interest on interest (accrued interest).",
"E_hi": "कर्मा अनुमान की प्राप्त अनुमान के अर्थ है।",
"F_en": "Simple Interest is calculated only on the principal amount and does not consider the accrued interest.",
"F_hi": "संसारी अनुमान को प्राप्त अनुमान के अर्थ नहींग है।",
"G_en": "Compound Interest is calculated on both the principal and the accumulated interest.",
"G_hi": "कर्मा अनुमान को प्राप्त अनुमान से ज्ञान की विश्वरूनिमान के अर्थ भी होता है।",
"H_en": "What is the difference between Simple Interest and Compound Interest?",
"H_hi": "संसारी विश्वरूनिमान और कर्मा विश्वरूनिमान के अर्थ को मिलाने के अर्थ भी होता है।",
"question": "संसारी विश्वरूनिमान और कर्मा विश्वरूनिमान के अर्थ भी मिलाने के अर्थ भी होता है।",
"option_a_en": "Simple Interest only includes the interest earned on the principal.",
"option_a_hi": "संसारी विश्वरूनिमान प्राप्ती क्रमा विश्वरूनिमान के अर्थ भी होता है।",
"option_b_en": "Compound Interest is calculated on both the principal and the accumulated interest.",
"option_b_hi": "कर्मा विश्वरुनिमान प्राप्ती क्रमा विश्वरुनिमान के अर्थ भींचोंकर्माविश्वरुनिमान प्राप्ती क्रमाविश्वरुनिमान प्राप्ती",
"option_c_en": "The difference between Simple Interest and Compound Interest is not applicable.",
"option_c_hi": "संसारमांकर्मावरुनिमान प्तीे सारमावरुनिमान प्तीे सारमान प्रमान प्तिमान सारमान प्रमान प्रमान सारमान प्रमान सारमान प्रमान सारमाे सान प्रमान सारमान सारमान प्रमान सारमान सारमान प्रमान सारमान सारमान प्रमान सान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सारमान सा