<think>
Okay, let's tackle this task. The user wants me to create 10 high-quality MCQs on Time and Work in Mathematics for Rajasthan State Exams, SSC, and Railway exams. The instructions specify that each question and options should be in both Hindi and English, following the Testbook style. The output needs to be in strict JSON format as per the provided example.

First, I need to recall the key concepts in Time and Work. Common topics include work done by individuals or groups, rates of work, efficiency, and problems involving pipes or taps. Since the exams target different levels, the difficulty should be moderate to high, suitable for competitive exams.

Starting with the first question. Let's think of a standard problem where two people work together. For example, A can do a job in 10 days, B in 15 days. How long together? The formula is 1/(1/10 +1/15) = 6 days. That's a classic case. Then, I need to create a question based on that. Let me structure the question in both languages.

Next, another problem could involve three workers. Maybe A and B can do a job in 12 days, B and C in 15 days, and A and C in 20 days. Find how long A, B, and C together would take. This requires solving equations with three variables. The solution involves adding the equations and solving for the combined rate.

Third question: Efficiency comparison. If A is twice as efficient as B, and together they finish in 10 days, how long does A take alone? Let efficiency of B be 1 unit, A would be 2 units. Total work = (2+1)*10 = 30 units. So A alone would take 30/2 =15 days.

Fourth problem: Work done by men and women. Suppose 5 men can do a job in 10 days, and 10 women in 5 days. How many days will 2 men and 4 women take? Calculate work units: Men's rate: 5M*10 = 50 units, Women's rate: 10W*5 = 50 units. So 1M = 50/50=1 unit? Wait, maybe better to compute work rates. Let me correct that. Let me think again. If 5 men take 10 days, total work is 5*10=50 man-days. Similarly, 10 women take 5 days, total work is 10*5=50 woman-days. So 1 man-day = 1 woman-day? Wait, that can't be right. Wait, maybe the total work is same, so 5M*10 =10W*5 => 50M =50W => 1M=1W? Hmm, but that would mean they have same efficiency. So combining 2M+4W = 6M (since 4W=4M). Total work is 50 units. So time = 50 / (2+4) = 50/6 ≈ 8.33 days. But that's 8.33 days, which is 8 days and 8 hours. But the answer options need to be in fractions or decimals. So maybe the question is designed such that 2M +4W = 6M, and total work is 50, so 50/6 ≈ 8.33 days. So the answer would be 8.33 days or 25/3 days. So the options would be in fractions.

Fifth problem: Pipes filling a tank. Pipe A can fill in 6 hours, Pipe B in 4 hours. If both are opened but after 1 hour Pipe B is closed, how long will Pipe A take to fill the rest? First hour, both work: rate A is 1/6, B is 1/4. Combined rate is 5/12 per hour. After 1 hour, 5/12 of tank is filled. Remaining is 7/12. Now Pipe A works alone at 1/6 per hour. Time needed: (7/12)/(1/6) = 7/12 *6= 3.5 hours. Total time is 1 +3.5=4.5 hours. But the question is how long after closing B. So answer is 3.5 hours or 7/2 hours.

Sixth question: Work done by A and B. A leaves after some days. Suppose A can do a job in 20 days, B in 30 days. They work together for 5 days, then A leaves. How many more days will B take to finish the job? Let's compute work done in 5 days: (1/20 +1/30)*5 = (3+2)/60 *5 =5/60*5=25/60=5/12. Remaining work:7/12. B's rate is 1/30. Time needed: (7/12)/(1/30)=7/12 *30= 17.5 days.

Seventh problem: Efficiency ratio. A is thrice as efficient as B. If A takes 12 days less than B, how many days does B take alone? Let B take x days, A takes x-12. Work rates: 1/x and 1/(x-12). Since A is thrice as efficient, 1/(x-12) =3/x. Cross multiply: x=3(x-12) => x=3x-36 => 2x=36 =>x=18. So B takes 18 days.

Eighth problem: Work done by men and women. 12 men can do a job in 10 days, 15 women in 12 days. How long will 4 men and 6 women take? Let me compute work units. Total work by men:12*10=120 man-days. Total work by women:15*12=180 woman-days. Let 1 woman = m men. So 180w =120m => w= (120/180)m=2/3 m. So 4m +6w=4m +6*(2/3)m=4m+4m=8m. Total work is 120 man-days. Time=120/8=15 days.

Ninth question: Work done by A and B. A works for half the time, B for the remaining. Total time is 30 hours. If A's rate is 2 units/hour and B's rate is 3 units/hour. How much work is done? Wait, maybe better to think of total work. Suppose total time is 30 hours. A works half, so 15 hours. B works 15 hours. Work done by A:2*15=30 units. Work by B:3*15=45. Total work=75 units. But maybe the question is different. Alternatively, if A and B work alternately, but the problem states that each works for half the total time. So total work is sum of their individual work. So answer is 75 units.

Tenth problem: Work done by three taps. Taps A, B, and C can fill in 10, 15, and 30 hours. If all three are opened, how long to fill the tank? Rates: 1/10 +1/15 +1/30 = (3+2+1)/30=6/30=1/5. So time is 5 hours.

Now, I need to translate these into questions with options. Also, ensure that the explanations are clear in both languages. Check for any calculation errors. Make sure the options are plausible and the correct answer is among them. Also, verify that the Hindi translations are accurate and natural.

For example, the first question:

Question: A and B can do a job in 10 and 15 days respectively. How long together?

Options: A. 6, B. 8, C. 5, D. 7.5

Answer: A. 6 days. Explanation: 1/10 +1/15 = 1/6. So time is 6 days.

Similarly for others. Each question should follow this structure. Ensure that the difficulty is moderate, suitable for competitive exams. Avoid any complex fractions unless necessary. Check calculations again for errors.
</think>

[
    {
        "subject": "Mathematics",
        "topic": "Samay aur Kaam (Time & Work)",
        "question_en": "A and B can complete a work in 10 and 15 days respectively. How many days will they take to complete the work together?",
        "question_hi": "A और B क्रमशः 10 दिन और 15 दिन में एक कार्य पूरा कर सकते हैं। वे एक साथ इस कार्य को कितने दिनों में पूरा करेंगे?",
        "A_en": "6 days", "A_hi": "6 दिन",
        "B_en": "8 days", "B_hi": "8 दिन",
        "C_en": "5 days", "C_hi": "5 दिन",
        "D_en": "7.5 days", "D_hi": "7.5 दिन",
        "answer": "A",
        "explanation_en": "Combined work rate = 1/10 + 1/15 = 1/6. Total time = 6 days.",
        "explanation_hi": "संयुक्त कार्य दर = 1/10 + 1/15 = 1/6। कुल समय = 6 दिन।"
    },
    {
        "subject": "Mathematics",
        "topic": "Samay aur Kaam (Time & Work)",
        "question_en": "A and B together can complete a work in 12 days, B and C in 15 days, and A and C in 20 days. How many days will A, B, and C together take to complete the work?",
        "question_hi": "A और B मिलकर एक कार्य 12 दिनों में पूरा कर सकते हैं, B और C 15 दिनों में और A और C 20 दिनों में। A, B और C मिलकर इस कार्य को कितने दिनों में पूरा करेंगे?",
        "A_en": "10 days", "A_hi": "10 दिन",
        "B_en": "8 days", "B_hi": "8 दिन",
        "C_en": "9 days", "C_hi": "9 दिन",
        "D_en": "7.5 days", "D_hi": "7.5 दिन",
        "answer": "A",
        "explanation_en": "Let the work rates be A + B = 1/12, B + C = 1/15, A + C = 1/20. Adding equations: 2(A + B + C) = 1/12 + 1/15 + 1/20 = 1/5. Total time = 10 days.",
        "explanation_hi": "माना कार्य दर A + B = 1/12, B + C = 1/15, A + C = 1/20। समीकरणों को जोड़ने पर: 2(A + B + C) = 1/12 + 1/15 + 1/20 = 1/5। कुल समय = 10 दिन।"
    },
    {
        "subject": "Mathematics",
        "topic": "Samay aur Kaam (Time & Work)",
        "question_en": "A is twice as efficient as B. Together, they can complete a work in 10 days. How many days will A take to complete the work alone?",
        "question_hi": "A, B की तुलना में दोगुना कुशल है। एक साथ, वे एक कार्य 10 दिनों में पूरा कर सकते हैं। A अकेला इस कार्य को कितने दिनों में पूरा करेगा?",
        "A_en": "15 days", "A_hi": "15 दिन",
        "B_en": "20 days", "B_hi": "20 दिन",
        "C_en": "12 days", "C_hi": "12 दिन",
        "D_en": "18 days", "D_hi": "18 दिन",
        "answer": "A",
        "explanation_en": "Let B's efficiency = 1 unit/day. A's efficiency = 2 units/day. Total work = (1 + 2) * 10 = 30 units. A alone takes 30 / 2 = 15 days.",
        "explanation_hi": "माना B की कार्यक्षमता = 1 इकाई/दिन। A की कार्यक्षमता = 2 इकाई/दिन। कुल कार्य = (1 + 2) * 10 = 30 इकाई। A अकेला 30 / 2 = 15 दिन लेगा।"
    },
    {
        "subject": "Mathematics",
        "topic": "Samay aur Kaam (Time & Work)",
        "question_en": "5 men can complete a work in 10 days, and 10 women can complete the same work in 5 days. How many days will 2 men and 4 women take to complete the work?",
        "question_hi": "5 पुरुष एक कार्य 10 दिनों में पूरा कर सकते हैं, और 10 महिलाएँ उसी कार्य को 5 दिनों में पूरा कर सकती हैं। 2 पुरुष और 4 महिलाएँ इस कार्य को पूरा करने में कितने दिन लेंगे?",
        "A_en": "8.33 days", "A_hi": "8.33 दिन",
        "B_en": "7.5 days", "B_hi": "7.5 दिन",
        "C_en": "6.25 days", "C_hi": "6.25 दिन",
        "D_en": "9 days", "D_hi": "9 दिन",
        "answer": "A",
        "explanation_en": "Work rate of 5 men = 5 * 10 = 50 man-days. Work rate of 10 women = 10 * 5 = 50 woman-days. Total work = 50 units. 2 men + 4 women = 2 + 4 = 6 units. Time = 50 / 6 ≈ 8.33 days.",
        "explanation_hi": "5 पुरुषों की कार्य दर = 5 * 10 = 50 पुरुष-दिन। 10 महिलाओं की कार्य दर = 10 * 5 = 50 महिला-दिन। कुल कार्य = 50 इकाई। 2 पुरुष + 4 महिलाएँ = 2 + 4 = 6 इकाई। समय = 50 / 6 ≈ 8.33 दिन।"
    },
    {
        "subject": "Mathematics",
        "topic": "Samay aur Kaam (Time & Work)",
        "question_en": "Pipe A can fill a tank in 6 hours, and Pipe B can fill it in 4 hours. Both pipes are opened for 1 hour, then Pipe B is closed. How long will Pipe A take to fill the remaining tank?",
        "question_hi": "नल A एक टैंक को 6 घंटे में भर सकता है, और नल B इसे 4 घंटे में भर सकता है। दोनों नल 1 घंटे तक खोले जाते हैं, फिर नल B बंद कर दिया जाता है। शेष टैंक को भरने में नल A कितना समय लेगा?",
        "A_en": "3.5 hours", "A_hi": "3.5 घंटे",
        "B_en": "4 hours", "B_hi": "4 घंटे",
        "C_en": "2.5