<think>
Okay, let's tackle this. The user wants 10 high-quality MCQs on Rajasthan Culture for exams like LDC, CET, RAS, SSC, and Railway. They need both Hindi and English versions in a specific JSON format. First, I need to cover various aspects of Rajasthan's culture like dance, music, festivals, folk tales, architecture, etc.

Starting with the first question on folk dances. Garba is a popular one. Wait, but Garba is actually from Gujarat. So maybe Rajasthani folk dances like Ghoomar, Kalbeliya, or Kathodi would be better. Let me confirm. Yes, Kalbeliya is a Rajasthani dance. Then the second question could be about a festival, like Gangaur. The third might be about a famous temple, like Dilwara in Mount Abu. 

For the fourth question, a well-known folk tale like Pabuji Ki Katha comes to mind. Next, the traditional attire for women would be Gangahariya. Then, a famous folk singer like Bhajan Lal Joshi. The seventh question could be about a traditional craft, maybe Blue pottery. 

Rajasthani thali with dal and bajra could be the eighth question. The ninth might be a traditional weapon like Khanda. Lastly, a famous folk dance for men, like Kathodi. I need to ensure all answers are accurate, options are plausible, and explanations are concise. Also, check that the topic is filled correctly. Let me verify each point for correctness before finalizing the JSON.
</think>

[
{
  "subject": "Rajasthan Culture",
  "topic": "Folk Dances",
  "question_en": "Which of the following is a traditional folk dance form of Rajasthan?",
  "question_hi": "निम्नलिखित में से कौन राजस्थान का एक पारंपरिक लोक नृत्य है?",
  "A_en": "Garba",
  "A_hi": "गरबा",
  "B_en": "Kalbeliya",
  "B_hi": "कलबेलिया",
  "C_en": "Bhangra",
  "C_hi": "भंगड़ा",
  "D_en": "Chhau",
  "D_hi": "छऊ",
  "answer": "B",
  "explanation_en": "Kalbeliya is a traditional folk dance form of Rajasthan, performed by the Kalbeliya community.",
  "explanation_hi": "कलबेलिया राजस्थान का एक पारंपरिक लोक नृत्य है, जो कलबेलिया समुदाय द्वारा प्रस्तुत किया जाता है।"
},
{
  "subject": "Rajasthan Culture",
  "topic": "Festivals",
  "question_en": "Which festival is celebrated to honor the goddess Gauri in Rajasthan?",
  "question_hi": "राजस्थान में गौरी देवी के सम्मान में कौन-सा त्योहार मनाया जाता है?",
  "A_en": "Diwali",
  "A_hi": "दिवाली",
  "B_en": "Gangaur",
  "B_hi": "गंगौर",
  "C_en": "Holi",
  "C_hi": "होली",
  "D_en": "Navratri",
  "D_hi": "नवरात्रि",
  "answer": "B",
  "explanation_en": "Gangaur is a traditional festival of Rajasthan celebrated to honor the goddess Gauri.",
  "explanation_hi": "गंगौर राजस्थान का एक पारंपरिक त्योहार है, जो गौरी देवी के सम्मान में मनाया जाता है।"
},
{
  "subject": "Rajasthan Culture",
  "topic": "Temples",
  "question_en": "Which temple complex is located in Mount Abu, Rajasthan?",
  "question_hi": "राजस्थान के माउंट आबू में कौन-सा मंदिर समूह स्थित है?",
  "A_en": "Chand Baori",
  "A_hi": "चांद बावड़ी",
  "B_en": "Dilwara",
  "B_hi": "दिलवाड़ा",
  "C_en": "Jagatdhatri",
  "C_hi": "जगत्धात्री",
  "D_en": "Marwar",
  "D_hi": "मारवाड़",
  "answer": "B",
  "explanation_en": "The Dilwara Temple complex is located in Mount Abu, Rajasthan.",
  "explanation_hi": "दिलवाड़ा मंदिर समूह राजस्थान के माउंट आबू में स्थित है।"
},
{
  "subject": "Rajasthan Culture",
  "topic": "Folk Tales",
  "question_en": "Which of the following is a famous Rajasthani folk tale about a king and a monkey?",
  "question_hi": "निम्नलिखित में से कौन-सा राजस्थानी लोककथा राजा और बन्दर के बारे में है?",
  "A_en": "Pabuji Ki Katha",
  "A_hi": "पबूजी की कथा",
  "B_en": "Raslila",
  "B_hi": "रासलीला",
  "C_en": "Bhakta Prahlad",
  "C_hi": "भक्त प्रहलाद",
  "D_en": "Karnail Bhatt",
  "D_hi": "करनैल भट्ट",
  "answer": "A",
  "explanation_en": "Pabuji Ki Katha is a famous Rajasthani folk tale about King Pabu and his monkey companion.",
  "explanation_hi": "पबूजी की कथा राजस्थानी लोककथा है जो राजा पबू और उनके बन्दर साथी के बारे में है।"
},
{
  "subject": "Rajasthan Culture",
  "topic": "Traditional Attire",
  "question_en": "What is the traditional attire worn by Rajasthani women called?",
  "question_hi": "राजस्थानी महिलाओं द्वारा पहने जाने वाले पारंपरिक पोशाक का नाम क्या है?",
  "A_en": "Saree",
  "A_hi": "साड़ी",
  "B_en": "Gangahariya",
  "B_hi": "गंगाहरिया",
  "C_en": "Chaniya Choli",
  "C_hi": "चानिया चोली",
  "D_en": "Lehenga",
  "D_hi": "लेहंगा",
  "answer": "B",
  "explanation_en": "Gangahariya is the traditional attire of Rajasthani women, characterized by a long skirt and blouse with mirror work.",
  "explanation_hi": "गंगाहरिया राजस्थानी महिलाओं का पारंपरिक पोशाक है, जिसमें लंबी साड़ी और ब्लाउज होते हैं और जिन पर दर्पण का कार्य होता है।"
},
{
  "subject": "Rajasthan Culture",
  "topic": "Folk Music",
  "question_en": "Who is a renowned Rajasthani folk singer?",
  "question_hi": "राजस्थानी लोकगायक में कौन प्रसिद्ध है?",
  "A_en": "Bhajan Lal Joshi",
  "A_hi": "भजन लाल जोशी",
  "B_en": "Ravindra Jain",
  "B_hi": "रविंद्र जैन",
  "C_en": "Anup Jalota",
  "C_hi": "अनुप जलोता",
  "D_en": "Shreya Ghoshal",
  "D_hi": "श्रेया घोषाल",
  "answer": "A",
  "explanation_en": "Bhajan Lal Joshi is a renowned Rajasthani folk singer known for his contributions to Rajasthani music.",
  "explanation_hi": "भजन लाल जोशी राजस्थानी लोकगायक हैं, जिनके राजस्थानी संगीत में योगदान के लिए प्रसिद्धि है।"
},
{
  "subject": "Rajasthan Culture",
  "topic": "Traditional Crafts",
  "question_en": "Which of the following is a traditional craft of Rajasthan known for its blue pottery?",
  "question_hi": "निम्नलिखित में से कौन राजस्थान की वह पारंपरिक कला है जिसे नीली मिट्टी के बर्तनों के लिए जाना जाता है?",
  "A_en": "Block Printing",
  "A_hi": "ब्लॉक प्रिंटिंग",
  "B_en": "Blue Pottery",
  "B_hi": "नीली मिट्टी के बर्तन",
  "C_en": "Miniature Painting",
  "C_hi": "मिनी चित्रकला",
  "D_en": "Embroidery",
  "D_hi": "शिल्प कारीगरी",
  "answer": "B",
  "explanation_en": "Blue pottery is a traditional craft of Rajasthan, known for its unique cobalt blue glaze.",
  "explanation_hi": "नीली मिट्टी के बर्तन राजस्थान की एक पारंपरिक कला है, जिसके लिए अद्वितीय कोबाल्ट नीली झालर के लिए जाना जाता है।"
},
{
  "subject": "Rajasthan Culture",
  "topic": "Cuisine",
  "question_en": "What is a traditional Rajasthani dish made with lentils and bajra?",
  "question_hi": "अलसी और बाजरा से बनाई गई एक पारंपरिक राजस्थानी डिश कौन-सी है?",
  "A_en": "Dal Baati",
  "A_hi": "दाल बाटी",
  "B_en": "Gatte ki Sabzi",
  "B_hi": "गट्टे की सब्जी",
  "C_en": "Churma",
  "C_hi": "चूरमा",
  "D_en": "Rajma",
  "D_hi": "राजमा",
  "answer": "A",
  "explanation_en": "Dal Baati is a traditional Rajasthani dish made with lentils and bajra (millet).",
  "explanation_hi": "दाल बाटी एक पारंपरिक राजस्थानी डिश है, जो अलसी और बाजरा (ज्वार) से बनाई जाती है।"
},
{
  "subject": "Rajasthan Culture",
  "topic": "Weapons",
  "question_en": "Which traditional weapon is associated with Rajasthani warriors?",
  "question_hi": "राजस्थानी सैनिकों से कौन-सा पारंपरिक हथियार संबंधित है?",
  "A_en": "Khanda",
  "A_hi": "खंडा",
  "B_en": "Torch",
  "B_hi": "टॉर्च",
  "C_en": "Sword",
  "C_hi": "तलवार",
  "D_en": "Bamboo Stick",
  "D_hi": "बांस की छड़ी",
  "answer": "A",
  "explanation_en": "Khanda is a traditional weapon of Rajasthani warriors, often depicted in Rajasthani miniature paintings.",
  "explanation_hi": "खंडा राजस्थानी सैनिकों का एक पारंपरिक हथियार है, जो राजस्थानी मिनी चित्रकला में दर्शाया गया है।"
},
{
  "subject": "Rajasthan Culture",
  "topic": "Folk Dances",
  "question_en": "Which of the following dances is performed during the monsoon season in Rajasthan?",
  "question_hi": "निम्नलिखित में से कौन-सा नृत्य राजस्थान में बरसात के मौसम में प्रस्तुत किया जाता है?",
  "A_en": "Kathodi",
  "A_hi": "कथोड़ी",
  "B_en": "Ghoomar",
  "B_hi": "घूमर",
  "C_en": "Chakri",
  "C_hi": "चाकरी",
  "D_en": "Bhavai",
  "D_hi": "भवाई",
  "answer": "A",
  "explanation_en": "Kathodi is a traditional Rajasthani folk dance performed during the monsoon season.",
  "explanation_hi": "कथोड़ी एक पारंपरिक राजस्थानी लोक नृत्य है, जो बरसात के मौसम में प्रस्तुत किया जाता है।"
}
]