<think>
Okay, I need to create 10 high-quality MCQs on Rajasthan Culture for exams like LDC, CET, RAS, SSC, and Railway. Let me start by thinking about different aspects of Rajasthan's culture. Folk music and dance are important, so maybe questions on that. Then there's traditional attire, festivals like Diwali or Gangaur, historical figures like Maharana Pratap, architecture like forts and palaces, cuisine, and maybe some arts like block printing or miniature paintings.

First question: What is the significance of the Gangaur Festival? I should check if it's a major festival in Rajasthan. Yes, it's a women's festival dedicated to Goddess Gauri, celebrated in Jaipur. The answer would be that it's a women's festival. Options could include other festivals like Teej or Holi to confuse.

Second question: Which folk dance is performed during the Phalgun month? Kalbeliya is a famous dance, right? They perform during Phalgun, so the answer is Kalbeliya. Other options could be Ghoomar, Chari, or Kathakali.

Third question: Traditional attire of Rajasthani women. They wear Ghagra-Choli with Odhni. So the correct answer is Ghagra-Choli. Other options like Sari or Ghungroo might be distractors.

Fourth question: Who composed the famous Rajasthani folk song "Kanha Kavariya"? I think it's a folk song about Krishna and Radha, but the composer might not be a specific person, but since it's a folk song, maybe the answer is unknown, but the options might include a folk tradition.

Fifth question: Which of these is a traditional Rajasthani dish? Dal Bati is definitely a staple. Other options could be Biryani or Chole Bhature, which are common in other regions.

Sixth question: What is 'Chandela' in Rajasthan? It's a type of folk music, but maybe it's a dance or a festival. Wait, Chandela is actually a folk song sung by the community. Need to confirm. Alternatively, maybe it's a dance form. Let me verify. Chandela is a folk dance performed in Bundi. So answer is a folk dance.

Seventh question: Which Rajasthani king is known for the construction of the Mehrangarh Fort? The answer is Rao Jodha. Other options could be Raja Man Singh or Sawai Jai Singh.

Eighth question: What is the significance of the 'Lad Dhol' dance? It's performed by men, especially during Teej, but maybe it's associated with harvest festivals. The correct answer would be that it's a male dance performed in groups.

Ninth question: Which of the following is a traditional Rajasthani art form? Miniature paintings are practiced here, especially in Nathdwara. So answer is Miniature painting. Other options like Pottery or Weaving could be distractors.

Tenth question: Who is the traditional folk deity of the Bhil tribe in Rajasthan? The answer is Mahaveer. Other options could be Gogaji or Ramdevji, who are also deities but need to check which is specific to Bhil.

Now, I need to structure each question in the required JSON format, ensuring Hindi and English versions of the question and options, correct answer, and explanations. Make sure the difficulty level is set according to Rajasthan's culture topics. Check for any inaccuracies, like confirming the correct composer or the correct festival associations. Also, ensure that the options are plausible and not too obvious to test the candidates properly.
</think>

[
  {
    "subject": "Rajasthan Culture",
    "topic": "Festivals",
    "question_en": "Which festival is dedicated to Goddess Gauri and celebrated mainly by women in Rajasthan?",
    "question_hi": "राजस्थान में श्री गौरी देवी के समर्पित अनुष्ठान कौन सा है जो मुख्य रूप से महिलाओं द्वारा मनाया जाता है?",
    "A_en": "Gangaur Festival",
    "A_hi": "गंगौर महोत्सव",
    "B_en": "Diwali",
    "B_hi": "दिवाली",
    "C_en": "Holi",
    "C_hi": "होली",
    "D_en": "Kumbh Mela",
    "D_hi": "कुंभ मेला",
    "answer": "A",
    "explanation_en": "Gangaur Festival is a significant women's festival in Rajasthan dedicated to Goddess Gauri, celebrated with great enthusiasm in Jaipur.",
    "explanation_hi": "गंगौर महोत्सव राजस्थान में महिलाओं के लिए महत्वपूर्ण एक अनुष्ठान है, जिसमें श्री गौरी देवी के समर्पित जयपुर में मनाया जाता है।"
  },
  {
    "subject": "Rajasthan Culture",
    "topic": "Folk Dances",
    "question_en": "Which traditional folk dance is performed during the Phalgun month in Rajasthan?",
    "question_hi": "राजस्थान में फाल्गुन माह में कौन सा वैश्विक जनजातीय नृत्य मनाया जाता है?",
    "A_en": "Kalbeliya",
    "A_hi": "कलबेलिया",
    "B_en": "Ghoomar",
    "B_hi": "घूमर",
    "C_en": "Chari",
    "C_hi": "चारी",
    "D_en": "Kathakali",
    "D_hi": "कथकली",
    "answer": "A",
    "explanation_en": "Kalbeliya is a traditional Rajasthani folk dance performed during the Phalgun month to honor the serpent deities.",
    "explanation_hi": "कलबेलिया राजस्थान का एक पारम्परिक जनजातीय नृत्य है जो सर्प देवताओं के आह्वान के लिए फाल्गुन माह में मनाया जाता है।"
  },
  {
    "subject": "Rajasthan Culture",
    "topic": "Traditional Attire",
    "question_en": "What is the traditional attire of Rajasthani women?",
    "question_hi": "राजस्थानी महिलाओं का पारम्परिक पोशाक क्या है?",
    "A_en": "Ghagra-Choli",
    "A_hi": "घगरा-चोली",
    "B_en": "Sari",
    "B_hi": "साड़ी",
    "C_en": "Odhni",
    "C_hi": "ओढ़नी",
    "D_en": "Both A and C",
    "D_hi": "A और C दोनों",
    "answer": "D",
    "explanation_en": "Rajasthani women traditionally wear Ghagra-Choli with Odhni (veil) as part of their attire.",
    "explanation_hi": "राजस्थानी महिलाएं अपने पारम्परिक पोशाक के रूप में घगरा-चोली और ओढ़नी (चुनरी) पहनती हैं।"
  },
  {
    "subject": "Rajasthan Culture",
    "topic": "Folk Songs",
    "question_en": "Which Rajasthani folk song is dedicated to the love story of Krishna and Radha?",
    "question_hi": "राजस्थानी लोक गीत में कौन सा गीत कृष्ण और राधा के प्रेम कहानी पर आधारित हैं?",
    "A_en": "Kanha Kavariya",
    "A_hi": "कन्हा कावरिया",
    "B_en": "Ras Leela",
    "B_hi": "रास लीला",
    "C_en": "Malwa Geet",
    "C_hi": "मालवा गीत",
    "D_en": "Bhajan",
    "D_hi": "भजन",
    "answer": "A",
    "explanation_en": "Kanha Kavariya is a popular Rajasthani folk song celebrating the love between Krishna and Radha.",
    "explanation_hi": "कन्हा कावरिया राजस्थान के लोक गीतों में एक लोकप्रिय गीत है जो कृष्ण और राधा के प्रेम की कहानी को चित्रित करता है।"
  },
  {
    "subject": "Rajasthan Culture",
    "topic": "Cuisine",
    "question_en": "Which dish is a traditional staple of Rajasthani cuisine?",
    "question_hi": "राजस्थानी खाने की कौन सी विशिष्ट व्यंजन है?",
    "A_en": "Dal Bati",
    "A_hi": "दाल बाती",
    "B_en": "Biryani",
    "B_hi": "बिरयानी",
    "C_en": "Chole Bhature",
    "C_hi": "चूले भटूरे",
    "D_en": "Kheer",
    "D_hi": "कीर",
    "answer": "A",
    "explanation_en": "Dal Bati is a traditional Rajasthani dish made with lentils and wheat dough, representing the region's dry climate adaptability.",
    "explanation_hi": "दाल बाती राजस्थान की एक पारम्परिक व्यंजन है जो मूंग दाल और गेहूं के आटे से बनाया जाता है और शुष्क जलवायु के अनुकूल है।"
  },
  {
    "subject": "Rajasthan Culture",
    "topic": "Folk Music",
    "question_en": "What is 'Chandela' in Rajasthan?",
    "question_hi": "राजस्थान में 'चन्देला' क्या है?",
    "A_en": "A Folk Dance",
    "A_hi": "एक जनजातीय नृत्य",
    "B_en": "A Folk Song",
    "B_hi": "एक जनजातीय गीत",
    "C_en": "A Musical Instrument",
    "C_hi": "एक संगीत यंत्र",
    "D_en": "A Festival",
    "D_hi": "एक उत्सव",
    "answer": "B",
    "explanation_en": "Chandela is a traditional Rajasthani folk song that reflects the cultural heritage of the Bundi region.",
    "explanation_hi": "चन्देला राजस्थान का एक पारम्परिक लोक गीत है जो बूंदी क्षेत्र के सांस्कृतिक विरासत को दर्शाता है।"
  },
  {
    "subject": "Rajasthan Culture",
    "topic": "Historical Figures",
    "question_en": "Which Rajasthani king is associated with the construction of Mehrangarh Fort?",
    "question_hi": "राजस्थान के किस राजा जोधपुर के महाराजा जोधा राव के संरक्षण के प्रसिद्ध महाराजा महाराजा जोधा राव के निर्माण से जुड़े हुए हैं?",
    "A_en": "Rao Jodha",
    "A_hi": "राव जोधा",
    "B_en": "Raja Man Singh",
    "B_hi": "राजा मान सिंह",
    "C_en": "Sawai Jai Singh",
    "C_hi": "सवाई जय सिंह",
    "D_en": "Raja Ratan Singh",
    "D_hi": "राजा रतन सिंह",
    "answer": "A",
    "explanation_en": "Rao Jodha founded Jodhpur and constructed the Mehrangarh Fort in the 15th century.",
    "explanation_hi": "राव जोधा ने 15वीं शताब्दी में जोधपुर की स्थापना की और महाराजा महाराजा जोधा राव का निर्माण किया।"
  },
  {
    "subject": "Rajasthan Culture",
    "topic": "Folk Dances",
    "question_en": "What is the significance of the 'Lad Dhol' dance in Rajasthan?",
    "question_hi": "राजस्थान में 'लाड़ ढोल' नृत्य का महत्व क्या है?",
    "A_en": "Performed during Teej festival",
    "A_hi": "तीज महोत्सव में मनाया जाता है",
    "B_en": "Performed by women in groups",
    "B_hi": "महिलाओं के दलों द्वारा मनाया जाता है",
    "C_en": "Celebrates harvest season",
    "C_hi": "कृषि अवधि की आह्लाद छोड़ता है",
    "D_en": "A martial dance form",
    "D_hi": "एक सांस्कृतिक नृत्य रूप",
    "answer": "C",
    "explanation_en": "Lad Dhol is a traditional male dance performed by men in groups to celebrate the harvest season in Rajasthan.",
    "explanation_hi": "लाड़ ढोल एक पारम्परिक पुरुष नृत्य है जो राजस्थान में कृषि अवधि के उत्सव के लिए पुरुषों द्वारा एक समूह में मनाया जाता है।"
  },
  {
    "subject": "Rajasthan Culture",
    "topic": "Art Forms",
    "question_en": "Which traditional art form is famous for intricate miniature paintings in Rajasthan?",
    "question_hi": "राजस्थान में मुक्ता चित्रकला के लिए कौन सा पारम्परिक कला रूप प्रसिद्ध है?",
    "A_en": "Miniature Painting",
    "A_hi": "मिनी चित्रकला",
    "B_en": "Pottery",
    "B_hi": "मिट्टी के बर्तन",
    "C_en": "Wood Carving",
    "C_hi": "लकड़ी की काटिंग",
    "D_en": "Block Printing",
    "D_hi": "ब्लॉक प्रिंटिंग",
    "answer": "A",
    "explanation_en": "Miniature painting is a renowned art form in Rajasthan, especially in Nathdwara and Kishangarh, known for its intricate details.",
    "explanation_hi": "मिनी चित्रकला नाथद्वारा और किशंगढ़ में राजस्थान की एक प्र