[
{
"subject": "Rajasthan Culture",
"topic": "Folk Dance",
"question_en": "Which of the following folk dance is traditionally performed by the women of Rajasthan?",
"question_hi": "राजस्थान की महिलाओं द्वारा पारंपरिक रूप से कौन सी लोक नृत्य की जाती है?",
"A_en": "Ghoomar", "A_hi": "घूमर",
"B_en": "Kalbeliya", "B_hi": "कलबेलिया",
"C_en": "Chari", "C_hi": "चारी",
"D_en": "Daph", "D_hi": "दाफ़",
"answer": "A",
"explanation_en": "Ghoomar is a traditional folk dance of Rajasthan, primarily performed by women.",
"explanation_hi": "घूमर राजस्थान का एक पारंपरिक लोक नृत्य है, जिसे मुख्य रूप से महिलाएं करती हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Cuisine",
"question_en": "Which of the following is a popular street food in Rajasthan?",
"question_hi": "राजस्थान में कौन सा एक लोकप्रिय स्ट्रीट फूड है?",
"A_en": "Kachoris", "A_hi": "कचौड़ियाँ",
"B_en": "Mirchi Bada", "B_hi": "मिर्ची बाड़ा",
"C_en": "Pyaz Kachori", "C_hi": "प्याज कचौड़ी",
"D_en": "Dal Bati Churma", "D_hi": "दाल बाटी चूरमा",
"answer": "B",
"explanation_en": "Mirchi Bada is a popular street food in Rajasthan, consisting of fried green chilies filled with spiced potatoes and chickpeas.",
"explanation_hi": "मिर्ची बाड़ा राजस्थान में एक लोकप्रिय स्ट्रीट फूड है, जिसमें बारीकी से तले हुए हरे मिर्च को आलू और चने के मिश्रण से भरा जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Music",
"question_en": "Which of the following is a traditional musical instrument of Rajasthan?",
"question_hi": "राजस्थान का एक पारंपरिक संगीत वाद्य है:",
"A_en": "Dholak", "A_hi": "धोलक",
"B_en": "Manganiyar", "B_hi": "मंगानियार",
"C_en": "Pakhawaj", "C_hi": "पखावज",
"D_en": "Been", "D_hi": "बीन",
"answer": "B",
"explanation_en": "Manganiyar is a traditional musical instrument of Rajasthan, used in various folk music forms.",
"explanation_hi": "मंगानियार राजस्थान का एक पारंपरिक संगीत वाद्य है, जो विभिन्न लोक संगीत रूपों में उपयोग किया जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Architecture",
"question_en": "Which of the following architectural style is characteristic of Rajasthani palaces?",
"question_hi": "राजस्थानी महलों में कौन सी वास्तुकला शैली पाई जाती है?",
"A_en": "Islamic", "A_hi": "इस्लामिक",
"B_en": "Rajput", "B_hi": "राजपूत",
"C_en": "Indian", "C_hi": "भारतीय",
"D_en": "Greek", "D_hi": "ग्रीक",
"answer": "B",
"explanation_en": "Rajput architecture is characteristic of Rajasthani palaces, known for its intricate carvings and ornate decorations.",
"explanation_hi": "राजपूत वास्तुकला राजस्थानी महलों की विशेषता है, जो जटिल नक्काशी और सजावटी विवरणों के लिए जानी जाती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Festivals",
"question_en": "Which of the following festivals is celebrated with great enthusiasm in Rajasthan?",
"question_hi": "राजस्थान में कौन सा त्योहार उत्साह से मनाया जाता है?",
"A_en": "Diwali", "A_hi": "दिवाली",
"B_en": "Holi", "B_hi": "होली",
"C_en": "Navratri", "C_hi": "नवरात्रि",
"D_en": "Gangaur", "D_hi": "गंगौर",
"answer": "D",
"explanation_en": "Gangaur is a significant festival in Rajasthan, celebrated with great enthusiasm, especially by women.",
"explanation_hi": "गंगौर राजस्थान में एक महत्वपूर्ण त्योहार है, जिसे उत्साह से मनाया जाता है, विशेषकर महिलाओं द्वारा।"
},
{
"subject": "Rajasthan Culture",
"topic": "Art",
"question_en": "Which of the following forms of art is commonly found in Rajasthan?",
"question_hi": "राजस्थान में कौन सा कला रूप पाया जाता है?",
"A_en": "Miniature Painting", "A_hi": "मिनिएचर पेंटिंग",
"B_en": "Wood Carving", "B_hi": "वुड कैरविंग",
"C_en": "Embroidery", "C_hi": "एंब्रॉयड्री",
"D_en": "Pottery", "D_hi": "पॉटरी",
"answer": "C",
"explanation_en": "Embroidery is a common form of art in Rajasthan, known for its intricate and colorful designs.",
"explanation_hi": "एंब्रॉयड्री राजस्थान में एक आम कला रूप है, जो जटिल और रंगीन डिज़ाइनों के लिए जानी जाती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Heritage",
"question_en": "Which of the following is a UNESCO World Heritage Site in Rajasthan?",
"question_hi": "राजस्थान में कौन सा यूनेस्को विश्व धरोहर स्थल है?",
"A_en": "Amer Fort", "A_hi": "आमेर किला",
"B_en": "Hawa Mahal", "B_hi": "हवा महल",
"C_en": "Jaisalmer Fort", "C_hi": "जैसलमेर किला",
"D_en": "Chittorgarh Fort", "D_hi": "चित्तौड़गढ़ किला",
"answer": "D",
"explanation_en": "Chittorgarh Fort is a UNESCO World Heritage Site in Rajasthan, known for its historical significance and architectural beauty.",
"explanation_hi": "चित्तौड़गढ़ किला राजस्थान में एक यूनेस्को विश्व धरोहर स्थल है, जो इतिहास की महत्ता और वास्तुकला की सुंदरता के लिए जाना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "History",
"question_en": "Which of the following dynasties ruled Rajasthan in the 16th century?",
"question_hi": "16वीं शताब्दी में राजस्थान पर कौन सा वंश शासन करता था?",
"A_en": "Rajput", "A_hi": "राजपूत",
"B_en": "Mughal", "B_hi": "मुगल",
"C_en": "Maratha", "C_hi": "मराठा",
"D_en": "Sisodia", "D_hi": "सिसोदिया",
"answer": "A",
"explanation_en": "Rajput dynasty ruled Rajasthan in the 16th century, known for their bravery and military prowess.",
"explanation_hi": "राजपूत वंश 16वीं शताब्दी में राजस्थान पर शासन करता था, जो अपनी शूरवीरता और सैन्य प्रतिभा के लिए जाने जाते थे।"
},
{
"subject": "Rajasthan Culture",
"topic": "Festivals",
"question_en": "Which of the following festivals is celebrated with great enthusiasm in Rajasthan, especially by women?",
"question_hi": "राजस्थान में कौन सा त्योहार महिलाओं द्वारा उत्साह से मनाया जाता है?",
"A_en": "Diwali", "A_hi": "दिवाली",
"B_en": "Holi", "B_hi": "होली",
"C_en": "Navratri", "C_hi": "नवरात्रि",
"D_en": "Gangaur", "D_hi": "गंगौर",
"answer": "D",
"explanation_en": "Gangaur is a significant festival in Rajasthan, especially celebrated by women, who worship the goddess Gauri during this time.",
"explanation_hi": "गंगौर राजस्थान में एक महत्वपूर्ण त्योहार है, जिसे विशेषकर महिलाएं मनाती हैं, जो इस समय देवी गौरी की पूजा करती हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Art",
"question_en": "Which of the following forms of art is commonly found in Rajasthan, known for its intricate and colorful designs?",
"question_hi": "राजस्थान में कौन सा कला रूप पाया जाता है, जो जटिल और रंगीन डिज़ाइनों के लिए जाना जाता है?",
"A_en": "Miniature Painting", "A_hi": "मिनिएचर पेंटिंग",
"B_en": "Wood Carving", "B_hi": "वुड कैरविंग",
"C_en": "Embroidery", "C_hi": "एंब्रॉयड्री",
"D_en": "Pottery", "D_hi": "पॉटरी",
"answer": "C",
"explanation_en": "Embroidery is a common form of art in Rajasthan, known for its intricate and colorful designs, often used in traditional clothing and textiles.",
"explanation_hi": "एंब्रॉयड्री राजस्थान में एक आम कला रूप है, जो जटिल और रंगीन डिज़ाइनों के लिए जानी जाती है, जिसे अक्सर पारंपरिक वेशभूषा और टेक्सटाइल्स में उपयोग किया जाता है।"
}