[
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Vastra (Costumes) aur Aabhushan (Ornaments)",
"question_en": "Which traditional garment is a long, flared skirt worn by Rajasthani women?",
"question_hi": "कौन सा पारंपरिक वस्त्र एक लम्बी, फड़फड़ाती स्कर्ट है जो राजस्थानी महिलाओं द्वारा पहनी जाती है?",
"A_en": "Ghagra", "A_hi": "घाघरा",
"B_en": "Saree", "B_hi": "साड़ी",
"C_en": "Lehenga", "C_hi": "लेहंगा",
"D_en": "Salwar", "D_hi": "सलवार",
"answer": "A",
"explanation_en": "Ghagra is the traditional long, flared skirt that forms a key part of Rajasthani women's attire.",
"explanation_hi": "घाघरा वह पारंपरिक लम्बी, फड़फड़ाती स्कर्ट है जो राजस्थानी महिलाओं के परिधान का मुख्य हिस्सा है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Vastra (Costumes) aur Aabhushan (Ornaments)",
"question_en": "What is the name of the traditional upper garment worn by Rajasthani men, often tied at the side?",
"question_hi": "राजस्थानी पुरुषों द्वारा पहना जाने वाला पारंपरिक ऊपरी वस्त्र, जो अक्सर बगल में बांधा जाता है, उसका क्या नाम है?",
"A_en": "Kurta", "A_hi": "कुर्ता",
"B_en": "Angarkha", "B_hi": "अंगरखा",
"C_en": "Sherwani", "C_hi": "शेरवानी",
"D_en": "Jacket", "D_hi": "जैकेट",
"answer": "B",
"explanation_en": "Angarkha is a traditional wrap‑around upper garment commonly worn by men in Rajasthan.",
"explanation_hi": "अंगरखा एक पारंपरिक लपेटने वाला ऊपरी वस्त्र है जो राजस्थान में पुरुषों द्वारा आमतौर पर पहना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Vastra (Costumes) aur Aabhushan (Ornaments)",
"question_en": "Which lower garment, tied at the waist and draped around the legs, is traditionally worn by Rajasthani men?",
"question_hi": "कौन सा निचला वस्त्र, कमर पर बांधा जाता है और पैरों के चारों ओर लपेटा जाता है, पारंपरिक रूप से राजस्थानी पुरुषों द्वारा पहना जाता है?",
"A_en": "Jeans", "A_hi": "जीन्स",
"B_en": "Dhoti", "B_hi": "धोती",
"C_en": "Pajama", "C_hi": "पजामा",
"D_en": "Shorts", "D_hi": "शॉर्ट्स",
"answer": "B",
"explanation_en": "Dhoti is the traditional draped lower garment worn by men in Rajasthan, especially during festivals.",
"explanation_hi": "धोती वह पारंपरिक लपेटा हुआ निचला वस्त्र है जिसे राजस्थान में पुरुषों द्वारा, विशेषकर त्यौहारों में, पहना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Vastra (Costumes) aur Aabhushan (Ornaments)",
"question_en": "What is the traditional name of the turban worn by Rajasthani men?",
"question_hi": "राजस्थानी पुरुषों द्वारा पहने जाने वाले पारंपरिक पगड़ी का क्या नाम है?",
"A_en": "Pagri", "A_hi": "पगड़ी",
"B_en": "Topi", "B_hi": "टोपी",
"C_en": "Dupatta", "C_hi": "दुपट्टा",
"D_en": "Bandana", "D_hi": "बैंडाना",
"answer": "A",
"explanation_en": "Pagri (turban) is an essential part of a Rajasthani man's traditional attire.",
"explanation_hi": "पगड़ी (टर्बन) राजस्थानी पुरुष के पारंपरिक परिधान का अनिवार्य हिस्सा है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Vastra (Costumes) aur Aabhushan (Ornaments)",
"question_en": "Which ornament, a large nose ring, is commonly worn by Rajasthani brides?",
"question_hi": "कौन सा आभूषण, बड़ा नथ (नाक की अंगूठी), राजस्थानी दुल्हनों द्वारा आमतौर पर पहना जाता है?",
"A_en": "Bajuband", "A_hi": "बाजूबंद",
"B_en": "Nath", "B_hi": "नथ",
"C_en": "Mala", "C_hi": "माला",
"D_en": "Kamarband", "D_hi": "कमरबंद",
"answer": "B",
"explanation_en": "Nath is the prominent nose ring that adorns Rajasthani brides during weddings.",
"explanation_hi": "नथ वह प्रमुख नाक की अंगूठी है जो राजस्थानी दुल्हनों को शादी के समय सजाती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Vastra (Costumes) aur Aabhushan (Ornaments)",
"question_en": "What is the traditional Rajasthani women's necklace called, often made of gold and beads?",
"question_hi": "राजस्थानी महिलाओं की पारंपरिक हार का क्या नाम है, जो अक्सर सोने और मोतियों से बनती है?",
"A_en": "Har", "A_hi": "हर",
"B_en": "Jhumka", "B_hi": "झुमका",
"C_en": "Bindi", "C_hi": "बिंदी",
"D_en": "Choker", "D_hi": "चॉकर",
"answer": "A",
"explanation_en": "Har is a traditional necklace worn by Rajasthani women, usually crafted in gold with beads or stones.",
"explanation_hi": "हर राजस्थानी महिलाओं द्वारा पहनी जाने वाली पारंपरिक हार है, जो आमतौर पर सोने में मोती या पत्थरों से बनती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Vastra (Costumes) aur Aabhushan (Ornaments)",
"question_en": "Which ankle ornament, often tinkling when walking, is a staple in Rajasthani women's jewellery?",
"question_hi": "कौन सी टखने की सजावट, चलने पर खनखनाती है, राजस्थानी महिलाओं के आभूषण में अनिवार्य है?",
"A_en": "Bajuband", "A_hi": "बाजूबंद",
"B_en": "Payal", "B_hi": "पायल",
"C_en": "Kamarband", "C_hi": "कमरबंद",
"D_en": "Kangan", "D_hi": "कंगन",
"answer": "B",
"explanation_en": "Payal (anklet) is a traditional ankle ornament that produces a pleasant sound with every step.",
"explanation_hi": "पायल (पैर की जूड़ी) एक पारंपरिक टखने की सजावट है जो हर कदम पर सुखद ध्वनि उत्पन्न करती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Vastra (Costumes) aur Aabhushan (Ornaments)",
"question_en": "What is the name of the armlet worn by Rajasthani women, often richly embellished?",
"question_hi": "राजस्थानी महिलाओं द्वारा पहना जाने वाला बाजूबंद, अक्सर समृद्ध रूप से सजाया गया, उसका क्या नाम है?",
"A_en": "Kangan", "A_hi": "कंगन",
"B_en": "Bajuband", "B_hi": "बाजूबंद",
"C_en": "Kamarband", "C_hi": "कमरबंद",
"D_en": "Mochi", "D_hi": "मोची",
"answer": "B",
"explanation_en": "Bajuband is the decorative armlet that forms an important part of a Rajasthani woman's jewellery set.",
"explanation_hi": "बाजूबंद वह सजावटी कलाईबंद है जो राजस्थानी महिला के आभूषण सेट का महत्वपूर्ण हिस्सा बनता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Vastra (Costumes) aur Aabhushan (Ornaments)",
"question_en": "Which head ornament, a decorative band placed on the forehead, is typical in Rajasthani bridal attire?",
"question_hi": "कौन सा माथे पर लगने वाला सजावटी बैंड, राजस्थानी दुल्हन के परिधान में आम है?",
"A_en": "Matha Patti", "A_hi": "माथा पत्ती",
"B_en": "Bindi", "B_hi": "बिंदी",
"C_en": "Mala", "C_hi": "माला",
"D_en": "Tikka", "D_hi": "टिक्का",
"answer": "A",
"explanation_en": "Matha Patti is a decorative forehead band worn by brides in Rajasthan, often studded with gems.",
"explanation_hi": "माथा पत्ती एक सजावटी माथे की बैंड है जिसे राजस्थानी दुल्हनें पहनती हैं, अक्सर रत्नों से सजी होती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Vastra (Costumes) aur Aabhushan (Ornaments)",
"question_en": "Which traditional fabric technique, known for its tiny dot patterns, is widely used in Rajasthani clothing?",
"question_hi": "कौन सी पारंपरिक कपड़े की तकनीक, छोटे बिंदुओं के पैटर्न के लिए जानी जाती है, राजस्थानी वस्त्रों में व्यापक रूप से उपयोग होती है?",
"A_en": "Bandhani", "A_hi": "बन्धनी",
"B_en": "Chikankari", "B_hi": "चिकनकारी",
"C_en": "Kantha", "C_hi": "कांथा",
"D_en": "Patola", "D_hi": "पतोलिया",
"answer": "A",
"explanation_en": "Bandhani is a tie‑dye technique that creates tiny, intricate dot patterns, characteristic of Rajashi attire.",
"explanation_hi": "बन्धनी एक टाई‑डाई तकनीक है जो छोटे, जटिल बिंदु पैटर्न बनाती है, जो राजस्थानी परिधान की विशेषता है।"
}
]