[
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Lok Deviyan: Kuldevi aur Aaradhya Deviyan",
"question_en": "Which of the following is a prominent Kuldevi of the Rajput community in Rajasthan?",
"question_hi": "निम्नलिखित में से कौन राजस्थान में राजपूत समुदाय की एक प्रमुख कुलदेवी है?",
"A_en": "Durga", "A_hi": "दुर्गा",
"B_en": "Kali", "B_hi": "काली",
"C_en": "Ashapura Mata", "C_hi": "आशापूरा माता",
"D_en": "Shakti", "D_hi": "शक्ति",
"answer": "C",
"explanation_en": "Ashapura Mata is a prominent Kuldevi of the Rajput community in Rajasthan, especially for the Jadeja and Rathore clans.",
"explanation_hi": "आशापूरा माता राजस्थान में राजपूत समुदाय की एक प्रमुख कुलदेवी है, विशेष रूप से जाड़ेजा और राठौर वंश के लिए।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Lok Deviyan: Kuldevi aur Aaradhya Deviyan",
"question_en": "What is the significance of Kuldevi in Rajasthan's culture?",
"question_hi": "राजस्थान की संस्कृति में कुलदेवी का क्या महत्व है?",
"A_en": "Protection of the family", "A_hi": "परिवार की रक्षा",
"B_en": "Prosperity of the clan", "B_hi": "वंश की समृद्धि",
"C_en": "Spiritual guidance", "C_hi": "आध्यात्मिक मार्गदर्शन",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "Kuldevi holds significant importance in Rajasthan's culture as it is believed to provide protection to the family, ensure the prosperity of the clan, and offer spiritual guidance.",
"explanation_hi": "राजस्थान की संस्कृति में कुलदेवी का महत्वपूर्ण स्थान है क्योंकि यह परिवार की रक्षा, वंश की समृद्धि और आध्यात्मिक मार्गदर्शन प्रदान करने के लिए माना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Lok Deviyan: Kuldevi aur Aaradhya Deviyan",
"question_en": "Which of the following is an Aaradhya Devi worshipped in Rajasthan?",
"question_hi": "निम्नलिखित में से कौन राजस्थान में पूजी जाने वाली आराध्य देवी है?",
"A_en": "Gangaur", "A_hi": "गणगौर",
"B_en": "Teej", "B_hi": "तीज",
"C_en": "Navratri", "C_hi": "नवरात्रि",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "All of the above are Aaradhya Devis worshipped in Rajasthan. Gangaur is a festival dedicated to Gauri, Teej is a festival dedicated to Parvati, and Navratri is a festival dedicated to the nine forms of Durga.",
"explanation_hi": "उपरोक्त सभी राजस्थान में पूजी जाने वाली आराध्य देवियां हैं। गणगौर गौरी को समर्पित एक त्योहार है, तीज पार्वती को समर्पित एक त्योहार है, और नवरात्रि दुर्गा के नौ रूपों को समर्पित एक त्योहार है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Lok Deviyan: Kuldevi aur Aaradhya Deviyan",
"question_en": "What is the role of Kuldevi in the marriage ceremonies of Rajasthan?",
"question_hi": "राजस्थान के विवाह समारोह में कुलदेवी की भूमिका क्या है?",
"A_en": "To bless the couple", "A_hi": "दंपति को आशीर्वाद देना",
"B_en": "To perform rituals", "B_hi": "अनुष्ठानों को करना",
"C_en": "To provide protection", "C_hi": "सुरक्षा प्रदान करना",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "Kuldevi plays a significant role in the marriage ceremonies of Rajasthan. She is believed to bless the couple, perform rituals, and provide protection to the newlyweds.",
"explanation_hi": "राजस्थान के विवाह समारोह में कुलदेवी की महत्वपूर्ण भूमिका है। यह माना जाता है कि वह दंपति को आशीर्वाद देती है, अनुष्ठान करती है, और नवविवाहित जोड़े को सुरक्षा प्रदान करती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Lok Deviyan: Kuldevi aur Aaradhya Deviyan",
"question_en": "Which of the following is a famous Kuldevi temple in Rajasthan?",
"question_hi": "निम्नलिखित में से कौन राजस्थान में एक प्रसिद्ध कुलदेवी मंदिर है?",
"A_en": "Mehandipur Balaji Temple", "A_hi": "मेहंदीपुर बालाजी मंदिर",
"B_en": "Kaila Devi Temple", "B_hi": "कैला देवी मंदिर",
"C_en": "Ashapura Mata Temple", "C_hi": "आशापूरा माता मंदिर",
"D_en": "Brahma Temple", "D_hi": "ब्रह्मा मंदिर",
"answer": "C",
"explanation_en": "Ashapura Mata Temple is a famous Kuldevi temple in Rajasthan, located in the Nagaur district.",
"explanation_hi": "आशापूरा माता मंदिर राजस्थान में एक प्रसिद्ध कुलदेवी मंदिर है, जो नागौर जिले में स्थित है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Lok Deviyan: Kuldevi aur Aaradhya Deviyan",
"question_en": "What is the significance of Aaradhya Devis in Rajasthan's culture?",
"question_hi": "राजस्थान की संस्कृति में आराध्य देवियों का क्या महत्व है?",
"A_en": "They are worshipped for prosperity", "A_hi": "वे समृद्धि के लिए पूजी जाती हैं",
"B_en": "They are worshipped for protection", "B_hi": "वे सुरक्षा के लिए पूजी जाती हैं",
"C_en": "They are worshipped for spiritual growth", "C_hi": "वे आध्यात्मिक विकास के लिए पूजी जाती हैं",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "Aaradhya Devis in Rajasthan's culture are worshipped for various reasons including prosperity, protection, and spiritual growth.",
"explanation_hi": "राजस्थान की संस्कृति में आराध्य देवियों की पूजा विभिन्न कारणों से की जाती है, जिनमें समृद्धि, सुरक्षा और आध्यात्मिक विकास शामिल हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Lok Deviyan: Kuldevi aur Aaradhya Deviyan",
"question_en": "Which of the following Aaradhya Devis is associated with the festival of Navratri?",
"question_hi": "निम्नलिखित में से कौन सी आराध्य देवी नवरात्रि त्योहार से जुड़ी हुई है?",
"A_en": "Durga", "A_hi": "दुर्गा",
"B_en": "Kali", "B_hi": "काली",
"C_en": "Lakshmi", "C_hi": "लक्ष्मी",
"D_en": "Saraswati", "D_hi": "सरस्वती",
"answer": "A",
"explanation_en": "Durga is the Aaradhya Devi associated with the festival of Navratri, which is a nine-day celebration of the nine forms of Durga.",
"explanation_hi": "दुर्गा नवरात्रि त्योहार से जुड़ी आराध्य देवी है, जो दुर्गा के नौ रूपों की नौ दिवसीय उत्सव है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Lok Deviyan: Kuldevi aur Aaradhya Deviyan",
"question_en": "What is the role of Kuldevi in the social hierarchy of Rajasthan?",
"question_hi": "राजस्थान की सामाजिक व्यवस्था में कुलदेवी की भूमिका क्या है?",
"A_en": "To maintain social status", "A_hi": "सामाजिक स्थिति बनाए रखना",
"B_en": "To provide spiritual guidance", "B_hi": "आध्यात्मिक मार्गदर्शन प्रदान करना",
"C_en": "To resolve conflicts", "C_hi": "संघर्षों का समाधान करना",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "Kuldevi plays a significant role in the social hierarchy of Rajasthan, maintaining social status, providing spiritual guidance, and resolving conflicts.",
"explanation_hi": "राजस्थान की सामाजिक व्यवस्था में कुलदेवी की महत्वपूर्ण भूमिका है, सामाजिक स्थिति बनाए रखना, आध्यात्मिक मार्गदर्शन प्रदान करना और संघर्षों का समाधान करना।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Lok Deviyan: Kuldevi aur Aaradhya Deviyan",
"question_en": "Which of the following is a characteristic of Kuldevi worship in Rajasthan?",
"question_hi": "निम्नलिखित में से कौन राजस्थान में कुलदेवी पूजा की एक विशेषता है?",
"A_en": "It is a individualistic practice", "A_hi": "यह एक व्यक्तिगत अभ्यास है",
"B_en": "It is a communal practice", "B_hi": "यह एक सामुदायिक अभ्यास है",
"C_en": "It is a ritualistic practice", "C_hi": "यह एक अनुष्ठानिक अभ्यास है",
"D_en": "It is a philosophical practice", "D_hi": "यह एक दार्शनिक अभ्यास है",
"answer": "B",
"explanation_en": "Kuldevi worship in Rajasthan is a communal practice, where the entire community comes together to worship and offer prayers to the Kuldevi.",
"explanation_hi": "राजस्थान में कुलदेवी पूजा एक सामुदायिक अभ्यास है, जहां पूरा समुदाय एक साथ आता है और कुलदेवी की पूजा और प्रार्थना करता है।"
}
]