[
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "Which famous fair in Rajasthan is known for its vibrant camel procession?",
"question_hi": "राजस्थान में कौन सा प्रसिद्ध मेला अपने रंगीन ऊंट जुलूस के लिए जाना जाता है?",
"A_en": "Pushkar Mela", "A_hi": "पुष्कर मेला",
"B_en": "Desert Festival", "B_hi": "रेगिस्तान महोत्सव",
"C_en": "Nagaur Fair", "C_hi": "नागौर मेला",
"D_en": "Trinetra Fair", "D_hi": "त्रिनेत्र मेला",
"answer": "B",
"explanation_en": "The Desert Festival, also known as Maru-Gurjjar Utsav or Rajasthani Desert Festival, is a three-day celebration held in February in the Thar Desert of Rajasthan. It showcases the rich culture of Rajasthan and features a vibrant camel procession.",
"explanation_hi": "रेगिस्तान महोत्सव, जिसे मारू-गुर्ज्जर उत्सव या राजस्थान रेगिस्तानी महोत्सव भी कहा जाता है, फरवरी में राजस्थान के थार रेगिस्तान में आयोजित तीन दिवसीय उत्सव है। यह राजस्थान की समृद्ध संस्कृति को प्रदर्शित करता है और इसमें एक रंगीन ऊंट जुलूस शामिल है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "Which festival in Rajasthan marks the beginning of the harvest season?",
"question_hi": "राजस्थान में कौन सा त्योहार फसल कटाई के मौसम की शुरुआत का प्रतीक है?",
"A_en": "Lohri", "A_hi": "लोहरी",
"B_en": "Holi", "B_hi": "होली",
"C_en": "Diwali", "C_hi": "दीवाली",
"D_en": "Makar Sankranti", "D_hi": "मकर संक्रांति",
"answer": "D",
"explanation_en": "Makar Sankranti marks the beginning of the harvest season in Rajasthan and is celebrated with great enthusiasm. It usually falls in mid-January.",
"explanation_hi": "मकर संक्रांति राजस्थान में फसल कटाई के मौसम की शुरुआत का प्रतीक है और इसे बहुत उत्साह से मनाया जाता है। यह आमतौर पर जनवरी के मध्य में पड़ता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "The festival of Gangaur is dedicated to which deity?",
"question_hi": "गणगौर त्योहार किस देवता को समर्पित है?",
"A_en": "Lord Shiva", "A_hi": "भगवान शिव",
"B_en": "Ganesha", "B_hi": "गणेश",
"C_en": "Lord Krishna", "C_hi": "भगवान कृष्ण",
"D_en": "Ganga and Parvati", "D_hi": "गंगा और पार्वती",
"answer": "D",
"explanation_en": "The Gangaur festival is dedicated to the deities Ganga and Parvati. It is a significant festival in Rajasthan, especially for women.",
"explanation_hi": "गणगौर त्योहार देवियों गंगा और पार्वती को समर्पित है। यह राजस्थान में एक महत्वपूर्ण त्योहार है, खासकर महिलाओं के लिए।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "The Pushkar Mela is held in which district of Rajasthan?",
"question_hi": "पुष्कर मेला राजस्थान के किस जिले में आयोजित किया जाता है?",
"A_en": "Ajmer", "A_hi": "अजमेर",
"B_en": "Jaipur", "B_hi": "जयपुर",
"C_en": "Jodhpur", "C_hi": "जोधपुर",
"D_en": "Bikaner", "D_hi": "बीकानेर",
"answer": "A",
"explanation_en": "The Pushkar Mela is held in the Ajmer district of Rajasthan. It is a world-famous fair that takes place annually.",
"explanation_hi": "पुष्कर मेला राजस्थान के अजमेर जिले में आयोजित किया जाता है। यह एक विश्व प्रसिद्ध मेला है जो हर साल होता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "Which Sikh festival is celebrated with great fervor in Rajasthan?",
"question_hi": "राजस्थान में कौन सा सिख त्योहार बहुत उत्साह से मनाया जाता है?",
"A_en": "Gurpurab", "A_hi": "गुरुपुरब",
"B_en": "Diwali", "B_hi": "दीवाली",
"C_en": "Holi", "C_hi": "होली",
"D_en": "Baisakhi", "D_hi": "बैसाखी",
"answer": "A",
"explanation_en": "Gurpurab, also known as Guru Nanak Jayanti, is a significant Sikh festival celebrated with great fervor in Rajasthan.",
"explanation_hi": "गुरुपुरब, जिसे गुरु नानक जयंती भी कहा जाता है, एक महत्वपूर्ण सिख त्योहार है जो राजस्थान में बहुत उत्साह से मनाया जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "The Jain festival of Paryushana is also known as which of the following?",
"question_hi": "जैन त्योहार पर्युषण को निम्नलिखित में से क्या कहा जाता है?",
"A_en": "Mahavira Jayanti", "A_hi": "महावीर जयंती",
"B_en": "Pardon Day", "B_hi": "क्षमा दिवस",
"C_en": "Rishi Panchami", "C_hi": "ऋषि पंचमी",
"D_en": "Aman ki Aahat", "D_hi": ":आमन की आहट",
"answer": "B",
"explanation_en": "The Jain festival of Paryushana is also known as Pardon Day. It is a significant festival where followers seek forgiveness from one another.",
"explanation_hi": "जैन त्योहार पर्युषण को क्षमा दिवस भी कहा जाता है। यह एक महत्वपूर्ण त्योहार है जहां अनुयायी एक दूसरे से क्षमा मांगते हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "The Muslim festival of Eid-al-Fitr marks the end of which month?",
"question_hi": "मुस्लिम त्योहार ईद-उल-फितर किस महीने के अंत का प्रतीक है?",
"A_en": "Ramzan", "A_hi": "रमजान",
"B_en": "Shawwal", "A_hi": "शव्वाल",
"C_en": "Rajab", "A_hi": "रजाब",
"D_en": "Muharram", "A_hi": "मुहर्रम",
"answer": "A",
"explanation_en": "Eid-al-Fitr marks the end of the holy month of Ramzan. It is a significant festival for Muslims worldwide.",
"explanation_hi": "ईद-उल-फितर पवित्र महीने रमजान के अंत का प्रतीक है। यह दुनिया भर के मुसलमानों के लिए एक महत्वपूर्ण त्योहार है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "The festival of Baisakhi is celebrated in Rajasthan with which traditional dance?",
"question_hi": "बैसाखी का त्योहार राजस्थान में किस पारंपरिक नृत्य के साथ मनाया जाता है?",
"A_en": "Kathak", "A_hi": "कथक",
"B_en": "Bhangra", "A_hi": "भांगड़ा",
"C_en": "Garba", "A_hi": "गरबा",
"D_en": "Ghoomar", "A_hi": "घूमर",
"answer": "D",
"explanation_en": "The festival of Baisakhi is celebrated in Rajasthan with the traditional dance of Ghoomar.",
"explanation_hi": "बैसाखी का त्योहार राजस्थान में पारंपरिक घूमर नृत्य के साथ मनाया जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "The famous cattle fair of Rajasthan, held in Nagaur, is known as which of the following?",
"question_hi": "राजस्थान में नागौर में आयोजित प्रसिद्ध पशु मेला किस नाम से जाना जाता है?",
"A_en": "Pushkar Mela", "A_hi": "पुष्कर मेला",
"B_en": "Nagaur Cattle Fair", "A_hi": "नागौर पशु मेला",
"C_en": "Desert Festival", "A_hi": "रेगिस्तान महोत्सव",
"D_en": "Trinetra Fair", "A_hi": "त्रिनेत्र मेला",
"answer": "B",
"explanation_en": "The famous cattle fair of Rajasthan, held in Nagaur, is known as the Nagaur Cattle Fair. It attracts a large number of visitors.",
"explanation_hi": "राजस्थान में नागौर में आयोजित प्रसिद्ध पशु मेला नागौर पशु मेला के नाम से जाना जाता है। यह बड़ी संख्या में आगंतुकों को आकर्षित करता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "The Muslim festival of Muharram marks the martyrdom of which Imam?",
"question_hi": "मुस्लिम त्योहार मुहर्रम किस इमाम की शहादत का प्रतीक है?",
"A_en": "Imam Hussain", "A_hi": "इमाम हुसैन",
"B_en": "Imam Ali", "A_hi": "इमाम अली",
"C_en": "Imam Mohammad", "A_hi": "इमाम मोहम्मद",
"D_en": "Imam Hasan", "A_hi": "इमाम हसन",
"answer": "A",
"explanation_en": "The Muslim festival of Muharram marks the martyrdom of Imam Hussain, a grandson of Prophet Muhammad.",
"explanation_hi": "मुस्लिम त्योहार मुहर्रम इमाम हुसैन की शहादत का प्रतीक है, जो पैगंबर मुहम्मद के पोते थे।"
}
]