[
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "Which of the following festivals is celebrated to commemorate the birth of Lord Krishna?",
"question_hi": "निम्नलिखित में से कौन सा त्योहार भगवान कृष्ण के जन्म की स्मृति में मनाया जाता है?",
"A_en": "Holi", "A_hi": "होली",
"B_en": "Diwali", "B_hi": "दिवाली",
"C_en": "Janmashtami", "C_hi": "जन्माष्टमी",
"D_en": "Navratri", "D_hi": "नवरात्रि",
"answer": "C",
"explanation_en": "Janmashtami is celebrated to commemorate the birth of Lord Krishna.",
"explanation_hi": "जन्माष्टमी भगवान कृष्ण के जन्म की स्मृति में मनाया जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "What is the significance of the Pushkar Fair in Rajasthan?",
"question_hi": "राजस्थान में पुष्कर मेले का क्या महत्व है?",
"A_en": "It is a major trade fair for cattle", "A_hi": "यह मवेशियों के लिए एक प्रमुख व्यापार मेला है",
"B_en": "It is a festival to celebrate the full moon", "B_hi": "यह पूर्णिमा का त्योहार मनाने के लिए है",
"C_en": "It is a religious festival to worship Lord Brahma", "C_hi": "यह भगवान ब्रह्मा की पूजा के लिए एक धार्मिक त्योहार है",
"D_en": "It is a cultural festival to promote Rajasthani art", "D_hi": "यह राजस्थानी कला को बढ़ावा देने के लिए एक सांस्कृतिक त्योहार है",
"answer": "A",
"explanation_en": "The Pushkar Fair is a major trade fair for cattle, where thousands of camels, horses, and other animals are bought and sold.",
"explanation_hi": "पुष्कर मेला मवेशियों के लिए एक प्रमुख व्यापार मेला है, जहां हजारों ऊंट, घोड़े और अन्य जानवर खरीदे और बेचे जाते हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "Which of the following is a major festival celebrated by the Jain community in Rajasthan?",
"question_hi": "निम्नलिखित में से कौन सा त्योहार राजस्थान में जैन समुदाय द्वारा मनाया जाता है?",
"A_en": "Diwali", "A_hi": "दिवाली",
"B_en": "Holi", "B_hi": "होली",
"C_en": "Mahavir Jayanti", "C_hi": "महावीर जयंती",
"D_en": "Navratri", "D_hi": "नवरात्रि",
"answer": "C",
"explanation_en": "Mahavir Jayanti is a major festival celebrated by the Jain community to commemorate the birth of Lord Mahavira.",
"explanation_hi": "महावीर जयंती जैन समुदाय द्वारा भगवान महावीर के जन्म की स्मृति में मनाया जाने वाला एक प्रमुख त्योहार है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "What is the significance of the Urs festival in Rajasthan?",
"question_hi": "राजस्थान में उर्स त्योहार का क्या महत्व है?",
"A_en": "It is a festival to celebrate the birth of a Sufi saint", "A_hi": "यह एक सूफी संत के जन्म का त्योहार मनाने के लिए है",
"B_en": "It is a festival to commemorate the death of a Sufi saint", "B_hi": "यह एक सूफी संत की मृत्यु की स्मृति में मनाया जाने वाला त्योहार है",
"C_en": "It is a festival to promote Islamic art and culture", "C_hi": "यह इस्लामी कला और संस्कृति को बढ़ावा देने के लिए एक त्योहार है",
"D_en": "It is a festival to celebrate the full moon", "D_hi": "यह पूर्णिमा का त्योहार मनाने के लिए है",
"answer": "B",
"explanation_en": "The Urs festival is celebrated to commemorate the death of a Sufi saint, and is an important event in the Islamic calendar.",
"explanation_hi": "उर्स त्योहार एक सूफी संत की मृत्यु की स्मृति में मनाया जाता है, और इस्लामिक कैलेंडर में एक महत्वपूर्ण घटना है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "Which of the following is a major festival celebrated by the Sikh community in Rajasthan?",
"question_hi": "निम्नलिखित में से कौन सा त्योहार राजस्थान में सिख समुदाय द्वारा मनाया जाता है?",
"A_en": "Gurpurab", "A_hi": "गुरपुरब",
"B_en": "Holi", "B_hi": "होली",
"C_en": "Diwali", "C_hi": "दिवाली",
"D_en": "Navratri", "D_hi": "नवरात्रि",
"answer": "A",
"explanation_en": "Gurpurab is a major festival celebrated by the Sikh community to commemorate the birth of Guru Nanak and other Sikh gurus.",
"explanation_hi": "गुरपुरब सिख समुदाय द्वारा गुरु नानक और अन्य सिख गुरुओं के जन्म की स्मृति में मनाया जाने वाला एक प्रमुख त्योहार है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "What is the significance of the Navratri festival in Rajasthan?",
"question_hi": "राजस्थान में नवरात्रि त्योहार का क्या महत्व है?",
"A_en": "It is a festival to worship the nine forms of Goddess Durga", "A_hi": "यह देवी दुर्गा के नौ रूपों की पूजा के लिए एक त्योहार है",
"B_en": "It is a festival to celebrate the full moon", "B_hi": "यह पूर्णिमा का त्योहार मनाने के लिए है",
"C_en": "It is a festival to promote Rajasthani art and culture", "C_hi": "यह राजस्थानी कला और संस्कृति को बढ़ावा देने के लिए एक त्योहार है",
"D_en": "It is a festival to commemorate the birth of Lord Krishna", "D_hi": "यह भगवान कृष्ण के जन्म की स्मृति में मनाया जाने वाला त्योहार है",
"answer": "A",
"explanation_en": "The Navratri festival is celebrated to worship the nine forms of Goddess Durga, and is an important event in the Hindu calendar.",
"explanation_hi": "नवरात्रि त्योहार देवी दुर्गा के नौ रूपों की पूजा के लिए मनाया जाता है, और हिंदू कैलेंडर में एक महत्वपूर्ण घटना है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "Which of the following is a major festival celebrated by the Muslim community in Rajasthan?",
"question_hi": "निम्नलिखित में से कौन सा त्योहार राजस्थान में मुस्लिम समुदाय द्वारा मनाया जाता है?",
"A_en": "Eid-al-Fitr", "A_hi": "ईद-उल-फितर",
"B_en": "Eid-al-Adha", "B_hi": "ईद-उल-अज़हा",
"C_en": "Urs", "C_hi": "उर्स",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "All of the above festivals are celebrated by the Muslim community in Rajasthan, with Eid-al-Fitr and Eid-al-Adha being two of the most important festivals in the Islamic calendar.",
"explanation_hi": "उपरोक्त सभी त्योहार राजस्थान में मुस्लिम समुदाय द्वारा मनाए जाते हैं, जिनमें ईद-उल-फितर और ईद-उल-अज़हा इस्लामिक कैलेंडर के दो सबसे महत्वपूर्ण त्योहार हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "What is the significance of the Teej festival in Rajasthan?",
"question_hi": "राजस्थान में तीज त्योहार का क्या महत्व है?",
"A_en": "It is a festival to celebrate the monsoon season", "A_hi": "यह मानसून का मौसम मनाने के लिए एक त्योहार है",
"B_en": "It is a festival to worship Lord Shiva and Goddess Parvati", "B_hi": "यह भगवान शिव और देवी पार्वती की पूजा के लिए एक त्योहार है",
"C_en": "It is a festival to promote Rajasthani art and culture", "C_hi": "यह राजस्थानी कला और संस्कृति को बढ़ावा देने के लिए एक त्योहार है",
"D_en": "It is a festival to commemorate the birth of Lord Krishna", "D_hi": "यह भगवान कृष्ण के जन्म की स्मृति में मनाया जाने वाला त्योहार है",
"answer": "A",
"explanation_en": "The Teej festival is celebrated to mark the arrival of the monsoon season, and is an important event in the Hindu calendar.",
"explanation_hi": "तीज त्योहार मानसून के मौसम के आगमन को चिह्नित करने के लिए मनाया जाता है, और हिंदू कैलेंडर में एक महत्वपूर्ण घटना है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Mele aur Tyohar (Hindu, Muslim, Jain & Sikh)",
"question_en": "Which of the following is a major festival celebrated by the Hindu community in Rajasthan?",
"question_hi": "निम्नलिखित में से कौन सा त्योहार राजस्थान में हिंदू समुदाय द्वारा मनाया जाता है?",
"A_en": "Diwali", "A_hi": "दिवाली",
"B_en": "Holi", "B_hi": "होली",
"C_en": "Navratri", "C_hi": "नवरात्रि",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "All of the above festivals are celebrated by the Hindu community in Rajasthan, with Diwali, Holi, and Navratri being three of the most important festivals in the Hindu calendar.",
"explanation_hi": "उपरोक्त सभी त्योहार राजस्थान में हिंदू समुदाय द्वारा मनाए जाते हैं, जिनमें दिवाली, होली और नवरात्रि हिंदू कैलेंडर के तीन सबसे महत्वपूर्ण त्योहार हैं।"
}
]