[
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which of the following regions in Rajasthan is known for its Mewar style of art?",
"question_hi": "राजस्थान में मेवाड़ी शैली की कला के लिए जाना जाने वाला क्षेत्र कौन सा है?",
"A_en": "Alwar", "A_hi": "अलवर",
"B_en": "Mewar", "B_hi": "मेवाड़",
"C_en": "Marwar", "C_hi": "मारवाड़",
"D_en": "Hadoti", "D_hi": "हाड़ौती",
"answer": "B",
"explanation_en": "Mewar region is known for its rich cultural heritage and Mewar style of art, which is characterized by intricate carvings and ornate designs.",
"explanation_hi": "मेवाड़ क्षेत्र अपनी समृद्ध सांस्कृतिक遗产 और मेवाड़ी शैली की कला के लिए जाना जाता है, जो जटिल नक्काशी और सजावटी डिज़ाइनों से पहचाना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which of the following styles of art is associated with the Marwar region of Rajasthan?",
"question_hi": "राजस्थान के मारवाड़ क्षेत्र से जुड़ी कला शैली कौन सी है?",
"A_en": "Mughal", "A_hi": "मुग़ल",
"B_en": "Rajput", "B_hi": "राजपूत",
"C_en": "Marwar", "C_hi": "मारवाड़ी",
"D_en": "Hadoti", "D_hi": "हाड़ौती",
"answer": "C",
"explanation_en": "Marwar style of art is a unique blend of Rajput and Mughal influences, characterized by bold and intricate designs.",
"explanation_hi": "मारवाड़ी शैली की कला राजपूत और मुग़ल प्रभावों का एक अद्वितीय मिश्रण है, जो जोरदार और जटिल डिज़ाइनों से पहचानी जाती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which of the following architectural styles is associated with the Hadoti region of Rajasthan?",
"question_hi": "राजस्थान के हाड़ौती क्षेत्र से जुड़ी वास्तुकला शैली कौन सी है?",
"A_en": "Mughal", "A_hi": "मुग़ल",
"B_en": "Rajput", "B_hi": "राजपूत",
"C_en": "Hadoti", "C_hi": "हाड़ौती",
"D_en": "Marwar", "D_hi": "मारवाड़",
"answer": "C",
"explanation_en": "Hadoti style of architecture is characterized by simple and elegant designs, often featuring intricate carvings and ornate decorations.",
"explanation_hi": "हाड़ौती वास्तुकला शैली सरल और सुंदर डिज़ाइनों से पहचानी जाती है, जिसमें अक्सर जटिल नक्काशी और सजावटी सजावटें शामिल होती हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which of the following artists is known for his contributions to the Mewar style of art?",
"question_hi": "मेवाड़ी शैली की कला में उनका योगदान के लिए जाने जाने वाले कलाकार कौन हैं?",
"A_en": "Bhilsana", "A_hi": "भीलसणा",
"B_en": "Mewar", "B_hi": "मेवाड़",
"C_en": "Nagari", "C_hi": "नागरी",
"D_en": "Rajput", "D_hi": "राजपूत",
"answer": "C",
"explanation_en": "Nagari was a renowned artist who made significant contributions to the Mewar style of art, known for his intricate carvings and ornate designs.",
"explanation_hi": "नागरी एक प्रसिद्ध कलाकार थे जिन्होंने मेवाड़ी शैली की कला में महत्वपूर्ण योगदान दिया, जिन्हें उनकी जटिल नक्काशी और सजावटी डिज़ाइनों के लिए जाना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which of the following architectural features is characteristic of the Alwar region of Rajasthan?",
"question_hi": "राजस्थान के अलवर क्षेत्र की वास्तुकला विशेषता कौन सी है?",
"A_en": "Arches", "A_hi": "गुंबद",
"B_en": "Columns", "B_hi": "स्तंभ",
"C_en": "Turrets", "C_hi": "टावर",
"D_en": "Domes", "D_hi": "गुंबद",
"answer": "C",
"explanation_en": "Turrets are a characteristic feature of the Alwar region, often featuring intricate carvings and ornate decorations.",
"explanation_hi": "टावरें अलवर क्षेत्र की विशेषता हैं, अक्सर जटिल नक्काशी और सजावटी सजावटें शामिल होती हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which of the following artists is associated with the Marwar region of Rajasthan?",
"question_hi": "राजस्थान के मारवाड़ क्षेत्र से जुड़े कलाकार कौन हैं?",
"A_en": "Nagari", "A_hi": "नागरी",
"B_en": "Bhilsana", "B_hi": "भीलसणा",
"C_en": "Kripal Singh Shekhawat", "C_hi": "कृपाल सिंह शेखावत",
"D_en": "Rajput", "D_hi": "राजपूत",
"answer": "C",
"explanation_en": "Kripal Singh Shekhawat was a renowned artist associated with the Marwar region, known for his contributions to the Marwar style of art.",
"explanation_hi": "कृपाल सिंह शेखावत मारवाड़ क्षेत्र से जुड़े प्रसिद्ध कलाकार थे, जिन्हें मारवाड़ी शैली की कला में उनके योगदान के लिए जाना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which of the following styles of art is associated with the Alwar region of Rajasthan?",
"question_hi": "राजस्थान के अलवर क्षेत्र से जुड़ी कला शैली कौन सी है?",
"A_en": "Rajput", "A_hi": "राजपूत",
"B_en": "Mughal", "B_hi": "मुग़ल",
"C_en": "Alwar", "C_hi": "अलवर",
"D_en": "Hadoti", "D_hi": "हाड़ौती",
"answer": "C",
"explanation_en": "Alwar style of art is a unique blend of Rajput and Mughal influences, characterized by intricate carvings and ornate designs.",
"explanation_hi": "अलवर शैली की कला राजपूत और मुग़ल प्रभावों का एक अद्वितीय मिश्रण है, जो जटिल नक्काशी और सजावटी डिज़ाइनों से पहचानी जाती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which of the following architectural features is characteristic of the Mewar region of Rajasthan?",
"question_hi": "राजस्थान के मेवाड़ क्षेत्र की वास्तुकला विशेषता कौन सी है?",
"A_en": "Arches", "A_hi": "गुंबद",
"B_en": "Columns", "B_hi": "स्तंभ",
"C_en": "Turrets", "C_hi": "टावर",
"D_en": "Domes", "D_hi": "गुंबद",
"answer": "D",
"explanation_en": "Domes are a characteristic feature of the Mewar region, often featuring intricate carvings and ornate decorations.",
"explanation_hi": "गुंबदें मेवाड़ क्षेत्र की विशेषता हैं, अक्सर जटिल नक्काशी और सजावटी सजावटें शामिल होती हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which of the following artists is known for his contributions to the Hadoti style of art?",
"question_hi": "हाड़ौती शैली की कला में उनका योगदान के लिए जाने जाने वाले कलाकार कौन हैं?",
"A_en": "Bhilsana", "A_hi": "भीलसणा",
"B_en": "Mewar", "B_hi": "मेवाड़",
"C_en": "Rajput", "C_hi": "राजपूत",
"D_en": "Dungar Singh", "D_hi": "दुंगर सिंह",
"answer": "D",
"explanation_en": "Dungar Singh was a renowned artist associated with the Hadoti region, known for his contributions to the Hadoti style of art.",
"explanation_hi": "दुंगर सिंह हाड़ौती क्षेत्र से जुड़े प्रसिद्ध कलाकार थे, जिन्हें हाड़ौती शैली की कला में उनके योगदान के लिए जाना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which of the following architectural features is characteristic of the Marwar region of Rajasthan?",
"question_hi": "राजस्थान के मारवाड़ क्षेत्र की वास्तुकला विशेषता कौन सी है?",
"A_en": "Arches", "A_hi": "गुंबद",
"B_en": "Columns", "B_hi": "स्तंभ",
"C_en": "Turrets", "C_hi": "टावर",
"D_en": "Domes", "D_hi": "गुंबद",
"answer": "C",
"explanation_en": "Turrets are a characteristic feature of the Marwar region, often featuring intricate carvings and ornate decorations.",
"explanation_hi": "टावरें मारवाड़ क्षेत्र की विशेषता हैं, अक्सर जटिल नक्काशी और सजावटी सजावटें शामिल होती हैं।"
}