[
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which characteristic is most associated with the Alwar school of painting?",
"question_hi": "Alwar शैलियों की चित्रकला की सबसे प्रमुख विशेषता कौन सी है?",
"A_en": "Use of bold outlines and bright colors", "A_hi": "मोटे किनारे और चमकीले रंगों का प्रयोग",
"B_en": "Depiction of courtly life of Mughal emperors", "B_hi": "मुगल सम्राटों के दरबारिक जीवन का चित्रण",
"C_en": "Natural pigments on paper with delicate floral motifs", "C_hi": "कागज पर प्राकृतिक रंगों से नाजुक फूलों के मोटीफ़",
"D_en": "Incorporation of European perspective techniques", "D_hi": "यूरोपीय परिप्रेक्ष्य तकनीकों का समावेश",
"answer": "C",
"explanation_en": "Alwar paintings are known for using natural pigments on paper and delicate floral motifs.", 
"explanation_hi": "Alwar की चित्रकला में कागज पर प्राकृतिक रंगों से नाजुक फूलों के मोटीफ़ का प्रयोग प्रमुख है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "The Mewar school is especially famous for which type of subject matter?",
"question_hi": "Mewar शैलियों की चित्रकला में विशेष रूप से किस प्रकार के विषय प्रमुख हैं?",
"A_en": "Battle scenes of Rajput warriors", "A_hi": "राजपूत योद्धाओं की युद्ध दृश्य",
"B_en": "Mythological narratives of Lord Krishna", "B_hi": "भगवान कृष्ण की पौराणिक कथाएँ",
"C_en": "Portraits of Mughal emperors", "C_hi": "मुगल सम्राटों के चित्र",
"D_en": "Landscapes of the Thar desert", "D_hi": "थार रेगिस्तान के दृश्य",
"answer": "B",
"explanation_en": "Mewar paintings, especially the Pichwai style, frequently depict scenes from the life of Lord Krishna.", 
"explanation_hi": "Mewar की पिचवाई शैली में अक्सर भगवान कृष्ण के जीवन के दृश्य चित्रित होते हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Phad paintings, a hallmark of the Marwar region, were traditionally used for:",
"question_hi": "Marwar क्षेत्र की प्रसिद्ध Phad चित्रकला का पारम्परिक उपयोग किस लिए किया जाता था?",
"A_en": "Decorating royal palaces", "A_hi": "राज महलों की सजावट",
"B_en": "Narrating folk epics during traveling performances", "B_hi": "भ्रमण करने वाले कलाकारों द्वारा लोक कथाओं का वर्णन",
"C_en": "Documenting agricultural practices", "C_hi": "कृषि कार्यों का दस्तावेजीकरण",
"D_en": "Religious rituals in temples", "D_hi": "मंदिरों में धार्मिक अनुष्ठान",
"answer": "B",
"explanation_en": "Phad paintings are large scrolls that storytellers use to narrate folk epics like Pabuji while traveling.", 
"explanation_hi": "Phad बड़े पैनल होते हैं जिनका उपयोग कथाकार पाबूजी जैसी लोक कथाओं को यात्रा के दौरान सुनाने के लिये करते हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which material is most commonly used as the base for traditional Alwar paintings?",
"question_hi": "Alwar की पारम्परिक चित्रकला में आधार के रूप में सबसे अधिक किस सामग्री का प्रयोग होता है?",
"A_en": "Cotton cloth", "A_hi": "कॉटन कपड़ा",
"B_en": "Bamboo bark", "B_hi": "बाँस की छाल",
"C_en": "Linen paper", "C_hi": "लिनेन कागज",
"D_en": "Silk canvas", "D_hi": "रेशमी कैनवास",
"answer": "C",
"explanation_en": "Artists of the Alwar school traditionally paint on fine linen paper prepared with a mixture of chalk and glue.", 
"explanation_hi": "Alwar की चित्रकारें आमतौर पर चाक और गोंद के मिश्रण से तैयार की गई बारीक लिनेन कागज पर चित्र बनाती हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Hadoti style paintings are predominantly found in which districts of Rajasthan?",
"question_hi": "Hadoti शैलियों की चित्रकला मुख्यतः राजस्थान के किन जिलों में पाई जाती है?",
"A_en": "Udaipur, Chittorgarh, Bhilwara", "A_hi": "उदयपुर, चित्तौड़गढ़, भीलवाड़ा",
"B_en": "Jodhpur, Bikaner, Barmer", "B_hi": "जोधपुर, बीकानेर, बरमेर",
"C_en": "Sawai Madhopur, Kota, Bundi", "C_hi": "सवाई माधोपुर, कोटा, बांदी",
"D_en": "Ajmer, Nagaur, Jaisalmer", "D_hi": "अजमेर, नागौर, जैसलमेर",
"answer": "C",
"explanation_en": "The Hadoti region, covering Sawai Madhopur, Kota and Bundi, is the cradle of Hadoti painting style.", 
"explanation_hi": "Hadoti शैली मुख्यतः सवाई माधोपुर, कोटा और बांदी जिलों में विकसित हुई है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which of the following features distinguishes Marwar paintings from the other Rajasthani styles?",
"question_hi": "निम्नलिखित में से कौन-सी विशेषता Marwar की चित्रकला को अन्य राजस्थानी शैलियों से अलग करती है?",
"A_en": "Extensive use of gold foil in borders", "A_hi": "किनारों में सोने की पत्ती का व्यापक प्रयोग",
"B_en": "Depiction of narrative scrolls called Phad", "B_hi": "Phad नामक कथा स्क्रॉल का चित्रण",
"C_en": "Portraits of Mughal emperors in regal attire", "C_hi": "शाही वस्त्रों में मुगल सम्राटों के चित्र",
"D_en": "Highly stylized floral patterns", "D_hi": "अत्यधिक शैलीबद्ध फूलों के पैटर्न",
"answer": "B",
"explanation_en": "Marwar is renowned for its Phad scroll paintings that narrate folk legends.", 
"explanation_hi": "Marwar की प्रमुख विशेषता Phad स्क्रॉल हैं, जो लोक कथाओं को चित्रित करते हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "In Mewar paintings, the background is often filled with:",
"question_hi": "Mewar चित्रकला में पृष्ठभूमि अक्सर किससे भरती है?",
"A_en": "Intricate geometric patterns", "A_hi": "जटिल ज्यामितीय पैटर्न",
"B_en": "Vibrant desert landscapes", "B_hi": "जीवंत रेगिस्तानी दृश्यों",
"C_en": "Delicate foliage and stylized trees", "C_hi": "नाज़ुक पत्ते और शैलीबद्ध पेड़",
"D_en": "Scenes of royal courts", "D_hi": "राजसी दरबार के दृश्य",
"answer": "C",
"explanation_en": "Mewar artists commonly use delicate foliage and stylized trees to create a serene backdrop.", 
"explanation_hi": "Mewar की चित्रकला में अक्सर नाज़ुक पत्तियों और शैलीबद्ध पेड़ों को पृष्ठभूमि के रूप में प्रयोग किया जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which painting technique is characteristic of the Hadoti style?",
"question_hi": "Hadoti शैली की विशेष चित्रकारी तकनीक कौन सी है?",
"A_en": "Layering of bright watercolor washes", "A_hi": "उज्ज्वल जलरंग की परतें बनाना",
"B_en": "Use of fine gold leaf on animal motifs", "B_hi": "पशु मोटीफ़ पर बारीक सोने की पत्ती का प्रयोग",
"C_en": "Application of natural earth pigments on mud walls", "C_hi": "मिट्टी की दीवारों पर प्राकृतिक मिट्टी के रंग लगाना",
"D_en": "Ink drawing on parchment with calligraphic details", "D_hi": "पर्चमेंट पर स्याही के चित्र और सुलेख विवरण",
"answer": "A",
"explanation_en": "Hadoti painters often apply multiple layers of bright watercolors to achieve depth and vibrancy.", 
"explanation_hi": "Hadoti चित्रकार कई परतों में उज्ज्वल जलरंग लगाकर गहराई और जीवंतता उत्पन्न करते हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "The Alwar school frequently incorporates which of the following themes in its artworks?",
"question_hi": "Alwar शैलियों की चित्रकला में अक्सर कौन-सा विषय चित्रित किया जाता है?",
"A_en": "Scenes from the Mahabharata", "A_hi": "महाभारत के दृश्य",
"B_en": "Local flora and fauna", "B_hi": "स्थानीय वनस्पति और जीव-जंतु",
"C_en": "Portraits of British officers", "C_hi": "ब्रिटिश अधिकारियों के चित्र",
"D_en": "Urban cityscapes of Jaipur", "D_hi": "जयपुर के शहरी दृश्यों",
"answer": "B",
"explanation_en": "Alwar paintings are known for detailed depictions of regional plants and animals.", 
"explanation_hi": "Alwar की चित्रकला में स्थानीय पौधों और जीव-जंतुओं के विस्तृत चित्रण प्रमुख हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which of the following statements is true about the use of gold in Mewar paintings?",
"question_hi": "Mewar चित्रकला में सोने के उपयोग के बारे में निम्नलिखित में से कौन-सा कथन सही है?",
"A_en": "Gold is only used for the main deity figures", "A_hi": "सोना केवल मुख्य देवता के चित्रों में प्रयोग होता है",
"B_en": "Gold leaf adorns borders and intricate patterns", "B_hi": "सोने की पत्ती किनारों और जटिल पैटर्न को सजाती है",
"C_en": "Gold is never used; only natural pigments are allowed", "C_hi": "सोना कभी नहीं प्रयोग किया जाता; केवल प्राकृतिक रंगों का उपयोग होता है",
"D_en": "Gold is mixed with watercolors to create a metallic shade", "D_hi": "सोने को जलरंग में मिलाकर धातु जैसी छटा बनायी जाती है",
"answer": "B",
"explanation_en": "Mewar artists frequently embellish the borders and intricate motifs with gold leaf.", 
"explanation_hi": "Mewar की चित्रकला में किनारों और जटिल मोटीफ़ को सोने की पत्ती से सजाया जाता है।"
}
]