[
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a popular folk dance of Rajasthan?",
"question_hi": "निम्नलिखित में से कौन सा राजस्थान का एक लोकप्रिय लोक नृत्य है?",
"A_en": "Kathak", "A_hi": "कथक",
"B_en": "Bharatanatyam", "B_hi": "भरतनाट्यम",
"C_en": "Ghoomar", "C_hi": "घूमर",
"D_en": "Odissi", "D_hi": "ओडिसी",
"answer": "C",
"explanation_en": "Ghoomar is a traditional folk dance of Rajasthan, typically performed by women during festivals and celebrations.",
"explanation_hi": "घूमर राजस्थान का एक पारंपरिक लोक नृत्य है, जो आम तौर पर महिलाओं द्वारा त्योहारों और समारोहों के दौरान किया जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "What is the name of the famous folk theatre of Rajasthan?",
"question_hi": "राजस्थान के प्रसिद्ध लोक थिएटर का नाम क्या है?",
"A_en": "Kathakali", "A_hi": "कथकली",
"B_en": "Ramlila", "B_hi": "रामलीला",
"C_en": "Tamasha", "C_hi": "तमाशा",
"D_en": "Bhayan", "D_hi": "भयान",
"answer": "D",
"explanation_en": "Bhayan is a traditional folk theatre form of Rajasthan, known for its dramatic performances.",
"explanation_hi": "भयान राजस्थान का एक पारंपरिक लोक थिएटर रूप है, जो अपने नाटकीय प्रदर्शनों के लिए जाना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following folk songs is associated with the Bana community of Rajasthan?",
"question_hi": "निम्नलिखित में से कौन सा लोक गीत राजस्थान के बाना समुदाय से जुड़ा है?",
"A_en": "Mandi", "A_hi": "मंडी",
"B_en": "Panihari", "B_hi": "पानीहारी",
"C_en": "Langvir Nritya", "C_hi": "लंगवीर नृत्य",
"D_en": "Ghoomar", "D_hi": "घूमर",
"answer": "B",
"explanation_en": "Panihari is a traditional folk song associated with the Bana community of Rajasthan.",
"explanation_hi": "पानीहारी राजस्थान के बाना समुदाय से जुड़ा एक पारंपरिक लोक गीत है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "What is the name of the famous folk dance of the Rabari community in Rajasthan?",
"question_hi": "राजस्थान में रबारी समुदाय का प्रसिद्ध लोक नृत्य क्या है?",
"A_en": "Ghoomar", "A_hi": "घूमर",
"B_en": "Dandiya Raas", "B_hi": "दंडिया रास",
"C_en": "Langvir Nritya", "C_hi": "लंगवीर नृत्य",
"D_en": "Raslila", "D_hi": "रासलिला",
"answer": "C",
"explanation_en": "Langvir Nritya is a traditional folk dance of the Rabari community in Rajasthan.",
"explanation_hi": "लंगवीर नृत्य राजस्थान में रबारी समुदाय का एक पारंपरिक लोक नृत्य है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a popular folk instrument of Rajasthan?",
"question_hi": "निम्नलिखित में से कौन सा राजस्थान का एक लोकप्रिय लोक वाद्य है?",
"A_en": "Sitar", "A_hi": "सितार",
"B_en": "Tabla", "B_hi": "तबला",
"C_en": "Sarangi", "C_hi": "सरंगी",
"D_en": "Rawanhatta", "D_hi": "रावणहट्टा",
"answer": "D",
"explanation_en": "Rawanhatta is a traditional folk instrument of Rajasthan, typically used in folk music and dance performances.",
"explanation_hi": "रावणहट्टा राजस्थान का एक पारंपरिक लोक वाद्य है, जो आम तौर पर लोक संगीत और नृत्य प्रदर्शनों में उपयोग किया जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "What is the name of the famous folk music of Rajasthan, typically sung by women?",
"question_hi": "राजस्थान के प्रसिद्ध लोक संगीत का नाम क्या है, जो आमतौर पर महिलाओं द्वारा गाया जाता है?",
"A_en": "Ghoomar", "A_hi": "घूमर",
"B_en": "Panihari", "B_hi": "पानीहारी",
"C_en": "Mandi", "C_hi": "मंडी",
"D_en": "Thumri", "D_hi": "ठुमरी",
"answer": "B",
"explanation_en": "Panihari is a traditional folk music of Rajasthan, typically sung by women during their daily chores.",
"explanation_hi": "पानीहारी राजस्थान का एक पारंपरिक लोक संगीत है, जो आमतौर पर महिलाओं द्वारा उनके दैनिक कार्यों के दौरान गाया जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following folk dances is performed by men in Rajasthan?",
"question_hi": "निम्नलिखित में से कौन सा लोक नृत्य राजस्थान में पुरुषों द्वारा किया जाता है?",
"A_en": "Ghoomar", "A_hi": "घूमर",
"B_en": "Kathak", "B_hi": "कथक",
"C_en": "Langvir Nritya", "C_hi": "लंगवीर नृत्य",
"D_en": "Bharatanatyam", "D_hi": "भरतनाट्यम",
"answer": "C",
"explanation_en": "Langvir Nritya is a traditional folk dance performed by men in Rajasthan, known for its energetic movements.",
"explanation_hi": "लंगवीर नृत्य राजस्थान में पुरुषों द्वारा किया जाने वाला एक पारंपरिक लोक नृत्य है, जो अपने ऊर्जावान आंदोलनों के लिए जाना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "What is the name of the famous folk theatre form of Rajasthan, known for its humorous performances?",
"question_hi": "राजस्थान के प्रसिद्ध लोक थिएटर रूप का नाम क्या है, जो अपने हास्य प्रदर्शनों के लिए जाना जाता है?",
"A_en": "Tamasha", "A_hi": "तमाशा",
"B_en": "Ramlila", "B_hi": "रामलीला",
"C_en": "Kathakali", "C_hi": "कथकली",
"D_en": "Bhayan", "D_hi": "भयान",
"answer": "A",
"explanation_en": "Tamasha is a traditional folk theatre form of Rajasthan, known for its humorous and entertaining performances.",
"explanation_hi": "तमाशा राजस्थान का एक पारंपरिक लोक थिएटर रूप है, जो अपने हास्य और मनोरंजक प्रदर्शनों के लिए जाना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following folk songs is associated with the harvesting season in Rajasthan?",
"question_hi": "निम्नलिखित में से कौन सा लोक गीत राजस्थान में फसल कटाई के मौसम से जुड़ा है?",
"A_en": "Panihari", "A_hi": "पानीहारी",
"B_en": "Mandi", "B_hi": "मंडी",
"C_en": "Ghoomar", "C_hi": "घूमर",
"D_en": "Holi", "D_hi": "होली",
"answer": "B",
"explanation_en": "Mandi is a traditional folk song associated with the harvesting season in Rajasthan.",
"explanation_hi": "मंडी राजस्थान में फसल कटाई के मौसम से जुड़ा एक पारंपरिक लोक गीत है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "What is the name of the famous folk dance of Rajasthan, typically performed during the monsoon season?",
"question_hi": "राजस्थान के प्रसिद्ध लोक नृत्य का नाम क्या है, जो आमतौर पर मानसून के मौसम के दौरान किया जाता है?",
"A_en": "Ghoomar", "A_hi": "घूमर",
"B_en": "Kathak", "B_hi": "कथक",
"C_en": "Langvir Nritya", "C_hi": "लंगवीर नृत्य",
"D_en": "Dandiya Raas", "D_hi": "दंडिया रास",
"answer": "A",
"explanation_en": "Ghoomar is a traditional folk dance of Rajasthan, typically performed during the monsoon season and festivals.",
"explanation_hi": "घूमर राजस्थान का एक पारंपरिक लोक नृत्य है, जो आमतौर पर मानसून के मौसम और त्योहारों के दौरान किया जाता है।"
}
]