[
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Devta: Panch-Peer aur Anya Pramukh Devta",
"question_en": "Who is the main deity among the Panch-Peer in Rajasthan?",
"question_hi": "राजस्थान में पंच-पीर में से मुख्य देवता कौन है?",
"A_en": "Baba Ramdev", "A_hi": "बाबा रामदेव",
"B_en": "Gogaji", "B_hi": "गोगाजी",
"C_en": "Bharthari", "C_hi": "भरथरी",
"D_en": "Harbhuji", "D_hi": "हरभुजी",
"answer": "A",
"explanation_en": "Baba Ramdev is considered the main deity among the Panch-Peer in Rajasthan.",
"explanation_hi": "राजस्थान में पंच-पीर में से बाबा रामदेव को मुख्य देवता माना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Devta: Panch-Peer aur Anya Pramukh Devta",
"question_en": "Which of the following is a prominent folk deity in Rajasthan?",
"question_hi": "निम्नलिखित में से कौन राजस्थान में एक प्रमुख लोक देवता है?",
"A_en": "Tejaji", "A_hi": "तेजाजी",
"B_en": "Pabuji", "B_hi": "पाबूजी",
"C_en": "Mamaji", "C_hi": "मामाजी",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "All of the above are prominent folk deities in Rajasthan.",
"explanation_hi": "उपरोक्त सभी राजस्थान में प्रमुख लोक देवता हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Devta: Panch-Peer aur Anya Pramukh Devta",
"question_en": "What is the significance of Panch-Peer in Rajasthan?",
"question_hi": "राजस्थान में पंच-पीर का क्या महत्व है?",
"A_en": "They are the five main deities of Rajasthan", "A_hi": "वे राजस्थान के पांच मुख्य देवता हैं",
"B_en": "They are the five main festivals of Rajasthan", "B_hi": "वे राजस्थान के पांच मुख्य त्योहार हैं",
"C_en": "They are the five main folk deities of Rajasthan", "C_hi": "वे राजस्थान के पांच मुख्य लोक देवता हैं",
"D_en": "They are the five main tribes of Rajasthan", "D_hi": "वे राजस्थान के पांच मुख्य जनजातियां हैं",
"answer": "C",
"explanation_en": "Panch-Peer refers to the five main folk deities of Rajasthan, who are revered and worshipped by the people.",
"explanation_hi": "पंच-पीर राजस्थान के पांच मुख्य लोक देवताओं को संदर्भित करता है, जिन्हें लोग पूजते और सम्मानित करते हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Devta: Panch-Peer aur Anya Pramukh Devta",
"question_en": "Which of the following deities is associated with snakes in Rajasthan?",
"question_hi": "निम्नलिखित में से कौन सा देवता राजस्थान में सांपों से जुड़ा हुआ है?",
"A_en": "Gogaji", "A_hi": "गोगाजी",
"B_en": "Baba Ramdev", "B_hi": "बाबा रामदेव",
"C_en": "Tejaji", "C_hi": "तेजाजी",
"D_en": "Pabuji", "D_hi": "पाबूजी",
"answer": "A",
"explanation_en": "Gogaji is a deity associated with snakes in Rajasthan.",
"explanation_hi": "गोगाजी राजस्थान में सांपों से जुड़ा एक देवता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Devta: Panch-Peer aur Anya Pramukh Devta",
"question_en": "Which folk deity is known for his bravery and is worshipped as a hero in Rajasthan?",
"question_hi": "कौन सा लोक देवता अपनी वीरता के लिए जाना जाता है और राजस्थान में एक नायक के रूप में पूजा जाता है?",
"A_en": "Pabuji", "A_hi": "पाबूजी",
"B_en": "Tejaji", "B_hi": "तेजाजी",
"C_en": "Gogaji", "C_hi": "गोगाजी",
"D_en": "Baba Ramdev", "D_hi": "बाबा रामदेव",
"answer": "A",
"explanation_en": "Pabuji is a folk deity known for his bravery and is worshipped as a hero in Rajasthan.",
"explanation_hi": "पाबूजी एक लोक देवता है जो अपनी वीरता के लिए जाना जाता है और राजस्थान में एक नायक के रूप में पूजा जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Devta: Panch-Peer aur Anya Pramukh Devta",
"question_en": "What is the significance of the Panch-Peer in the cultural heritage of Rajasthan?",
"question_hi": "राजस्थान की सांस्कृतिक विरासत में पंच-पीर का क्या महत्व है?",
"A_en": "They represent the five main castes of Rajasthan", "A_hi": "वे राजस्थान की पांच मुख्य जातियों का प्रतिनिधित्व करते हैं",
"B_en": "They represent the five main festivals of Rajasthan", "B_hi": "वे राजस्थान के पांच मुख्य त्योहारों का प्रतिनिधित्व करते हैं",
"C_en": "They represent the five main folk deities of Rajasthan", "C_hi": "वे राजस्थान के पांच मुख्य लोक देवताओं का प्रतिनिधित्व करते हैं",
"D_en": "They represent the five main tribes of Rajasthan", "D_hi": "वे राजस्थान की पांच मुख्य जनजातियों का प्रतिनिधित्व करते हैं",
"answer": "C",
"explanation_en": "The Panch-Peer represents the five main folk deities of Rajasthan, who are an integral part of the state's cultural heritage.",
"explanation_hi": "पंच-पीर राजस्थान के पांच मुख्य लोक देवताओं का प्रतिनिधित्व करता है, जो राज्य की सांस्कृतिक विरासत का एक अभिन्न अंग हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Devta: Panch-Peer aur Anya Pramukh Devta",
"question_en": "Which deity is worshipped as a protector of cattle in Rajasthan?",
"question_hi": "कौन सा देवता राजस्थान में मवेशियों के रक्षक के रूप में पूजा जाता है?",
"A_en": "Gogaji", "A_hi": "गोगाजी",
"B_en": "Baba Ramdev", "B_hi": "बाबा रामदेव",
"C_en": "Tejaji", "C_hi": "तेजाजी",
"D_en": "Pabuji", "D_hi": "पाबूजी",
"answer": "D",
"explanation_en": "Pabuji is worshipped as a protector of cattle in Rajasthan.",
"explanation_hi": "पाबूजी राजस्थान में मवेशियों के रक्षक के रूप में पूजा जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Devta: Panch-Peer aur Anya Pramukh Devta",
"question_en": "What is the role of the Panch-Peer in the social life of Rajasthan?",
"question_hi": "राजस्थान के सामाजिक जीवन में पंच-पीर की क्या भूमिका है?",
"A_en": "They are the guardians of social norms", "A_hi": "वे सामाजिक मानकों के संरक्षक हैं",
"B_en": "They are the protectors of cattle", "B_hi": "वे मवेशियों के रक्षक हैं",
"C_en": "They are the preservers of cultural heritage", "C_hi": "वे सांस्कृतिक विरासत के संरक्षक हैं",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The Panch-Peer plays a significant role in the social life of Rajasthan, as they are the guardians of social norms, protectors of cattle, and preservers of cultural heritage.",
"explanation_hi": "पंच-पीर राजस्थान के सामाजिक जीवन में एक महत्वपूर्ण भूमिका निभाता है, क्योंकि वे सामाजिक मानकों के संरक्षक, मवेशियों के रक्षक और सांस्कृतिक विरासत के संरक्षक हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Devta: Panch-Peer aur Anya Pramukh Devta",
"question_en": "Which deity is associated with the protection of children in Rajasthan?",
"question_hi": "राजस्थान में बच्चों की रक्षा से जुड़ा कौन सा देवता है?",
"A_en": "Baba Ramdev", "A_hi": "बाबा रामदेव",
"B_en": "Gogaji", "B_hi": "गोगाजी",
"C_en": "Tejaji", "C_hi": "तेजाजी",
"D_en": "Pabuji", "D_hi": "पाबूजी",
"answer": "A",
"explanation_en": "Baba Ramdev is associated with the protection of children in Rajasthan.",
"explanation_hi": "बाबा रामदेव राजस्थान में बच्चों की रक्षा से जुड़ा हुआ है।"
}
]