[
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a traditional folk dance of Rajasthan?",
"question_hi": "निम्नलिखित में से कौन राजस्थान का एक पारंपरिक लोक नृत्य है?",
"A_en": "Kathak", "A_hi": "कथक",
"B_en": "Ghoomar", "B_hi": "घूमर",
"C_en": "Bharatanatyam", "C_hi": "भरतनाट्यम",
"D_en": "Odissi", "D_hi": "ओडिसी",
"answer": "B",
"explanation_en": "Ghoomar is a traditional folk dance of Rajasthan, typically performed by women during festive occasions.",
"explanation_hi": "घूमर राजस्थान का एक पारंपरिक लोक नृत्य है, जो आमतौर पर महिलाएं त्योहारों के अवसर पर करती हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "What is the name of the traditional folk song of Rajasthan, which is sung during the monsoon season?",
"question_hi": "राजस्थान के पारंपरिक लोक गीत का नाम क्या है, जो मानसून के मौसम में गाया जाता है?",
"A_en": "Saawan", "A_hi": "सावन",
"B_en": "Holi", "B_hi": "होली",
"C_en": "Diwali", "C_hi": "दिवाली",
"D_en": "Raat", "D_hi": "रात",
"answer": "A",
"explanation_en": "Saawan is a traditional folk song of Rajasthan, which is sung during the monsoon season to welcome the rains.",
"explanation_hi": "सावन राजस्थान का एक पारंपरिक लोक गीत है, जो मानसून के मौसम में वर्षा का स्वागत करने के लिए गाया जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a popular folk theatre form of Rajasthan?",
"question_hi": "निम्नलिखित में से कौन राजस्थान का एक लोकप्रिय लोक नाट्य रूप है?",
"A_en": "Bhavai", "A_hi": "भवई",
"B_en": "Tamasha", "B_hi": "तमाशा",
"C_en": "Nautanki", "C_hi": "नौटंकी",
"D_en": "Swang", "D_hi": "स्वांग",
"answer": "A",
"explanation_en": "Bhavai is a popular folk theatre form of Rajasthan, which is known for its humorous and satirical performances.",
"explanation_hi": "भवई राजस्थान का एक लोकप्रिय लोक नाट्य रूप है, जो अपने हास्य और व्यंग्यात्मक प्रदर्शनों के लिए जाना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Who is the pioneer of the Ghoomar dance form in Rajasthan?",
"question_hi": "राजस्थान में घूमर नृत्य रूप के जन्मदाता कौन हैं?",
"A_en": "Kanhaiyalal", "A_hi": "कान्हैयालाल",
"B_en": "Hiralal", "B_hi": "हीरालाल",
"C_en": "Kesarbai", "C_hi": "केसरबाई",
"D_en": "Sunderlal", "D_hi": "सुंदरलाल",
"answer": "A",
"explanation_en": "Kanhaiyalal is considered the pioneer of the Ghoomar dance form in Rajasthan, and is credited with popularizing it across the state.",
"explanation_hi": "कान्हैयालाल को राजस्थान में घूमर नृत्य रूप के जन्मदाता माना जाता है, और उन्हें पूरे राज्य में इसके लोकप्रियकरण का श्रेय दिया जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "What is the name of the traditional folk instrument of Rajasthan, which is used to accompany folk songs and dances?",
"question_hi": "राजस्थान के पारंपरिक लोक वाद्य का नाम क्या है, जिसका उपयोग लोक गीतों और नृत्यों के साथ किया जाता है?",
"A_en": "Dholak", "A_hi": "ढोलक",
"B_en": "Nagada", "B_hi": "नगाड़ा",
"C_en": "Chang", "C_hi": "चंग",
"D_en": "Rawanhatta", "D_hi": "रावणहट्टा",
"answer": "B",
"explanation_en": "Nagada is a traditional folk instrument of Rajasthan, which is used to accompany folk songs and dances, particularly during festivals and celebrations.",
"explanation_hi": "नगाड़ा राजस्थान का एक पारंपरिक लोक वाद्य है, जिसका उपयोग लोक गीतों और नृत्यों के साथ किया जाता है, विशेष रूप से त्योहारों और समारोहों के दौरान।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following folk dances of Rajasthan is known for its energetic and acrobatic movements?",
"question_hi": "निम्नलिखित में से कौन राजस्थान का लोक नृत्य ऊर्जावान और जिमनास्टिक गतिविधियों के लिए जाना जाता है?",
"A_en": "Ghoomar", "A_hi": "घूमर",
"B_en": "Kathak", "B_hi": "कथक",
"C_en": "Bhavai", "C_hi": "भवई",
"D_en": "Chari", "D_hi": "चारी",
"answer": "D",
"explanation_en": "Chari is a folk dance of Rajasthan, which is known for its energetic and acrobatic movements, and is typically performed by men during festivals and celebrations.",
"explanation_hi": "चारी राजस्थान का एक लोक नृत्य है, जो अपनी ऊर्जावान और जिमनास्टिक गतिविधियों के लिए जाना जाता है, और आमतौर पर पुरुष त्योहारों और समारोहों के दौरान करते हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "What is the name of the traditional folk song of Rajasthan, which is sung during the harvest season?",
"question_hi": "राजस्थान के पारंपरिक लोक गीत का नाम क्या है, जो फसल के मौसम में गाया जाता है?",
"A_en": "Holi", "A_hi": "होली",
"B_en": "Saawan", "B_hi": "सावन",
"C_en": "Baisakhi", "C_hi": "बैसाखी",
"D_en": "Phaag", "D_hi": "फाग",
"answer": "D",
"explanation_en": "Phaag is a traditional folk song of Rajasthan, which is sung during the harvest season to celebrate the arrival of spring and the new crop.",
"explanation_hi": "फाग राजस्थान का एक पारंपरिक लोक गीत है, जो फसल के मौसम में वसंत और नई फसल के आगमन का जश्न मनाने के लिए गाया जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a type of folk theatre in Rajasthan, which is known for its satirical and humorous performances?",
"question_hi": "निम्नलिखित में से कौन राजस्थान का एक प्रकार का लोक नाट्य है, जो अपने व्यंग्यात्मक और हास्य प्रदर्शनों के लिए जाना जाता है?",
"A_en": "Bhavai", "A_hi": "भवई",
"B_en": "Tamasha", "B_hi": "तमाशा",
"C_en": "Nautanki", "C_hi": "नौटंकी",
"D_en": "Swang", "D_hi": "स्वांग",
"answer": "A",
"explanation_en": "Bhavai is a type of folk theatre in Rajasthan, which is known for its satirical and humorous performances, and is typically performed during festivals and celebrations.",
"explanation_hi": "भवई राजस्थान का एक प्रकार का लोक नाट्य है, जो अपने व्यंग्यात्मक और हास्य प्रदर्शनों के लिए जाना जाता है, और आमतौर पर त्योहारों और समारोहों के दौरान किया जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Who is the famous folk singer of Rajasthan, known for his songs on social and political issues?",
"question_hi": "राजस्थान का प्रसिद्ध लोक गायक कौन है, जो सामाजिक और राजनीतिक मुद्दों पर अपने गीतों के लिए जाना जाता है?",
"A_en": "Komal Kothari", "A_hi": "कोमल कोठारी",
"B_en": "Rajasthani Lalla", "B_hi": "राजस्थानी लल्ला",
"C_en": "Allahrakha", "C_hi": "अल्लारखा",
"D_en": "Teejan Bai", "D_hi": "तीजन बाई",
"answer": "C",
"explanation_en": "Allahrakha is a famous folk singer of Rajasthan, known for his songs on social and political issues, and is considered a pioneer of the folk music movement in the state.",
"explanation_hi": "अल्लारखा राजस्थान का एक प्रसिद्ध लोक गायक है, जो सामाजिक और राजनीतिक मुद्दों पर अपने गीतों के लिए जाना जाता है, और राज्य में लोक संगीत आंदोलन के एक पioneer माना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "What is the name of the traditional folk dance of Rajasthan, which is performed by women during the Teej festival?",
"question_hi": "राजस्थान के पारंपरिक लोक नृत्य का नाम क्या है, जो तीज त्योहार के दौरान महिलाओं द्वारा किया जाता है?",
"A_en": "Ghoomar", "A_hi": "घूमर",
"B_en": "Kathak", "B_hi": "कथक",
"C_en": "Bhavai", "C_hi": "भवई",
"D_en": "Chari", "D_hi": "चारी",
"answer": "A",
"explanation_en": "Ghoomar is a traditional folk dance of Rajasthan, which is performed by women during the Teej festival, and is known for its energetic and graceful movements.",
"explanation_hi": "घूमर राजस्थान का एक पारंपरिक लोक नृत्य है, जो तीज त्योहार के दौरान महिलाओं द्वारा किया जाता है, और इसकी ऊर्जावान और सुंदर गतिविधियों के लिए जाना जाता है।"
}
]