[
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which style of miniature painting originated in the Alwar region of Rajasthan?",
"question_hi": "राजस्थान के अलवर क्षेत्र में कौन सी लघु चित्रकला शैली उत्पन्न हुई?",
"A_en": "Mewar style", "A_hi": "मेवाड़ शैली",
"B_en": "Marwar style", "B_hi": "मारवाड़ शैली",
"C_en": "Alwar style", "C_hi": "अलवर शैली",
"D_en": "Hadoti style", "D_hi": "हाड़ौती शैली",
"answer": "C",
"explanation_en": "The Alwar style of miniature painting is a unique and distinct style that originated in the Alwar region of Rajasthan.",
"explanation_hi": "अलवर शैली की लघु चित्रकला एक विशिष्ट और अनोखी शैली है जो राजस्थान के अलवर क्षेत्र में उत्पन्न हुई।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which of the following painting styles is famous for its vibrant colors and intricate designs from Mewar region?",
"question_hi": "मेवाड़ क्षेत्र से अपनी जीवंत रंगों और जटिल डिजाइनों के लिए कौन सी चित्रकला शैली प्रसिद्ध है?",
"A_en": "Mewar miniature painting", "A_hi": "मेवाड़ लघु चित्रकला",
"B_en": "Marwar miniature painting", "B_hi": "मारवाड़ लघु चित्रकला",
"C_en": "Hadoti miniature painting", "C_hi": "हाड़ौती लघु चित्रकला",
"D_en": "Alwar miniature painting", "D_hi": "अलवर लघु चित्रकला",
"answer": "A",
"explanation_en": "Mewar miniature painting is famous for its vibrant colors and intricate designs, showcasing the rich cultural heritage of the Mewar region.",
"explanation_hi": "मेवाड़ लघु चित्रकला अपने जीवंत रंगों और जटिल डिजाइनों के लिए प्रसिद्ध है, जो मेवाड़ क्षेत्र की समृद्ध सांस्कृतिक विरासत को प्रदर्शित करती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which style of painting is characterized by bold and bright colors, typically from the Marwar region?",
"question_hi": "कौन सी चित्रकला शैली अपने बोल्ड और चमकीले रंगों के लिए जानी जाती है, जो आमतौर पर मारवाड़ क्षेत्र से है?",
"A_en": "Mewar style", "A_hi": "मेवाड़ शैली",
"B_en": "Marwar style", "B_hi": "मारवाड़ शैली",
"C_en": "Hadoti style", "C_hi": "हाड़ौती शैली",
"D_en": "Alwar style", "D_hi": "अलवर शैली",
"answer": "B",
"explanation_en": "The Marwar style of painting is characterized by bold and bright colors, reflecting the rich cultural traditions of the Marwar region.",
"explanation_hi": "मारवाड़ शैली की चित्रकला अपने बोल्ड और चमकीले रंगों के लिए जानी जाती है, जो मारवाड़ क्षेत्र की समृद्ध सांस्कृतिक परंपराओं को दर्शाती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which region in Rajasthan is known for its unique Hadoti style of miniature painting?",
"question_hi": "राजस्थान में कौन सा क्षेत्र अपनी अनोखी हाड़ौती शैली की लघु चित्रकला के लिए जाना जाता है?",
"A_en": "Mewar", "A_hi": "मेवाड़",
"B_en": "Marwar", "B_hi": "मारवाड़",
"C_en": "Hadoti", "C_hi": "हाड़ौती",
"D_en": "Alwar", "D_hi": "अलवर",
"answer": "C",
"explanation_en": "The Hadoti region in Rajasthan is known for its unique Hadoti style of miniature painting, which showcases the cultural traditions of the region.",
"explanation_hi": "राजस्थान का हाड़ौती क्षेत्र अपनी अनोखी हाड़ौती शैली की लघु चित्रकला के लिए जाना जाता है, जो क्षेत्र की सांस्कृतिक परंपराओं को प्रदर्शित करती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which of the following miniature painting styles is known for its delicate and intricate designs from the Alwar region?",
"question_hi": "निम्नलिखित में से कौन सी लघु चित्रकला शैली अलवर क्षेत्र से अपनी नाजुक और जटिल डिजाइनों के लिए जानी जाती है?",
"A_en": "Alwar miniature painting", "A_hi": "अलवर लघु चित्रकला",
"B_en": "Mewar miniature painting", "B_hi": "मेवाड़ लघु चित्रकला",
"C_en": "Marwar miniature painting", "C_hi": "मारवाड़ लघु चित्रकला",
"D_en": "Hadoti miniature painting", "D_hi": "हाड़ौती लघु चित्रकला",
"answer": "A",
"explanation_en": "The Alwar miniature painting style is known for its delicate and intricate designs, showcasing the artistic skills of the Alwar region.",
"explanation_hi": "अलवर लघु चित्रकला शैली अपनी नाजुक और जटिल डिजाइनों के लिए जानी जाती है, जो अलवर क्षेत्र की कलात्मक कौशल को प्रदर्शित करती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which style of miniature painting is characterized by its use of gold and silver leaf, typically from the Mewar region?",
"question_hi": "कौन सी लघु चित्रकला शैली अपने उपयोग में सोने और चांदी की पत्ती के लिए जानी जाती है, जो आमतौर पर मेवाड़ क्षेत्र से है?",
"A_en": "Mewar miniature painting", "A_hi": "मेवाड़ लघु चित्रकला",
"B_en": "Marwar miniature painting", "B_hi": "मारवाड़ लघु चित्रकला",
"C_en": "Hadoti miniature painting", "C_hi": "हाड़ौती लघु चित्रकला",
"D_en": "Alwar miniature painting", "D_hi": "अलवर लघु चित्रकला",
"answer": "A",
"explanation_en": "The Mewar miniature painting style is characterized by its use of gold and silver leaf, reflecting the rich cultural heritage of the Mewar region.",
"explanation_hi": "मेवाड़ लघु चित्रकला शैली अपने उपयोग में सोने और चांदी की पत्ती के लिए जानी जाती है, जो मेवाड़ क्षेत्र की समृद्ध सांस्कृतिक विरासत को दर्शाती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which region in Rajasthan is famous for its vibrant and colorful miniature paintings?",
"question_hi": "राजस्थान में कौन सा क्षेत्र अपने जीवंत और रंगीन लघु चित्रकलाओं के लिए प्रसिद्ध है?",
"A_en": "Mewar", "A_hi": "मेवाड़",
"B_en": "Marwar", "B_hi": "मारवाड़",
"C_en": "Alwar", "C_hi": "अलवर",
"D_en": "Hadoti", "D_hi": "हाड़ौती",
"answer": "A",
"explanation_en": "The Mewar region in Rajasthan is famous for its vibrant and colorful miniature paintings, showcasing the rich cultural traditions of the region.",
"explanation_hi": "राजस्थान का मेवाड़ क्षेत्र अपने जीवंत और रंगीन लघु चित्रकलाओं के लिए प्रसिद्ध है, जो क्षेत्र की समृद्ध सांस्कृतिक परंपराओं को प्रदर्शित करता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which style of painting is known for its bold and expressive designs, typically from the Marwar region?",
"question_hi": "कौन सी चित्रकला शैली अपने बोल्ड और अभिव्यक्तिपूर्ण डिजाइनों के लिए जानी जाती है, जो आमतौर पर मारवाड़ क्षेत्र से है?",
"A_en": "Mewar style", "A_hi": "मेवाड़ शैली",
"B_en": "Marwar style", "B_hi": "मारवाड़ शैली",
"C_en": "Hadoti style", "C_hi": "हाड़ौती शैली",
"D_en": "Alwar style", "D_hi": "अलवर शैली",
"answer": "B",
"explanation_en": "The Marwar style of painting is known for its bold and expressive designs, reflecting the rich cultural traditions of the Marwar region.",
"explanation_hi": "मारवाड़ शैली की चित्रकला अपने बोल्ड और अभिव्यक्तिपूर्ण डिजाइनों के लिए जानी जाती है, जो मारवाड़ क्षेत्र की समृद्ध सांस्कृतिक परंपराओं को दर्शाती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which region in Rajasthan is known for its unique and distinct style of miniature painting?",
"question_hi": "राजस्थान में कौन सा क्षेत्र अपनी अनोखी और विशिष्ट शैली की लघु चित्रकला के लिए जाना जाता है?",
"A_en": "Alwar", "A_hi": "अलवर",
"B_en": "Mewar", "B_hi": "मेवाड़",
"C_en": "Marwar", "C_hi": "मारवाड़",
"D_en": "Hadoti", "D_hi": "हाड़ौती",
"answer": "A",
"explanation_en": "The Alwar region in Rajasthan is known for its unique and distinct style of miniature painting, showcasing the artistic skills of the region.",
"explanation_hi": "राजस्थान का अलवर क्षेत्र अपनी अनोखी और विशिष्ट शैली की लघु चित्रकला के लिए जाना जाता है, जो क्षेत्र की कलात्मक कौशल को प्रदर्शित करता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ki Chitrakala: Alwar, Mewar, Marwar aur Hadoti Shailiyan",
"question_en": "Which style of miniature painting is characterized by its use of natural colors and simple designs?",
"question_hi": "कौन सी लघु चित्रकला शैली अपने प्राकृतिक रंगों और सरल डिजाइनों के उपयोग के लिए जानी जाती है?",
"A_en": "Mewar miniature painting", "A_hi": "मेवाड़ लघु चित्रकला",
"B_en": "Marwar miniature painting", "B_hi": "मारवाड़ लघु चित्रकला",
"C_en": "Hadoti miniature painting", "C_hi": "हाड़ौती लघु चित्रकला",
"D_en": "Alwar miniature painting", "D_hi": "अलवर लघु चित्रकला",
"answer": "C",
"explanation_en": "The Hadoti miniature painting style is characterized by its use of natural colors and simple designs, reflecting the cultural traditions of the Hadoti region.",
"explanation_hi": "हाड़ौती लघु चित्रकला शैली अपने प्राकृतिक रंगों और सरल डिजाइनों के उपयोग के लिए जानी जाती है, जो हाड़ौती क्षेत्र की सांस्कृतिक परंपराओं को दर्शाती है।"
}
]