[
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a traditional folk dance of Rajasthan?",
"question_hi": "राजस्थान के पारंपरिक लोक नृत्यों में से कौनसा है?",
"A_en": "Garba", "A_hi": "गरबा",
"B_en": "Ghoomar", "B_hi": "घूमर",
"C_en": "Kalbeliya", "C_hi": "कालबेलिया",
"D_en": "Bhangra", "D_hi": "भांगड़ा",
"answer": "B",
"explanation_en": "Ghoomar is a traditional folk dance of Rajasthan, especially performed by women.",
"explanation_hi": "घूमर राजस्थान का एक पारंपरिक लोक नृत्य है, जो विशेष रूप से महिलाओं द्वारा किया जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a traditional folk song of Rajasthan?",
"question_hi": "राजस्थान के पारंपरिक लोक गीतों में से कौनसा है?",
"A_en": "Bhavageet", "A_hi": "भावगीत",
"B_en": "Bhajan", "B_hi": "भजन",
"C_en": "Folk Ballad", "C_hi": "लोक गीत",
"D_en": "Thumri", "D_hi": "ठुमरी",
"answer": "A",
"explanation_en": "Bhavageet is a traditional folk song of Rajasthan, known for its emotional and devotional lyrics.",
"explanation_hi": "भावगीत राजस्थान का एक पारंपरिक लोक गीत है, जाना जाता है इसके भावनात्मक और भक्तिभावभरे लिरिक्स के लिए।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a traditional folk instrument of Rajasthan?",
"question_hi": "राजस्थान के पारंपरिक लोक वाद्यों में से कौनसा है?",
"A_en": "Sitar", "A_hi": "सितार",
"B_en": "Dholak", "B_hi": "धोलक",
"C_en": "Pungi", "C_hi": "पुंगी",
"D_en": "Shehnai", "D_hi": "शहनाई",
"answer": "B",
"explanation_en": "Dholak is a traditional folk instrument of Rajasthan, commonly used in folk music and dance.",
"explanation_hi": "धोलक राजस्थान का एक पारंपरिक लोक वाद्य है, जो अक्सर लोक संगीत और नृत्य में उपयोग किया जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a traditional folk theatre form of Rajasthan?",
"question_hi": "राजस्थान के पारंपरिक लोक नाटकों में से कौनसा है?",
"A_en": "Yakshagana", "A_hi": "यक्षगान",
"B_en": "Terah Tari", "B_hi": "तरह तारी",
"C_en": "Ras Lila", "C_hi": "रास लीला",
"D_en": "Ram Leela", "D_hi": "राम लीला",
"answer": "B",
"explanation_en": "Terah Tari is a traditional folk theatre form of Rajasthan, known for its narrative and dramatic performances.",
"explanation_hi": "तरह तारी राजस्थान का एक पारंपरिक लोक नाटक है, जाना जाता है इसके कथात्मक और नाटकीय प्रदर्शनों के लिए।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a traditional folk music form of Rajasthan?",
"question_hi": "राजस्थान के पारंपरिक लोक संगीतों में से कौनसा है?",
"A_en": "Bhopa", "A_hi": "भोपा",
"B_en": "Lavani", "B_hi": "लवणी",
"C_en": "Kathak", "C_hi": "कथक",
"D_en": "Dhrupad", "D_hi": "ध्रुपद",
"answer": "A",
"explanation_en": "Bhopa is a traditional folk music form of Rajasthan, known for its poetic and narrative lyrics.",
"explanation_hi": "भोपा राजस्थान का एक पारंपरिक लोक संगीत है, जाना जाता है इसके कवितात्मक और कथात्मक लिरिक्स के लिए।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a traditional folk instrument used in Rajasthan's Kathak dance?",
"question_hi": "राजस्थान के कथक नृत्य में उपयोग किए जाने वाले पारंपरिक लोक वाद्यों में से कौनसा है?",
"A_en": "Mridangam", "A_hi": "मृदंगम",
"B_en": "Tabla", "B_hi": "तबला",
"C_en": "Dholak", "C_hi": "धोलक",
"D_en": "Pakhawaj", "D_hi": "पakhawaj",
"answer": "B",
"explanation_en": "Tabla is a traditional folk instrument used in Rajasthan's Kathak dance, known for its rapid beats and rhythmic patterns.",
"explanation_hi": "तबला राजस्थान के कथक नृत्य में उपयोग किए जाने वाला एक पारंपरिक लोक वाद्य है, जाना जाता है इसके तेज़ धुनों और तालों के लिए।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a traditional folk theatre form of Rajasthan, known for its acrobatic feats?",
"question_hi": "राजस्थान के पारंपरिक लोक नाटकों में से कौनसा है, जाना जाता है इसके अक्सरबाजी के लिए?",
"A_en": "Thathera", "A_hi": "ठाथेरा",
"B_en": "Terah Tari", "B_hi": "तरह तारी",
"C_en": "Bhopa", "C_hi": "भोपा",
"D_en": "Kalbeliya", "D_hi": "कालबेलिया",
"answer": "A",
"explanation_en": "Thathera is a traditional folk theatre form of Rajasthan, known for its acrobatic feats and physical performances.",
"explanation_hi": "ठाथेरा राजस्थान का एक पारंपरिक लोक नाटक है, जाना जाता है इसके अक्सरबाजी के लिए और शारीरिक प्रदर्शनों के लिए।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a traditional folk song of Rajasthan, sung by the Bhil tribes?",
"question_hi": "राजस्थान के पारंपरिक लोक गीतों में से कौनसा है, जो भील जनजाति द्वारा गाया जाता है?",
"A_en": "Bhavageet", "A_hi": "भावगीत",
"B_en": "Bhajan", "B_hi": "भजन",
"C_en": "Folk Ballad", "C_hi": "लोक गीत",
"D_en": "Bhilwara", "D_hi": "भीलवारा",
"answer": "D",
"explanation_en": "Bhilwara is a traditional folk song of Rajasthan, sung by the Bhil tribes, known for its poetic and narrative lyrics.",
"explanation_hi": "भीलवारा राजस्थान का एक पारंपरिक लोक गीत है, जो भील जनजाति द्वारा गाया जाता है, जाना जाता है इसके कवितात्मक और कथात्मक लिरिक्स के लिए।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a traditional folk instrument used in Rajasthan's Kalbeliya dance?",
"question_hi": "राजस्थान के कालबेलिया नृत्य में उपयोग किए जाने वाले पारंपरिक लोक वाद्यों में से कौनसा है?",
"A_en": "Pungi", "A_hi": "पुंगी",
"B_en": "Shehnai", "B_hi": "शहनाई",
"C_en": "Dholak", "C_hi": "धोलक",
"D_en": "Kamaccha", "D_hi": "कमाच्छा",
"answer": "D",
"explanation_en": "Kamaccha is a traditional folk instrument used in Rajasthan's Kalbeliya dance, known for its unique and haunting sounds.",
"explanation_hi": "कमाच्छा राजस्थान के कालबेलिया नृत्य में उपयोग किए जाने वाला एक पारंपरिक लोक वाद्य है, जाना जाता है इसके अद्वितीय और भयंकर ध्वनियों के लिए।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a traditional folk theatre form of Rajasthan, known for its shadow puppetry?",
"question_hi": "राजस्थान के पारंपरिक लोक नाटकों में से कौनसा है, जाना जाता है इसके छायाचित्रकला के लिए?",
"A_en": "Ras Lila", "A_hi": "रास लीला",
"B_en": "Terah Tari", "B_hi": "तरह तारी",
"C_en": "Thathera", "C_hi": "ठाथेरा",
"D_en": "Khayal Rang", "D_hi": "खयाल रंग",
"answer": "D",
"explanation_en": "Khayal Rang is a traditional folk theatre form of Rajasthan, known for its shadow puppetry and narrative performances.",
"explanation_hi": "खयाल रंग राजस्थान का एक पारंपरिक लोक नाटक है, जाना जाता है इसके छायाचित्रकला और कथात्मक प्रदर्शनों के लिए।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a traditional folk instrument used in Rajasthan's Ghoomar dance?",
"question_hi": "राजस्थान के घूमर नृत्य में उपयोग किए जाने वाले पारंपरिक लोक वाद्यों में से कौनसा है?",
"A_en": "Dholak", "A_hi": "धोलक",
"B_en": "Pungi", "B_hi": "पुंगी",
"C_en": "Shehnai", "C_hi": "शहनाई",
"D_en": "Kadhum", "D_hi": "कधुम",
"answer": "D",
"explanation_en": "Kadhum is a traditional folk instrument used in Rajasthan's Ghoomar dance, known for its unique and energetic sounds.",
"explanation_hi": "कधुम राजस्थान के घूमर नृत्य में उपयोग किए जाने वाला एक पारंपरिक लोक वाद्य है, जाना जाता है इसके अद्वितीय और ऊर्जावान ध्वनियों के लिए।"
}