[
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a famous folk dance of Rajasthan?",
"question_hi": "निम्नलिखित में से कौन राजस्थान का प्रसिद्ध लोक नृत्य है?",
"A_en": "Bharatanatyam", "A_hi": "भरतनाट्यम",
"B_en": "Kathak", "B_hi": "कथक",
"C_en": "Ghoomar", "C_hi": "घूमर",
"D_en": "Odissi", "D_hi": "ओडिसी",
"answer": "C",
"explanation_en": "Ghoomar is a traditional folk dance of Rajasthan, typically performed by women during festivals and special occasions.",
"explanation_hi": "घूमर राजस्थान का एक पारंपरिक लोक नृत्य है, जो आमतौर पर महिलाएं त्योहारों और विशेष अवसरों के दौरान करती हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "What is the name of the traditional folk song of Rajasthan, which is sung during the marriage ceremonies?",
"question_hi": "राजस्थान के पारंपरिक लोक गीत का नाम क्या है, जो विवाह समारोह के दौरान गाया जाता है?",
"A_en": "Maand", "A_hi": "मांड",
"B_en": "Bhopa", "B_hi": "भोपा",
"C_en": "Panihari", "C_hi": "पानीहरी",
"D_en": "Kurjan", "D_hi": "कुरजान",
"answer": "C",
"explanation_en": "Panihari is a traditional folk song of Rajasthan, which is sung during the marriage ceremonies, especially during the 'Mehndi' ceremony.",
"explanation_hi": "पानीहरी राजस्थान का एक पारंपरिक लोक गीत है, जो विवाह समारोह के दौरान गाया जाता है, खासकर 'मेहंदी' समारोह के दौरान।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a popular folk theatre form of Rajasthan?",
"question_hi": "निम्नलिखित में से कौन राजस्थान का एक लोकप्रिय लोक नाट्य रूप है?",
"A_en": "Bhavai", "A_hi": "भावाई",
"B_en": "Swang", "B_hi": "स्वांग",
"C_en": "Nautanki", "C_hi": "नौटंकी",
"D_en": "Raasleela", "D_hi": "रासलीला",
"answer": "A",
"explanation_en": "Bhavai is a popular folk theatre form of Rajasthan, which is known for its energetic and vibrant performances.",
"explanation_hi": "भावाई राजस्थान का एक लोकप्रिय लोक नाट्य रूप है, जो अपने ऊर्जावान और रंगीन प्रदर्शनों के लिए जाना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "What is the name of the traditional folk instrument of Rajasthan, which is used to accompany folk songs and dances?",
"question_hi": "राजस्थान के पारंपरिक लोक वाद्य का नाम क्या है, जो लोक गीतों और नृत्यों के साथ उपयोग किया जाता है?",
"A_en": "Dholak", "A_hi": "ढोलक",
"B_en": "Nagada", "B_hi": "नगाड़ा",
"C_en": "Chang", "C_hi": "चंग",
"D_en": "Rawanhatta", "D_hi": "रवनहट्टा",
"answer": "B",
"explanation_en": "Nagada is a traditional folk instrument of Rajasthan, which is used to accompany folk songs and dances, especially during the 'Ghoomar' dance.",
"explanation_hi": "नगाड़ा राजस्थान का एक पारंपरिक लोक वाद्य है, जो लोक गीतों और नृत्यों के साथ उपयोग किया जाता है, खासकर 'घूमर' नृत्य के दौरान।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following folk dances of Rajasthan is known for its energetic and acrobatic movements?",
"question_hi": "निम्नलिखित में से कौन राजस्थान का लोक नृत्य अपने ऊर्जावान और जिमनास्टिक गतिविधियों के लिए जाना जाता है?",
"A_en": "Ghoomar", "A_hi": "घूमर",
"B_en": "Kalbeliya", "B_hi": "कालबेलिया",
"C_en": "Bhavai", "C_hi": "भावाई",
"D_en": "Chari", "D_hi": "चारी",
"answer": "D",
"explanation_en": "Chari is a folk dance of Rajasthan, which is known for its energetic and acrobatic movements, and is typically performed by women.",
"explanation_hi": "चारी राजस्थान का एक लोक नृत्य है, जो अपने ऊर्जावान और जिमनास्टिक गतिविधियों के लिए जाना जाता है, और आमतौर पर महिलाएं करती हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "What is the name of the traditional folk song of Rajasthan, which is sung during the harvesting season?",
"question_hi": "राजस्थान के पारंपरिक लोक गीत का नाम क्या है, जो फसल कटाई के मौसम के दौरान गाया जाता है?",
"A_en": "Fag", "A_hi": "फाग",
"B_en": "Holi", "B_hi": "होली",
"C_en": "Baisakhi", "C_hi": "बैसाखी",
"D_en": "Lohri", "D_hi": "लोहड़ी",
"answer": "A",
"explanation_en": "Fag is a traditional folk song of Rajasthan, which is sung during the harvesting season, especially during the 'Holi' festival.",
"explanation_hi": "फाग राजस्थान का एक पारंपरिक लोक गीत है, जो फसल कटाई के मौसम के दौरान गाया जाता है, खासकर 'होली' त्योहार के दौरान।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following is a famous folk musician of Rajasthan?",
"question_hi": "निम्नलिखित में से कौन राजस्थान का प्रसिद्ध लोक संगीतकार है?",
"A_en": "Komal Da", "A_hi": "कोमल डा",
"B_en": "Allah Jilai Bai", "B_hi": "अल्लाह जिलाई बाई",
"C_en": "Teejan Bai", "C_hi": "तीजन बाई",
"D_en": "Sawaimadhopur Gharana", "D_hi": "सवाईमाधोपुर घराना",
"answer": "C",
"explanation_en": "Teejan Bai is a famous folk musician of Rajasthan, known for her traditional folk songs and performances.",
"explanation_hi": "तीजन बाई राजस्थान की एक प्रसिद्ध लोक संगीतकार है, जो अपने पारंपरिक लोक गीतों और प्रदर्शनों के लिए जानी जाती है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "What is the name of the traditional folk dance of Rajasthan, which is performed by the 'Kathodi' community?",
"question_hi": "राजस्थान के पारंपरिक लोक नृत्य का नाम क्या है, जो 'कथोड़ी' समुदाय द्वारा किया जाता है?",
"A_en": "Ghoomar", "A_hi": "घूमर",
"B_en": "Kalbeliya", "B_hi": "कालबेलिया",
"C_en": "Bhavai", "C_hi": "भावाई",
"D_en": "Kathputli", "D_hi": "कठपुतली",
"answer": "B",
"explanation_en": "Kalbeliya is a traditional folk dance of Rajasthan, which is performed by the 'Kathodi' community, and is known for its energetic and vibrant performances.",
"explanation_hi": "कालबेलिया राजस्थान का एक पारंपरिक लोक नृत्य है, जो 'कथोड़ी' समुदाय द्वारा किया जाता है, और अपने ऊर्जावान और रंगीन प्रदर्शनों के लिए जाना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "Which of the following folk dances of Rajasthan is known for its intricate footwork and hand movements?",
"question_hi": "निम्नलिखित में से कौन राजस्थान का लोक नृत्य अपने जटिल पैरों की गति और हाथों की गतिविधियों के लिए जाना जाता है?",
"A_en": "Ghoomar", "A_hi": "घूमर",
"B_en": "Kalbeliya", "B_hi": "कालबेलिया",
"C_en": "Bhavai", "C_hi": "भावाई",
"D_en": "Chari", "D_hi": "चारी",
"answer": "B",
"explanation_en": "Kalbeliya is a folk dance of Rajasthan, which is known for its intricate footwork and hand movements, and is typically performed by women.",
"explanation_hi": "कालबेलिया राजस्थान का एक लोक नृत्य है, जो अपने जटिल पैरों की गति और हाथों की गतिविधियों के लिए जाना जाता है, और आमतौर पर महिलाएं करती हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Rajasthan ke Lok Geet, Lok Nritya aur Lok Natya",
"question_en": "What is the name of the traditional folk festival of Rajasthan, which is celebrated during the full moon night in the month of 'Sharad'?",
"question_hi": "राजस्थान के पारंपरिक लोक त्योहार का नाम क्या है, जो 'शरद' माह में पूर्णिमा की रात को मनाया जाता है?",
"A_en": "Sharad Purnima", "A_hi": "शरद पूर्णिमा",
"B_en": "Kartik Purnima", "B_hi": "कार्तिक पूर्णिमा",
"C_en": "Holi", "C_hi": "होली",
"D_en": "Diwali", "D_hi": "दीवाली",
"answer": "A",
"explanation_en": "Sharad Purnima is a traditional folk festival of Rajasthan, which is celebrated during the full moon night in the month of 'Sharad', and is known for its cultural and musical performances.",
"explanation_hi": "शरद पूर्णिमा राजस्थान का एक पारंपरिक लोक त्योहार है, जो 'शरद' माह में पूर्णिमा की रात को मनाया जाता है, और अपने सांस्कृतिक और संगीतमय प्रदर्शनों के लिए जाना जाता है।"
}
]