[
{
"subject": "Rajasthan Culture",
"topic": "Sant Sampraday: Ramanandi, Dadupanthi, Bishnoi, Jasnathi, etc.",
"question_en": "Who was the founder of the Ramanandi sect?",
"question_hi": "रामानंदी संप्रदाय के संस्थापक कौन थे?",
"A_en": "Bhakti Charandas", "A_hi": "भक्ति चरंदास",
"B_en": "Ramananda", "B_hi": "रामानंद",
"C_en": "Kabir", "C_hi": "कबीर",
"D_en": "Guru Nanak", "D_hi": "गुरु नानक",
"answer": "B",
"explanation_en": "Ramananda was a 14th-century Hindu yogi and a prominent figure in the Bhakti movement. He is considered the founder of the Ramanandi sect.",
"explanation_hi": "रामानंद 14वीं शताब्दी के हिंदू योगी और भक्ति आंदोलन के एक प्रमुख व्यक्ति थे। उन्हें रामानंदी संप्रदाय के संस्थापक माना जाता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Sant Sampraday: Ramanandi, Dadupanthi, Bishnoi, Jasnathi, etc.",
"question_en": "Which of the following sects was founded by Guru Dadu Dayal?",
"question_hi": "निम्नलिखित में से कौन से संप्रदाय की स्थापना गुरु दादू दयाल ने की थी?",
"A_en": "Ramanandi", "A_hi": "रामानंदी",
"B_en": "Dadupanthi", "B_hi": "दादुपंथी",
"C_en": "Bishnoi", "C_hi": "बिश्नोई",
"D_en": "Jasnathi", "D_hi": "जसनाथी",
"answer": "B",
"explanation_en": "The Dadupanthi sect was founded by Guru Dadu Dayal in the 16th century. The sect emphasizes devotion to God and a simple way of life.",
"explanation_hi": "दादुपंथी संप्रदाय की स्थापना गुरु दादू दयाल ने 16वीं शताब्दी में की थी। यह संप्रदाय ईश्वर की भक्ति और सादगी पर जोर देता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Sant Sampraday: Ramanandi, Dadupanthi, Bishnoi, Jasnathi, etc.",
"question_en": "Who was the founder of the Bishnoi sect?",
"question_hi": "बिश्नोई संप्रदाय के संस्थापक कौन थे?",
"A_en": "Guru Jambhoji", "A_hi": "गुरु जंभोजी",
"B_en": "Ramananda", "B_hi": "रामानंद",
"C_en": "Kabir", "C_hi": "कबीर",
"D_en": "Dadu Dayal", "D_hi": "दादू दयाल",
"answer": "A",
"explanation_en": "The Bishnoi sect was founded by Guru Jambhoji in the 15th century. The sect emphasizes environmental conservation and a simple way of life.",
"explanation_hi": "बिश्नोई संप्रदाय की स्थापना गुरु जंभोजी ने 15वीं शताब्दी में की थी। यह संप्रदाय पर्यावरण संरक्षण और सादगी पर जोर देता है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Sant Sampraday: Ramanandi, Dadupanthi, Bishnoi, Jasnathi, etc.",
"question_en": "Which of the following sects is known for its emphasis on environmental conservation?",
"question_hi": "निम्नलिखित में से कौन सा संप्रदाय पर्यावरण संरक्षण पर जोर देने के लिए जाना जाता है?",
"A_en": "Ramanandi", "A_hi": "रामानंदी",
"B_en": "Dadupanthi", "B_hi": "दादुपंथी",
"C_en": "Bishnoi", "C_hi": "बिश्नोई",
"D_en": "Jasnathi", "D_hi": "जसनाथी",
"answer": "C",
"explanation_en": "The Bishnoi sect is known for its emphasis on environmental conservation. They have made significant contributions to the preservation of trees and wildlife.",
"explanation_hi": "बिश्नोई संप्रदाय पर्यावरण संरक्षण पर जोर देने के लिए जाना जाता है। उन्होंने पेड़ों और वन्यजीवों के संरक्षण में महत्वपूर्ण योगदान दिया है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Sant Sampraday: Ramanandi, Dadupanthi, Bishnoi, Jasnathi, etc.",
"question_en": "Who was Jasnath ji, and what was his significance?",
"question_hi": "जसनाथ जी कौन थे और उनका क्या महत्व था?",
"A_en": "A 16th-century saint and founder of the Jasnathi sect", "A_hi": "16वीं शताब्दी के संत और जसनाथी संप्रदाय के संस्थापक",
"B_en": "A poet and writer from Rajasthan", "B_hi": "राजस्थान के एक कवि और लेखक",
"C_en": "A ruler of the Rathore dynasty", "C_hi": "राठौर राजवंश के एक शासक",
"D_en": "A social reformer from Gujarat", "D_hi": "गुजरात के एक समाज सुधारक",
"answer": "A",
"explanation_en": "Jasnath ji was a 16th-century saint and the founder of the Jasnathi sect. He was a prominent figure in the Bhakti movement in Rajasthan.",
"explanation_hi": "जसनाथ जी 16वीं शताब्दी के संत और जसनाथी संप्रदाय के संस्थापक थे। वह राजस्थान में भक्ति आंदोलन के एक प्रमुख व्यक्ति थे।"
},
{
"subject": "Rajasthan Culture",
"topic": "Sant Sampraday: Ramanandi, Dadupanthi, Bishnoi, Jasnathi, etc.",
"question_en": "Which of the following is a common feature of the Ramanandi and Dadupanthi sects?",
"question_hi": "निम्नलिखित में से कौन सी विशेषता रामानंदी और दादुपंथी संप्रदायों की आम है?",
"A_en": "Emphasis on idol worship", "A_hi": "मूर्ति पूजा पर जोर",
"B_en": "Emphasis on devotion to God", "B_hi": "ईश्वर की भक्ति पर जोर",
"C_en": "Emphasis on environmental conservation", "C_hi": "पर्यावरण संरक्षण पर जोर",
"D_en": "Emphasis on social hierarchy", "D_hi": "सामाजिक पदानुक्रम पर जोर",
"answer": "B",
"explanation_en": "Both the Ramanandi and Dadupanthi sects emphasize devotion to God and a simple way of life. They focus on the attainment of spiritual liberation through devotion and self-realization.",
"explanation_hi": "रामानंदी और दादुपंथी दोनों संप्रदाय ईश्वर की भक्ति और सादगी पर जोर देते हैं। वे भक्ति और आत्म-साक्षात्कार के माध्यम से आध्यात्मिक मुक्ति प्राप्त करने पर ध्यान केंद्रित करते हैं।"
},
{
"subject": "Rajasthan Culture",
"topic": "Sant Sampraday: Ramanandi, Dadupanthi, Bishnoi, Jasnathi, etc.",
"question_en": "In which century did the Bishnoi sect emerge?",
"question_hi": "बिश्नोई संप्रदाय कब उभरा?",
"A_en": "15th century", "A_hi": "15वीं शताब्दी",
"B_en": "16th century", "B_hi": "16वीं शताब्दी",
"C_en": "17th century", "C_hi": "17वीं शताब्दी",
"D_en": "18th century", "D_hi": "18वीं शताब्दी",
"answer": "A",
"explanation_en": "The Bishnoi sect emerged in the 15th century. It was founded by Guru Jambhoji in 1485.",
"explanation_hi": "बिश्नोई संप्रदाय 15वीं शताब्दी में उभरा। इसकी स्थापना गुरु जंभोजी ने 1485 में की थी।"
},
{
"subject": "Rajasthan Culture",
"topic": "Sant Sampraday: Ramanandi, Dadupanthi, Bishnoi, Jasnathi, etc.",
"question_en": "What is the significance of the Jasnathi sect in Rajasthan?",
"question_hi": "राजस्थान में जसनाथी संप्रदाय का क्या महत्व है?",
"A_en": "It is a major contributor to the state's economy", "A_hi": "यह राज्य की अर्थव्यवस्था में एक प्रमुख योगदानकर्ता है",
"B_en": "It is a prominent sect in the Bhakti movement", "B_hi": "यह भक्ति आंदोलन में एक प्रमुख संप्रदाय है",
"C_en": "It is a well-known for its architectural achievements", "C_hi": "यह अपने वास्तुकला की उपलब्धियों के लिए जाना जाता है",
"D_en": "It is a significant part of Rajasthan's cultural heritage", "D_hi": "यह राजस्थान की सांस्कृतिक विरासत का एक महत्वपूर्ण हिस्सा है",
"answer": "D",
"explanation_en": "The Jasnathi sect is a significant part of Rajasthan's cultural heritage. It has played a crucial role in shaping the state's spiritual and cultural landscape.",
"explanation_hi": "जसनाथी संप्रदाय राजस्थान की सांस्कृतिक विरासत का एक महत्वपूर्ण हिस्सा है। इसने राज्य के आध्यात्मिक और सांस्कृतिक परिदृश्य को आकार देने में महत्वपूर्ण भूमिका निभाई है।"
},
{
"subject": "Rajasthan Culture",
"topic": "Sant Sampraday: Ramanandi, Dadupanthi, Bishnoi, Jasnathi, etc.",
"question_en": "Who among the following is a notable figure in the Ramanandi sect?",
"question_hi": "निम्नलिखित में से कौन रामानंदी संप्रदाय की एक उल्लेखनीय शख्सियत है?",
"A_en": "Kabir", "A_hi": "कबीर",
"B_en": "Dadu Dayal", "B_hi": "दादू दयाल",
"C_en": "Ravidas", "C_hi": "रविदास",
"D_en": "Anandabai", "D_hi": "आनंदबाई",
"answer": "C",
"explanation_en": "Ravidas was a notable figure in the Ramanandi sect. He was a poet and a saint who emphasized devotion to God and social equality.",
"explanation_hi": "रविदास रामानंदी संप्रदाय की एक उल्लेखनीय शख्सियत थे। वह एक कवि और संत थे जिन्होंने ईश्वर की भक्ति और सामाजिक समानता पर जोर दिया।"
},
{
"subject": "Rajasthan Culture",
"topic": "Sant Sampraday: Ramanandi, Dadupanthi, Bishnoi, Jasnathi, etc.",
"question_en": "Which of the following sects is known for its strict rules and regulations?",
"question_hi": "निम्नलिखित में से कौन सा संप्रदाय अपने सख्त नियमों और विनियमों के लिए जाना जाता है?",
"A_en": "Ramanandi", "A_hi": "रामानंदी",
"B_en": "Dadupanthi", "B_hi": "दादुपंथी",
"C_en": "Bishnoi", "C_hi": "बिश्नोई",
"D_en": "Jasnathi", "D_hi": "जसनाथी",
"answer": "C",
"explanation_en": "The Bishnoi sect is known for its strict rules and regulations. They have a strong emphasis on environmental conservation and social responsibility.",
"explanation_hi": "बिश्नोई संप्रदाय अपने सख्त नियमों और विनियमों के लिए जाना जाता है। वे पर्यावरण संरक्षण और सामाजिक जिम्मेदारी पर जोर देते हैं।"
}
]