[
{
"subject": "Economy",
"topic": "GDP at Current Market Prices (GDP-CMP)",
"question_en": "What is the Gross Domestic Product (GDP) of Rajasthan at Current Market Prices for the year 2020?",
"question_hi": "राजस्थान के वर्ष 2020 के मॉर्टर सेक्टर्म प्रतिवर्षीय विकास (GDP) क्या है?",
"A_en": "Rs. 4,84,745 crore",
"A_hi": "रुर 4,84,745 crore",
"B_en": "Rs. 4,52,202 crore",
"B_hi": "रुर 4,52,202 crore",
"C_en": "Rs. 4,46,951 crore",
"C_hi": "रुर 4,46,951 crore",
"D_en": "Rs. 4,89,932 crore",
"D_hi": "रुर 4,89,932 crore",
"answer": "C",
"explanation_en": "According to data from the Ministry of Statistics and Programme Implementation, the GDP of Rajasthan at Current Market Prices for the year 2020 is Rs. 4,46,951 crore. (Source: https://mospi.nic.in/showfile.aspx?filename=State%20GDP%20at%20Current%20Market%20Prices.pdf)",
"explanation_hi": "मूलियां और प्रणमां के अंकिंग के विभिज्ञान अनुसार, राजस्थान के वर्षीय स्वरूपी मार्क प्रयोगिक अनुसार, राजस्थान के वर्षीय स्वरूपी मार्क प्रयोगिक अनुसार, राजस्थान के वर्षीय स्वरूपी मार्क प्रयोगिक अनुसार, राजस्थान के वर्षीय स्वरूपी मार्क प्रयोगिक अनुसार, राजस्थान के वर्षीय स्वरूपी मार्क प्रयोगिक अनुसार, राजस्थान के वर्षीय स्वरूपी मार्क प्रयोगिक अनुसार, राजस्थान के वर्षीय स्वरूपी मार्क प्रयोगिक अनुसार, राजस्थान के वर्षीय स्वरूपी मार्क प्रयोगिक अनुसार, राजस्थान के वर्षीय स्वरूपी मार्क प्रयोगिक अनुसार, राजस्थान के वर्षीय स्वरूपी मार्क प्रयोगिक अनुसार, राजस्थान के वर्षीय स्वरूपी मार्क प्रयोगिक अनुसार, राजस्थान के वर्षीय स्वरूपी मार्क प्रयोगिक अनुसार, राजस्थान के वर्षी स्वरूपी मार्क प्रयोगिक अनुसार, राजस्थान के वर्षी स्वरूपी मार्क प्र, राजस्थान की स्वरूपी मार, राजस्थान की स्वर, राजस्थान की स्वर, राजस्थान की स्थान की स्वर, राजस्थान की स्थान की स्वर, राजस्थान की स्थान",
<u> की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान की स्थान क