[
{
"subject": "Economy",
"topic": "Globalization and International Trade",
"question_en": "What is the main advantage of free trade under globalization?",
"question_hi": "ग्लोबलाइजेशन के तहत मुक्त व्यापार का मुख्य लाभ क्या है?",
"A_en": "Increased government control", "A_hi": "सरकार का वृद्धि हुआ नियंत्रण",
"B_en": "Reduced job opportunities", "B_hi": "कमी भर्ती अवसर",
"C_en": "Increased competition and lower prices", "C_hi": "वृद्धि प्रतिस्पर्धा और कम मूल्य",
"D_en": "Dependence on foreign countries", "D_hi": "विदेशी देशों पर निर्भरता",
"answer": "C",
"explanation_en": "Free trade under globalization leads to increased competition and lower prices, which benefits consumers.",
"explanation_hi": "ग्लोबलाइजेशन के तहत मुक्त व्यापार प्रतिस्पर्धा और कम मूल्य का वृद्धि करता है, जो उपभोक्ताओं को लाभ पहुंचाता है।"
},
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the term for the study of the overall behavior and performance of an economy?",
"question_hi": "आर्थिक व्यवहार और प्रदर्शन का अध्ययन करने के लिए क्या नाम दिया जाता है?",
"A_en": "Microeconomics", "A_hi": "माइक्रो अर्थशास्त्र",
"B_en": "Macroeconomics", "B_hi": "मैक्रो अर्थशास्त्र",
"C_en": "International Trade", "C_hi": "अंतरराष्ट्रीय व्यापार",
"D_en": "Monetary Policy", "D_hi": "मौद्रिक नीति",
"answer": "B",
"explanation_en": "Macroeconomics is the study of the overall behavior and performance of an economy, including factors such as inflation, unemployment, and economic growth.",
"explanation_hi": "मैक्रो अर्थशास्त्र आर्थिक व्यवहार और प्रदर्शन का अध्ययन है, जिसमें मुद्रास्फीति, बेरोजगारी, और आर्थिक वृद्धि जैसे कारक शामिल होते हैं।"
},
{
"subject": "Economy",
"topic": "Development Economics",
"question_en": "What is the term for the gap between the standard of living of the richest and poorest countries in the world?",
"question_hi": "दुनिया के सबसे अमीर और गरीब देशों के जीवन स्तर के बीच की खाई को क्या कहते हैं?",
"A_en": "Poverty Line", "A_hi": "गरीबी रेखा",
"B_en": "Income Inequality", "B_hi": "आय असमानता",
"C_en": "Human Development Index", "C_hi": "मानव विकास सूचकांक",
"D_en": "Global Poverty Rate", "D_hi": "वैश्विक गरीबी दर",
"answer": "B",
"explanation_en": "Income Inequality refers to the gap between the standard of living of the richest and poorest countries in the world.",
"explanation_hi": "आय असमानता दुनिया के सबसे अमीर और गरीब देशों के जीवन स्तर के बीच की खाई को संदर्भित करता है।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "What is the term for the process of government borrowing money from the public to finance its expenditure?",
"question_hi": "सरकार के व्यय को वित्तपोषित करने के लिए सार्वजनिक से पैसा उधार लेने की प्रक्रिया को क्या कहते हैं?",
"A_en": "Taxation", "A_hi": "कर",
"B_en": "Public Borrowing", "B_hi": "सार्वजनिक उधार",
"C_en": "Government Expenditure", "C_hi": "सरकारी व्यय",
"D_en": "Fiscal Policy", "D_hi": "वित्तीय नीति",
"answer": "B",
"explanation_en": "Public Borrowing is the process of government borrowing money from the public to finance its expenditure.",
"explanation_hi": "सार्वजनिक उधार सरकार के व्यय को वित्तपोषित करने के लिए सार्वजनिक से पैसा उधार लेने की प्रक्रिया है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the term for the restriction on the import of goods and services into a country?",
"question_hi": "एक देश में वस्तुओं और सेवाओं के आयात पर प्रतिबंध को क्या कहते हैं?",
"A_en": "Trade Tariff", "A_hi": "व्यापार शुल्क",
"B_en": "Import Quota", "B_hi": "आयात अनुमति",
"C_en": "Export Subsidy", "C_hi": "निर्यात सब्सिडी",
"D_en": "Import Restriction", "D_hi": "आयात प्रतिबंध",
"answer": "D",
"explanation_en": "Import Restriction is the restriction on the import of goods and services into a country.",
"explanation_hi": "आयात प्रतिबंध एक देश में वस्तुओं और सेवाओं के आयात पर प्रतिबंध है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the term for the process of reducing the money supply in an economy to control inflation?",
"question_hi": "एक अर्थव्यवस्था में मुद्रास्फीति को नियंत्रित करने के लिए नकदी की आपूर्ति को कम करने की प्रक्रिया को क्या कहते हैं?",
"A_en": "Monetary Expansion", "A_hi": "मौद्रिक विस्तार",
"B_en": "Monetary Contraction", "B_hi": "मौद्रिक संकुचन",
"C_en": "Fiscal Policy", "C_hi": "वित्तीय नीति",
"D_en": "Supply Side Policy", "D_hi": "सupply side नीति",
"answer": "B",
"explanation_en": "Monetary Contraction is the process of reducing the money supply in an economy to control inflation.",
"explanation_hi": "मौद्रिक संकुचन एक अर्थव्यवस्था में मुद्रास्फीति को नियंत्रित करने के लिए नकदी की आपूर्ति को कम करने की प्रक्रिया है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the term for the use of government spending and taxation to influence the overall level of economic activity?",
"question_hi": "सरकार के व्यय और करों का उपयोग करके अर्थव्यवस्था के कुल स्तर को प्रभावित करने के लिए क्या कहा जाता है?",
"A_en": "Monetary Policy", "A_hi": "मौद्रिक नीति",
"B_en": "Fiscal Policy", "B_hi": "वित्तीय नीति",
"C_en": "Supply Side Policy", "C_hi": "सupply side नीति",
"D_en": "Stabilization Policy", "D_hi": "स्थिरता नीति",
"answer": "B",
"explanation_en": "Fiscal Policy is the use of government spending and taxation to influence the overall level of economic activity.",
"explanation_hi": "वित्तीय नीति सरकार के व्यय और करों का उपयोग करके अर्थव्यवस्था के कुल स्तर को प्रभावित करने के लिए किया जाता है।"
},
{
"subject": "Economy",
"topic": "Development Economics",
"question_en": "What is the term for the process of improving the economic well-being of a country or region?",
"question_hi": "एक देश या क्षेत्र के आर्थिक सामर्थ्य को सुधारने की प्रक्रिया को क्या कहते हैं?",
"A_en": "Poverty Reduction", "A_hi": "गरीबी कम करना",
"B_en": "Economic Development", "B_hi": "आर्थिक विकास",
"C_en": "Human Development", "C_hi": "मानव विकास",
"D_en": "Sustainable Development", "D_hi": "दीर्घकालिक विकास",
"answer": "B",
"explanation_en": "Economic Development is the process of improving the economic well-being of a country or region.",
"explanation_hi": "आर्थिक विकास एक देश या क्षेत्र के आर्थिक सामर्थ्य को सुधारने की प्रक्रिया है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the term for the agreement between two or more countries to reduce or eliminate tariffs and other trade barriers?",
"question_hi": "दो या अधिक देशों के बीच शुल्क और अन्य व्यापार बाधाओं को कम करने या समाप्त करने के लिए समझौते को क्या कहते हैं?",
"A_en": "Trade Agreement", "A_hi": "व्यापार समझौता",
"B_en": "Free Trade Area", "B_hi": "मुक्त व्यापार क्षेत्र",
"C_en": "Common Market", "C_hi": "सामान्य बाजार",
"D_en": "Customs Union", "D_hi": "कस्टम यूनियन",
"answer": "B",
"explanation_en": "Free Trade Area is the agreement between two or more countries to reduce or eliminate tariffs and other trade barriers.",
"explanation_hi": "मुक्त व्यापार क्षेत्र दो या अधिक देशों के बीच शुल्क और अन्य व्यापार बाधाओं को कम करने या समाप्त करने के लिए समझौता है।"
},
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the term for the rate at which the average level of prices for goods and services is rising?",
"question_hi": "उत्पादों और सेवाओं के औसत स्तर की कीमतें बढ़ रही हैं, उनकी दर को क्या कहते हैं?",
"A_en": "Inflation Rate", "A_hi": "मुद्रास्फीति दर",
"B_en": "Unemployment Rate", "B_hi": "बेरोजगारी दर",
"C_en": "GDP Growth Rate", "C_hi": "जीडीपी वृद्धि दर",
"D_en": "Interest Rate", "D_hi": "ब्याज दर",
"answer": "A",
"explanation_en": "Inflation Rate is the rate at which the average level of prices for goods and services is rising.",
"explanation_hi": "मुद्रास्फीति दर उत्पादों और सेवाओं के औसत स्तर की कीमतें बढ़ रही हैं, उनकी दर है।"
}