[
{
"subject": "Economy",
"topic": "GDP and Inflation",
"question_en": "What is the term used to measure the value of goods and services produced within a country's borders?",
"question_hi": "एक देश के भीतर उत्पादित वस्तुओं और सेवाओं के मूल्य को मापने के लिए उपयोग किया जाने वाला क्या शब्द है?",
"A_en": "GDP", "A_hi": "जीडीपी",
"B_en": "CPI", "B_hi": "सीपीआई",
"C_en": "GNI", "C_hi": "जीएनआई",
"D_en": "GNP", "D_hi": "जीएनपी",
"answer": "A",
"explanation_en": "GDP is the total value of goods and services produced within a country's borders.",
"explanation_hi": "जीडीपी एक देश के भीतर उत्पादित वस्तुओं और सेवाओं के कुल मूल्य को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the term used to describe the government's use of taxation and public expenditure to influence the level of economic activity?",
"question_hi": "सरकार के द्वारा कर और सार्वजनिक व्यय का उपयोग करके आर्थिक गतिविधि के स्तर को प्रभावित करने के लिए क्या शब्द का उपयोग किया जाता है?",
"A_en": "Fiscal Policy", "A_hi": "वित्तीय नीति",
"B_en": "Monetary Policy", "B_hi": "貨नीय नीति",
"C_en": "Supply-Side Economics", "C_hi": "आपूर्ति पक्ष की अर्थशास्त्र",
"D_en": "Demand-Side Economics", "D_hi": "मांग पक्ष की अर्थशास्त्र",
"answer": "A",
"explanation_en": "Fiscal policy is the use of government spending and taxation to influence economic activity.",
"explanation_hi": "वित्तीय नीति सरकार के खर्च और कर का उपयोग करके आर्थिक गतिविधि को प्रभावित करने के लिए किया जाता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the term used to describe the exchange of goods and services between countries?",
"question_hi": "दो देशों के बीच वस्तुओं और सेवाओं के आदान-प्रदान को क्या शब्द से जाना जाता है?",
"A_en": "International Trade", "A_hi": "अंतर्राष्ट्रीय व्यापार",
"B_en": "Globalization", "B_hi": "वैश्वीकरण",
"C_en": "Commodification", "C_hi": "उद्धरण",
"D_en": "Protectionism", "D_hi": "संरक्षणवाद",
"answer": "A",
"explanation_en": "International trade is the exchange of goods and services between countries.",
"explanation_hi": "अंतर्राष्ट्रीय व्यापार दो देशों के बीच वस्तुओं और सेवाओं के आदान-प्रदान को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Unemployment",
"question_en": "What is the term used to describe the situation in which a person is able to work but is not employed?",
"question_hi": "व्यक्ति काम करने के योग्य होता है लेकिन रोजगार नहीं पाता है, इस स्थिति को क्या शब्द से जाना जाता है?",
"A_en": "Unemployment", "A_hi": "बेरोजगारी",
"B_en": "Underemployment", "B_hi": "अंडर-इम्प्लॉयमेंट",
"C_en": "Overemployment", "C_hi": "ओवर-इम्प्लॉयमेंट",
"D_en": "Voluntary Unemployment", "D_hi": "स्वैच्छिक बेरोजगारी",
"answer": "A",
"explanation_en": "Unemployment is the situation in which a person is able to work but is not employed.",
"explanation_hi": "बेरोजगारी व्यक्ति काम करने के योग्य होता है लेकिन रोजगार नहीं पाता है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the term used to describe the rate at which the general level of prices for goods and services is rising?",
"question_hi": "वस्तुओं और सेवाओं के लिए सामान्य स्तर पर मूल्यों की दर में वृद्धि की दर को क्या शब्द से जाना जाता है?",
"A_en": "Inflation", "A_hi": ".inflate",
"B_en": "Deflation", "B_hi": "deflate",
"C_en": "Stagflation", "C_hi": "स्टैगफ्लेशन",
"D_en": "Hyperinflation", "D_hi": "hyperinflation",
"answer": "A",
"explanation_en": "Inflation is the rate at which the general level of prices for goods and services is rising.",
"explanation_hi": "inflate वस्तुओं और सेवाओं के लिए सामान्य स्तर पर मूल्यों की दर में वृद्धि की दर को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the term used to describe the actions of a central bank to control the money supply and interest rates?",
"question_hi": "केंद्रीय बैंक के द्वारा पैसे की आपूर्ति और ब्याज दरों को नियंत्रित करने के लिए क्या शब्द का उपयोग किया जाता है?",
"A_en": "Monetary Policy", "A_hi": "貨नीय नीति",
"B_en": "Fiscal Policy", "B_hi": "वित्तीय नीति",
"C_en": "Supply-Side Economics", "C_hi": "आपूर्ति पक्ष की अर्थशास्त्र",
"D_en": "Demand-Side Economics", "D_hi": "मांग पक्ष की अर्थशास्त्र",
"answer": "A",
"explanation_en": "Monetary policy is the actions of a central bank to control the money supply and interest rates.",
"explanation_hi": "貨नीय नीति केंद्रीय बैंक के द्वारा पैसे की आपूर्ति और ब्याज दरों को नियंत्रित करने के लिए किया जाता है।"
},
{
"subject": "Economy",
"topic": "Gross Domestic Product (GDP)",
"question_en": "What is the term used to measure the total value of all final goods and services produced within a country's borders?",
"question_hi": "एक देश के भीतर सभी अंतिम वस्तुओं और सेवाओं के कुल मूल्य को मापने के लिए क्या शब्द का उपयोग किया जाता है?",
"A_en": "GDP", "A_hi": "जीडीपी",
"B_en": "GNP", "B_hi": "जीएनपी",
"C_en": "GNI", "C_hi": "जीएनआई",
"D_en": "NMP", "D_hi": "एनएमपी",
"answer": "A",
"explanation_en": "GDP is the total value of all final goods and services produced within a country's borders.",
"explanation_hi": "जीडीपी एक देश के भीतर सभी अंतिम वस्तुओं और सेवाओं के कुल मूल्य को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Fiscal Deficit",
"question_en": "What is the term used to describe the difference between a government's total expenditure and its total revenue?",
"question_hi": "सरकार के कुल व्यय और कुल आय के बीच अंतर को क्या शब्द से जाना जाता है?",
"A_en": "Fiscal Deficit", "A_hi": "वित्तीय घाटा",
"B_en": "Revenue Deficit", "B_hi": "आय घाटा",
"C_en": "Capital Deficit", "C_hi": "राजकोषीय घाटा",
"D_en": "Current Account Deficit", "D_hi": "वर्तमान लेखा घाटा",
"answer": "A",
"explanation_en": "Fiscal deficit is the difference between a government's total expenditure and its total revenue.",
"explanation_hi": "वित्तीय घाटा सरकार के कुल व्यय और कुल आय के बीच अंतर को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Supply and Demand",
"question_en": "What is the term used to describe the relationship between the quantity of a good or service that producers are willing to sell and the quantity that consumers are willing to buy?",
"question_hi": "उत्पादकों के द्वारा बेचने के लिए तैयार वस्तु या सेवा की मात्रा और उपभोक्ताओं के द्वारा खरीदने के लिए तैयार मात्रा के बीच संबंध को क्या शब्द से जाना जाता है?",
"A_en": "Supply and Demand", "A_hi": "आपूर्ति और मांग",
"B_en": "Law of Diminishing Returns", "B_hi": "कम आ रही वापसी का नियम",
"C_en": "Law of Increasing Opportunity Cost", "C_hi": "वृद्धि होती है के अवसर की लागत का नियम",
"D_en": "Law of Comparative Advantage", "D_hi": "समानता का लाभ का नियम",
"answer": "A",
"explanation_en": "Supply and demand is the relationship between the quantity of a good or service that producers are willing to sell and the quantity that consumers are willing to buy.",
"explanation_hi": "आपूर्ति और मांग उत्पादकों के द्वारा बेचने के लिए तैयार वस्तु या सेवा की मात्रा और उपभोक्ताओं के द्वारा खरीदने के लिए तैयार मात्रा के बीच संबंध को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Monopolistic Competition",
"question_en": "What is the term used to describe a market structure in which a single firm has a significant market share but there are many other firms competing with it?",
"question_hi": "एक बाजार संरचना को क्या शब्द से जाना जाता है जिसमें एक ही कंपनी का काफी बड़ा बाजार हिस्सा होता है लेकिन कई अन्य कंपनियां उसे प्रतिस्पर्धा करती हैं?",
"A_en": "Monopolistic Competition", "A_hi": "प्रतिस्पर्धात्मक एकाधिकार",
"B_en": "Perfect Competition", "B_hi": "पूर्ण प्रतिस्पर्धा",
"C_en": "Monopoly", "C_hi": "एकाधिकार",
"D_en": "Oligopoly", "D_hi": "ओलिगोपोली",
"answer": "A",
"explanation_en": "Monopolistic competition is a market structure in which a single firm has a significant market share but there are many other firms competing with it.",
"explanation_hi": "प्रतिस्पर्धात्मक एकाधिकार एक बाजार संरचना है जिसमें एक ही कंपनी का काफी बड़ा बाजार हिस्सा होता है लेकिन कई अन्य कंपनियां उसे प्रतिस्पर्धा करती हैं।"
}