[
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the term used to describe the overall level of prices for goods and services in an economy?",
"question_hi": "एक अर्थव्यवस्था में वस्तुओं और सेवाओं के लिए कुल स्तर की कीमतों को वर्णित करने वाला शब्द क्या है?",
"A_en": "Inflation", "A_hi": "अचलीकरण",
"B_en": "Deflation", "B_hi": "अपचलीकरण",
"C_en": "Stagflation", "C_hi": "स्टैगफ्लेशन",
"D_en": "Depression", "D_hi": "गिरावट",
"answer": "C",
"explanation_en": "Stagflation is a combination of inflation and stagnant economic growth.",
"explanation_hi": "स्टैगफ्लेशन एक उच्च मुद्रास्फीति और आर्थिक विकास के साथ असंतुलन का मिश्रण है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the concept of diminishing marginal utility?",
"question_hi": "सीमित मार्जिनल उपयोगिता का सिद्धांत क्या है?",
"A_en": "When the demand for a good increases, its price also increases.", "A_hi": "जब किसी उत्पाद की मांग बढ़ती है, तो उसकी कीमत भी बढ़ जाती है।",
"B_en": "As more units of a good are consumed, the additional utility gained decreases.", "B_hi": "जब किसी उत्पाद के अधिक इकाइयाँ उपभोग की जाती हैं, तो प्राप्त होने वाली अतिरिक्त उपयोगिता घटती है।",
"C_en": "The law of supply and demand determines the price of a good.", "C_hi": "सप्लाई और डिमांड के कानून द्वारा किसी उत्पाद की कीमत निर्धारित की जाती है।",
"D_en": "The consumer's willingness to pay is determined by the market price.", "D_hi": "उपभोक्ता की भुगतान करने की इच्छा बाजार की कीमत द्वारा निर्धारित की जाती है।",
"answer": "B",
"explanation_en": "Diminishing marginal utility is a concept in microeconomics that describes the decrease in the additional utility gained from consuming more units of a good.",
"explanation_hi": "सीमित मार्जिनल उपयोगिता माइक्रोइकॉनॉमिक्स का एक सिद्धांत है जो अधिक इकाइयों के उपभोग से प्राप्त होने वाली अतिरिक्त उपयोगिता के घटते होने का वर्णन करता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the term used to describe the exchange of goods and services between countries?",
"question_hi": "देशों के बीच वस्तुओं और सेवाओं के आदान-प्रदान को वर्णित करने वाला शब्द क्या है?",
"A_en": "Trade", "A_hi": "व्यापार",
"B_en": "Investment", "B_hi": "निवेश",
"C_en": "Tourism", "C_hi": "प्रवास",
"D_en": "International Trade", "D_hi": "अंतरराष्ट्रीय व्यापार",
"answer": "A",
"explanation_en": "Trade is the exchange of goods and services between countries, which can be facilitated by trade agreements, tariffs, and other market mechanisms.",
"explanation_hi": "व्यापार देशों के बीच वस्तुओं और सेवाओं का आदान-प्रदान है, जो व्यापार समझौतों, टैरिफ, और अन्य बाजार प्रणालियों द्वारा प्रोत्साहित किया जा सकता है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the primary objective of monetary policy?",
"question_hi": "आर्थिक नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To control inflation", "A_hi": "चलन से नियंत्रण करना",
"B_en": "To increase economic growth", "B_hi": "आर्थिक विकास बढ़ाना",
"C_en": "To maintain price stability", "C_hi": "भाव स्थिरता बनाए रखना",
"D_en": "To reduce unemployment", "D_hi": "बेरोजगारी कम करना",
"answer": "C",
"explanation_en": "The primary objective of monetary policy is to maintain price stability, which means keeping inflation under control and ensuring that the overall price level in the economy is stable.",
"explanation_hi": "आर्थिक नीति का मुख्य उद्देश्य भाव स्थिरता बनाए रखना है, जिसका अर्थ है कि चलन को नियंत्रित करना और यह सुनिश्चित करना कि अर्थव्यवस्था का कुल भाव स्थिर है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the term used to describe the use of government spending and taxation to influence the economy?",
"question_hi": "सरकारी खर्च और करों का उपयोग करके अर्थव्यवस्था पर प्रभाव डालने को वर्णित करने वाला शब्द क्या है?",
"A_en": "Fiscal Policy", "A_hi": "वित्तीय नीति",
"B_en": "Monetary Policy", "B_hi": "आर्थिक नीति",
"C_en": "Supply Side Economics", "C_hi": "सप्लाई पक्ष अर्थशास्त्र",
"D_en": "Demand Side Economics", "D_hi": "डिमांड पक्ष अर्थशास्त्र",
"answer": "A",
"explanation_en": "Fiscal policy is the use of government spending and taxation to influence the economy, which can be used to stimulate economic growth, reduce unemployment, or control inflation.",
"explanation_hi": "वित्तीय नीति सरकारी खर्च और करों का उपयोग करके अर्थव्यवस्था पर प्रभाव डालने के लिए है, जो आर्थिक विकास को बढ़ावा देने, बेरोजगारी को कम करने, या चलन को नियंत्रित करने के लिए उपयोग की जा सकती है।"
},
{
"subject": "Economy",
"topic": "Globalization",
"question_en": "What is the term used to describe the increasing interconnectedness of the world's economies?",
"question_hi": "विश्व की अर्थव्यवस्थाओं के बीच बढ़ती संबंधितता को वर्णित करने वाला शब्द क्या है?",
"A_en": "Globalization", "A_hi": "वैश्वीकरण",
"B_en": "Trade Liberalization", "B_hi": "व्यापार संधि",
"C_en": "Economic Integration", "C_hi": "आर्थिक एकीकरण",
"D_en": "International Cooperation", "D_hi": "अंतरराष्ट्रीय सहयोग",
"answer": "A",
"explanation_en": "Globalization refers to the increasing interconnectedness of the world's economies, which has led to increased trade, investment, and cultural exchange between countries.",
"explanation_hi": "वैश्वीकरण विश्व की अर्थव्यवस्थाओं के बीच बढ़ती संबंधितता को संदर्भित करता है, जिसके परिणामस्वरूप देशों के बीच व्यापार, निवेश, और सांस्कृतिक आदान-प्रदान में वृद्धि हुई है।"
},
{
"subject": "Economy",
"topic": "Development Economics",
"question_en": "What is the term used to describe the study of how economic development can be achieved in low-income countries?",
"question_hi": "निम्न आय वाले देशों में आर्थिक विकास को प्राप्त करने के तरीके का अध्ययन करने वाले शब्द क्या है?",
"A_en": "Development Economics", "A_hi": "विकास अर्थशास्त्र",
"B_en": "International Trade", "B_hi": "अंतरराष्ट्रीय व्यापार",
"C_en": "Economic Growth", "C_hi": "आर्थिक विकास",
"D_en": "Poverty Reduction", "D_hi": "गरीबी कम करना",
"answer": "A",
"explanation_en": "Development economics is the study of how economic development can be achieved in low-income countries, which involves understanding the factors that contribute to economic growth and development.",
"explanation_hi": "विकास अर्थशास्त्र निम्न आय वाले देशों में आर्थिक विकास को प्राप्त करने के तरीके का अध्ययन करता है, जिसमें आर्थिक विकास और विकास को प्रभावित करने वाले कारकों को समझना शामिल है।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "What is the term used to describe the government's revenue and expenditure?",
"question_hi": "सरकार के आय और व्यय को वर्णित करने वाला शब्द क्या है?",
"A_en": "Public Finance", "A_hi": "सार्वजनिक वित्त",
"B_en": "Government Budget", "B_hi": "सरकारी बजट",
"C_en": "Fiscal Policy", "C_hi": "वित्तीय नीति",
"D_en": "Monetary Policy", "D_hi": "आर्थिक नीति",
"answer": "B",
"explanation_en": "Government budget refers to the government's revenue and expenditure, which is used to fund public programs and services.",
"explanation_hi": "सरकारी बजट सरकार के आय और व्यय को संदर्भित करता है, जिसका उपयोग सार्वजनिक कार्यक्रमों और सेवाओं को वित्तपोषित करने के लिए किया जाता है।"
},
{
"subject": "Economy",
"topic": "Business Cycles",
"question_en": "What is the term used to describe the fluctuations in economic activity over time?",
"question_hi": "समय के साथ आर्थिक गतिविधि के उतार-चढ़ाव को वर्णित करने वाला शब्द क्या है?",
"A_en": "Business Cycles", "A_hi": "व्यवसाय चक्र",
"B_en": "Economic Growth", "B_hi": "आर्थिक विकास",
"C_en": "Inflation", "C_hi": "अचलीकरण",
"D_en": "Unemployment", "D_hi": "बेरोजगारी",
"answer": "A",
"explanation_en": "Business cycles refer to the fluctuations in economic activity over time, which can include periods of expansion and contraction.",
"explanation_hi": "व्यवसाय चक्र समय के साथ आर्थिक गतिविधि के उतार-चढ़ाव को संदर्भित करता है, जिसमें विस्तार और संकुचन के दौर शामिल हैं।"
},
{
"subject": "Economy",
"topic": "International Finance",
"question_en": "What is the term used to describe the flow of money and financial assets across international borders?",
"question_hi": "अंतरराष्ट्रीय सीमाओं के पार पैसे और वित्तीय संपत्तियों के प्रवाह को वर्णित करने वाला शब्द क्या है?",
"A_en": "International Finance", "A_hi": "अंतरराष्ट्रीय वित्त",
"B_en": "Foreign Exchange", "B_hi": "विदेशी मुद्रा",
"C_en": "Globalization", "C_hi": "वैश्वीकरण",
"D_en": "Trade Liberalization", "D_hi": "व्यापार संधि",
"answer": "A",
"explanation_en": "International finance refers to the flow of money and financial assets across international borders, which can include foreign exchange transactions, international investments, and other financial flows.",
"explanation_hi": "अंतरराष्ट्रीय वित्त अंतरराष्ट्रीय सीमाओं के पार पैसे और वित्तीय संपत्तियों के प्रवाह को संदर्भित करता है, जिसमें विदेशी मुद्रा लेनदेन, अंतरराष्ट्रीय निवेश, और अन्य वित्तीय प्रवाह शामिल हैं।"
}