[
{
"subject": "Economy",
"topic": "GDP and Inflation",
"question_en": "Which of the following is a characteristic of Hyperinflation?",
"question_hi": "हाइपरइन्फ्लेशन का क्या विशेषता होगी?",
"A_en": "Rapid increase in GDP", "A_hi": "जीडीपी में तेजी से वृद्धि",
"B_en": "Rapid increase in prices of goods and services", "B_hi": "वस्तुओं और सेवाओं की कीमतों में तेजी से वृद्धि",
"C_en": "Rapid decrease in inflation rate", "C_hi": "इन्फ्लेशन रेट में तेजी से कमी",
"D_en": "Rapid increase in money supply", "D_hi": "धन की तेजी से वृद्धि",
"answer": "B",
"explanation_en": "Hyperinflation is characterized by a rapid increase in the prices of goods and services, often exceeding 50% in a single month.",
"explanation_hi": "हाइपरइन्फ्लेशन को वस्तुओं और सेवाओं की कीमतों में तेजी से वृद्धि के रूप में परिभाषित किया जाता है, जो अक्सर एक महीने में 50% से अधिक होती है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the primary objective of Fiscal Policy?",
"question_hi": "वित्तीय नीति का प्राथमिक उद्देश्य क्या होगा?",
"A_en": "To control inflation", "A_hi": "इन्फ्लेशन नियंत्रण करना",
"B_en": "To reduce unemployment", "B_hi": "बेरोजगारी को कम करना",
"C_en": "To promote economic growth", "C_hi": "आर्थिक विकास को बढ़ावा देना",
"D_en": "To balance the budget", "D_hi": "बजट को संतुलित करना",
"answer": "C",
"explanation_en": "The primary objective of Fiscal Policy is to promote economic growth by increasing government expenditure and taxation.",
"explanation_hi": "वित्तीय नीति का प्राथमिक उद्देश्य आर्थिक विकास को बढ़ावा देना है, जिसमें सरकारी व्यय और कर बढ़ाकर किया जाता है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the primary tool of Monetary Policy?",
"question_hi": "वित्तीय नीति का प्राथमिक औजार क्या होगा?",
"A_en": "Open Market Operations", "A_hi": "ओपन मार्केट ऑपरेशन",
"B_en": "Reserve Requirements", "B_hi": "रिजर्व आवश्यकताएं",
"C_en": "Cash Reserve Ratio", "C_hi": "कैश रिजर्व अनुपात",
"D_en": "Discount Rate", "D_hi": "डिस्काउंट दर",
"answer": "A",
"explanation_en": "Open Market Operations (OMO) is the primary tool of Monetary Policy, used to increase or decrease the money supply in the economy.",
"explanation_hi": "ओपन मार्केट ऑपरेशन (OMO) वित्तीय नीति का प्राथमिक औजार है, जिसका उपयोग अर्थव्यवस्था में धन की आपूर्ति बढ़ाने या कम करने के लिए किया जाता है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the difference between Demand-Pull Inflation and Cost-Push Inflation?",
"question_hi": "डिमांड-पल इन्फ्लेशन और कॉस्ट-पुश इन्फ्लेशन के बीच क्या अंतर होगा?",
"A_en": "Demand-Pull Inflation is caused by excess demand, while Cost-Push Inflation is caused by excess supply", "A_hi": "डिमांड-पल इन्फ्लेशन एक्सेस डिमांड के कारण होता है, जबकि कॉस्ट-पुश इन्फ्लेशन एक्सेस सप्लाई के कारण होता है",
"B_en": "Demand-Pull Inflation is caused by excess supply, while Cost-Push Inflation is caused by excess demand", "B_hi": "डिमांड-पल इन्फ्लेशन एक्सेस सप्लाई के कारण होता है, जबकि कॉस्ट-पुश इन्फ्लेशन एक्सेस डिमांड के कारण होता है",
"C_en": "Demand-Pull Inflation is caused by a decrease in aggregate demand, while Cost-Push Inflation is caused by a decrease in aggregate supply", "C_hi": "डिमांड-पल इन्फ्लेशन एक्सेस डिमांड के कारण होता है, जबकि कॉस्ट-पुश इन्फ्लेशन एक्सेस सप्लाई के कारण होता है",
"D_en": "Demand-Pull Inflation is caused by a decrease in aggregate supply, while Cost-Push Inflation is caused by a decrease in aggregate demand", "D_hi": "डिमांड-पल इन्फ्लेशन एक्सेस सप्लाई के कारण होता है, जबकि कॉस्ट-पुश इन्फ्लेशन एक्सेस डिमांड के कारण होता है",
"answer": "A",
"explanation_en": "Demand-Pull Inflation is caused by excess demand, while Cost-Push Inflation is caused by excess supply.",
"explanation_hi": "डिमांड-पल इन्फ्लेशन एक्सेस डिमांड के कारण होता है, जबकि कॉस्ट-पुश इन्फ्लेशन एक्सेस सप्लाई के कारण होता है।"
},
{
"subject": "Economy",
"topic": "Economic Indicators",
"question_en": "What is the purpose of a Leading Indicator?",
"question_hi": "लीडिंग इंडिकेटर का उद्देश्य क्या होगा?",
"A_en": "To measure the current economic situation", "A_hi": "वर्तमान आर्थिक स्थिति को मापना",
"B_en": "To predict future economic trends", "B_hi": "भविष्य के आर्थिक प्रवृत्तियों का अनुमान लगाना",
"C_en": "To measure the past economic performance", "C_hi": "भूतकाल में आर्थिक प्रदर्शन को मापना",
"D_en": "To measure the inflation rate", "D_hi": "इन्फ्लेशन दर को मापना",
"answer": "B",
"explanation_en": "A Leading Indicator is used to predict future economic trends, such as a recession or economic growth.",
"explanation_hi": "लीडिंग इंडिकेटर का उपयोग भविष्य के आर्थिक प्रवृत्तियों का अनुमान लगाने के लिए किया जाता है, जैसे कि आर्थिक संकट या आर्थिक विकास।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the effect of a decrease in the Reserve Requirements on the money supply?",
"question_hi": "रिजर्व आवश्यकताओं में कमी का पैसे की आपूर्ति पर क्या प्रभाव पड़ेगा?",
"A_en": "Decrease in money supply", "A_hi": "पैसे की आपूर्ति में कमी",
"B_en": "Increase in money supply", "B_hi": "पैसे की आपूर्ति में वृद्धि",
"C_en": "No effect on money supply", "C_hi": "पैसे की आपूर्ति पर कोई प्रभाव नहीं",
"D_en": "Increase in interest rates", "D_hi": "ब्याज दरों में वृद्धि",
"answer": "B",
"explanation_en": "A decrease in the Reserve Requirements will increase the money supply, as banks will have more money to lend.",
"explanation_hi": "रिजर्व आवश्यकताओं में कमी से पैसे की आपूर्ति में वृद्धि होगी, क्योंकि बैंकों को और अधिक पैसा उधार देने की अनुमति मिलेगी।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the effect of an increase in government expenditure on the GDP?",
"question_hi": "सरकारी व्यय में वृद्धि का जीडीपी पर क्या प्रभाव पड़ेगा?",
"A_en": "Decrease in GDP", "A_hi": "जीडीपी में कमी",
"B_en": "Increase in GDP", "B_hi": "जीडीपी में वृद्धि",
"C_en": "No effect on GDP", "C_hi": "जीडीपी पर कोई प्रभाव नहीं",
"D_en": "Decrease in inflation rate", "D_hi": "इन्फ्लेशन दर में कमी",
"answer": "B",
"explanation_en": "An increase in government expenditure will increase the GDP, as it will lead to an increase in aggregate demand.",
"explanation_hi": "सरकारी व्यय में वृद्धि से जीडीपी में वृद्धि होगी, क्योंकि यह एक्सेस डिमांड को बढ़ाएगा।"
},
{
"subject": "Economy",
"topic": "Economic Systems",
"question_en": "What is the main difference between a Command Economy and a Market Economy?",
"question_hi": "कमांड अर्थव्यवस्था और बाजार अर्थव्यवस्था के बीच क्या मुख्य अंतर होगा?",
"A_en": "Command Economy is controlled by the government, while Market Economy is controlled by the market forces", "A_hi": "कमांड अर्थव्यवस्था सरकार द्वारा नियंत्रित होती है, जबकि बाजार अर्थव्यवस्था बाजार बलों द्वारा नियंत्रित होती है",
"B_en": "Command Economy is controlled by market forces, while Market Economy is controlled by the government", "B_hi": "कमांड अर्थव्यवस्था बाजार बलों द्वारा नियंत्रित होती है, जबकि बाजार अर्थव्यवस्था सरकार द्वारा नियंत्रित होती है",
"C_en": "Command Economy is more efficient than Market Economy", "C_hi": "कमांड अर्थव्यवस्था बाजार अर्थव्यवस्था से अधिक कारगर होती है",
"D_en": "Market Economy is more efficient than Command Economy", "D_hi": "बाजार अर्थव्यवस्था कमांड अर्थव्यवस्था से अधिक कारगर होती है",
"answer": "A",
"explanation_en": "The main difference between a Command Economy and a Market Economy is that a Command Economy is controlled by the government, while a Market Economy is controlled by the market forces.",
"explanation_hi": "कमांड अर्थव्यवस्था और बाजार अर्थव्यवस्था के बीच मुख्य अंतर यह है कि कमांड अर्थव्यवस्था सरकार द्वारा नियंत्रित होती है, जबकि बाजार अर्थव्यवस्था बाजार बलों द्वारा नियंत्रित होती है।"
},
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the concept of Opportunity Cost?",
"question_hi": "क्या है अवसर लागत का सिद्धांत?",
"A_en": "The cost of a choice", "A_hi": "एक चुनाव की लागत",
"B_en": "The benefit of a choice", "B_hi": "एक चुनाव का लाभ",
"C_en": "The opportunity to make a choice", "C_hi": "एक चुनाव करने की संभावना",
"D_en": "The cost of not making a choice", "D_hi": "एक चुनाव न करने की लागत",
"answer": "D",
"explanation_en": "Opportunity Cost is the cost of not making a choice, which is the benefit that could have been gained from an alternative choice.",
"explanation_hi": "अवसर लागत एक चुनाव न करने की लागत है, जो एक वैकल्पिक चुनाव से प्राप्त होने वाले लाभ से आती है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the concept of Elasticity of Demand?",
"question_hi": "क्या है डिमांड की लचीलापन?",
"A_en": "The responsiveness of demand to changes in price", "A_hi": "मूल्य में परिवर्तन के जवाब में डिमांड की प्रतिक्रिया",
"B_en": "The responsiveness of supply to changes in price", "B_hi": "मूल्य में परिवर्तन के जवाब में सप्लाई की प्रतिक्रिया",
"C_en": "The responsiveness of demand to changes in income", "C_hi": "आय में परिवर्तन के जवाब में डिमांड की प्रतिक्रिया",
"D_en": "The responsiveness of supply to changes in income", "D_hi": "आय में परिवर्तन के जवाब में सप्लाई की प्रतिक्रिया",
"answer": "A",
"explanation_en": "Elasticity of Demand is the responsiveness of demand to changes in price.",
"explanation_hi": "डिमांड की लचीलापन मूल्य में परिवर्तन के जवाब में डिमांड की प्रतिक्रिया को दर्शाता है।"
}