[
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the main objective of fiscal policy?",
"question_hi": "वित्तीय नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To control inflation", "A_hi": "वृद्धि दर को नियंत्रित करना",
"B_en": "To stabilize the economy", "B_hi": "आर्थिक स्थिरता स्थापित करना",
"C_en": "To reduce unemployment", "C_hi": "बेरोजगारी को कम करना",
"D_en": "To manage government debt", "D_hi": "सरकारी कर्ज को प्रबंधित करना",
"answer": "B",
"explanation_en": "Fiscal policy is used to stabilize the economy by adjusting government spending and taxation.",
"explanation_hi": "वित्तीय नीति का उपयोग सरकारी व्यय और करों को समायोजित करके अर्थव्यवस्था की स्थिरता सुनिश्चित करने के लिए किया जाता है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the law of diminishing marginal utility?",
"question_hi": "विभाजनक केन्द्रीय उपयोगिता का नियम क्या है?",
"A_en": "As consumption increases, utility also increases", "A_hi": "उपभोग बढ़ता है, उपयोगिता भी बढ़ती है",
"B_en": "As consumption increases, utility first increases and then decreases", "B_hi": "उपभोग बढ़ता है, तो उपयोगिता पहले बढ़ती है और फिर घटती है",
"C_en": "As consumption increases, utility remains constant", "C_hi": "उपभोग बढ़ता है, तो उपयोगिता स्थिर रहती है",
"D_en": "As consumption increases, utility decreases", "D_hi": "उपभोग बढ़ता है, तो उपयोगिता घटती है",
"answer": "B",
"explanation_en": "The law of diminishing marginal utility states that as consumption increases, the additional utility gained from each additional unit of consumption decreases.",
"explanation_hi": "विभाजनक केन्द्रीय उपयोगिता का नियम कहता है कि उपभोग बढ़ता है तो प्रत्येक अतिरिक्त इकाई के उपभोग से प्राप्त उपयोगिता घटती जाती है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is comparative advantage?",
"question_hi": "सामान्य लाभ क्या है?",
"A_en": "The ability of a country to produce a good at a lower cost than other countries", "A_hi": "एक देश की उस वस्तु का उत्पादन करने की क्षमता जो अन्य देशों की तुलना में कम लागत पर किया जा सके",
"B_en": "The ability of a country to produce a good at a higher quality than other countries", "B_hi": "एक देश की उस वस्तु का उत्पादन करने की क्षमता जो अन्य देशों की तुलना में उच्च गुणवत्ता पर किया जा सके",
"C_en": "The ability of a country to import goods at a lower cost than producing them domestically", "C_hi": "एक देश की उस वस्तु का आयात करने की क्षमता जो घरेलू उत्पादन से कम लागत पर किया जा सके",
"D_en": "The ability of a country to export goods at a higher price than importing them", "D_hi": "एक देश की उस वस्तु का निर्यात करने की क्षमता जो आयात से अधिक कीमत पर किया जा सके",
"answer": "A",
"explanation_en": "Comparative advantage is the ability of a country to produce a good at a lower cost than other countries, even if they are more efficient in producing other goods.",
"explanation_hi": "सामान्य लाभ एक देश की उस वस्तु का उत्पादन करने की क्षमता है जो अन्य देशों की तुलना में कम लागत पर किया जा सके, चाहे वे दूसरी वस्तुओं के उत्पादन में अधिक कुशल हों।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the main tool of monetary policy?",
"question_hi": "वित्तीय नीति का मुख्य औजार क्या है?",
"A_en": "Interest rates", "A_hi": "ब्याज दरें",
"B_en": "Money supply", "B_hi": "मुद्रा आपूर्ति",
"C_en": "Fiscal policy", "C_hi": "वित्तीय नीति",
"D_en": "Exchange rates", "D_hi": "विनिमय दरें",
"answer": "A",
"explanation_en": "Interest rates are the main tool of monetary policy, used to control inflation and stabilize the economy.",
"explanation_hi": "ब्याज दरें वित्तीय नीति का मुख्य औजार है, जो वृद्धि दर को नियंत्रित करने और अर्थव्यवस्था की स्थिरता सुनिश्चित करने के लिए उपयोग की जाती है।"
},
{
"subject": "Economy",
"topic": "Growth and Development",
"question_en": "What is the concept of sustainable development?",
"question_hi": "सामर्थ्य संवृद्धि का सिद्धांत क्या है?",
"A_en": "Meeting the needs of the present without compromising the ability of future generations to meet their own needs", "A_hi": "वर्तमान की आवश्यकताओं को पूरा करने के बिना भविष्य की पीढ़ियों को अपनी आवश्यकताओं को पूरा करने की क्षमता को प्रभावित नहीं करना",
"B_en": "Increasing economic growth without considering environmental degradation", "B_hi": "आर्थिक वृद्धि को बढ़ावा देने के बिना पर्यावरणीय विनाश का ध्यान नहीं रखना",
"C_en": "Reducing poverty without considering income inequality", "C_hi": "ग़रीबी को कम करने के बिना आय असमानता का ध्यान नहीं रखना",
"D_en": "Increasing economic growth without considering social welfare", "D_hi": "आर्थिक वृद्धि को बढ़ावा देने के बिना सामाजिक कल्याण का ध्यान नहीं रखना",
"answer": "A",
"explanation_en": "Sustainable development is the concept of meeting the needs of the present without compromising the ability of future generations to meet their own needs.",
"explanation_hi": "सामर्थ्य संवृद्धि वर्तमान की आवश्यकताओं को पूरा करने के बिना भविष्य की पीढ़ियों को अपनी आवश्यकताओं को पूरा करने की क्षमता को प्रभावित नहीं करने का सिद्धांत है।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "What is the concept of fiscal incidence?",
"question_hi": "वित्तीय प्रभाव का सिद्धांत क्या है?",
"A_en": "The impact of taxation on the economy", "A_hi": "करों का अर्थव्यवस्था पर प्रभाव",
"B_en": "The allocation of public expenditure", "B_hi": "सार्वजनिक व्यय का वितरण",
"C_en": "The impact of government spending on the economy", "C_hi": "सरकारी व्यय का अर्थव्यवस्था पर प्रभाव",
"D_en": "The impact of taxation on the distribution of income", "D_hi": "करों का आय की वितरण पर प्रभाव",
"answer": "D",
"explanation_en": "Fiscal incidence is the impact of taxation on the distribution of income.",
"explanation_hi": "वित्तीय प्रभाव करों का आय की वितरण पर प्रभाव है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the concept of comparative disadvantage?",
"question_hi": "सामान्य हानि का सिद्धांत क्या है?",
"A_en": "The ability of a country to produce a good at a higher cost than other countries", "A_hi": "एक देश की उस वस्तु का उत्पादन करने की क्षमता जो अन्य देशों की तुलना में अधिक लागत पर किया जा सके",
"B_en": "The ability of a country to import goods at a higher cost than producing them domestically", "B_hi": "एक देश की उस वस्तु का आयात करने की क्षमता जो घरेलू उत्पादन से अधिक लागत पर किया जा सके",
"C_en": "The ability of a country to export goods at a lower price than importing them", "C_hi": "एक देश की उस वस्तु का निर्यात करने की क्षमता जो आयात से कम कीमत पर किया जा सके",
"D_en": "The ability of a country to import goods at a lower cost than other countries", "D_hi": "एक देश की उस वस्तु का आयात करने की क्षमता जो अन्य देशों की तुलना में कम लागत पर किया जा सके",
"answer": "A",
"explanation_en": "Comparative disadvantage is the ability of a country to produce a good at a higher cost than other countries.",
"explanation_hi": "सामान्य हानि एक देश की उस वस्तु का उत्पादन करने की क्षमता है जो अन्य देशों की तुलना में अधिक लागत पर किया जा सके।"
},
{
"subject": "Economy",
"topic": "Economic Growth",
"question_en": "What is the concept of economic growth?",
"question_hi": "आर्थिक वृद्धि का सिद्धांत क्या है?",
"A_en": "An increase in the production of goods and services", "A_hi": "उत्पादों और सेवाओं के उत्पादन में वृद्धि",
"B_en": "An increase in the standard of living", "B_hi": "जीवन स्तर में वृद्धि",
"C_en": "An increase in the productivity of factors of production", "C_hi": "उत्पादन कारकों की उत्पादकता में वृद्धि",
"D_en": "An increase in the supply of goods and services", "D_hi": "उत्पादों और सेवाओं की आपूर्ति में वृद्धि",
"answer": "C",
"explanation_en": "Economic growth is the increase in the productivity of factors of production.",
"explanation_hi": "आर्थिक वृद्धि उत्पादन कारकों की उत्पादकता में वृद्धि है।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "What is the concept of public expenditure?",
"question_hi": "सार्वजनिक व्यय का सिद्धांत क्या है?",
"A_en": "The government's revenue expenditure", "A_hi": "सरकार का आय का व्यय",
"B_en": "The government's capital expenditure", "B_hi": "सरकार का पूंजी व्यय",
"C_en": "The government's total expenditure", "C_hi": "सरकार का कुल व्यय",
"D_en": "The government's revenue and capital expenditure", "D_hi": "सरकार का आय और पूंजी व्यय",
"answer": "C",
"explanation_en": "Public expenditure is the government's total expenditure.",
"explanation_hi": "सार्वजनिक व्यय सरकार का कुल व्यय है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the concept of monetary policy?",
"question_hi": "वित्तीय नीति का सिद्धांत क्या है?",
"A_en": "The government's control over the money supply", "A_hi": "सरकार का मुद्रा आपूर्ति पर नियंत्रण",
"B_en": "The government's control over interest rates", "B_hi": "सरकार का ब्याज दरों पर नियंत्रण",
"C_en": "The government's control over inflation", "C_hi": "सरकार का वृद्धि दर पर नियंत्रण",
"D_en": "The government's control over the exchange rate", "D_hi": "सरकार का विनिमय दर पर नियंत्रण",
"answer": "B",
"explanation_en": "Monetary policy is the government's control over interest rates.",
"explanation_hi": "वित्तीय नीति सरकार का ब्याज दरों पर नियंत्रण है।"
}