[
{
"subject": "Economy",
"topic": "GDP and Inflation",
"question_en": "What is the primary purpose of Gross Domestic Product (GDP)?",
"question_hi": "जीएसडीपी (GDP) का मुख्य उद्देश्य क्या है? ",
"A_en": "It measures the total value of exports", "A_hi": "यह व्यापार के कुल मूल्य को मापता है",
"B_en": "It measures the total value of goods and services produced within a country", "B_hi": "यह देश के भीतर उत्पादित सामानों और सेवाओं का कुल मूल्य मापता है",
"C_en": "It measures the total value of imports", "C_hi": "यह आयात का कुल मूल्य मापता है",
"D_en": "It measures the total value of government spending", "D_hi": "यह सरकार के खर्च का कुल मूल्य मापता है",
"answer": "B",
"explanation_en": "The primary purpose of GDP is to measure the total value of goods and services produced within a country.",
"explanation_hi": "जीएसडीपी का मुख्य उद्देश्य देश के भीतर उत्पादित सामानों और सेवाओं का कुल मूल्य मापना है।"
},
{
"subject": "Economy",
"topic": "Inflation and Deflation",
"question_en": "What is the difference between inflation and deflation?",
"question_hi": "सक्रियता और नीचे के बीच अंतर क्या है? ",
"A_en": "Inflation is a decrease in the general price level, while deflation is an increase in the general price level", "A_hi": "सक्रियता में व्यापक कीमत का कम होना होता है, जबकि नीचे में व्यापक कीमत का वृद्धि होती है",
"B_en": "Inflation is an increase in the general price level, while deflation is a decrease in the general price level", "B_hi": "सक्रियता में व्यापक कीमत का वृद्धि होती है, जबकि नीचे में व्यापक कीमत का कम होना होता है",
"C_en": "Inflation is a decrease in the value of money, while deflation is an increase in the value of money", "C_hi": "सक्रियता में पैसे का मूल्य कम होता है, जबकि नीचे में पैसे का मूल्य बढ़ता है",
"D_en": "Inflation is a decrease in the general price level, while deflation is a decrease in the value of money", "D_hi": "सक्रियता में व्यापक कीमत का कम होना होता है, जबकि नीचे में पैसे का मूल्य कम होता है",
"answer": "B",
"explanation_en": "Inflation is an increase in the general price level, while deflation is a decrease in the general price level.",
"explanation_hi": "सक्रियता में व्यापक कीमत का वृद्धि होती है, जबकि नीचे में व्यापक कीमत का कम होना होता है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the primary goal of fiscal policy?",
"question_hi": "वित्तीय नीति का प्राथमिक लक्ष्य क्या है? ",
"A_en": "To control inflation", "A_hi": "सक्रियता को नियंत्रित करना",
"B_en": "To promote economic growth", "B_hi": "आर्थिक वृद्धि को बढ़ावा देना",
"C_en": "To reduce the budget deficit", "C_hi": "बजट घाटे को कम करना",
"D_en": "To increase government revenue", "D_hi": "सरकार की आय बढ़ाना",
"answer": "B",
"explanation_en": "The primary goal of fiscal policy is to promote economic growth.",
"explanation_hi": "वित्तीय नीति का प्राथमिक लक्ष्य आर्थिक वृद्धि को बढ़ावा देना है।"
},
{
"subject": "Economy",
"topic": "Monopolies and Oligopolies",
"question_en": "What is the difference between a monopoly and an oligopoly?",
"question_hi": "एकाधिकार और एकाधिकार के बीच अंतर क्या है? ",
"A_en": "A monopoly is a market structure where one firm dominates the market, while an oligopoly is a market structure where two or more firms dominate the market", "A_hi": "एकाधिकार में एक कंपनी बाजार का नियंत्रण करती है, जबकि एकाधिकार में दो या दो से अधिक कंपनियाँ बाजार का नियंत्रण करती हैं",
"B_en": "A monopoly is a market structure where two or more firms dominate the market, while an oligopoly is a market structure where one firm dominates the market", "B_hi": "एकाधिकार में दो या दो से अधिक कंपनियाँ बाजार का नियंत्रण करती हैं, जबकि एकाधिकार में एक कंपनी बाजार का नियंत्रण करती है",
"C_en": "A monopoly is a market structure where no firm dominates the market, while an oligopoly is a market structure where one firm dominates the market", "C_hi": "एकाधिकार में कोई कंपनी बाजार का नियंत्रण नहीं करती है, जबकि एकाधिकार में एक कंपनी बाजार का नियंत्रण करती है",
"D_en": "A monopoly is a market structure where one firm dominates the market, while an oligopoly is a market structure where no firm dominates the market", "D_hi": "एकाधिकार में एक कंपनी बाजार का नियंत्रण करती है, जबकि एकाधिकार में कोई कंपनी बाजार का नियंत्रण नहीं करती है",
"answer": "A",
"explanation_en": "A monopoly is a market structure where one firm dominates the market, while an oligopoly is a market structure where two or more firms dominate the market.",
"explanation_hi": "एकाधिकार में एक कंपनी बाजार का नियंत्रण करती है, जबकि एकाधिकार में दो या दो से अधिक कंपनियाँ बाजार का नियंत्रण करती हैं।"
},
{
"subject": "Economy",
"topic": "Supply and Demand",
"question_en": "What is the law of supply?",
"question_hi": "आपूर्ति का कानून क्या है? ",
"A_en": "The law of supply states that as the price of a good increases, the quantity supplied also increases", "A_hi": "आपूर्ति का कानून कहता है कि एक वस्तु की कीमत बढ़ने पर आपूर्ति भी बढ़ती है",
"B_en": "The law of supply states that as the price of a good increases, the quantity supplied decreases", "B_hi": "आपूर्ति का कानून कहता है कि एक वस्तु की कीमत बढ़ने पर आपूर्ति कम होती है",
"C_en": "The law of supply states that as the price of a good decreases, the quantity supplied also decreases", "C_hi": "आपूर्ति का कानून कहता है कि एक वस्तु की कीमत कम होने पर आपूर्ति भी कम होती है",
"D_en": "The law of supply states that as the price of a good increases, the quantity supplied remains constant", "D_hi": "आपूर्ति का कानून कहता है कि एक वस्तु की कीमत बढ़ने पर आपूर्ति स्थिर रहती है",
"answer": "A",
"explanation_en": "The law of supply states that as the price of a good increases, the quantity supplied also increases.",
"explanation_hi": "आपूर्ति का कानून कहता है कि एक वस्तु की कीमत बढ़ने पर आपूर्ति भी बढ़ती है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the advantage of comparative advantage in international trade?",
"question_hi": "अंतर्राष्ट्रीय व्यापार में तुलनात्मक लाभ का फायदा क्या है? ",
"A_en": "It allows countries to specialize in producing goods where they have a comparative advantage", "A_hi": "यह देशों को उन वस्तुओं के उत्पादन में विशेषज्ञता हासिल करने की अनुमति देता है जहां उन्हें तुलनात्मक लाभ होता है",
"B_en": "It allows countries to produce goods where they have a comparative disadvantage", "B_hi": "यह देशों को उन वस्तुओं के उत्पादन में विशेषज्ञता हासिल करने की अनुमति देता है जहां उन्हें तुलनात्मक विसंगति होती है",
"C_en": "It allows countries to trade goods where they have a comparative advantage", "C_hi": "यह देशों को उन वस्तुओं का व्यापार करने की अनुमति देता है जहां उन्हें तुलनात्मक लाभ होता है",
"D_en": "It allows countries to reduce their trade deficit", "D_hi": "यह देशों को अपने व्यापार घाटे को कम करने की अनुमति देता है",
"answer": "A",
"explanation_en": "The advantage of comparative advantage in international trade is that it allows countries to specialize in producing goods where they have a comparative advantage.",
"explanation_hi": "अंतर्राष्ट्रीय व्यापार में तुलनात्मक लाभ का फायदा यह है कि यह देशों को उन वस्तुओं के उत्पादन में विशेषज्ञता हासिल करने की अनुमति देता है जहां उन्हें तुलनात्मक लाभ होता है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the concept of opportunity cost?",
"question_hi": " अवसर लागत का सिद्धांत क्या है? ",
"A_en": "The opportunity cost is the cost of choosing one option over another", "A_hi": "अवसर लागत वैकल्पिक विकल्पों के बीच चुनने का खर्च है",
"B_en": "The opportunity cost is the cost of producing a good or service", "B_hi": "अवसर लागत एक वस्तु या सेवा का उत्पादन करने का खर्च है",
"C_en": "The opportunity cost is the benefit of choosing one option over another", "C_hi": "अवसर लागत वैकल्पिक विकल्पों के बीच चुनने का लाभ है",
"D_en": "The opportunity cost is the cost of not choosing an option", "D_hi": "अवसर लागत वैकल्पिक विकल्प को नहीं चुनने का खर्च है",
"answer": "A",
"explanation_en": "The concept of opportunity cost is the cost of choosing one option over another.",
"explanation_hi": "अवसर लागत का सिद्धांत वैकल्पिक विकल्पों के बीच चुनने का खर्च है।"
},
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the concept of aggregate demand?",
"question_hi": "अवुमित लागत का सिद्धांत क्या है? ",
"A_en": "The aggregate demand is the total amount of goods and services that households, businesses, and governments want to buy", "A_hi": "अवुमित लागत कुल राशि है जिसे घरेलू, व्यवसायिक और सरकारी इकाइयाँ खरीदना चाहती हैं",
"B_en": "The aggregate demand is the total amount of goods and services that are produced in an economy", "B_hi": "अवुमित लागत कुल राशि है जो किसी अर्थव्यवस्था में उत्पादित होती है",
"C_en": "The aggregate demand is the total amount of money that is circulating in an economy", "C_hi": "अवुमित लागत कुल राशि है जो किसी अर्थव्यवस्था में प्रचलित होती है",
"D_en": "The aggregate demand is the total amount of goods and services that are consumed in an economy", "D_hi": "अवुमित लागत कुल राशि है जो किसी अर्थव्यवस्था में उपभोग की जाती है",
"answer": "A",
"explanation_en": "The concept of aggregate demand is the total amount of goods and services that households, businesses, and governments want to buy.",
"explanation_hi": "अवुमित लागत का सिद्धांत कुल राशि है जिसे घरेलू, व्यवसायिक और सरकारी इकाइयाँ खरीदना चाहती हैं।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "What is the concept of fiscal decentralization?",
"question_hi": "वित्तीय विकेंद्रीकरण का सिद्धांत क्या है? ",
"A_en": "The fiscal decentralization is the process of transferring power and resources from the central government to local governments", "A_hi": "वित्तीय विकेंद्रीकरण केंद्र सरकार से स्थानीय सरकारों की शक्ति और संसाधनों को स्थानांतरित करने की प्रक्रिया है",
"B_en": "The fiscal decentralization is the process of transferring power and resources from local governments to the central government", "B_hi": "वित्तीय विकेंद्रीकरण स्थानीय सरकारों से केंद्र सरकार की शक्ति और संसाधनों को स्थानांतरित करने की प्रक्रिया है",
"C_en": "The fiscal decentralization is the process of reducing the role of the central government", "C_hi": "वित्तीय विकेंद्रीकरण केंद्र सरकार के भूमिका को कम करने की प्रक्रिया है",
"D_en": "The fiscal decentralization is the process of increasing the role of the central government", "D_hi": "वित्तीय विकेंद्रीकरण केंद्र सरकार के भूमिका को बढ़ाने की प्रक्रिया है",
"answer": "A",
"explanation_en": "The concept of fiscal decentralization is the process of transferring power and resources from the central government to local governments.",
"explanation_hi": "वित्तीय विकेंद्रीकरण का सिद्धांत केंद्र सरकार से स्थानीय सरकारों की शक्ति और संसाधनों को स्थानांतरित करने की प्रक्रिया है।"
}