[
{
"subject": "Economy",
"topic": "GDP and Economic Growth",
"question_en": "What is the primary factor that determines a country's GDP?",
"question_hi": "एक देश की जीडीपी का मुख्य कारक क्या है?",
"A_en": "Per capita income", "A_hi": "प्रति व्यक्ति आय",
"B_en": "Total population", "B_hi": "कुल जनसंख्या",
"C_en": "Labor force participation rate", "C_hi": "श्रम शक्ति भागीदारी दर",
"D_en": "Gross domestic savings", "D_hi": "महILA घरेलू बचत",
"answer": "C",
"explanation_en": "Labor force participation rate is a key determinant of a country's GDP, as it measures the percentage of the working-age population that is employed or actively seeking employment.",
"explanation_hi": "श्रम शक्ति भागीदारी दर एक देश की जीडीपी का एक प्रमुख निर्धारक है, क्योंकि यह काम करने के योग्य आबादी के प्रतिशत को मापता है जो रोजगार में है या सक्रिय रूप से रोजगार की तलाश में है।"
},
{
"subject": "Economy",
"topic": "Inflation and Deflation",
"question_en": "What is the difference between inflation and deflation?",
"question_hi": "फ्लेटेंशन और डेफ्लेशन में क्या अंतर है?",
"A_en": "Inflation is a decrease in prices, while deflation is an increase in prices", "A_hi": "फ्लेटेंशन में दाम कम होते हैं, जबकि डेफ्लेशन में दाम बढ़ते हैं",
"B_en": "Inflation is an increase in prices, while deflation is a decrease in prices", "B_hi": "फ्लेटेंशन में दाम बढ़ते हैं, जबकि डेफ्लेशन में दाम कम होते हैं",
"C_en": "Inflation and deflation are the same thing", "C_hi": "फ्लेटेंशन और डेफ्लेशन एक ही चीज़ हैं",
"D_en": "Inflation is a decrease in aggregate demand, while deflation is an increase in aggregate demand", "D_hi": "फ्लेटेंशन में समग्र मांग में कमी होती है, जबकि डेफ्लेशन में समग्र मांग में वृद्धि होती है",
"answer": "B",
"explanation_en": "Inflation is a sustained increase in the general price level of goods and services in an economy, while deflation is a sustained decrease in the general price level.",
"explanation_hi": "फ्लेटेंशन एक अर्थव्यवस्था में वस्तुओं और सेवाओं के आम दाम में स्थायी वृद्धि है, जबकि डेफ्लेशन एक अर्थव्यवस्था में वस्तुओं और सेवाओं के आम दाम में स्थायी कमी है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the primary goal of fiscal policy?",
"question_hi": "राजकोषीय नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To increase government revenue", "A_hi": "सरकारी आय बढ़ाना",
"B_en": "To reduce government expenditure", "B_hi": "सरकारी व्यय कम करना",
"C_en": "To stimulate economic growth", "C_hi": "आर्थिक विकास को बढ़ावा देना",
"D_en": "To reduce inflation", "D_hi": "फ्लेटेंशन कम करना",
"answer": "C",
"explanation_en": "Fiscal policy aims to promote economic growth and stability by adjusting government spending and taxation.",
"explanation_hi": "राजकोषीय नीति सरकारी व्यय और करों को समायोजित करके आर्थिक विकास और स्थिरता को बढ़ावा देने का लक्ष्य रखती है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the advantage of international trade?",
"question_hi": "अंतर्राष्ट्रीय व्यापार का लाभ क्या है?",
"A_en": "Increased government revenue", "A_hi": "सरकारी आय में वृद्धि",
"B_en": "Reduced government expenditure", "B_hi": "सरकारी व्यय में कमी",
"C_en": "Increased economic efficiency", "C_hi": "आर्थिक कार्यशीलता में वृद्धि",
"D_en": "Reduced economic growth", "D_hi": "आर्थिक विकास में कमी",
"answer": "C",
"explanation_en": "International trade allows countries to specialize in the production of goods and services for which they have a comparative advantage, leading to increased economic efficiency.",
"explanation_hi": "अंतर्राष्ट्रीय व्यापार देशों को उन वस्तुओं और सेवाओं के उत्पादन में विशेषज्ञता हासिल करने की अनुमति देता है जिनमें वे तुलनात्मक लाभ रखते हैं, जिससे आर्थिक कार्यशीलता में वृद्धि होती है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the primary tool of monetary policy?",
"question_hi": "राजकोषीय नीति का मुख्य औजार क्या है?",
"A_en": "Increase in government spending", "A_hi": "सरकारी व्यय में वृद्धि",
"B_en": "Reduction in interest rates", "B_hi": "रुचि दरों में कमी",
"C_en": "Increase in taxes", "C_hi": "करों में वृद्धि",
"D_en": "Reduction in government revenue", "D_hi": "सरकारी आय में कमी",
"answer": "B",
"explanation_en": "Monetary policy uses interest rates as its primary tool to control inflation and stimulate economic growth.",
"explanation_hi": "राजकोषीय नीति रुचि दरों का उपयोग करके जीडीपी को बढ़ावा देने और फ्लेटेंशन को नियंत्रित करने के लिए अपना मुख्य औजार है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the concept of opportunity cost?",
"question_hi": "अप्रत्यक्ष लागत की अवधारणा क्या है?",
"A_en": "The cost of an action or decision", "A_hi": "एक कार्रवाई या निर्णय की लागत",
"B_en": "The benefit of an action or decision", "B_hi": "एक कार्रवाई या निर्णय का लाभ",
"C_en": "The cost of not taking an action or decision", "C_hi": "एक कार्रवाई या निर्णय न करने की लागत",
"D_en": "The benefit of not taking an action or decision", "D_hi": "एक कार्रवाई या निर्णय न करने का लाभ",
"answer": "C",
"explanation_en": "Opportunity cost is the cost of choosing one option over another, and it represents the benefit that could have been gained from the alternative choice.",
"explanation_hi": "अप्रत्यक्ष लागत एक विकल्प को दूसरे विकल्प की तुलना में चुनने की लागत है, और यह विकल्प के विकल्प की संभावित प्राप्ति को प्रतिनिधित्व करती है।"
},
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the concept of GDP?",
"question_hi": "जीडीपी की अवधारणा क्या है?",
"A_en": "The total value of all goods and services produced within a country", "A_hi": "एक देश में उत्पादित सभी वस्तुओं और सेवाओं का कुल मूल्य",
"B_en": "The total value of all goods and services consumed within a country", "B_hi": "एक देश में उपभोग की गई सभी वस्तुओं और सेवाओं का कुल मूल्य",
"C_en": "The value of all goods and services produced within a country minus the value of imports", "C_hi": "एक देश में उत्पादित सभी वस्तुओं और सेवाओं का मूल्य उसके आयातों के मूल्य से घटा",
"D_en": "The value of all goods and services consumed within a country minus the value of imports", "D_hi": "एक देश में उपभोग की गई सभी वस्तुओं और सेवाओं का मूल्य उसके आयातों के मूल्य से घटा",
"answer": "A",
"explanation_en": "GDP is the total value of all final goods and services produced within a country's borders during a specific time period, usually a year.",
"explanation_hi": "जीडीपी एक देश के सीमाओं के भीतर एक विशिष्ट समय की अवधि में उत्पादित सभी अंतिम वस्तुओं और सेवाओं के कुल मूल्य को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Economic Indicators",
"question_en": "What is the purpose of economic indicators?",
"question_hi": "आर्थिक संकेतकों का उद्देश्य क्या है?",
"A_en": "To predict future economic trends", "A_hi": "भविष्य के आर्थिक मामलों का भविष्यवाणी करना",
"B_en": "To measure current economic activity", "B_hi": "वर्तमान आर्थिक गतिविधि को मापना",
"C_en": "To evaluate the effectiveness of economic policies", "C_hi": "आर्थिक नीतियों की प्रभावशीलता की मूल्यांकन करना",
"D_en": "To identify economic problems", "D_hi": "आर्थिक समस्याओं की पहचान करना",
"answer": "B",
"explanation_en": "Economic indicators are statistics that provide information about the current state of the economy, such as inflation rate, unemployment rate, and GDP growth rate.",
"explanation_hi": "आर्थिक संकेतक वे सांख्यिकीय हैं जो आर्थिक विकास के वर्तमान हालात के बारे में जानकारी प्रदान करते हैं, जैसे फ्लेटेंशन दर, बेरोजगारी दर, और जीडीपी विकास दर।"
},
{
"subject": "Economy",
"topic": "Resource Allocation",
"question_en": "What is the concept of scarcity?",
"question_hi": "कमी की अवधारणा क्या है?",
"A_en": "The availability of resources", "A_hi": "संसाधनों की उपलब्धता",
"B_en": "The limited nature of resources", "B_hi": "संसाधनों की सीमित प्रकृति",
"C_en": "The abundance of resources", "C_hi": "संसाधनों की अधिकता",
"D_en": "The distribution of resources", "D_hi": "संसाधनों का वितरण",
"answer": "B",
"explanation_en": "Scarcity refers to the limited availability of resources to meet the unlimited wants and needs of individuals and societies.",
"explanation_hi": "कमी से तात्पर्य व्यक्तियों और समाजों की असीमित इच्छाओं और आवश्यकताओं को पूरा करने के लिए संसाधनों की सीमित उपलब्धता से है।"
}
]