[
{
"subject": "Economy",
"topic": "Globalization",
"question_en": "Globalization is the process of:",
"question_hi": "ग्लोबलाइजेशन क्या है?",
"A_en": "Increasing trade between countries", "A_hi": "देशों के बीच व्यापार बढ़ना",
"B_en": "Reducing trade barriers", "B_hi": "व्यापार के बाधाओं को कम करना",
"C_en": "Increased economic interdependence among nations", "C_hi": "राष्ट्रों के बीच आर्थिक निर्भरता बढ़ना",
"D_en": "Decreasing economic growth", "D_hi": "आर्थिक वृद्धि घटाना",
"answer": "C",
"explanation_en": "Globalization refers to the increasing economic interdependence among nations, facilitated by advances in technology, communication, and transportation.",
"explanation_hi": "ग्लोबलाइजेशन राष्ट्रों के बीच बढ़ती आर्थिक निर्भरता को संदर्भित करता है, जो प्रौद्योगिकी, संचार और परिवहन के तरक्की के द्वारा सुगम होता है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the primary cause of inflation?",
"question_hi": "बढ़ती कीमतों का मुख्य कारण क्या है?",
"A_en": "Increase in aggregate demand", "A_hi": "सामग्री मांग में वृद्धि",
"B_en": "Decrease in aggregate demand", "B_hi": "सामग्री मांग में कमी",
"C_en": "Increase in production costs", "C_hi": "उत्पादन लागत में वृद्धि",
"D_en": "Decrease in production costs", "D_hi": "उत्पादन लागत में कमी",
"answer": "A",
"explanation_en": "Increase in aggregate demand is the primary cause of inflation, as it leads to higher prices and reduced purchasing power.",
"explanation_hi": "सामग्री मांग में वृद्धि बढ़ती कीमतों और खरीदने की शक्ति में कमी का प्राथमिक कारण है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the law of diminishing marginal utility?",
"question_hi": "कमी उत्पादकता का कानून क्या है?",
"A_en": "As the quantity of a good increases, its marginal utility also increases", "A_hi": "एक वस्तु की मात्रा बढ़ने पर इसका मार्जिनल उपयोग भी बढ़ता है",
"B_en": "As the quantity of a good increases, its marginal utility remains constant", "B_hi": "एक वस्तु की मात्रा बढ़ने पर इसका मार्जिनल उपयोग स्थिर रहता है",
"C_en": "As the quantity of a good increases, its marginal utility first increases and then decreases", "C_hi": "एक वस्तु की मात्रा बढ़ने पर इसका मार्जिनल उपयोग पहले बढ़ता है और फिर घटता है",
"D_en": "As the quantity of a good decreases, its marginal utility also decreases", "D_hi": "एक वस्तु की मात्रा घटते ही इसका मार्जिनल उपयोग भी घटता है",
"answer": "C",
"explanation_en": "The law of diminishing marginal utility states that as the quantity of a good increases, its marginal utility first increases and then decreases, leading to a point of diminishing returns.",
"explanation_hi": "कमी उत्पादकता का कानून यह कहता है कि एक वस्तु की मात्रा बढ़ने पर इसका मार्जिनल उपयोग पहले बढ़ता है और फिर घटता है, जिससे उत्पादकता कम हो जाती है।"
},
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the difference between nominal GDP and real GDP?",
"question_hi": "नाममात्र GDP और वास्तविक GDP में अंतर क्या है?",
"A_en": "Nominal GDP measures the value of goods and services produced in a given year, while real GDP measures the value of goods and services produced in a previous year.", "A_hi": "नाममात्र GDP दिए गए वर्ष में उत्पादित वस्तुओं और सेवाओं का मूल्य मापता है, जबकि वास्तविक GDP पिछले वर्ष में उत्पादित वस्तुओं और सेवाओं का मूल्य मापता है।",
"B_en": "Nominal GDP measures the value of goods and services produced in a previous year, while real GDP measures the value of goods and services produced in a given year.", "B_hi": "नाममात्र GDP पिछले वर्ष में उत्पादित वस्तुओं और सेवाओं का मूल्य मापता है, जबकि वास्तविक GDP दिए गए वर्ष में उत्पादित वस्तुओं और सेवाओं का मूल्य मापता है।",
"C_en": "Nominal GDP and real GDP are the same thing.", "C_hi": "नाममात्र GDP और वास्तविक GDP एक ही चीज़ है।",
"D_en": "Nominal GDP measures the value of goods and services produced in a given year, while real GDP measures the value of goods and services produced in a future year.", "D_hi": "नाममात्र GDP दिए गए वर्ष में उत्पादित वस्तुओं और सेवाओं का मूल्य मापता है, जबकि वास्तविक GDP भविष्य के वर्ष में उत्पादित वस्तुओं और सेवाओं का मूल्य मापता है।",
"answer": "A",
"explanation_en": "Nominal GDP measures the value of goods and services produced in a given year, while real GDP measures the value of goods and services produced in a previous year, adjusted for inflation.",
"explanation_hi": "नाममात्र GDP दिए गए वर्ष में उत्पादित वस्तुओं और सेवाओं का मूल्य मापता है, जबकि वास्तविक GDP पिछले वर्ष में उत्पादित वस्तुओं और सेवाओं का मूल्य मापता है, जो मुद्रास्फीति के लिए समायोजित होता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the concept of comparative advantage?",
"question_hi": "सापेक्ष लाभ की अवधारणा क्या है?",
"A_en": "A country should produce goods in which it has absolute advantage", "A_hi": "एक देश उस वस्तु का उत्पादन करना चाहिए जिसमें वह संपूर्ण लाभ रखता हो",
"B_en": "A country should produce goods in which it has comparative advantage", "B_hi": "एक देश उस वस्तु का उत्पादन करना चाहिए जिसमें वह सापेक्ष लाभ रखता हो",
"C_en": "A country should export all its goods to other countries", "C_hi": "एक देश अपनी सभी वस्तुओं को अन्य देशों को निर्यात करना चाहिए",
"D_en": "A country should import all its goods from other countries", "D_hi": "एक देश अपनी सभी वस्तुओं को अन्य देशों से आयात करना चाहिए",
"answer": "B",
"explanation_en": "Comparative advantage refers to the concept that a country should produce and export goods in which it has a lower opportunity cost compared to other countries.",
"explanation_hi": "सापेक्ष लाभ से आशय है कि एक देश उस वस्तु का उत्पादन करना चाहिए और निर्यात करना चाहिए जिसमें उसके पास अन्य देशों की तुलना में कम अवसर लागत हो।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the primary tool of monetary policy?",
"question_hi": "अर्थव्यवस्था के नीति का प्राथमिक उपकरण क्या है?",
"A_en": "Fiscal policy", "A_hi": "कार्यकारी नीति",
"B_en": "Monetary policy", "B_hi": "आर्थिक नीति",
"C_en": "Supply-side economics", "C_hi": "आपूर्ति पक्ष की अर्थशास्त्र",
"D_en": "Demand-side economics", "D_hi": "आवश्यकता पक्ष की अर्थशास्त्र",
"answer": "B",
"explanation_en": "Monetary policy is the primary tool of macroeconomic policy, and it involves the use of monetary variables such as interest rates and money supply to manage the economy.",
"explanation_hi": "आर्थिक नीति अर्थव्यवस्था के मैक्रोआर्थिक नीति का प्राथमिक उपकरण है, और इसमें ब्याज दरों और नकदी आपूर्ति जैसे आर्थिक चर जैसे कारकों का उपयोग करके अर्थव्यवस्था का प्रबंधन किया जाता है।"
},
{
"subject": "Economy",
"topic": "Gross Domestic Product (GDP)",
"question_en": "What is the formula for calculating GDP?",
"question_hi": "जीडीपी की गणना करने का सूत्र क्या है?",
"A_en": "C + I + G + (X - M)", "A_hi": "सी + आई + जी + (X - एम)",
"B_en": "C + I + G + X", "B_hi": "सी + आई + जी + X",
"C_en": "C + I + G + M", "C_hi": "सी + आई + जी + एम",
"D_en": "C + I + X - M", "D_hi": "सी + आई + X - एम",
"answer": "A",
"explanation_en": "The formula for calculating GDP is C + I + G + (X - M), where C is consumption, I is investment, G is government spending, X is exports, and M is imports.",
"explanation_hi": "जीडीपी की गणना करने का सूत्र सी + आई + जी + (X - एम) है, जहां सी उपभोग, आई निवेश, जी सरकारी खर्च, X निर्यात, और एम आयात है।"
},
{
"subject": "Economy",
"topic": "Economic Systems",
"question_en": "What is the difference between a command economy and a market economy?",
"question_hi": "निर्देशित अर्थव्यवस्था और बाजार अर्थव्यवस्था में अंतर क्या है?",
"A_en": "In a command economy, the government controls the production and distribution of goods and services, while in a market economy, prices are determined by supply and demand.", "A_hi": "निर्देशित अर्थव्यवस्था में, सरकार वस्तुओं और सेवाओं के उत्पादन और वितरण पर नियंत्रण रखती है, जबकि बाजार अर्थव्यवस्था में, मूल्य आपूर्ति और मांग द्वारा निर्धारित होते हैं।",
"B_en": "In a command economy, prices are determined by supply and demand, while in a market economy, the government controls the production and distribution of goods and services.", "B_hi": "निर्देशित अर्थव्यवस्था में, मूल्य आपूर्ति और मांग द्वारा निर्धारित होते हैं, जबकि बाजार अर्थव्यवस्था में, सरकार वस्तुओं और सेवाओं के उत्पादन और वितरण पर नियंत्रण रखती है।",
"C_en": "In a command economy, the government does not control the production and distribution of goods and services, while in a market economy, prices are determined by government intervention.", "C_hi": "निर्देशित अर्थव्यवस्था में, सरकार वस्तुओं और सेवाओं के उत्पादन और वितरण पर नियंत्रण नहीं रखती है, जबकि बाजार अर्थव्यवस्था में, मूल्य सरकारी हस्तक्षेप द्वारा निर्धारित होते हैं।",
"D_en": "In a command economy, the government controls the production and distribution of goods and services, but prices are determined by supply and demand.", "D_hi": "निर्देशित अर्थव्यवस्था में, सरकार वस्तुओं और सेवाओं के उत्पादन और वितरण पर नियंत्रण रखती है, लेकिन मूल्य आपूर्ति और मांग द्वारा निर्धारित होते हैं।",
"answer": "A",
"explanation_en": "In a command economy, the government controls the production and distribution of goods and services, while in a market economy, prices are determined by supply and demand.",
"explanation_hi": "निर्देशित अर्थव्यवस्था में, सरकार वस्तुओं और सेवाओं के उत्पादन और वितरण पर नियंत्रण रखती है, जबकि बाजार अर्थव्यवस्था में, मूल्य आपूर्ति और मांग द्वारा निर्धारित होते हैं।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "What is the difference between a tax and a fee?",
"question_hi": "कर और शुल्क के बीच अंतर क्या है?",
"A_en": "A tax is a compulsory payment to the government, while a fee is a voluntary payment for a specific service.", "A_hi": "कर एक अनिवार्य भुगतान है जो सरकार को दिया जाता है, जबकि शुल्क एक विशिष्ट सेवा के लिए एक आत्मसमर्पण भुगतान है।",
"B_en": "A tax is a voluntary payment for a specific service, while a fee is a compulsory payment to the government.", "B_hi": "कर एक विशिष्ट सेवा के लिए एक आत्मसमर्पण भुगतान है, जबकि शुल्क एक अनिवार्य भुगतान है जो सरकार को दिया जाता है।",
"C_en": "A tax is a payment for a specific service, while a fee is a payment for a general service.", "C_hi": "कर एक विशिष्ट सेवा के लिए एक भुगतान है, जबकि शुल्क एक सामान्य सेवा के लिए एक भुगतान है।",
"D_en": "A tax is a payment for a general service, while a fee is a payment for a specific service.", "D_hi": "कर एक सामान्य सेवा के लिए एक भुगतान है, जबकि शुल्क एक विशिष्ट सेवा के लिए एक भुगतान है।",
"answer": "A",
"explanation_en": "A tax is a compulsory payment to the government, while a fee is a voluntary payment for a specific service.",
"explanation_hi": "कर एक अनिवार्य भुगतान है जो सरकार को दिया जाता है, जबकि शुल्क एक विशिष्ट सेवा के लिए एक आत्मसमर्पण भुगतान है।"
}