[
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the primary function of the Reserve Bank of India?",
"question_hi": "भारतीय रिज़र्व बैंक का प्राथमिक कार्य क्या है?",
"A_en": "To regulate the money supply", "A_hi": "मुद्रा की आपूर्ति को नियंत्रित करने के लिए",
"B_en": "To collect taxes", "B_hi": "करों का संग्रह करने के लिए",
"C_en": "To provide loans to farmers", "C_hi": "किसानों को ऋण प्रदान करने के लिए",
"D_en": "To manage the country's foreign exchange", "D_hi": "देश के विदेशी मुद्रा का प्रबंधन करने के लिए",
"answer": "A",
"explanation_en": "The Reserve Bank of India is responsible for regulating the money supply in the country, which includes managing inflation, interest rates, and the overall stability of the financial system.",
"explanation_hi": "भारतीय रिज़र्व बैंक देश में मुद्रा की आपूर्ति को नियंत्रित करने के लिए जिम्मेदार है, जिसमें मुद्रास्फीति का प्रबंधन, ब्याज दरें और वित्तीय प्रणाली की समग्र स्थिरता शामिल है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is a characteristic of a mixed economy?",
"question_hi": "निम्नलिखित में से कौन एक मिश्रित अर्थव्यवस्था की विशेषता है?",
"A_en": "Private sector dominance", "A_hi": "निजी क्षेत्र का प्रभुत्व",
"B_en": "Public sector dominance", "B_hi": "सार्वजनिक क्षेत्र का प्रभुत्व",
"C_en": "Coexistence of public and private sectors", "C_hi": "सार्वजनिक और निजी क्षेत्रों का सह-अस्तित्व",
"D_en": "Absence of government intervention", "D_hi": "सरकारी हस्तक्षेप की अनुपस्थिति",
"answer": "C",
"explanation_en": "A mixed economy is characterized by the coexistence of both public and private sectors, where the government plays a significant role in regulating and guiding the economy, while also allowing private enterprise to operate and thrive.",
"explanation_hi": "मिश्रित अर्थव्यवस्था की विशेषता सार्वजनिक और निजी क्षेत्रों के सह-अस्तित्व से है, जहां सरकार अर्थव्यवस्था को नियंत्रित और निर्देशित करने में एक महत्वपूर्ण भूमिका निभाती है, जबकि निजी उद्यमों को भी संचालित और समृद्ध होने की अनुमति देती है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the main objective of the National Rural Employment Guarantee Act (NREGA)?",
"question_hi": "राष्ट्रीय ग्रामीण रोजगार गारंटी अधिनियम (नरेगा) का मुख्य उद्देश्य क्या है?",
"A_en": "To provide employment to rural youth", "A_hi": "ग्रामीण युवाओं को रोजगार प्रदान करने के लिए",
"B_en": "To promote rural development", "B_hi": "ग्रामीण विकास को बढ़ावा देने के लिए",
"C_en": "To guarantee a minimum of 100 days of employment to rural laborers", "C_hi": "ग्रामीण मजदूरों को न्यूनतम 100 दिनों का रोजगार गारंटी देने के लिए",
"D_en": "To reduce rural poverty", "D_hi": "ग्रामीण गरीबी को कम करने के लिए",
"answer": "C",
"explanation_en": "The National Rural Employment Guarantee Act (NREGA) aims to provide a legal guarantee of a minimum of 100 days of employment to rural laborers, in order to protect them from poverty and hunger.",
"explanation_hi": "राष्ट्रीय ग्रामीण रोजगार गारंटी अधिनियम (नरेगा) का उद्देश्य ग्रामीण मजदूरों को न्यूनतम 100 दिनों का रोजगार गारंटी देना है, ताकि उन्हें गरीबी और भुखमरी से बचाया जा सके।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is a type of economic planning?",
"question_hi": "निम्नलिखित में से कौन एक प्रकार की आर्थिक योजना है?",
"A_en": "Indicative planning", "A_hi": "संकेतक योजना",
"B_en": "Imperative planning", "B_hi": "आवश्यक योजना",
"C_en": "Central planning", "C_hi": "केंद्रीय योजना",
"D_en": "Decentralized planning", "D_hi": "विकेंद्रीकृत योजना",
"answer": "B",
"explanation_en": "Imperative planning is a type of economic planning where the government plays a significant role in directing and controlling the economy, and the plans are implemented through a centralized authority.",
"explanation_hi": "आवश्यक योजना एक प्रकार की आर्थिक योजना है जहां सरकार अर्थव्यवस्था को निर्देशित और नियंत्रित करने में एक महत्वपूर्ण भूमिका निभाती है, और योजनाएं एक केंद्रीय प्राधिकरण के माध्यम से लागू की जाती हैं।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the purpose of the Consumer Protection Act, 1986?",
"question_hi": "उपभोक्ता संरक्षण अधिनियम, 1986 का उद्देश्य क्या है?",
"A_en": "To protect consumers from exploitation", "A_hi": "उपभोक्ताओं को शोषण से बचाने के लिए",
"B_en": "To promote consumer awareness", "B_hi": "उपभोक्ता जागरूकता को बढ़ावा देने के लिए",
"C_en": "To regulate business practices", "C_hi": "व्यावसायिक प्रथाओं को नियंत्रित करने के लिए",
"D_en": "To provide compensation to consumers", "D_hi": "उपभोक्ताओं को मुआवजा प्रदान करने के लिए",
"answer": "A",
"explanation_en": "The Consumer Protection Act, 1986 aims to protect consumers from exploitation by businesses, and to provide them with a framework for redressal of grievances.",
"explanation_hi": "उपभोक्ता संरक्षण अधिनियम, 1986 का उद्देश्य उपभोक्ताओं को व्यवसायों द्वारा शोषण से बचाना है, और उन्हें शिकायतों के निवारण के लिए एक ढांचा प्रदान करना है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the main difference between a monopolistic market and a perfect competitive market?",
"question_hi": "एक एकाधिकारवादी बाजार और एक पूर्ण प्रतिस्पर्धी बाजार के बीच मुख्य अंतर क्या है?",
"A_en": "Number of firms", "A_hi": "कंपनियों की संख्या",
"B_en": "Level of competition", "B_hi": "प्रतिस्पर्धा का स्तर",
"C_en": "Barriers to entry", "C_hi": "प्रवेश के लिए बाधाएं",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The main difference between a monopolistic market and a perfect competitive market is the number of firms, level of competition, and barriers to entry. In a monopolistic market, there is only one firm, whereas in a perfect competitive market, there are many firms. Additionally, in a monopolistic market, there are high barriers to entry, whereas in a perfect competitive market, there are low barriers to entry.",
"explanation_hi": "एक एकाधिकारवादी बाजार और एक पूर्ण प्रतिस्पर्धी बाजार के बीच मुख्य अंतर कंपनियों की संख्या, प्रतिस्पर्धा का स्तर और प्रवेश के लिए बाधाएं हैं। एक एकाधिकारवादी बाजार में, केवल एक कंपनी है, जबकि एक पूर्ण प्रतिस्पर्धी बाजार में, कई कंपनियां हैं। इसके अलावा, एक एकाधिकारवादी बाजार में, प्रवेश के लिए उच्च बाधाएं हैं, जबकि एक पूर्ण प्रतिस्पर्धी बाजार में, प्रवेश के लिए निम्न बाधाएं हैं।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the purpose of the Foreign Exchange Management Act (FEMA)?",
"question_hi": "विदेशी मुद्रा प्रबंधन अधिनियम (फेमा) का उद्देश्य क्या है?",
"A_en": "To regulate foreign exchange transactions", "A_hi": "विदेशी मुद्रा लेनदेन को नियंत्रित करने के लिए",
"B_en": "To promote foreign investment", "B_hi": "विदेशी निवेश को बढ़ावा देने के लिए",
"C_en": "To stabilize the rupee", "C_hi": "रुपये को स्थिर करने के लिए",
"D_en": "To manage foreign trade", "D_hi": "विदेशी व्यापार का प्रबंधन करने के लिए",
"answer": "A",
"explanation_en": "The Foreign Exchange Management Act (FEMA) aims to regulate foreign exchange transactions, and to facilitate the flow of foreign exchange in and out of the country.",
"explanation_hi": "विदेशी मुद्रा प्रबंधन अधिनियम (फेमा) का उद्देश्य विदेशी मुद्रा लेनदेन को नियंत्रित करना है, और देश में और बाहर से विदेशी मुद्रा के प्रवाह को सुविधाजनक बनाना है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the difference between a deficit budget and a surplus budget?",
"question_hi": "एक घाटे के बजट और एक अधिशेष बजट के बीच क्या अंतर है?",
"A_en": "Revenue and expenditure", "A_hi": "राजस्व और व्यय",
"B_en": "Government spending and taxation", "B_hi": "सरकारी खर्च और कराधान",
"C_en": "Deficit is when expenditure exceeds revenue, while surplus is when revenue exceeds expenditure", "C_hi": "घाटा तब होता है जब व्यय राजस्व से अधिक होता है, जबकि अधिशेष तब होता है जब राजस्व व्यय से अधिक होता है",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "C",
"explanation_en": "A deficit budget occurs when the government's expenditure exceeds its revenue, resulting in a deficit. On the other hand, a surplus budget occurs when the government's revenue exceeds its expenditure, resulting in a surplus.",
"explanation_hi": "एक घाटे का बजट तब होता है जब सरकार का व्यय उसके राजस्व से अधिक होता है, जिससे घाटा होता है। दूसरी ओर, एक अधिशेष बजट तब होता है जब सरकार का राजस्व उसके व्यय से अधिक होता है, जिससे अधिशेष होता है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the role of the Securities and Exchange Board of India (SEBI)?",
"question_hi": "भारतीय प्रतिभूति और विनिमय बोर्ड (सेबी) की भूमिका क्या है?",
"A_en": "To regulate the stock market", "A_hi": "स्टॉक मार्केट को नियंत्रित करने के लिए",
"B_en": "To promote investor protection", "B_hi": "निवेशक सुरक्षा को बढ़ावा देने के लिए",
"C_en": "To oversee the functioning of stock exchanges and intermediaries", "C_hi": "स्टॉक एक्सचेंज और मध्यवर्ती संस्थाओं के कार्यों की देखरेख करने के लिए",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The Securities and Exchange Board of India (SEBI) is responsible for regulating the stock market, promoting investor protection, and overseeing the functioning of stock exchanges and intermediaries.",
"explanation_hi": "भारतीय प्रतिभूति और विनिमय बोर्ड (सेबी) स्टॉक मार्केट को नियंत्रित करने, निवेशक सुरक्षा को बढ़ावा देने और स्टॉक एक्सचेंज और मध्यवर्ती संस्थाओं के कार्यों की देखरेख करने के लिए जिम्मेदार है।"
}
]