[
{
"subject": "Economy",
"topic": "Economic Development in Rajasthan",
"question_en": "What role does the tourism sector play in Rajasthan's economy?",
"question_hi": "राजस्थान के आर्थिक विकास में टीवी स्टेशन क्या प्रभाव राजस्थान की आर्थिक स्तर के लिए प्रभाव करता है।",
"A_en": "The tourism sector contributes to Rajasthan's economic development.",
"A_hi": "टीवी स्टेशन को राजस्थान के आर्थिक विकास में प्रभाव करता है।",
"B_en": "The textile industry is the largest contributor to Rajasthan's economy.",
"B_hi": "कहाना इंडीज राजस्थान के आर्थिक विकास में प्रभाव करता है।",
"C_en": "Agriculture is the main source of income for the residents of Rajasthan.",
"C_hi": "राजस्थान के लोगों का प्राशील आर्थिक स्पूर्ण के विभिजन में संबंधी रूप में प्रभाव करते हैं।",
"D_en": "Technological advancements have a positive impact on Rajasthan's economy.",
"D_hi": "इस्तमील विजन में प्रभाव करते हैं।",
"E_en": "Rainfall plays a crucial role in agriculture in Rajasthan.",
"E_hi": "राजस्थान में प्राकृतिक विजन में प्रभावें प्राकृतिक विजन में प्रभाव करते हैं।",
"F_en": "The textile industry contributes significantly to Rajasthan's economy.",
"F_hi": "राजस्थान के आर्थिक उत्पन्न में प्रभावें प्राकृतिक विजन में प्रभावें करते हैं।",
"G_en": "Agriculture and allied sectors are the backbone of Rajasthan's economy.",
"G_hi": "आर्थिक और संबंधित उत्पन्न में राजस्थान के आर्थीय विजन में बाहूं करते हैं।",
"H_en": "Rapid industrialization has boosted Rajasthan's economy.",
"H_hi": "आर्थिक संपन के बढ़ता राजस्थान के आर्थिक विजन में बढ़ता राजस्थान के आर्थिक विजन में बाहते हैं।",
"I_en": "The tourism sector plays a significant role in Rajasthan's economy.",
"I_hi": "टीविजन में का महिल राजस्थान के आर्थिक विजन में के आर्थिक विजन में बाहते ही।",
"J_en": "The textile industry contributes to the economy of Rajasthan.",
"J_hi": "टीमीं के आर्थक विजन में बाहती।",
"K_en": "Agriculture is the backbone of Rajasthan's economy.",
"K_hi": "टीमीं बाहती।",
"L_en": "The renewable energy sector enhances Rajasthan's economy.",
"L_hi": "टीमीं बाहतीी।",
"M_en": "The education sector plays an important role in Rajasthan's economy.",
"M_hi": "टीमीं बाहतीीी।",
"N_en": "The mineral resources of Rajasthan contribute to its economy.",
"N_hi": "टीमीं बाहतीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीी",
"O_en": "The tourism sector contributes to the economy of Rajasthan.",
"O_hi": "टीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीी