[
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is a characteristic of a perfectly competitive market?",
"question_hi": "निम्नलिखित में से कौन एक पूर्ण प्रतिस्पर्धी बाजार की विशेषता है?",
"A_en": "Few sellers", "A_hi": "कुछ विक्रेता",
"B_en": "Many buyers and sellers", "B_hi": "कई खरीदार और विक्रेता",
"C_en": "Barriers to entry", "C_hi": "प्रवेश के लिए बाधाएं",
"D_en": "Single price", "D_hi": "एकल मूल्य",
"answer": "B",
"explanation_en": "In a perfectly competitive market, there are many buyers and sellers, and no single buyer or seller can influence the market price.",
"explanation_hi": "एक पूर्ण प्रतिस्पर्धी बाजार में, कई खरीदार और विक्रेता होते हैं, और कोई भी खरीदार या विक्रेता बाजार मूल्य को प्रभावित नहीं कर सकता है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the main objective of fiscal policy?",
"question_hi": "राजकोषीय नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To reduce inflation", "A_hi": "मुद्रास्फीति को कम करने के लिए",
"B_en": "To increase economic growth", "B_hi": "आर्थिक विकास को बढ़ाने के लिए",
"C_en": "To reduce unemployment", "C_hi": "बेरोजगारी को कम करने के लिए",
"D_en": "To achieve all of the above", "D_hi": "उपरोक्त सभी को प्राप्त करने के लिए",
"answer": "D",
"explanation_en": "The main objective of fiscal policy is to achieve economic growth, reduce unemployment, and control inflation.",
"explanation_hi": "राजकोषीय नीति का मुख्य उद्देश्य आर्थिक विकास को बढ़ाना, बेरोजगारी को कम करना और मुद्रास्फीति को नियंत्रित करना है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is a type of economic system?",
"question_hi": "निम्नलिखित में से कौन एक प्रकार की आर्थिक व्यवस्था है?",
"A_en": "Mixed economy", "A_hi": "मिश्रित अर्थव्यवस्था",
"B_en": "Planned economy", "B_hi": "योजनाबद्ध अर्थव्यवस्था",
"C_en": "Market economy", "C_hi": "बाजार अर्थव्यवस्था",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "There are several types of economic systems, including mixed economy, planned economy, and market economy.",
"explanation_hi": "आर्थिक व्यवस्था के कई प्रकार हैं, जिनमें मिश्रित अर्थव्यवस्था, योजनाबद्ध अर्थव्यवस्था और बाजार अर्थव्यवस्था शामिल हैं।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the role of the Reserve Bank of India in the Indian economy?",
"question_hi": "भारतीय अर्थव्यवस्था में भारतीय रिज़र्व बैंक की भूमिका क्या है?",
"A_en": "To regulate the money supply", "A_hi": "मुद्रा आपूर्ति को नियंत्रित करने के लिए",
"B_en": "To supervise commercial banks", "B_hi": "व्यावसायिक बैंकों की देखरेख करने के लिए",
"C_en": "To manage foreign exchange", "C_hi": "विदेशी मुद्रा का प्रबंधन करने के लिए",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The Reserve Bank of India plays a crucial role in the Indian economy by regulating the money supply, supervising commercial banks, and managing foreign exchange.",
"explanation_hi": "भारतीय रिज़र्व बैंक भारतीय अर्थव्यवस्था में एक महत्वपूर्ण भूमिका निभाता है जो मुद्रा आपूर्ति को नियंत्रित करता है, व्यावसायिक बैंकों की देखरेख करता है और विदेशी मुद्रा का प्रबंधन करता है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is a benefit of foreign direct investment?",
"question_hi": "निम्नलिखित में से कौन एक प्रत्यक्ष विदेशी निवेश का लाभ है?",
"A_en": "Increased employment opportunities", "A_hi": "रोजगार के अवसरों में वृद्धि",
"B_en": "Improved technology", "B_hi": "प्रौद्योगिकी में सुधार",
"C_en": "Increased competition", "C_hi": "प्रतिस्पर्धा में वृद्धि",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "Foreign direct investment can bring several benefits to a country, including increased employment opportunities, improved technology, and increased competition.",
"explanation_hi": "प्रत्यक्ष विदेशी निवेश एक देश को कई लाभ प्रदान कर सकता है, जिनमें रोजगार के अवसरों में वृद्धि, प्रौद्योगिकी में सुधार और प्रतिस्पर्धा में वृद्धि शामिल है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the concept of opportunity cost?",
"question_hi": "अवसर लागत की अवधारणा क्या है?",
"A_en": "The cost of choosing one option over another", "A_hi": "एक विकल्प को दूसरे के ऊपर चुनने की लागत",
"B_en": "The cost of producing a good or service", "B_hi": "एक वस्तु या सेवा के उत्पादन की लागत",
"C_en": "The cost of consuming a good or service", "C_hi": "एक वस्तु या सेवा की खपत की लागत",
"D_en": "The cost of investing in a business", "D_hi": "एक व्यवसाय में निवेश की लागत",
"answer": "A",
"explanation_en": "Opportunity cost refers to the cost of choosing one option over another, and it is a fundamental concept in economics.",
"explanation_hi": "अवसर लागत एक विकल्प को दूसरे के ऊपर चुनने की लागत को संदर्भित करती है, और यह अर्थशास्त्र में एक मूलभूत अवधारणा है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is a type of market structure?",
"question_hi": "निम्नलिखित में से कौन एक प्रकार की बाजार संरचना है?",
"A_en": "Monopoly", "A_hi": "एकाधिकार",
"B_en": "Oligopoly", "B_hi": "अल्पाधिकार",
"C_en": "Perfect competition", "C_hi": "पूर्ण प्रतिस्पर्धा",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "There are several types of market structures, including monopoly, oligopoly, and perfect competition.",
"explanation_hi": "बाजार संरचना के कई प्रकार हैं, जिनमें एकाधिकार, अल्पाधिकार और पूर्ण प्रतिस्पर्धा शामिल हैं।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the role of the government in a market economy?",
"question_hi": "एक बाजार अर्थव्यवस्था में सरकार की भूमिका क्या है?",
"A_en": "To regulate the market", "A_hi": "बाजार को नियंत्रित करने के लिए",
"B_en": "To provide public goods", "B_hi": "सार्वजनिक वस्तुओं को प्रदान करने के लिए",
"C_en": "To redistribute income", "C_hi": "आय को पुनर्वितरित करने के लिए",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The government plays a crucial role in a market economy by regulating the market, providing public goods, and redistributing income.",
"explanation_hi": "एक बाजार अर्थव्यवस्था में सरकार बाजार को नियंत्रित करने, सार्वजनिक वस्तुओं को प्रदान करने और आय को पुनर्वितरित करने के लिए एक महत्वपूर्ण भूमिका निभाती है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is a characteristic of a developing country?",
"question_hi": "निम्नलिखित में से कौन एक विकासशील देश की विशेषता है?",
"A_en": "High per capita income", "A_hi": "प्रति व्यक्ति उच्च आय",
"B_en": "Low level of industrialization", "B_hi": "औद्योगिकीकरण का निम्न स्तर",
"C_en": "High level of human development", "C_hi": "मानव विकास का उच्च स्तर",
"D_en": "Low level of poverty", "D_hi": "गरीबी का निम्न स्तर",
"answer": "B",
"explanation_en": "Developing countries are characterized by a low level of industrialization, low per capita income, and a low level of human development.",
"explanation_hi": "विकासशील देशों की विशेषता है एक निम्न स्तर का औद्योगिकीकरण, निम्न प्रति व्यक्ति आय और मानव विकास का निम्न स्तर।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the concept of economic growth?",
"question_hi": "आर्थिक विकास की अवधारणा क्या है?",
"A_en": "An increase in the production of goods and services", "A_hi": "वस्तुओं और सेवाओं के उत्पादन में वृद्धि",
"B_en": "An increase in the level of employment", "B_hi": "रोजगार के स्तर में वृद्धि",
"C_en": "An increase in the standard of living", "C_hi": "जीवन स्तर में वृद्धि",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "Economic growth refers to an increase in the production of goods and services, an increase in the level of employment, and an increase in the standard of living.",
"explanation_hi": "आर्थिक विकास वस्तुओं और सेवाओं के उत्पादन में वृद्धि, रोजगार के स्तर में वृद्धि और जीवन स्तर में वृद्धि को संदर्भित करता है।"
}
]