[
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the main objective of the Monetary Policy of India?",
"question_hi": "भारत की मौद्रिक नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To control inflation", "A_hi": "मुद्रास्फीति पर नियंत्रण",
"B_en": "To promote economic growth", "B_hi": "आर्थिक विकास को बढ़ावा देना",
"C_en": "To maintain financial stability", "C_hi": "वित्तीय स्थिरता बनाए रखना",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The main objective of the Monetary Policy of India is to control inflation, promote economic growth, and maintain financial stability.",
"explanation_hi": "भारत की मौद्रिक नीति का मुख्य उद्देश्य मुद्रास्फीति पर नियंत्रण, आर्थिक विकास को बढ़ावा देना, और वित्तीय स्थिरता बनाए रखना है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the name of the economic policy implemented by the Government of India in 1991?",
"question_hi": "भारत सरकार द्वारा 1991 में लागू की गई आर्थिक नीति का नाम क्या है?",
"A_en": "New Economic Policy", "A_hi": "नई आर्थिक नीति",
"B_en": "Liberalization Policy", "B_hi": "उदारीकरण नीति",
"C_en": "Privatization Policy", "C_hi": "निजीकरण नीति",
"D_en": "Globalization Policy", "D_hi": "वैश्वीकरण नीति",
"answer": "A",
"explanation_en": "The New Economic Policy was implemented by the Government of India in 1991, which aimed to liberalize and open up the Indian economy to the world.",
"explanation_hi": "भारत सरकार ने 1991 में नई आर्थिक नीति लागू की, जिसका उद्देश्य भारतीय अर्थव्यवस्था को उदार और विश्व के लिए खोलना था।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the term used to describe the increase in the general price level of goods and services in an economy?",
"question_hi": "किसी अर्थव्यवस्था में वस्तुओं और सेवाओं की सामान्य मूल्य स्तर में वृद्धि को वर्णित करने के लिए उपयोग किया जाने वाला शब्द क्या है?",
"A_en": "Inflation", "A_hi": "मुद्रास्फीति",
"B_en": "Deflation", "B_hi": "मुद्रास्फीति की कमी",
"C_en": "Recession", "C_hi": "मंदी",
"D_en": "Depression", "D_hi": "अवसाद",
"answer": "A",
"explanation_en": "Inflation is the term used to describe the increase in the general price level of goods and services in an economy.",
"explanation_hi": "मुद्रास्फीति किसी अर्थव्यवस्था में वस्तुओं और सेवाओं की सामान्य मूल्य स्तर में वृद्धि को वर्णित करने के लिए उपयोग किया जाने वाला शब्द है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the name of the organization responsible for regulating the banking system in India?",
"question_hi": "भारत में बैंकिंग प्रणाली को नियंत्रित करने के लिए जिम्मेदार संगठन का नाम क्या है?",
"A_en": "Reserve Bank of India", "A_hi": "भारतीय रिज़र्व बैंक",
"B_en": "State Bank of India", "B_hi": "भारतीय स्टेट बैंक",
"C_en": "Indian Bank", "C_hi": "इंडियन बैंक",
"D_en": "Bank of India", "D_hi": "बैंक ऑफ़ इंडिया",
"answer": "A",
"explanation_en": "The Reserve Bank of India is the central bank of India and is responsible for regulating the banking system in the country.",
"explanation_hi": "भारतीय रिज़र्व बैंक भारत का केंद्रीय बैंक है और देश में बैंकिंग प्रणाली को नियंत्रित करने के लिए जिम्मेदार है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the term used to describe the process of increasing the production of goods and services in an economy?",
"question_hi": "किसी अर्थव्यवस्था में वस्तुओं और सेवाओं के उत्पादन में वृद्धि की प्रक्रिया को वर्णित करने के लिए उपयोग किया जाने वाला शब्द क्या है?",
"A_en": "Growth", "A_hi": "विकास",
"B_en": "Development", "B_hi": "विकास",
"C_en": "Expansion", "C_hi": "विस्तार",
"D_en": "Production", "D_hi": "उत्पादन",
"answer": "A",
"explanation_en": "Growth is the term used to describe the process of increasing the production of goods and services in an economy.",
"explanation_hi": "विकास किसी अर्थव्यवस्था में वस्तुओं और सेवाओं के उत्पादन में वृद्धि की प्रक्रिया को वर्णित करने के लिए उपयोग किया जाने वाला शब्द है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the name of the economic indicator that measures the total value of goods and services produced within a country's borders?",
"question_hi": "किसी देश की सीमाओं के भीतर उत्पादित वस्तुओं और सेवाओं के कुल मूल्य को मापने वाले आर्थिक संकेतक का नाम क्या है?",
"A_en": "GDP (Gross Domestic Product)", "A_hi": "जीडीपी (सकल घरेलू उत्पाद)",
"B_en": "GNP (Gross National Product)", "B_hi": "जीएनपी (सकल राष्ट्रीय उत्पाद)",
"C_en": "NDP (Net Domestic Product)", "C_hi": "एनडीपी (शुद्ध घरेलू उत्पाद)",
"D_en": "NNP (Net National Product)", "D_hi": "एनएनपी (शुद्ध राष्ट्रीय उत्पाद)",
"answer": "A",
"explanation_en": "GDP (Gross Domestic Product) is the economic indicator that measures the total value of goods and services produced within a country's borders.",
"explanation_hi": "जीडीपी (सकल घरेलू उत्पाद) किसी देश की सीमाओं के भीतर उत्पादित वस्तुओं और सेवाओं के कुल मूल्य को मापने वाला आर्थिक संकेतक है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the term used to describe the situation where the demand for a particular good or service is greater than its supply?",
"question_hi": "किसी विशिष्ट वस्तु या सेवा की मांग इसकी आपूर्ति से अधिक होने की स्थिति को वर्णित करने के लिए उपयोग किया जाने वाला शब्द क्या है?",
"A_en": "Shortage", "A_hi": "कमी",
"B_en": "Surplus", "B_hi": "अधिशेष",
"C_en": "Scarcity", "C_hi": "दुर्लभता",
"D_en": "Deficiency", "D_hi": "अभाव",
"answer": "A",
"explanation_en": "Shortage is the term used to describe the situation where the demand for a particular good or service is greater than its supply.",
"explanation_hi": "कमी किसी विशिष्ट वस्तु या सेवा की मांग इसकी आपूर्ति से अधिक होने की स्थिति को वर्णित करने के लिए उपयोग किया जाने वाला शब्द है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the name of the government agency responsible for collecting taxes in India?",
"question_hi": "भारत में करों का संग्रह करने के लिए जिम्मेदार सरकारी एजेंसी का नाम क्या है?",
"A_en": "Income Tax Department", "A_hi": "आयकर विभाग",
"B_en": "Central Board of Direct Taxes", "B_hi": "केंद्रीय प्रत्यक्ष कर बोर्ड",
"C_en": "Goods and Services Tax Council", "C_hi": "वस्तु और सेवा कर परिषद",
"D_en": "Central Excise and Customs Board", "D_hi": "केंद्रीय उत्पाद शुल्क और सीमा शुल्क बोर्ड",
"answer": "A",
"explanation_en": "The Income Tax Department is the government agency responsible for collecting taxes in India.",
"explanation_hi": "आयकर विभाग भारत में करों का संग्रह करने के लिए जिम्मेदार सरकारी एजेंसी है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the term used to describe the movement of goods and services from one country to another?",
"question_hi": "एक देश से दूसरे देश में वस्तुओं और सेवाओं की गति को वर्णित करने के लिए उपयोग किया जाने वाला शब्द क्या है?",
"A_en": "Trade", "A_hi": "व्यापार",
"B_en": "Commerce", "B_hi": "वाणिज्य",
"C_en": "Exchange", "C_hi": "विनिमय",
"D_en": "Transaction", "D_hi": "लेन-देन",
"answer": "A",
"explanation_en": "Trade is the term used to describe the movement of goods and services from one country to another.",
"explanation_hi": "व्यापार एक देश से दूसरे देश में वस्तुओं और सेवाओं की गति को वर्णित करने के लिए उपयोग किया जाने वाला शब्द है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the name of the economic concept that refers to the benefit or value that consumers derive from consuming a good or service?",
"question_hi": "किसी वस्तु या सेवा की खपत से उपभोक्ताओं को प्राप्त होने वाले लाभ या मूल्य को संदर्भित करने वाली आर्थिक अवधारणा का नाम क्या है?",
"A_en": "Consumer Surplus", "A_hi": "उपभोक्ता अधिशेष",
"B_en": "Producer Surplus", "B_hi": "उत्पादक अधिशेष",
"C_en": "Social Surplus", "C_hi": "सामाजिक अधिशेष",
"D_en": "Economic Surplus", "D_hi": "आर्थिक अधिशेष",
"answer": "A",
"explanation_en": "Consumer Surplus is the economic concept that refers to the benefit or value that consumers derive from consuming a good or service.",
"explanation_hi": "उपभोक्ता अधिशेष किसी वस्तु या सेवा की खपत से उपभोक्ताओं को प्राप्त होने वाले लाभ या मूल्य को संदर्भित करने वाली आर्थिक अवधारणा है।"
}
]