[
{
"subject": "Economy",
"topic": "GDP and Economic Growth",
"question_en": "What is the primary contributor to India's Gross Domestic Product (GDP)?",
"question_hi": "भारत के ग्रॉस डोमेंट प्रतिविद्या के मुख्य समर्थन है?",
"A_en": "Agriculture",
"A_hi": "कृषि",
"B_en": "Manufacturing",
"B_hi": "बन्ने",
"C_en": "Services",
"C_hi": "सेवाओं",
"D_en": "Primary Sector",
"D_hi": "प्राधिकार स्तर",
"answer": "C",
"explanation_en": "Services sector contributes significantly to India's GDP as it represents a majority of the country's economy. Agriculture and manufacturing sectors also play a role, but the primary role is played by the Services sector.",
"explanation_hi": "भारत के एकीकरण में सर्वेदिक सेवा प्रश्रेष्ठ में भारत के GDP में मूल भूमि होता है। कृषि और निर्माण के भूमि का भूमि कर रहे हों, लेकिन सेवा प्रश्रेष्ठ में भारत के GDP में मूल भूमि होता हों, लेकिन सेवा प्रश्रेष्ठ में भारत के गैरियाँ के GDP में भारत के GDP में भारत के GDP में भारत के GDP में भारत के GDP में भारत के GDP में भारत के GDP में भारत के GDP में भारत के GDP में भारत के GDP में GDP के में भारत के GDP में GDP के में भारत के GDP में GDP में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP के में GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP कें GDP क