[
{
"subject": "Economy",
"topic": "",
"question_en": "What is Gross Domestic Product (GDP) at current market price?",
"question_hi": "वर्तमान मामला में गृह का ग्रॉस ओपीएड क्या है।",
"A_en": "Rs. 100",
"A_hi": "100",
"B_en": "Rs. 80",
"B_hi": "80",
"C_en": "Rs. 90",
"C_hi": "90",
"D_en": "Rs. 120",
"D_hi": "120",
"answer": "C",
"explanation_en": "Gross Domestic Product (GDP) at current market price is the total value of all goods and services produced within a country's geographical boundaries in a specific time period, usually a year. It includes both domestically produced goods and services and imported goods, but excludes net exports. So, the correct answer is Rs. 90 (C).",
"explanation_hi": "वर्तमान मामला में गृह का ग्रॉस ओपीएड क्या है।",
"answer": "C",
"explanation": "गृह की मूल क्षेत्र में निवृत्तियाँ के विभागों में कुलम का वर्षीय ग्रॉस ओपीएड क्या है।",
"answer": "C",
"explanation": "गृह की कुलम का वर्षीय ग्रॉस ओपीएड क्या है।",
"answer": "C",
"explanation": "गृह की कुलम का वर्षीय ग्रॉस ओपीएड को पाठीं के वर्षीय ग्रॉस ओपीएड क्या है।",
"answer": "C",
"explanation": "गृह की कुलम का वर्षीय ग्रॉस ओपीएड को पाठीं के वर्षीय ग्रॉस ओपीएड को पाठीं के वर्षीय ग्रॉस ओपीएड को पाठीं के वर्षीय ग्रॉस ओपीएड को पाठीं के वर्षीय ग्रॉस ओपीएड को पाठीं के वर्षीय ग्रॉस ओपीएड को पाठीं के वर्षीय ग्रॉस ओपीएड को पाठीं के वर्षीय ग्रॉस ओपीएड को पाठीं के वर्षीय ग्रॉस ओपीएड को पाठीं के वर्षीय ग्रॉस ओपीएड को पाठीं के वर्षीय ग्रॉस ओपीएड को पाठीं के वर्षीय ग्रॉस ओपीएड को पाठीं के वर्षीय ग्रॉस ओपीएड को पाठीं के वर्षीय ग्रॉस ओपीएड को पाठीं के वर्षीय ग्रौ ओपीएड को पाठीं के वर्षीय ग्रौ ओपीएड को पाठीं को वर्षीय ग्रौ ओपीएड को पाठीं को वर्षीय ग्रौ ओपीएड को पाठीं को वर्षीय ग्रौ ओपीएड को पाठीं को वर्षीय ग्रौ ओपीएड को पाठीं को वर्षीय ग्रौ ओपीएड को पाठीं को वर्षीय ग्रौ ओपीएड को पाठीं को वर्षीय ग्रौ ओपीएड को पाठीं को वर्षीय ग्रौ ओपीएड को पाठीं को वर्षीय ग्रौ ओपीएड को पाठीं को वर्षय ग्रौ ओपीएड को पाठीं को वर्षीय ग्रौ ओपीएड को पाठीं को वर्षीय ग्रौ ओपीएड को पाठीं को वर्षय ग्रौ ओपीएड को पाठीं को वर्षीय ग्रौ ओपीएड को पाठो वर्षीय ग्रौ ओपीएड को पाठो वर्षीय ग्रौ ओपीएड को पाठो वर्ष