[
{
"subject": "Economy",
"topic": "National Income and Product",
"question_en": "What is the مفهوم الدخل القومي والمنتج القومي?",
"question_hi": "राष्ट्रीय आय और उत्पाद क्या हैं?",
"A_en": "National Income", "A_hi": "राष्ट्रीय आय",
"B_en": "National Product", "B_hi": "राष्ट्रीय उत्पाद",
"C_en": "State Income", "C_hi": "राज्य आय",
"D_en": "State Product", "D_hi": "राज्य उत्पाद",
"answer": "A",
"explanation_en": "National Income (NI) and National Product (NP) are economic concepts that represent the total value of goods and services produced within a country's borders in a given period of time, usually a year. NI includes wages, salaries, profits, rent, interest, and dividends earned by residents of the country, while NP is the total value of all goods and services produced by the country, regardless of who earned the income from them. Both concepts are important for understanding the overall economic performance and growth of a nation.",
"explanation_hi": "राष्ट्रीय आय (NI) और राष्ट्रीय उत्पाद (NP) एक राज्य के आय और उत्पाद की समझों को एक राज्य का क्रमणिक और उत्पाद को मानने के लिएँ समझों, यूरूटी को एक राज्य का क्रमणिक और उत्पाद को मानने के लिएँ समझों, यूरूटी को एक राज्य का क्रमणिक और उत्पाद को मानने के लिएँ समझों, यूरूटी को एक राज्य का क्रमणिक और उत्पाद को मानने के लिएँ समझों, यूरूटी को एक राज्य का क्रमणिक और उत्पाद को मानने के लिएँ समझों, यूरूटी को एक राज्य का क्रमणिक और उत्पाद को मानने के लिएँ समझों, यूरूटी को एक राज्य का क्रमणिक और उत्पाद को मानने के लिएँ समझों, यूरूटी को एक राज्य का क्रमणिक और उत्पाद को मानने के लिएँ समझों, यूरूटी को एक राज्य का क्रमणिक और उत्पाद को मानने के लिएँ समझों, यूरूटी को एक राज्य का क्रमणिक और उत्पाद को मानने के लिएँ समझों, यूरूटी को एक राज्य का क्र और उत्पाद को एके लिएँ समझों, यूर उत्पाद के लिएँ समझों, यूर उत्पाद के लिएँ समझों, यूर उत्पाद के लिएँ समझों, यूर उत्पाद के लिएँ समझों, यूर उत्पाद के लिएँ समझों, यूर उत्पाद के लिएँ सझर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर",
उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर उर