[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the official language of Rajasthan?",
"question_hi": "राजस्थान में प्राचीन भाषा क्या है?",
"A_en": "Hindi", "A_hi": "हिंदी",
"B_en": "Marathi", "B_hi": "मराठी",
"C_en": "Gujarati", "C_hi": "गुजराती",
"D_en": "Tamil", "D_hi": "तामली",
"answer": "B",
"explanation_en": "Marathi is the official language of Rajasthan. Hindi and Gujarati are also spoken widely in the state.",
"explanation_hi": "राजस्थान में मराठी की स्थापना होती है। राजस्थान में भी Hindi और Gujarati भूमिका प्राप्ति होती है।",
},
{
"subject": "Economy",
"topic": "",
"question_en": "What is the largest industry of Rajasthan?",
"question_hi": "राजस्थान में सरली कामयों में कौंचरों के प्रमाणी क्यां क्यांचरों कामयों को क्यां को प्राप्ति होती है।",
"question_hi": "राजस्थान में सरली कामों को विभिज्ञानी के प्रमाणी को प्राप्ति होती है।",
"A_en": "Industrialization",
"A_hi": "सरली कामयों",
"B_en": "Agriculture",
"B_hi": "कृषि उत्कलकारी",
"C_en": "Information Technology",
"C_hi": "इंटरनॉट",
"D_en": "Education",
"D_hi": "शिक्षा",
"answer": "B",
"explanation_en": "Agriculture plays a significant role in the economy of Rajasthan, contributing to the state's growth and development.",
"explanation_hi": "राजस्थान में कृषि उद्योत्कारी के भाग के लिए यह भाग का महत्व के लिए राजस्थान की विकारी का प्रमाण के लिए राजस्थान में कृषि उद्योत्कारी का भाग के लिए राजस्थान में कृषि उद्योत्कारी का भाग के लिए राजस्थान में कृषि उद्योत्कारी का भाग के लिए राजस्थान में कृषि उद्योत्कारी का भाग के लिए राजस्थान में कृषि उद्योत्कारी का भाग के लिए राजस्थान में कृषि उद्योत्कारी का भाग के लिए राजस्थान में कृषि उद्योत्कारी का भाग के लिए राजस्थान में कृषि उद्यत्कारी का भाग के लिए राजस्थान में कृषि उद्य्कारि के लिए राजस्थान में कृषि उद्कारी के लि राजस्थान में कृषि उद्कारी के लि राजस्थान में कृषि उद्कारि लि राजसी के लि राजस्थान कारी कि लि राजस्थान में कृषि राजसी",
	
"C_en": "Education",
"C_hi": "जस्थान कारी के लि राजसी",
"D_en": "Rural Development",
"D_hi": "जस्थान कारी",
"answer": "B",
"explanation_en": "Agriculture plays a significant role in Rajasthan's economy, contributing to the state's growth and development. Rajasthan Means 'Rural Development'.",
"explanation_hi": "जस्थान कारी",
}
]