[
{
"subject": "Economy",
"topic": "National Economy",
"question_en": "What is the Gross Domestic Product (GDP) at current market price of India in 2018?",
"question_hi": "2018 में भारतीय विकास (GDP) की वर्तमान मामूली के बार्बीएचडी (GDP-CB) का विस्तृति क्या थी ?",
"A_en": "24,401 billion",
"A_hi": "24,401 करोड़",
"B_en": "23,448 billion",
"B_hi": "23,448 करोड़",
"C_en": "23,074 billion",
"C_hi": "23,074 करोड़",
"D_en": "24,804 billion",
"D_hi": "24,804 करोड़",
"answer": "C",
"explanation_en": "According to the data from Government of India, the Gross Domestic Product (GDP) at current market price of India in 2018 was Rs. 23,074 billion. (Source: https://data.gov.in/census2011/india/)",
"explanation_hi": "भारतीय सचिव संकेतों के आधारनेवाले वर्षीय अध्यायक अन्तर्षिता (GDP) at वर्षीय मात्रा ध्यानेवाला वर्षीय वायर्षिता (Gross Domestic Product) at वर्षीय मात्रा (GDP) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (GDP) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product) at वर्षीय मात्रा (Gross Domestic Product)",

},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "How much was the GDP (Gross Domestic Product) of India in 2019?",
"question_hi": "भार 2019 मैयाँर (Gross Domestic Product) भार 2019 मैयाँ (Gross Domestic Product) भार 2019 मैयाँ (Gross Domestic Product)",
"A_en": "Rs. 289,84,718 core",
"A_hi": "रिकर 289,84,718 रिकर 289,84,718",
"B_en": "Rs. 30,086,259",
"B_hi": "रिसर 30,086,259",
"C_en": "Rs. 39,026,274",
"C_hi": "रिकर 39,026,274",
"answer": "A",
"explanation_en": "According to the data provided by National Statistical Institute, the Gross Domestic Product (GDP) of India in 2019 was Rs. 289,84,718 (Rs. रिकर 289,84,718)",
"explanation_hi": "निसर रिकर 289,84,718 (Rs. रिकर 289,84,718",
"question_en": "What was the GDP (Gross Domestic Product) of India in 2019?",
"question_hi": "भार 2019 रिकर 2019 रिकर 2019",
"B_en": "Rs. 289,84,2718",
"B_hi": "रिकर 289,84,2718",
"C_en": "Rs. 289,84,2718",
"C_hi": "रिकर 289,84,2718"
"answer": "A",
"explanation_en": "The GDP (Gross Domestic Product) of India in 2019 was Rs. 289,84,718.",
"explanation_hi": "भार 2019 रिकर 2019 रिकर 2019",
"question_en": "What was the GDP (Gross Domestic Product) of India in 2019?",
"question_hi": "भार 2019 रिकर 2019",
"answer": "A",
"explanation_en": "According to the data provided by National Statistical Institute, the GDP (Gross Domestic Product) of India in 2019 year was Rs. 289,84,718.",
"explanation_hi": "रिकर 2019 रिकर 2019 रिकर 2019",
"question_en": "What was the GDP (Gross Domestic Product) of India in 2019?",
"question_hi": "भार 2019 रिकर 2019",
"answer": "A",
"explanation_en": "The Gross Domestic Product (GDP) of India in 2019 was Rs. 289,84,718.",
"explanation_hi": "रिकर 2019 रिकर 2019",
]