[
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the term for the total value of goods and services produced within a country's borders over a specific time period?",
"question_hi": "किसी देश की सीमाओं के भीतर एक निश्चित समय अवधि में उत्पादित वस्तुओं और सेवाओं के कुल मूल्य के लिए शब्द क्या है?",
"A_en": "GDP", "A_hi": "जीडीपी",
"B_en": "GNP", "B_hi": "जीएनपी",
"C_en": "NDP", "C_hi": "एनडीपी",
"D_en": "NNP", "D_hi": "एनएनपी",
"answer": "A",
"explanation_en": "Gross Domestic Product (GDP) is the total value of goods and services produced within a country's borders over a specific time period.",
"explanation_hi": "सकल घरेलू उत्पाद (जीडीपी) एक निश्चित समय अवधि में किसी देश की सीमाओं के भीतर उत्पादित वस्तुओं और सेवाओं का कुल मूल्य है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the term for a sustained increase in the general price level of goods and services in an economy over time?",
"question_hi": "किसी अर्थव्यवस्था में समय के साथ वस्तुओं और सेवाओं की सामान्य कीमत स्तर में एक सतत वृद्धि के लिए शब्द क्या है?",
"A_en": "Deflation", "A_hi": "मुद्रास्फीति की कमी",
"B_en": "Inflation", "B_hi": "मुद्रास्फीति",
"C_en": "Stagflation", "C_hi": "मुद्रास्फीति-मंदी",
"D_en": "Reflation", "D_hi": "पुनर्मुद्रास्फीति",
"answer": "B",
"explanation_en": "Inflation is a sustained increase in the general price level of goods and services in an economy over time.",
"explanation_hi": "मुद्रास्फीति किसी अर्थव्यवस्था में समय के साथ वस्तुओं और सेवाओं की सामान्य कीमत स्तर में एक सतत वृद्धि है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the term for the use of government spending and taxation to influence the overall level of economic activity?",
"question_hi": "सरकारी व्यय और कराधान का उपयोग करके आर्थिक गतिविधि के समग्र स्तर को प्रभावित करने के लिए शब्द क्या है?",
"A_en": "Monetary Policy", "A_hi": "मौद्रिक नीति",
"B_en": "Fiscal Policy", "B_hi": "राजकोषीय नीति",
"C_en": "Supply-Side Policy", "C_hi": "आपूर्ति-पक्ष नीति",
"D_en": "Demand-Side Policy", "D_hi": "मांग-पक्ष नीति",
"answer": "B",
"explanation_en": "Fiscal policy is the use of government spending and taxation to influence the overall level of economic activity.",
"explanation_hi": "राजकोषीय नीति सरकारी व्यय और कराधान का उपयोग करके आर्थिक गतिविधि के समग्र स्तर को प्रभावित करने के लिए है।"
},
{
"subject": "Economy",
"topic": "Poverty",
"question_en": "What is the term for the state of being unable to afford basic necessities such as food, shelter, and clothing?",
"question_hi": "भोजन, आश्रय और कपड़ों जैसी मूलभूत आवश्यकताओं को खरीदने में असमर्थ होने की स्थिति के लिए शब्द क्या है?",
"A_en": "Unemployment", "A_hi": "बेरोजगारी",
"B_en": "Poverty", "B_hi": "गरीबी",
"C_en": "Inequality", "C_hi": "असमानता",
"D_en": "Deprivation", "D_hi": "वंचना",
"answer": "B",
"explanation_en": "Poverty is the state of being unable to afford basic necessities such as food, shelter, and clothing.",
"explanation_hi": "गरीबी भोजन, आश्रय और कपड़ों जैसी मूलभूत आवश्यकताओं को खरीदने में असमर्थ होने की स्थिति है।"
},
{
"subject": "Economy",
"topic": "Globalization",
"question_en": "What is the term for the increasing integration of economies around the world through trade, investment, and technology?",
"question_hi": "व्यापार, निवेश और प्रौद्योगिकी के माध्यम से दुनिया भर की अर्थव्यवस्थाओं के बढ़ते एकीकरण के लिए शब्द क्या है?",
"A_en": "Globalization", "A_hi": "वैश्वीकरण",
"B_en": "Regionalization", "B_hi": "क्षेत्रीयकरण",
"C_en": "Nationalization", "C_hi": "राष्ट्रीयकरण",
"D_en": "Privatization", "D_hi": "निजीकरण",
"answer": "A",
"explanation_en": "Globalization is the increasing integration of economies around the world through trade, investment, and technology.",
"explanation_hi": "वैश्वीकरण व्यापार, निवेश और प्रौद्योगिकी के माध्यम से दुनिया भर की अर्थव्यवस्थाओं के बढ़ते एकीकरण है।"
},
{
"subject": "Economy",
"topic": "Economic Growth",
"question_en": "What is the term for a sustained increase in the production of goods and services in an economy over time?",
"question_hi": "किसी अर्थव्यवस्था में समय के साथ वस्तुओं और सेवाओं के उत्पादन में एक सतत वृद्धि के लिए शब्द क्या है?",
"A_en": "Economic Decline", "A_hi": "आर्थिक पतन",
"B_en": "Economic Stagnation", "B_hi": "आर्थिक स्थिरता",
"C_en": "Economic Growth", "C_hi": "आर्थिक विकास",
"D_en": "Economic Fluctuation", "D_hi": "आर्थिक उतार-चढ़ाव",
"answer": "C",
"explanation_en": "Economic growth is a sustained increase in the production of goods and services in an economy over time.",
"explanation_hi": "आर्थिक विकास किसी अर्थव्यवस्था में समय के साथ वस्तुओं और सेवाओं के उत्पादन में एक सतत वृद्धि है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the term for the exchange of goods and services between countries?",
"question_hi": "देशों के बीच वस्तुओं और सेवाओं के आदान-प्रदान के लिए शब्द क्या है?",
"A_en": "Domestic Trade", "A_hi": "आंतरिक व्यापार",
"B_en": "International Trade", "B_hi": "अंतर्राष्ट्रीय व्यापार",
"C_en": "Foreign Trade", "C_hi": "विदेशी व्यापार",
"D_en": "Local Trade", "D_hi": "स्थानीय व्यापार",
"answer": "B",
"explanation_en": "International trade is the exchange of goods and services between countries.",
"explanation_hi": "अंतर्राष्ट्रीय व्यापार देशों के बीच वस्तुओं और सेवाओं के आदान-प्रदान है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the term for the actions taken by a central bank to control the money supply and interest rates in an economy?",
"question_hi": "किसी अर्थव्यवस्था में मुद्रा आपूर्ति और ब्याज दरों को नियंत्रित करने के लिए एक केंद्रीय बैंक द्वारा की गई क्रियाओं के लिए शब्द क्या है?",
"A_en": "Fiscal Policy", "A_hi": "राजकोषीय नीति",
"B_en": "Monetary Policy", "B_hi": "मौद्रिक नीति",
"C_en": "Supply-Side Policy", "C_hi": "आपूर्ति-पक्ष नीति",
"D_en": "Demand-Side Policy", "D_hi": "मांग-पक्ष नीति",
"answer": "B",
"explanation_en": "Monetary policy is the actions taken by a central bank to control the money supply and interest rates in an economy.",
"explanation_hi": "मौद्रिक नीति किसी अर्थव्यवस्था में मुद्रा आपूर्ति और ब्याज दरों को नियंत्रित करने के लिए एक केंद्रीय बैंक द्वारा की गई क्रियाएं हैं।"
},
{
"subject": "Economy",
"topic": "Unemployment",
"question_en": "What is the term for the state of being without a job or employment?",
"question_hi": "बेरोजगारी या रोजगार के बिना होने की स्थिति के लिए शब्द क्या है?",
"A_en": "Employment", "A_hi": "रोजगार",
"B_en": "Unemployment", "B_hi": "बेरोजगारी",
"C_en": "Underemployment", "C_hi": "अल्प रोजगार",
"D_en": "Overemployment", "D_hi": "अति रोजगार",
"answer": "B",
"explanation_en": "Unemployment is the state of being without a job or employment.",
"explanation_hi": "बेरोजगारी बेरोजगारी या रोजगार के बिना होने की स्थिति है।"
},
{
"subject": "Economy",
"topic": "Economic Systems",
"question_en": "What is the term for the way in which a society organizes its economic activities, including the production, distribution, and exchange of goods and services?",
"question_hi": "किसी समाज द्वारा अपनी आर्थिक गतिविधियों के संगठन के लिए शब्द क्या है, जिसमें वस्तुओं और सेवाओं का उत्पादन, वितरण और आदान-प्रदान शामिल है?",
"A_en": "Economic System", "A_hi": "आर्थिक प्रणाली",
"B_en": "Political System", "B_hi": "राजनीतिक प्रणाली",
"C_en": "Social System", "C_hi": "सामाजिक प्रणाली",
"D_en": "Cultural System", "D_hi": "सांस्कृतिक प्रणाली",
"answer": "A",
"explanation_en": "An economic system is the way in which a society organizes its economic activities, including the production, distribution, and exchange of goods and services.",
"explanation_hi": "एक आर्थिक प्रणाली किसी समाज द्वारा अपनी आर्थिक गतिविधियों के संगठन का तरीका है, जिसमें वस्तुओं और सेवाओं का उत्पादन, वितरण और आदान-प्रदान शामिल है।"
}
]