[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the contribution of agriculture and allied sectors in Rajasthan's GDP?",
"question_hi": "राजस्थान के GDP में आर्थिक और सामान्य क्षेत्रों की समाप्ति के लिए कैसे प्रश्न है ?",
"A_en": "Agriculture contributes 17% and allied sectors contribute 12% in Rajasthan's GDP.",
"A_hi": "आर्थिक 17% और सामान्य क्षेत्र 12% में राजस्थान के GDP में हैं।",
"B_en": "Agriculture contributes 20% and allied sectors contribute 15% in Rajasthan's GDP.",
"B_hi": "आर्थिक 20% और सामान्य क्षेत्र 15% में राजस्थान के GDP में हैं।",
"C_en": "Agriculture contributes 18% and allied sectors contribute 16% in Rajasthan's GDP.",
"C_hi": "आर्थिक 18% और सामान्य क्षेत्र 16% में राजस्थान के GDP में हैं।",
"D_en": "Agriculture contributes 20% and allied sectors contribute 18% in Rajasthan's GDP.",
"D_hi": "आर्थिक 20% और सामान्य क्षेत्र 18% में राजस्थान के GDP में हैं।",
"E_en": "Agriculture contributes 16% and allied sectors contribute 20% in Rajasthan's GDP.",
"E_hi": "आर्थिक 16% और सामान्य क्षेत्र 20% में राजस्थान के GDP में हैं।",
"F_en": "Agriculture contributes 19% and allied sectors contribute 17% in Rajasthan's GDP.",
"F_hi": "आर्थिक 19% और सामान्य क्षेत्र 17% में राजस्थान के GDP में हैं।",
"G_en": "Agriculture contributes 18% and allied sectors contribute 18% in Rajasthan's GDP.",
"G_hi": "आर्थिक 18% और सामान्य क्षेत्र 18% में राजस्थान के GDP में हैं।",
"H_en": "Agriculture contributes 19% and allied sectors contribute 16% in Rajasthan's GDP.",
"H_hi": "आर्थिक 19% और सामान्य क्षेत्र 16% में राजस्थान के GDP में हैं।",
"I_en": "Agriculture contributes 20% and allied sectors contribute 15% in Rajasthan's GDP.",
"I_hi": "आर्थिक 20% और सामान्य क्षेत्र 15% में राजस्थान के GDP में हैं।",
"J_en": "Agriculture contributes 21% and allied sectors contribute 14% in Rajasthan's GDP.",
"J_hi": "आर्थिक 21% और सामान्य क्षेत्र 14% में राजस्थान के GDP में हैं।",
"K_en": "Agriculture contributes 22% and allied sectors contribute 13% in Rajasthan's GDP.",
"K_hi": "आर्थी 22% और सामान्य क्षेत्र 13% में राजस्।",
"L_en": "Agriculture contributes 23% and allied sectors contribute 12% in Rajasthan's GDP.",
"L_hi": "आरसी 23% और सामान्ेत्र 12% में राज्।",
]