[
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the primary cause of inflation in an economy?",
"question_hi": "एक अर्थव्यवस्था में मुद्रास्फीति का प्राथमिक कारण क्या है?",
"A_en": "Increase in money supply", "A_hi": "मुद्रा आपूर्ति में वृद्धि",
"B_en": "Decrease in money supply", "B_hi": "मुद्रा आपूर्ति में कमी",
"C_en": "Increase in production", "C_hi": "उत्पादन में वृद्धि",
"D_en": "Decrease in production", "D_hi": "उत्पादन में कमी",
"answer": "A",
"explanation_en": "Inflation occurs when there is an excess of money in circulation, causing prices to rise. An increase in money supply is the primary cause of inflation.",
"explanation_hi": "मुद्रास्फीति तब होती है जब परिसंचरण में धन की अधिकता होती है, जिससे कीमतें बढ़ जाती हैं। मुद्रा आपूर्ति में वृद्धि मुद्रास्फीति का प्राथमिक कारण है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the main objective of fiscal policy?",
"question_hi": "राजकोषीय नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To reduce inflation", "A_hi": "मुद्रास्फीति को कम करने के लिए",
"B_en": "To increase economic growth", "B_hi": "आर्थिक विकास को बढ़ाने के लिए",
"C_en": "To reduce unemployment", "C_hi": "बेरोजगारी को कम करने के लिए",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The main objective of fiscal policy is to achieve economic stability and growth by managing government revenue and expenditure. This includes reducing inflation, increasing economic growth, and reducing unemployment.",
"explanation_hi": "राजकोषीय नीति का मुख्य उद्देश्य सरकारी राजस्व और व्यय को प्रबंधित करके आर्थिक स्थिरता और विकास को प्राप्त करना है। इसमें मुद्रास्फीति को कम करना, आर्थिक विकास को बढ़ाना और बेरोजगारी को कम करना शामिल है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the primary tool used by the central bank to implement monetary policy?",
"question_hi": "केंद्रीय बैंक द्वारा मौद्रिक नीति को लागू करने के लिए प्राथमिक उपकरण क्या है?",
"A_en": "Fiscal policy", "A_hi": "राजकोषीय नीति",
"B_en": "Monetary policy", "B_hi": "मौद्रिक नीति",
"C_en": "Interest rates", "C_hi": "ब्याज दरें",
"D_en": "Open market operations", "D_hi": "ओपन मार्केट ऑपरेशंस",
"answer": "D",
"explanation_en": "The primary tool used by the central bank to implement monetary policy is open market operations, which involves buying or selling government securities to increase or decrease the money supply.",
"explanation_hi": "केंद्रीय बैंक द्वारा मौद्रिक नीति को लागू करने के लिए प्राथमिक उपकरण ओपन मार्केट ऑपरेशंस है, जिसमें मुद्रा आपूर्ति को बढ़ाने या घटाने के लिए सरकारी प्रतिभूतियों को खरीदना या बेचना शामिल है।"
},
{
"subject": "Economy",
"topic": "Economic Growth",
"question_en": "What is the main indicator of economic growth?",
"question_hi": "आर्थिक विकास का मुख्य संकेतक क्या है?",
"A_en": "GDP", "A_hi": "जीडीपी",
"B_en": "Inflation rate", "B_hi": "मुद्रास्फीति दर",
"C_en": "Unemployment rate", "C_hi": "बेरोजगारी दर",
"D_en": "Poverty rate", "D_hi": "गरीबी दर",
"answer": "A",
"explanation_en": "The main indicator of economic growth is GDP (Gross Domestic Product), which measures the total value of goods and services produced within a country's borders.",
"explanation_hi": "आर्थिक विकास का मुख्य संकेतक जीडीपी (सकल घरेलू उत्पाद) है, जो एक देश की सीमा के भीतर उत्पादित वस्तुओं और सेवाओं के कुल मूल्य को मापता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the main advantage of international trade?",
"question_hi": "अंतरराष्ट्रीय व्यापार का मुख्य लाभ क्या है?",
"A_en": "Increased competition", "A_hi": "प्रतिस्पर्धा में वृद्धि",
"B_en": "Improved efficiency", "B_hi": "कुशलता में सुधार",
"C_en": "Increased economic growth", "C_hi": "आर्थिक विकास में वृद्धि",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The main advantage of international trade is that it allows countries to specialize in the production of goods and services in which they have a comparative advantage, leading to increased economic growth, improved efficiency, and increased competition.",
"explanation_hi": "अंतरराष्ट्रीय व्यापार का मुख्य लाभ यह है कि यह देशों को उन वस्तुओं और सेवाओं के उत्पादन में विशेषज्ञता प्राप्त करने की अनुमति देता है जिनमें उनके पास तुलनात्मक लाभ है, जिसके परिणामस्वरूप आर्थिक विकास में वृद्धि, कुशलता में सुधार और प्रतिस्पर्धा में वृद्धि होती है।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "What is the main source of revenue for the government?",
"question_hi": "सरकार के लिए राजस्व का मुख्य स्रोत क्या है?",
"A_en": "Taxes", "A_hi": "कर",
"B_en": "Borrowing", "B_hi": "उधार",
"C_en": "Grants", "C_hi": "अनुदान",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "A",
"explanation_en": "The main source of revenue for the government is taxes, which include income tax, sales tax, and other types of taxes.",
"explanation_hi": "सरकार के लिए राजस्व का मुख्य स्रोत कर है, जिसमें आयकर, बिक्री कर और अन्य प्रकार के कर शामिल हैं।"
},
{
"subject": "Economy",
"topic": "Economic Systems",
"question_en": "What is the main characteristic of a market economy?",
"question_hi": "बाजार अर्थव्यवस्था का मुख्य लक्षण क्या है?",
"A_en": "Government ownership of resources", "A_hi": "संसाधनों का सरकारी स्वामित्व",
"B_en": "Private ownership of resources", "B_hi": "संसाधनों का निजी स्वामित्व",
"C_en": "Central planning", "C_hi": "केंद्रीय योजना",
"D_en": "Price controls", "D_hi": "मूल्य नियंत्रण",
"answer": "B",
"explanation_en": "The main characteristic of a market economy is private ownership of resources, which allows individuals and businesses to make decisions about how to allocate resources.",
"explanation_hi": "बाजार अर्थव्यवस्था का मुख्य लक्षण संसाधनों का निजी स्वामित्व है, जो व्यक्तियों और व्यवसायों को संसाधनों को कैसे आवंटित करने के बारे में निर्णय लेने की अनुमति देता है।"
},
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the main component of national income?",
"question_hi": "राष्ट्रीय आय का मुख्य घटक क्या है?",
"A_en": "Consumer spending", "A_hi": "उपभोक्ता व्यय",
"B_en": "Investment", "B_hi": "निवेश",
"C_en": "Government spending", "C_hi": "सरकारी व्यय",
"D_en": "Net exports", "D_hi": "शुद्ध निर्यात",
"answer": "A",
"explanation_en": "The main component of national income is consumer spending, which accounts for the largest share of national income.",
"explanation_hi": "राष्ट्रीय आय का मुख्य घटक उपभोक्ता व्यय है, जो राष्ट्रीय आय के सबसे बड़े हिस्से के लिए जिम्मेदार है।"
},
{
"subject": "Economy",
"topic": "Money and Banking",
"question_en": "What is the main function of a central bank?",
"question_hi": "केंद्रीय बैंक का मुख्य कार्य क्या है?",
"A_en": "To provide loans to individuals", "A_hi": "व्यक्तियों को ऋण प्रदान करना",
"B_en": "To regulate the money supply", "B_hi": "मुद्रा आपूर्ति को नियंत्रित करना",
"C_en": "To provide investment advice", "C_hi": "निवेश सलाह प्रदान करना",
"D_en": "To manage foreign exchange", "D_hi": "विदेशी मुद्रा को प्रबंधित करना",
"answer": "B",
"explanation_en": "The main function of a central bank is to regulate the money supply, which involves managing the amount of money in circulation and setting interest rates.",
"explanation_hi": "केंद्रीय बैंक का मुख्य कार्य मुद्रा आपूर्ति को नियंत्रित करना है, जिसमें परिसंचरण में मुद्रा की मात्रा को प्रबंधित करना और ब्याज दरें निर्धारित करना शामिल है।"
},
{
"subject": "Economy",
"topic": "International Economic Organizations",
"question_en": "What is the main purpose of the International Monetary Fund (IMF)?",
"question_hi": "अंतरराष्ट्रीय मुद्रा कोष (आईएमएफ) का मुख्य उद्देश्य क्या है?",
"A_en": "To promote international trade", "A_hi": "अंतरराष्ट्रीय व्यापार को बढ़ावा देना",
"B_en": "To provide financial assistance to countries", "B_hi": "देशों को वित्तीय सहायता प्रदान करना",
"C_en": "To regulate international finance", "C_hi": "अंतरराष्ट्रीय वित्त को नियंत्रित करना",
"D_en": "To promote economic development", "D_hi": "आर्थिक विकास को बढ़ावा देना",
"answer": "B",
"explanation_en": "The main purpose of the International Monetary Fund (IMF) is to provide financial assistance to countries experiencing economic difficulties, such as balance of payments problems.",
"explanation_hi": "अंतरराष्ट्रीय मुद्रा कोष (आईएमएफ) का मुख्य उद्देश्य आर्थिक कठिनाइयों का सामना करने वाले देशों को वित्तीय सहायता प्रदान करना है, जैसे कि भुगतान संतुलन समस्याएं।"
}
]