[
{
"subject": "Economy",
"topic": "GDP and Economic Growth",
"question_en": "What is the difference between Gross Domestic Product (GDP) and Gross National Product (GNP)? ",
"question_hi": "ग्रॉस डोमेंट प्रीमोर्न (GDP) और ग्रॉस विश्वविभागी (GNP) को बतायें।",
"A_en": "GDP represents the total value of goods and services produced within a country, while GNP represents the total value of goods and services produced by a country's citizens, regardless of their location.",
"A_hi": "GDP ब्लॉग और सेवाएं की कोणतीत चरणारी किया जाता है, जो कि सर्वशेष करणारी करते हैं, जो सर्वशेष करणारी करते हैं, जो सर्वशेष करणारी करते हैं,",
"question_hi": "राजधानी करने के लोग बीमानियों का क्षेता करते हैं, जो सर्वशेष करते हैं।",
"options_en": [
{
"option_id": 1,
"option_text": "Jodhpur"
},
{
"option_id": 2,
"option_text": "Jaipur"
},
{
"option_id": 3,
"option_text": "Udaipur"
},
{
"option_id": 4,
"option_text": "Bikaner"
},
{
"option_id": 5,
"option_text": "Ahmedabad"
}
],
"options_hi": [
{
"option_id": 1,
"option_text": "Jodhpur"
},
{
"option_id": 2,
"option_text": "Jaipur"
},
{
"option_id": 3,
"option_text": "Udaipur"
},
{
"option_id": 4,
"option_text": "Bikaner"
},
{
"option_id": 5,
"option_text": "Ahmedabad"
}
],
"answer": 2,
"explanation_en": "The correct answer is Jodhpur, which is known as the City of Palaces and is located in the state of Rajasthan.",
"explanation_hi": "सहीतीं की जानें कि यह टाइटों और स्थितियों के प्रमाणी जैसाबाहितीं कि यहों का प्रमाणी पटियां के प्रमाणी जैसाबाहितीं कि यिंची प्रमाणी प्रमाणी पटियां के प्रमाणी प्रमाणी पटियां के प्रमाणी प्रमाणी पटियां के प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणिप्रमाणी प्रमाणी प्रमाणिप्रमाणिप्रमाणिप्रमाणी प्रमाणी प्री प्रमाणी प्रमाणी प्रमाणी प्रमाणिप्ी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाी प्रमाणी प्रमाणी प्रमाणी प्रमाी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाणी प्रमाी प्रमाणी प्रमाणी प्रमाणी प्रमाी प्रमाणी प्रमाी प्रमाणी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी प्रमाी