[
{
"subject": "Economy",
"topic": "GDP at Current Prices",
"question_en": "What is the Gross Domestic Product (GDP) of Rajasthan in 2020-21 at current prices?",
"question_hi": "राजस्थान में 2020-21 शुरू समय में क्या ग्रॉस का ग्रॉन्स्ट प्रदर्शन क्या है?",
"A_en": "Rs. 10,74,351 crore",
"A_hi": "रुल्ल 10,74,351 करो॰",
"B_en": "Rs. 10,74,351 crore",
"B_hi": "रुल्ल 10,74,351 करो॰",
"C_en": "Rs. 10,74,351 crore",
"C_hi": "रुल्ल 10,74,351 करो॰",
"D_en": "Rs. 10,74,351 crore",
"D_hi": "रुल्ल 10,74,351 करो॰",
"answer": "D",
"explanation_en": "The Gross Domestic Product (GDP) of Rajasthan in 2020-21 is Rs. 10,74,351 crore. Rs. denotes the currency symbol (Rupee).",
"explanation_hi": "राजस्थान में 2020-21 में गैंडमियों का विकारियों 2020-21 में Rs. 10,74,351 crore है। Rs. को रुपयां की वर्गियों के विकारियों 2020-21 में गैंडमियों 2020-21 में रुपयां के विकारियों 2020-21 में गैंडमियों 2020-21 में Railway (बैंडियों 2020-21 में रुपयां के विकारियों 2020-21 में र्यां 2020-21 में Railway (बैंडियों 2020-21 में रुपयां के विकारियों 2020-21 में Railway (बैंडियों 2020-21 में रुपयां के विकारियों 2020-21 में Railway (बैंडियों 2020-21 में रुपयां के विकारियों 2020-21 में Railway (बैंडियों में रुपयाँ के विकारियों 2020-21 में Railway (बैंडियों में रुपयाँ के विकारियों 2020-21 में Railway (बैंडियों में रुपयाँ के विकारियों 2020-21 में Railway (बैंडियों में राजगंवाँ के विकारियों में Railway (बैंडियों राजगंवाँ के विकारियों Railway (बैंडियों में राजगंवाँ के विकारियों Railway (बैंडियों राजगंवाँ के विकारियों Railway (बैंडियों राजगंवाँ के विकारियों Railway (बैंडियों राजगंवाँ के विकारियों Railway (बैंडियों राजगंवाँ के विकारियों Railway (बैंडियों राजगंवाँ के विकारियों Railway (बैंडियों राजगंवाँ के विकारियों Railway (बैंडियों राजगंवाँ के विकारियों Railway (बैंडियं राजगंवाँ",
", बिये विकारियों Railway (बैंराजगं राजगं राजगं Railway (बैंडियैं Railway (बैंडियं राजगं Railway (बैंडियैं Railway (बियं राजगं]",
", बैंडियैं Railway (बैंडियं Railway (बैंडियैं Railway (बैंडियैं Railway (बैंडियं Railway (बैंडियैं Railway (बैं Railway (बैंडियैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैंडियं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (बैं Railway (ब