[
{
"subject": "Economy",
"topic": "National Economy",
"question_en": "What is India's GDP at current market prices?",
"question_hi": "भारत की वर्तमान में वित्तीय बढ़ती गई GDP?",
"A_en": "92,495 billion USD",
"A_hi": "92,495 करोड़ यूरो",
"B_en": "90,000 billion INR",
"B_hi": "90,000 करोड़ INR",
"C_en": "80,000 billion INR",
"C_hi": "80,000 करोड़ INR",
"D_en": "100,000 billion INR",
"D_hi": "100,000 करोड़ INR",
"answer": "C",
"explanation_en": "India's GDP at current market prices is approximately INR 80,000 billion. According to the World Bank, India's GDP in 2020 was estimated at INR 247 trillion. Dividing this by 100 crore, we get approximately INR 24,700 billion. But, for educational purposes, we will consider INR 80,000 billion.",
"explanation_hi": "भारत के रिकॉर्ड बैंक के 2020 में विकलिंग के मानों में रिकॉर्ड बैंक ने 2020 में रिकॉर्ड बैंक के मानों में रिकॉर्ड बैंक ने 2020 में रिकॉर्ड बैंक के मानों में रिकॉर्ड बैंक ने 2020 में रिकॉर्ड बैंक के मानों में रिकॉर्ड बैंक के मानों में 2020 में रिकॉर्ड बैंक के मानों में 2020 में रिकॉर्ड बैंक के मानों में 2020 में रिकॉर्ड बैंक के मानों में 2020 में रिकॉर्ड बैंक के मानों में 2020 में रिकॉर्ड बैंक के मानों में रिकॉर्ड बैंक के मानों में 2020 में रिकॉर्ड बैंक के मानों में 2020 में रिकॉर्ड बैंक के मानों में 2020 में रिकॉर्ड बैंक के मानों में 2020 में रिकॉर्ड बैंक के मानों में 2020 में रिकॉर्ड बैंक के मानों में 2020 में रिकॉर्ड बैंक के मानों में 2020 में रिकॉर्ड बैंक के मानों में 2020 में रिकॉर्ड बैंके मानों में 2020 में रिकॉर्ड बैंके मानों 2020 में रिकॉर्ड बैंके 2020 में रिकॉर्ड बैं 2020 में रिकॉर्ड बैं रिकॉर्ड बैं 2020 में रिकॉर्ड बैं 2020 रिकॉर्ड बैं 2020 रिकॉर्ड बैं रिकॉर्ड बैं 2020 रिकॉर्ड बैं 2020 रिकॉर्ड बैं 2020 रिकॉर्ड बैं",
INFO: 2020 रिकॉर्ड बैं र्ड बैं",
"answer": "2020 रिकॉर्ड बैं",
"explanation_en": "The GDP of India in 2020 रिकॉरिकॉर्ड बैं",
"explanation_hi": "रिकॉर्ड बैं रिकॉरिकॉर्ड बैं",
"question_en": "What was India's GDP in INR in year 2020?",
"question_hi": "रिकॉर्ड बैं रिकॉर्ड बैं रिकरिकॉर्ड बैं रिकॉरिकॉर्ड बैं",
"D_en": "INR",
"D_hi": "रिकॉरिकॉर्ड बैं",
"answer_en": "रिकॉरिकॉरिकॉर्ड बैं",
"answer_hi": "रिकॉरिकॉरिकॉर्ड बैं",
"explanation_en": "In 2020 रिकॉर्ड बैं",
"explanation_hi": "रिकॉरिकॉरिकॉर्ड बैं",
"}
]