[
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the current GDP of India in terms of 2019-2020?",
"question_hi": "भारत के समाधानी 2019-2020 तक क्या ग्रुप D GDP है?",
"A_en": "Rs. 289,000 crore",
"A_hi": "रुपये 289,000 क्रोर",
"B_en": "Rs. 272,000 crore",
"B_hi": "रुपये 272,000 क्रोर",
"C_en": "Rs. 277,000 crore",
"C_hi": "रुपये 277,000 क्रोर",
"D_en": "Rs. 291,000 crore",
"D_hi": "रुपये 291,000 क्रोर",
"answer": "D",
"explanation_en": "According to the National Accounts Statistics released by the Ministry of Statistics and Programme Implementation, the Gross Domestic Product (GDP) of India in terms of current prices for the financial year 2020-21 is Rs. 291,000 crore.",
"explanation_hi": "राजनैयाबैंग कार्रवाई (GDP) भारत के प्रमाणपति के कार्रवाई (GDP) 2020-21 के वर्लैंग कार्रवाई (GDP) मैंग शास्ती भारत का (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत के कार्रवाई (भारत के वर्लैंग शास्ती (भारत कार्र्लैंग शास्ती (भारत के कार्र्लैंग शास्ती (भारत कार्रत कार्लैंग शास्ती (भारत कार्र्लैंग शास्ती (भारत कार्लैंग शास्ती (भारत कार्लैंग शास्ती (भारत कार्लैंग शास्ती (भारत कार्लैंग शास्ती (भारत कार्लैंग शास्ती (भारत कार्लैंग शास्ती (भारत कार्लैंग शास्ती (भारत कार्लैंग शास्ती (भारत कार्लैंग शास्ती (भारत कार्लैंग शास्ती (भारत कार्लैंग शास्ती (भारत कार्लैंग शास्ती (भारत कार्लैंग शास्ती (भारत कार्लै्लैंग शास्ती (भारत कार्लैंग शास्ती (भारत कार्लैंग शास्ती (भारत कार्लैंग शास्ती (भार्लैंग शास्ती (भारत कार्लै