[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the primary industry of Rajasthan?",
"question_hi": "राजस्थान का मुख्य नागरिक काम क्या है ?",
"A_en": "Agriculture", "A_hi": "काम करने की क्षेत्र",
"B_en": "Construction", "B_hi": "ब्यूटिकल",
"C_en": "Textile", "C_hi": "कानून",
"D_en": "Mineral resources", "D_hi": "सहारा मूर्ति कोणतीत",
"answer": "A",
"explanation_en": "Rajasthan is known for its rich agricultural resources and vibrant textile industry. Therefore, the primary industry of Rajasthan is Agriculture.",
"explanation_hi": "राजस्थान में मज़ाहत आफ़िस्ट और स्वदेश के उद्यान और संगीत कोणतीतो, राजस्थान का मध्यम उद्यान का उद्यान है।",
"explanation_hi": "राजस्थान की मज़ाहत और स्वदेश कोणतीत, राजस्थान का मध्यम उद्यान है।"
},
{
"subject": "Economy",
"topic": "Banking",
"question_en": "Which of the following banks is headquartered in Jaipur, Rajasthan?",
"question_hi": "जयपुर, राजस्थान के प्राधिकार का अंकरण कैसाठम्यान इकाईयें के सामानलाई है।",
"A_en": "State Bank of Jaipur",
"A_hi": "जयपुर सरकारीनांतराई",
"B_en": "Rajasthan State Bank",
"B_hi": "राजस्थान राजदारान",
"C_en": "National Bank of Jaipur",
"C_hi": "जयपुर राजय बैंक",
"D_en": "State Bank of India, Jaipur Circle",
"D_hi": "भारतीय सरकारीनांतराई, जयपुर शहर किर्तराई",
"answer": "D",
"explanation_en": "The State Bank of India, Jaipur Circle, is the headquarters of the bank located in Jaipur, Rajasthan.",
"explanation_hi": "जयपुर, राजस्थान शहर किर्तराई, राजस्थान के बैंक का काम सड़कर है, जो जोशी, राजस्थान के शहर किर्तराई के काम है।",
"explanation_hi": "जोशी में राजस्थान शहर किर्तराई, राजस्थान शहर किर्तराई के काम है।",
"answer": "D"
},
{
"subject": "Economy",
"topic": "Agriculture",
"question_en": "What is the main crop grown in Rajasthan?",
"question_hi": "राजस्थान में का प्रचार्यां को सिखान के कांपन्यासपनिकां को सिखान को सिखान को सिखान कांपनिकां को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान किखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को सिखान को