[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the role of the Central Statistics Office (CSO)?",
"question_hi": "कॉर्पोरेशनल स्टेटियम ऑफिस (CSO) का कार्य क्या होता है।",
"A_en": "CSO collects and publishes economic and statistical data.",
"A_hi": "CSO किस्त्रों और विश्वस्नान में विभिन्न और संदर्भिक डेटा को बढ़ाने और उपलब्ध करने का कार्य किया गया है।",
"B_en": "CSO provides statistical data for various sectors and industries.",
"B_hi": "CSO छात्रों और प्रणालिक स्थानी डेटा प्रदर्श करना है।",
"C_en": "CSO determines and publishes inflation rates.",
"C_hi": "CSO आर्थों और प्रवर्द्धी के संतुलन करने का कार्य है।",
"D_en": "CSO studies and publishes economic indicators.",
"D_hi": "CSO आर्थों और संपारिती के बार्बीन प्रकार में अनुवाद करने का कार्य है।",
"E_en": "CSO monitors and publishes GDP.",
"E_hi": "CSO आर्त्रिती की एक्सीडियन प्रकार में गृहित करने का कार्य है।",
"F_en": "CSO studies and publishes employment trends.",
"F_hi": "CSO कृषि और विभिन्ती की क्रमिक प्रकार में विवाद करने का कार्य है।",
"G_en": "CSO analyses and publishes inflation rates.",
"G_hi": "CSO विभिन्ती की क्रमिक प्रकार में आरूढ़तिती करने का कार्य है।",
"H_en": "CSO conducts economic research and publishes employment trends.",
"H_hi": "CSO एक्सीकिचिक प्रश्नन करने का कार्य है।",
"I_en": "CSO publishes trade data and economic indicators.",
"I_hi": "CSO एक्सीकिचिक प्रश्नन करने का काम है।",
"J_en": "CSO prepares exam papers for various competitive exams.",
"J_hi": "CSO एक्सीकिचिक प्रश्नन करने का काम है।",
"K_en": "CSO analyzes the Indian economy.",
"K_hi": "CSO भारती भारती भारती करने का काम है।",
"L_en": "CSO develops economic models.",
"L_hi": "CSO भारती भारती का कार्यार्थिक भार्यार्थिक भार्यार्थिक भार्यार्थिक भार्थिक भार्यार्थिक भार्थिक भार्यार्थिक भार्थिक भार्यार्थिक भार्यार्थिक भार्यार्थिक भार्यार्थिक भार्यार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार्थिक भार