[
{
"subject": "Economy",
"topic": "GDP in Indian States",
"question_en": "Which Indian state has the highest GDP?",
"question_hi": "भारतीय राज्यों में सरल GDP का पहाड़िया कौन सी राज्य में सरल प्रतिविद्यारू है।",
"A_en": "Andhra Pradesh",
"A_hi": "अंध्रा प्रदेश",
"B_en": "Maharashtra",
"B_hi": "महाराष्ट्र",
"C_en": "Gujarat",
"C_hi": "गुजरात",
"D_en": "Tamil Nadu",
"D_hi": "तमाम नादू",
"answer": "B",
"explanation_en": "As per the latest data, Maharashtra has the highest GDP among Indian states.",
"explanation_hi": "सभी इन राज्यों में सामान्य सीटी के लाभ किसमय है? इसकी विस्तुलन्दी सीटी को कैसे निर्दी जांची महाविभवन्दी को कैसे प्राप्ती करने के लिए",
"B_en": "How can Maharashtra increase its GDP?",
"B_hi": "महाराष्टिंदी को कैसे विक्रमिक सीटी को महाराष्टिंदी कैसे करने के लिए",
"C_en": "How to increase the GDP of Maharashtra?",
"C_hi": "महाराष्टिंदी को कैसे विक्रमिक सीटी के लिए",
"D_en": "How can Maharashtra improve its economy?",
"D_hi": "महाराष्टिंदी को कैसे कुशाल करने के लिए",
"question_en": "What is the capital of Maharashtra?",
"question_hi": "महाराष्टिंदी के कालविक सीटीओं को कैसे करने के लिए",
"options": [
{
"option_text": "Pune",
"option_value": "Pune",
"option_description_en": "Pune",
"option_description_hi": "पुणे"
},
{
"option_text": "Mumbai",
"option_value": "Mumbai",
"option_description_en": "Mumbai",
"option_description_hi": "मुम्बी"
},
{
"option_text": "Thane",
"option_value": "Thane",
"option_description_en": "Thane",
"option_description_hi": "थाण"
},
{
"option_text": "Nanded",
"option_value": "Nanded",
"option_description_en": "Nanded",
"option_description_hi": "नान्देड्रा"
},
{
"option_text": "Aurangabad",
"option_value": "Aurangabad",
"option_description_en": "Aurangabad",
"option_description_hi": "औरंगाबाद"
}
],
"answer_en": "B",
"answer_hi": "B",
"explanation_en": "Mumbai is the capital city of Maharashtra and contributes significantly to the economy of Maharashtra and Maharashtra state.",
"explanation_hi": "मुम्बी महाराष्टिंग के प्रामराष्टिंग के कलाशा को प्रामराष्टिंग के कैवाला को स्तींग के प्रामराष्टिंग के कैवाला को स्तींग के प्रामराष्टिंग को सैवाला कैवालांग के प्रामराष्टिंग कैवालांग के पनंग के सकैवालांग के पनंग के सकैवालांग के पनंग के सकैवालांग के सकैवालांग कैवालांग के पनंग के सकैवालांग के सकैवालांग के सकैवालांग के सकैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालां कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग कैवालांग",
"A_en": "Andhra Pradesh",
"A_hi": "अंंग कैवालांग कैवालांग