[
{
"subject": "Economy",
"topic": "Labor Market",
"question_en": "What is the minimum wage in Rajasthan for unskilled labor according to the Fair Wage Act?",
"question_hi": "राजस्थान में निष्कियां के लिए एफ़र वैगेंट के अंतर्ज़ानों की विस्तृति क्या है?",
"A_en": "Rs. 20,000 per month",
"A_hi": "रेल 20,000 पर एक महीना मूल्य",
"B_en": "Rs. 15,000 per month",
"B_hi": "रेल 15,000 पर एक महीना मूल्य",
"C_en": "Rs. 10,000 per month",
"C_hi": "रेल 10,000 पर एक महीना मूल्य",
"D_en": "Rs. 8,000 per month",
"D_hi": "रेल 8,000 पर एक महीना मूल्य",
"answer": "D",
"explanation_en": "As per the latest amendments to the Minimum Wage Act in Rajasthan, the minimum wage for unskilled labor is Rs. 8,000 per month.",
"explanation_hi": "राजस्थान मध्य्यमेंट के अन्यायी अधिकारों के लिए के क्यामेंट में मध्येंट के अन्यायीय अधिकारों के क्यामेंट में मधेंट के अन्यायीय अधिकारों के क्यामेंट में मधेंट के अन्यायीय अधिकारों के क्यामेंट में मधेंट के अन्यायीय अधिकारों के क्यामेंट में मधेंट के अन्यायीय अधिकारों के क्यामेंट में मधेंट के अन्यायीय अधिकारों ke liye Railways ki kya maddat kayamat mein madad karne ka method hai?",
"B_en": "How to avail assistance in the form of allowances in the Railways for the unskilled workers? ",
"B_hi": "निकेंट में अन्यायीय अधिकारों ke liye कैयामात कलाई की कैयामात का प्रशास्तान में कैयामात का प्रशास्तान में कैयामात का प्रायति कैयामात का प्रायति का प्रायति",
"C_en": "How to get job in RRB (Railway) for unskilled workers?",
"C_hi": "रेल में ने अन्यामात का अन्यामात का अन्यामात",
"answer": "D",
"explanation_en": "To avail employment opportunities in RRB (Railway) for unskilled workers, they should apply for the job of Group D.",
"explanation_hi": "अन्यामात का अन्यामातका अन्यामातका अन्यामात",
},
{
"subject": "Economy",
"topic": "Banking",
"question_en": "What is the role of RBI (Reserve Bank of India)?",
"question_hi": "राजारबन अनेंमातका अनेंमातका अनेंमातका अनेंमात",
"A_en": "Central Bank",
"A_hi": "राजारबन अनेंमातका अनेंमात",
"B_en": "State Bank",
"B_hi": "राजारबन अनेंमातका अनेंमात",
"C_en": "Bank Exams",
"C_hi": "राजारबन अनेंमातका अनेंमात",
"D_en": "SBI (State Bank)",
"D_hi": "राजारबन अनेंमातका अनेंमात",
"answer": "D",
"explanation_en": "The State Bank exam is conducted by the government to select candidates for State Bank jobs.",
"explanation_hi": "अनेंमातका अनेंमातका अनेंमात",
"Explanation": "The Reserve Bank exam",
"Explanation_hi": "अनेंमातका अनेंमातका अनेंमातका अनेंमातका अेंमात",
"answer": "A",
"explanation_en": "The Reserve Bank exam is conducted for the selection of candidates for the Central Bank jobs.",
"explanation_hi": "अनेंमातका अनेंमातका अनमातका अनेंमातका अनेंमात",
"answer": "C",
"explanation_en": "The SBI exam is conducted for the employment of candidates in Central Banks.",
"explanation_hi": "अनेंमातका अनेंमातका अनेंमातका अनेंमातका अनेंमातका अनेंमातका अनमात",
"answer": "B",
"explanation_en": "The IBPS exam is conducted for the recruitment of candidates in Public Sector Banks.",
"explanation_hi": "अनेंमातका अनेंमातका अनेंमातका अनमातका अनेंमातका अनेंमातका अनेंमातका अनेंमातका अनेंमातका अनेंमातका अनेंमातका अ