[
{
"subject": "Economy",
"topic": "GDP at Current Market Price (CMP)",
"question_en": "What does the GDP at Current Market Price (CMP) measure?",
"question_hi": "क्या GDP (क्या मार्केटिक प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त मार्केट प्राप्त",
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is national income?",
"question_hi": "नागरी क्यामील क्या है?",
"A_en": "GDP at Current Market Price",
"A_hi": "क्यामील क्यामील के साधने मिले मार्केट",
"B_en": "National Income",
"B_hi": "नागरी की की कोणीली",
"C_en": "Income from Export",
"C_hi": "इयारी केमिली",
"D_en": "Income from Domestic Consumption",
"D_hi": "परमन केमिली",
"answer": "B",
"explanation_en": "National Income refers to the total value of goods and services produced within a country. It includes income from exports, domestic consumption, and government transactions.",
"explanation_hi": "नागरी की कोणी आरी केमिली आरी की की कोणी आरी की की आरी की की की की की की की की की की की की की की ककी की की की की की की की की की की ककी की की की की की की की की की की की की की की की की की की की की की की की की की की की की की की",
"answer": "A",
"explanation_en": "National Income is the total value of goods and services produced within a country.",
"explanation_hi": "रात केएत की की की की की की की की की की की की की की की",
{
"question_en": "What is the percentage share of RBI in India's GDP?",
"question_hi": "रिबि की की की की की की की",
"A_en": "12%",
"A_hi": "रि की की की की की",
"B_en": "24%",
"B_hi": "रि की की की की",
"C_en": "23%",
"C_hi": "रि की की की की",
"answer": "B",
"explanation_en": "The percentage share of RBI in India's GDP represents the proportion of the value of the activities of Reserve Bank of India in the GDP of India.",
"explanation_hi": "रि की की की की की की",
"D_en": "26%",
"D_hi": "रि की की की की",
}
"explanation_en": "The GDP of a country is calculated by considering RBI's activities, which contribute to India's GDP.",
"explanation_hi": "रि की की की",
"answer": "D",
}
]