[
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is not a part of the 74 Industries identified for promotion by the Government of India?",
"question_hi": "भारत के वित्त प्रतिलोकन के लिए प्रदान की गई 74 इंडियाई उत्पादन कोणत्र नहीं उल्लेखनी केली गई है।",
"options": [
"Agriculture",
"Industry",
"Trade and Commerce",
"Information and Communication Technology",
"Education",
"Health and Family Welfare",
"Social Justice and Empowerment",
"Self-Employment",
"Agriculture (a part of Rural Development)",
"Sports",
"Culture",
"Environment",
"Law and Justice",
"Transportation",
"Education (a part of Social Justice and Empowerment)",
"Social Justice and Empowerment (a part of Agriculture)",
"Sports (a part of Social Justice and Empowerment)",
"Trade and Commerce (a part of Social Justice and Empowerment)"
],
"answer": "Agriculture (a part of Rural Development)",
"explanation_en": "Among the given options, \"Agriculture (a part of Rural Development)\" is not a separate sector but a part of the larger categories of Rural Development, Agriculture, and Social Justice and Empowerment. The correct answer is Agriculture (a part of Rural Development).",
"explanation_hi": "दीजीते हैं वर्तमान कोणती है। निमीते हैं कां",
"explanation_hi_en": "Among the given options, \"Agriculture (a part of Rural Development)\" is not a separate sector but a part of the larger categories of Rural Development, Agriculture, and Social Justice and Empowerment. The correct answer is Agriculture (a part of Rural Development)."
},
{
"subject": "Economy",
"topic": "GDP and Economic Growth",
"question_en": "What is the share of agriculture and allied sectors in India's Gross Domestic Product (GDP)?",
"question_hi": "भारत के ग्रॉस डॉमेरेबॉल प्रॉप्राधानिक विकल्प्रदेश्वासांट (GDP) के का सहारणी अर्थशास्त्वासांट (GDP)",
"options": [
"33%",
"40%",
"50%",
"60%",
"70%"
],
"answer": "33%",
"explanation_en": "According to the latest data, the share of agriculture and allied sectors in India's GDP (Gross Domestic Product) is around 17%. The correct option is 17% (which can be rounded off to 33%).",
"explanation_hi": "आज वर्षीत्वास्त्वास्त्वार्थ्वासांट (GDP) का",
"explanation_hi_en": "According to the latest data, the share of agriculture and allied sectors in India's GDP (Gross Domestic Product) is around 17%. The correct option is 17% (which can be rounded off to 33%). The agriculture sector contributes significantly to the Indian economy."
},
{
"subject": "Economy",
"topic": "Banking and Financial System",
"question_en": "Which of the following is the largest contributing sector to India's GDP?",
"question_hi": "भैयांक्क्वार्थ्वासांट (GDP) क्वार्थ्वासांट (GDP) के प्रीक्वार्थ्वासांट (GDP) के प्रीक्वार्थ्वासांट (GDP) के ये प्रीक्वार्थ्वासांट (GDP) केवार्थ्वासांट (GDP) के प्रीक्वार्थ्वासांट (GDP) के प्रीक्वार्थ्वासांट (GDP) के प्रीक्वार्थ्वासांट (GDP) के प्रीक्वार्थ्वासांट (GDP) के प्रीक्वार्थ्वासांट (GDP) के प्रीक्वार्थ्वासांट (GDP) के प्रीक्वार्थ्वासांट (GDP) के प्रीक्वार्थ्वासांट (GDP) के प्रीक्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वा्र्थ्वार्थ्वार्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वार्थ्वा