[
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the primary function of monetary policy in an economy?",
"question_hi": "एक अर्थव्यवस्था में मौद्रिक नीति का प्राथमिक कार्य क्या है?",
"A_en": "To control inflation", "A_hi": "ब्याज दरों को नियंत्रित करना",
"B_en": "To regulate interest rates", "B_hi": "ब्याज दरों को नियंत्रित करना",
"C_en": "To control unemployment", "C_hi": "रोजगार को नियंत्रित करना",
"D_en": "To promote economic growth", "D_hi": "आर्थिक विकास को बढ़ावा देना",
"answer": "B",
"explanation_en": "Monetary policy is primarily used to regulate interest rates and control inflation.",
"explanation_hi": "मौद्रिक नीति का प्राथमिक उपयोग ब्याज दरों को नियंत्रित करना और ब्याज दरों को नियंत्रित करना है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the law of diminishing marginal utility?",
"question_hi": "क्या है मार्जिनल उपयोगिता का कमी का नियम?",
"A_en": "As the quantity of a good increases, its price also increases", "A_hi": "सामान की मात्रा बढ़ने के साथ, उसकी कीमत भी बढ़ती है",
"B_en": "As the quantity of a good increases, its price remains constant", "B_hi": "सामान की मात्रा बढ़ने के साथ, उसकी कीमत स्थिर रहती है",
"C_en": "As the quantity of a good increases, its price decreases", "C_hi": "सामान की मात्रा बढ़ने के साथ, उसकी कीमत घटती है",
"D_en": "As the quantity of a good increases, its utility also increases", "D_hi": "सामान की मात्रा बढ़ने के साथ, उसकी उपयोगिता भी बढ़ती है",
"answer": "C",
"explanation_en": "The law of diminishing marginal utility states that as the quantity of a good increases, its utility decreases.",
"explanation_hi": "मार्जिनल उपयोगिता का कमी का नियम यह कहता है कि सामान की मात्रा बढ़ने के साथ, उसकी उपयोगिता कम होती है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the concept of comparative advantage?",
"question_hi": "क्या है तुलनात्मक लाभ का सिद्धांत?",
"A_en": "A country should specialize in producing goods in which it has absolute advantage", "A_hi": "एक देश उस सामान में विशेषज्ञता होनी चाहिए जिसमें वह पूर्ण लाभ हासिल करता है",
"B_en": "A country should specialize in producing goods in which it has comparative advantage", "B_hi": "एक देश उस सामान में विशेषज्ञता होनी चाहिए जिसमें वह तुलनात्मक लाभ हासिल करता है",
"C_en": "A country should not engage in international trade", "C_hi": "एक देश अंतर्राष्ट्रीय व्यापार में शामिल नहीं होना चाहिए",
"D_en": "A country should produce all goods domestically", "D_hi": "एक देश सभी सामान घरेलू रूप से उत्पन्न करना चाहिए",
"answer": "B",
"explanation_en": "Comparative advantage is the concept that a country should specialize in producing goods in which it has a lower opportunity cost.",
"explanation_hi": "तुलनात्मक लाभ सिद्धांत यह है कि एक देश उस सामान में विशेषज्ञता होनी चाहिए जिसमें उसकी कम अवसर लागत होती है।"
},
{
"subject": "Economy",
"topic": "GDP",
"question_en": "What is the formula for calculating GDP?",
"question_hi": "क्या है जीडीपी की गणना के लिए सूत्र?",
"A_en": "GDP = C + I + G + (X - M)", "A_hi": "जीडीपी = सी + आई + जी + (एक्स - एम)",
"B_en": "GDP = C + I + (X - M)", "B_hi": "जीडीपी = सी + आई + (एक्स - एम)",
"C_en": "GDP = C + (X - M)", "C_hi": "जीडीपी = सी + (एक्स - एम)",
"D_en": "GDP = I + (X - M)", "D_hi": "जीडीपी = आई + (एक्स - एम)",
"answer": "A",
"explanation_en": "The formula for calculating GDP is GDP = C + I + G + (X - M), where C is consumption, I is investment, G is government spending, X is exports, and M is imports.",
"explanation_hi": "जीडीपी की गणना के लिए सूत्र है जीडीपी = सी + आई + जी + (एक्स - एम), जहां सी उपभोग, आई निवेश, जी सरकारी व्यय, एक्स निर्यात, और एम आयात है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the difference between demand-pull inflation and cost-push inflation?",
"question_hi": "क्या है मांग की पलना और लागत की पलना के बीच अंतर?",
"A_en": "Demand-pull inflation is caused by an increase in aggregate demand, while cost-push inflation is caused by an increase in production costs", "A_hi": "मांग की पलना मांग के कारण होती है, जबकि लागत की पलना उत्पादन लागत के कारण होती है",
"B_en": "Demand-pull inflation is caused by a decrease in aggregate demand, while cost-push inflation is caused by a decrease in production costs", "B_hi": "मांग की पलना मांग के कारण होती है, जबकि लागत की पलना उत्पादन लागत के कारण होती है",
"C_en": "Demand-pull inflation is caused by an increase in production costs, while cost-push inflation is caused by an increase in aggregate demand", "C_hi": "मांग की पलना उत्पादन लागत के कारण होती है, जबकि लागत की पलना मांग के कारण होती है",
"D_en": "Demand-pull inflation and cost-push inflation are the same thing", "D_hi": "मांग की पलना और लागत की पलना एक ही चीज़ है",
"answer": "A",
"explanation_en": "Demand-pull inflation is caused by an increase in aggregate demand, while cost-push inflation is caused by an increase in production costs.",
"explanation_hi": "मांग की पलना मांग के कारण होती है, जबकि लागत की पलना उत्पादन लागत के कारण होती है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the primary goal of fiscal policy?",
"question_hi": "क्या है कार्यकारी नीति का प्राथमिक उद्देश्य?",
"A_en": "To control inflation", "A_hi": "ब्याज दरों को नियंत्रित करना",
"B_en": "To promote economic growth", "B_hi": "आर्थिक विकास को बढ़ावा देना",
"C_en": "To reduce unemployment", "C_hi": "रोजगार को कम करना",
"D_en": "To balance the budget", "D_hi": "सालाना बजट को संतुलित करना",
"answer": "B",
"explanation_en": "The primary goal of fiscal policy is to promote economic growth and stability.",
"explanation_hi": "कार्यकारी नीति का प्राथमिक उद्देश्य आर्थिक विकास और स्थिरता को बढ़ावा देना है।"
},
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the concept of national income?",
"question_hi": "क्या है राष्ट्रीय आय का सिद्धांत?",
"A_en": "The total value of all goods and services produced within a country", "A_hi": "एक देश में उत्पादित सभी सामानों और सेवाओं की कुल मूल्य",
"B_en": "The total value of all goods and services consumed within a country", "B_hi": "एक देश में उपभोग की जाने वाली सभी सामानों और सेवाओं की कुल मूल्य",
"C_en": "The total value of all goods and services exported by a country", "C_hi": "एक देश द्वारा निर्यात की जाने वाली सभी सामानों और सेवाओं की कुल मूल्य",
"D_en": "The total value of all goods and services imported by a country", "D_hi": "एक देश द्वारा आयात की जाने वाली सभी सामानों और सेवाओं की कुल मूल्य",
"answer": "A",
"explanation_en": "National income is the total value of all goods and services produced within a country.",
"explanation_hi": "राष्ट्रीय आय एक देश में उत्पादित सभी सामानों और सेवाओं की कुल मूल्य है।"
},
{
"subject": "Economy",
"topic": "Unemployment",
"question_en": "What is the concept of structural unemployment?",
"question_hi": "क्या है संरचनात्मक रोजगार का सिद्धांत?",
"A_en": "Unemployment caused by a mismatch between the skills of workers and the requirements of the job market", "A_hi": "कर्मचारियों की कौशल और नौकरी बाजार की आवश्यकताओं के बीच असंगति के कारण होने वाली रोजगार",
"B_en": "Unemployment caused by a decrease in aggregate demand", "B_hi": "मांग की कमी के कारण होने वाली रोजगार",
"C_en": "Unemployment caused by an increase in production costs", "C_hi": "उत्पादन लागत के बढ़ने के कारण होने वाली रोजगार",
"D_en": "Unemployment caused by a lack of education and training", "D_hi": "शिक्षा और प्रशिक्षण की कमी के कारण होने वाली रोजगार",
"answer": "A",
"explanation_en": "Structural unemployment is caused by a mismatch between the skills of workers and the requirements of the job market.",
"explanation_hi": "संरचनात्मक रोजगार कर्मचारियों की कौशल और नौकरी बाजार की आवश्यकताओं के बीच असंगति के कारण होता है।"
},
{
"subject": "Economy",
"topic": "Gross Domestic Product (GDP)",
"question_en": "What is the difference between GDP and GNP?",
"question_hi": "क्या है जीडीपी और जीएनपी के बीच अंतर?",
"A_en": "GDP includes only domestic production, while GNP includes both domestic and foreign production", "A_hi": "जीडीपी केवल घरेलू उत्पादन को शामिल करता है, जबकि जीएनपी घरेलू और विदेशी उत्पादन दोनों को शामिल करता है",
"B_en": "GDP includes only foreign production, while GNP includes both domestic and foreign production", "B_hi": "जीडीपी केवल विदेशी उत्पादन को शामिल करता है, जबकि जीएनपी घरेलू और विदेशी उत्पादन दोनों को शामिल करता है",
"C_en": "GDP and GNP are the same", "C_hi": "जीडीपी और जीएनपी एक ही है",
"D_en": "GDP is higher than GNP", "D_hi": "जीडीपी जीएनपी से अधिक है",
"answer": "A",
"explanation_en": "GDP includes only domestic production, while GNP includes both domestic and foreign production.",
"explanation_hi": "जीडीपी केवल घरेलू उत्पादन को शामिल करता है, जबकि जीएनपी घरेलू और विदेशी उत्पादन दोनों को शामिल करता है।"
}