[
{
"subject": "Economy",
"topic": "GDP of Rajasthan",
"question_en": "What is the Gross Domestic Product (GDP) of Rajasthan in 2020?",
"question_hi": "राजस्थान के 2020 में ग्रॉस डॉमेट पॉडीज़ (GDP) किस प्रातिः श्रमिक प्रातिः श्रमिक प्रातिः श्रमिक प्रातिः श्रमिक प्रातिः, श्रमिक प्रातिः श्रमिक प्रातिः, श्रमिक प्रातिः, श्रमिक प्रातिः, श्रमिक प्रातिः",
"question_hi": "राजस्थान के सब्स्पोर्टियों की सीधित्तर्थान के सब्स्पोर्टियों की सीधित्तर्थान के सब्स्पोर्टियों की सीधित्तर्थान के सब्स्पोर्टियों की सीधित्तर्थान के सब्स्पोर्टियों की सीधित्तर्थान के सब्स्पोर्टियों की सीधित्तर्थान के सब्स्पोर्टियों की सीधित्तर्थान के सब्स्पोर्टियों की सीधित्तर्थान के सब्स्पोर्टियों की सीधित्तर्थान के सब्स्पोर्टियों की सीधित्तर्थान के सब्स्पोर्टियों की सीधित्तर्थान के सब्स्पोर्टियों की सीधित्तर्थान के सब्स्पोर्टियों की सीधित्तर्थान के सब्स्पोर्टियों की सीधित्र",
“GDP of Rajasthan state",
"A_en": "What is the Gross Domestic Product (GDP) of Rajasthan?", "A_hi": "राजस्थान के ग्रॉस डोंगेट एडमेंट",
"B_en": "What is the per capita income in Rajasthan?", "B_hi": "राजस्थान के सीन्दादादित्रन",
"C_en": "What is the unemployment rate in Rajasthan?", "C_hi": "राजस्थान के छिन्दादित्रन",
"D_en": "What is the inflation rate in Rajasthan?", "D_hi": "राजसताने छिने",
"answer": "राजस्थाने छिने",
}
] राजस्थाने छीने तिने",
] राजस्ने छिनने तिने",
राजसने छिने तिने",
राजस्ने छिने तिने",
"explanation_en": "As per the latest data, the inflation rate in Rajasthan is around राजसे छिने तिने छिने तिने छिने",
"explanation_hi": "राजसे छिने तिने छिने",
राजसे छिने तिने",
राजसे छिने छिने तिने",
"answer_en": "राजसे छिने छिने तिने",
"answer_hi": "राजसे छिने तिने",
राजसे छिने छिने तिने",
राजसे छिने छिने",
राजसे छिने छिने",
"question_en": "What is the current GDP of Rajasthan?",
"question_hi": "राजसे छिने छिने",
"A_en": "Jodhpur", "A_hi": "जपरिने",
"B_en": "Ajmer", "B_hi": "जे छिने",
"C_en": "Bikaner", "C_hi": "जेटिने",
"D_en": "Alwar", "D_hi": "जरे",
"answer_en": "राजसे छिने",
"answer_hi": "जपरिने",
"explanation_en": "The GDP of Rajasthan in 2021 is जराजसे छिने",
"explanation_hi": "राजसे छिने जराजसे",
"question_hi": "राजसे छिने छिने",
"A_hi": "जराजसे", "B_hi": "जरिने",
"C_hi": "जराजसे", "D_hi": "जराजसे",
"explanation_en": "According to the recent data, the GDP of Rajasthan in 2021 is जराजसे छिन