[
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "Which of the following is a characteristic of a perfectly competitive market?",
"question_hi": "पूर्ण प्रतिस्पर्धी बाजार का कोई विशेषता क्या है?",
"A_en": "Monopoly", "A_hi": "मोनोपोली",
"B_en": "Perfect competition", "B_hi": "पूर्ण प्रतिस्पर्धी",
"C_en": "Oligopoly", "C_hi": "ऑलिगोपोली",
"D_en": "Monopsony", "D_hi": "मोनोप्सनी",
"answer": "B",
"explanation_en": "A perfectly competitive market is characterized by many firms producing a homogeneous product, free entry and exit, and perfect information.",
"explanation_hi": "पूर्ण प्रतिस्पर्धी बाजार में कई कंपनियाँ एक समान उत्पाद का उत्पादन करती हैं, मुक्त प्रवेश और निकास, और आदर्श जानकारी होती है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the law of diminishing marginal utility?",
"question_hi": "आंशिक उपयोगिता का घटता सीमा कानून क्या है?",
"A_en": "As the quantity of a good increases, its price also increases.",
"A_hi": "उत्पाद की मात्रा बढ़ती जा रही है, इसकी कीमत भी बढ़ती जा रही है।",
"B_en": "As the quantity of a good increases, the marginal utility also increases.",
"B_hi": "उत्पाद की मात्रा बढ़ती जा रही है, इसकी आंशिक उपयोगिता भी बढ़ती जा रही है।",
"C_en": "As the quantity of a good increases, the marginal utility decreases.",
"C_hi": "उत्पाद की मात्रा बढ़ती जा रही है, इसकी आंशिक उपयोगिता घटती जा रही है।",
"D_en": "As the quantity of a good increases, the price remains constant.",
"D_hi": "उत्पाद की मात्रा बढ़ती जा रही है, इसकी कीमत स्थिर रहती है।",
"answer": "C",
"explanation_en": "The law of diminishing marginal utility states that as the quantity of a good increases, the marginal utility decreases.",
"explanation_hi": "आंशिक उपयोगिता का घटता सीमा कानून के अनुसार, उत्पाद की मात्रा बढ़ती जा रही है, इसकी आंशिक उपयोगिता घटती जा रही है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the main advantage of free trade?",
"question_hi": "मुक्त व्यापार का मुख्य लाभ क्या है?",
"A_en": "Increased government revenue",
"A_hi": "सरकार की आय में वृद्धि",
"B_en": "Increased consumer surplus",
"B_hi": "ग्राहकों की लाभांश में वृद्धि",
"C_en": "Increased government control",
"C_hi": "सरकार का नियंत्रण बढ़ जाता है।",
"D_en": "Increased efficiency and lower prices",
"D_hi": "कार्य क्षमता में वृद्धि और कम कीमतें",
"answer": "D",
"explanation_en": "Free trade leads to increased efficiency and lower prices due to competition and specialization.",
"explanation_hi": "मुक्त व्यापार प्रतिस्पर्धा और विशेषज्ञता के कारण कार्य क्षमता में वृद्धि और कम कीमतें लाता है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the primary goal of monetary policy?",
"question_hi": "वित्तीय नीति का मुख्य लक्ष्य क्या है?",
"A_en": "To control inflation",
"A_hi": "चालuflation को नियंत्रित करना",
"B_en": "To control unemployment",
"B_hi": "बेरोजगारी को नियंत्रित करना",
"C_en": "To control economic growth",
"C_hi": "आर्थिक विकास को नियंत्रित करना",
"D_en": "To maintain price stability and full employment",
"D_hi": "मूल्य स्थिरता और पूर्ण रोजगार बनाए रखना",
"answer": "D",
"explanation_en": "Monetary policy aims to maintain price stability and full employment by adjusting interest rates and money supply.",
"explanation_hi": "वित्तीय नीति मूल्य स्थिरता और पूर्ण रोजगार बनाए रखने के लिए ब्याज दरों और पैसे की आपूर्ति को समायोजित करके काम करती है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the primary tool of fiscal policy?",
"question_hi": "वित्तीय नीति का मुख्य औजार क्या है?",
"A_en": "Government spending",
"A_hi": "सरकारी खर्च",
"B_en": "Taxation",
"B_hi": "कर",
"C_en": "Monetary policy",
"C_hi": "वित्तीय नीति",
"D_en": "Fiscal policy",
"D_hi": "वित्तीय नीति",
"answer": "A",
"explanation_en": "Government spending is the primary tool of fiscal policy, used to stimulate economic growth and stabilize the economy.",
"explanation_hi": "सरकारी खर्च वित्तीय नीति का मुख्य औजार है, जिसका उपयोग आर्थिक विकास को प्रेरित करने और अर्थव्यवस्था को स्थिर करने के लिए किया जाता है।"
},
{
"subject": "Economy",
"topic": "GDP",
"question_en": "What is the formula for calculating GDP?",
"question_hi": "जीडीपी की गणना करने का सूत्र क्या है?",
"A_en": "C + I + G + (X - M)",
"A_hi": "सी + आइ + जी + (एक्स - एम)",
"B_en": "C + I + G + X",
"B_hi": "सी + आइ + जी + एक्स",
"C_en": "C + I + G - (X - M)",
"C_hi": "सी + आइ + जी - (एक्स - एम)",
"D_en": "C + I + G + X + M",
"D_hi": "सी + आइ + जी + एक्स + एम",
"answer": "A",
"explanation_en": "The formula for calculating GDP is C + I + G + (X - M), where C is consumption, I is investment, G is government spending, X is exports, and M is imports.",
"explanation_hi": "जीडीपी की गणना करने का सूत्र सी + आइ + जी + (एक्स - एम) है, जहां सी उपभोग, आइ निवेश, जी सरकारी खर्च, एक्स निर्यात, और एम आयात है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the definition of inflation?",
"question_hi": "फ्लेटिंग का परिभाषा क्या है?",
"A_en": "A decrease in the general price level",
"A_hi": "सामान्य कीमत स्तर में कमी",
"B_en": "An increase in the general price level",
"B_hi": "सामान्य कीमत स्तर में वृद्धि",
"C_en": "A decrease in the general price level and a decrease in the money supply",
"C_hi": "सामान्य कीमत स्तर में कमी और पैसे की आपूर्ति में कमी",
"D_en": "An increase in the general price level and a decrease in the money supply",
"D_hi": "सामान्य कीमत स्तर में वृद्धि और पैसे की आपूर्ति में कमी",
"answer": "B",
"explanation_en": "Inflation is a sustained increase in the general price level of goods and services in an economy over time.",
"explanation_hi": "फ्लेटिंग एक अर्थव्यवस्था में समय के साथ सामान्य कीमत स्तर के विस्तारित वृद्धि है।"
},
{
"subject": "Economy",
"topic": "Unemployment",
"question_en": "What is the definition of structural unemployment?",
"question_hi": "संरचनात्मक बेरोजगारी का परिभाषा क्या है?",
"A_en": "The number of people unemployed due to a lack of skills or education",
"A_hi": "अभाव के कारण कौशल या शिक्षा से जुड़े लोगों की संख्या बेरोजगार",
"B_en": "The number of people unemployed due to a lack of jobs",
"B_hi": "कमी के कारण नौकरियों के अभाव में लोगों की संख्या बेरोजगार",
"C_en": "The number of people unemployed due to a mismatch between the skills they have and the skills required by employers",
"C_hi": "लोगों के कौशल और मांगकर्ताओं द्वारा आवश्यक कौशल के बीच भेद के कारण बेरोजगारी",
"D_en": "The number of people unemployed due to a lack of economic growth",
"D_hi": "आर्थिक विकास की कमी के कारण लोगों की संख्या बेरोजगार",
"answer": "C",
"explanation_en": "Structural unemployment occurs when there is a mismatch between the skills people have and the skills required by employers.",
"explanation_hi": "संरचनात्मक बेरोजगारी तब होती है जब लोगों के पास होने वाले कौशल और मांगकर्ताओं द्वारा आवश्यक कौशल के बीच भेद होता है।"
},
{
"subject": "Economy",
"topic": "Gross Domestic Product (GDP)",
"question_en": "What is the difference between GDP and GNP?",
"question_hi": "जीडीपी और जीएनपी के बीच अंतर क्या है?",
"A_en": "GDP measures the value of goods and services produced within a country, while GNP measures the value of goods and services produced by citizens of a country living abroad.",
"A_hi": "जीडीपी एक देश में उत्पादित सामान और सेवाओं के मूल्य को मापता है, जबकि जीएनपी एक देश के नागरिकों द्वारा विदेशों में रहने वाले देश में उत्पादित सामान और सेवाओं के मूल्य को मापता है।",
"B_en": "GDP measures the value of goods and services produced by citizens of a country, while GNP measures the value of goods and services produced within a country.",
"B_hi": "जीडीपी एक देश के नागरिकों द्वारा उत्पादित सामान और सेवाओं के मूल्य को मापता है, जबकि जीएनपी एक देश में उत्पादित सामान और सेवाओं के मूल्य को मापता है।",
"C_en": "GDP measures the value of goods and services produced by citizens of a country and foreigners living in the country, while GNP measures the value of goods and services produced within a country.",
"C_hi": "जीडीपी एक देश के नागरिकों द्वारा और विदेशी निवासी द्वारा उत्पादित सामान और सेवाओं के मूल्य को मापता है, जबकि जीएनपी एक देश में उत्पादित सामान और सेवाओं के मूल्य को मापता है।",
"D_en": "GDP measures the value of goods and services produced by foreigners living in a country, while GNP measures the value of goods and services produced by citizens of a country.",
"D_hi": "जीडीपी एक देश में रहने वाले विदेशी नागरिकों द्वारा उत्पादित सामान और सेवाओं के मूल्य को मापता है, जबकि जीएनपी एक देश के नागरिकों द्वारा उत्पादित सामान और सेवाओं के मूल्य को मापता है।",
"answer": "A",
"explanation_en": "GDP measures the value of goods and services produced within a country, while GNP measures the value of goods and services produced by citizens of a country living abroad.",
"explanation_hi": "जीडीपी एक देश में उत्पादित सामान और सेवाओं के मूल्य को मापता है, जबकि जीएनपी एक देश के नागरिकों द्वारा विदेशों में रहने वाले देश में उत्पादित सामान और सेवाओं के मूल्य को मापता है।"
}
]