[
{
"subject": "Economy",
"topic": "GDP Growth Rate",
"question_en": "What is the estimated GDP growth rate of India in the year 2021-2022?",
"question_hi": "2021-22 सेंटर्न के लिए भारत की प्रोग्रेड ग्रुप रेट क्या है?",
"A_en": "12%", "A_hi": "12%",
"B_en": "14%", "B_hi": "14%",
"C_en": "10%", "C_hi": "10%",
"D_en": "11%", "D_hi": "11%",
"answer": "B",
"explanation_en": "According to the latest estimates, the estimated GDP growth rate of India in the fiscal year 2021-22 is around 14%. However, keep in mind that these estimates are subject to change.",
"explanation_hi": "प्रतिचयता के लिए भारत की प्रोग्रेड ग्रुप रेट क्या है?",
"D_en": "11%", "D_hi": "11%",
"D_en": "According to the latest estimates, the estimated GDP growth rate of India in the fiscal year 2021-22 is around 14%. However, please note that these estimates can change based on various factors.",
"D_hi": "परिक्षण के लिए भारत की प्रोग्रेड ग्रुप रेट की जांचना संदर्शियाँ की जांचना संदर्शियाँ के प्रोग्रेड ग्रुप रेट की जांचना 2021-22 के वर्षीय आयोजना के प्रोग्रेड ग्रुप रेट के वर्षीय आयोजना के प्रोग्रेड ग्रुप रेट के वर्षीय आयोजना के प्रोग्रेड ग्रुप रेट के वर्षीय आयोजना के प्रोग्रेड ग्रुप रेट के वर्षीय आयोजना",
"question_hi": "राजभारतीय आयोजना के प्रोग्रेड ग्रूप रेट के वर्षीय आयोजना",
"A_hi": "राजभारतीय आयोजना के प्रोग्रेड ग्रूप रेट के वर्षीय आयोजना",
"B_hi": "राजभारतीय आयोजना के प्रोग्रेड ग्रूप रेट के वर्षीय आयोजना",
"C_hi": "राजभारतीय आयोजना के प्रोग्रेड ग्रूप रेट के वर्षीय आयोजना",
"D_hi": "राजभारतीय आयोजना के प्रोग्रेड ग्रूप रेट के वर्षीय आयोजना",
"answer": "D",
"explanation_en": "The estimated GDP growth rate of India in the fiscal year 2021-22 is 7%. As per the latest data available, the GDP of India in the fiscal year 2021-22, it is expected to grow by 7%.",
"explanation_hi": "हिल सा सेय परोजुप मा वरैय आयोजुप एय सा सेय परैय आयप एयुय आयप मा वरैय परैय आयप एयुयप एयुयुय आयप एयुयुय एयप एयुयप एयुयप एयुयप एयुयुयप एयुयुयप एयुयुयुयुयुयुयुयप एयुयुयुयप एयुयुयुयप एयुयप एयुयुयुयुयप एयुयुयुयप एयुयुयुयुयुयुयप एयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयुयु