[
{
"subject": "Economy",
"topic": "GDP और NNP",
"question_en": "NNP (Net National Product) kya hai?",
"question_hi": "एनएनपी (नेट नेशनल प्रोडक्ट) क्या है?",
"A_en": "NNP ek prakriya hai jismein GDP mein interest aur dividend shamil kiye jate hain.",
"A_hi": "एनएनपी एक प्रक्रिया है जिसमें जीडीपी में ब्याज और डिविडेंड शामिल किए जाते हैं।",
"B_en": "NNP ek prakriya hai jismein GDP mein kucch aavashyak kharch shamil kiye jate hain.",
"B_hi": "एनएनपी एक प्रक्रिया है जिसमें जीडीपी में कुछ आवश्यक खर्च शामिल किए जाते हैं।",
"C_en": "NNP ek prakriya hai jismein GDP mein vyaktigat kharch shamil kiye jate hain.",
"C_hi": "एनएनपी एक प्रक्रिया है जिसमें जीडीपी में व्यक्तिगत खर्च शामिल किए जाते हैं।",
"D_en": "NNP ek prakriya hai jismein GDP mein prashasanik kharch shamil kiye jate hain.",
"D_hi": "एनएनपी एक प्रक्रिया है जिसमें जीडीपी में प्रशासनिक खर्च शामिल किए जाते हैं।",
"answer": "A",
"explanation_en": "NNP ek prakriya hai jismein GDP mein interest aur dividend shamil kiye jate hain.",
"explanation_hi": "एनएनपी एक प्रक्रिया है जिसमें जीडीपी में ब्याज और डिविडेंड शामिल किए जाते हैं।"
},
{
"subject": "Economy",
"topic": "Agriculture",
"question_en": "Kisan Vikas Patra (KVP) ka upyog kis kshetra mein kiya jata hai?",
"question_hi": "किसान विकास पत्र (केवीपी) का उपयोग किस क्षेत्र में किया जाता है?",
"A_en": "Agriculture",
"A_hi": "कृषि",
"B_en": "Industry",
"B_hi": "उद्योग",
"C_en": "Service Sector",
"C_hi": "सेवा क्षेत्र",
"D_en": "Social Welfare",
"D_hi": "सामाजिक कल्याण",
"answer": "A",
"explanation_en": "Kisan Vikas Patra (KVP) ka upyog kisanon ki madad ke liye kiya jata hai.",
"explanation_hi": "किसान विकास पत्र (केवीपी) का उपयोग किसानों की मदद के लिए किया जाता है।"
},
{
"subject": "Economy",
"topic": "Economic Indicators",
"question_en": "Inflation ki ghataktaa kya hai?",
"question_hi": "इन्फ्लेशन की घातकता क्या है?",
"A_en": "Inflation ki ghataktaa ek prakriya hai jismein mooly ke mulya badh jate hain.",
"A_hi": "इन्फ्लेशन की घातकता एक प्रक्रिया है जिसमें मूल्य के मूल्य बढ़ जाते हैं।",
"B_en": "Inflation ki ghataktaa ek prakriya hai jismein mooly ke mulya kam hote hain.",
"B_hi": "इन्फ्लेशन की घातकता एक प्रक्रिया है जिसमें मूल्य के मूल्य कम होते हैं।",
"C_en": "Inflation ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan theek se hota hai.",
"C_hi": "इन्फ्लेशन की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन ठीक से होता है।",
"D_en": "Inflation ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan galat ho jata hai.",
"D_hi": "इन्फ्लेशन की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन गलत हो जाता है।",
"answer": "A",
"explanation_en": "Inflation ki ghataktaa ek prakriya hai jismein mooly ke mulya badh jate hain.",
"explanation_hi": "इन्फ्लेशन की घातकता एक प्रक्रिया है जिसमें मूल्य के मूल्य बढ़ जाते हैं।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "Monetary Policy ki madad se kya kiya ja sakta hai?",
"question_hi": "मनीषी नीति की मदद से क्या किया जा सकता है?",
"A_en": "Monetary Policy ki madad se inflation ki ghataktaa kam ki ja sakti hai.",
"A_hi": "मनीषी नीति की मदद से इन्फ्लेशन की घातकता कम की जा सकती है।",
"B_en": "Monetary Policy ki madad se economy ka sanchalan theek se hota hai.",
"B_hi": "मनीषी नीति की मदद से अर्थव्यवस्था का संचालन ठीक से होता है।",
"C_en": "Monetary Policy ki madad se unemployment ki sthiti badh sakti hai.",
"C_hi": "मनीषी नीति की मदद से बेरोजगारी की स्थिति बढ़ सकती है।",
"D_en": "Monetary Policy ki madad se inflation ki ghataktaa badh sakti hai.",
"D_hi": "मनीषी नीति की मदद से इन्फ्लेशन की घातकता बढ़ सकती है।",
"answer": "A",
"explanation_en": "Monetary Policy ki madad se inflation ki ghataktaa kam ki ja sakti hai.",
"explanation_hi": "मनीषी नीति की मदद से इन्फ्लेशन की घातकता कम की जा सकती है।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "Public Finance ke madhyam se kya kiya ja sakta hai?",
"question_hi": "सार्वजनिक वित्त के माध्यम से क्या किया जा सकता है?",
"A_en": "Public Finance ke madhyam se arthvyavastha ka sanchalan theek se hota hai.",
"A_hi": "सार्वजनिक वित्त के माध्यम से अर्थव्यवस्था का संचालन ठीक से होता है।",
"B_en": "Public Finance ke madhyam se public services ki sambhavana badh sakti hai.",
"B_hi": "सार्वजनिक वित्त के माध्यम से सार्वजनिक सेवाओं की संभावना बढ़ सकती है।",
"C_en": "Public Finance ke madhyam se inflation ki ghataktaa kam ki ja sakti hai.",
"C_hi": "सार्वजनिक वित्त के माध्यम से इन्फ्लेशन की घातकता कम की जा सकती है।",
"D_en": "Public Finance ke madhyam se unemployment ki sthiti badh sakti hai.",
"D_hi": "सार्वजनिक वित्त के माध्यम से बेरोजगारी की स्थिति बढ़ सकती है।",
"answer": "B",
"explanation_en": "Public Finance ke madhyam se public services ki sambhavana badh sakti hai.",
"explanation_hi": "सार्वजनिक वित्त के माध्यम से सार्वजनिक सेवाओं की संभावना बढ़ सकती है।"
},
{
"subject": "Economy",
"topic": "Economic Growth",
"question_en": "Economic Growth ki ghataktaa kya hai?",
"question_hi": "आर्थिक वृद्धि की घातकता क्या है?",
"A_en": "Economic Growth ki ghataktaa ek prakriya hai jismein mooly ki sthiti badhti hai.",
"A_hi": "आर्थिक वृद्धि की घातकता एक प्रक्रिया है जिसमें मूल्य की स्थिति बढ़ती है।",
"B_en": "Economic Growth ki ghataktaa ek prakriya hai jismein mooly ki sthiti kam hoti hai.",
"B_hi": "आर्थिक वृद्धि की घातकता एक प्रक्रिया है जिसमें मूल्य की स्थिति कम होती है।",
"C_en": "Economic Growth ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan theek se hota hai.",
"C_hi": "आर्थिक वृद्धि की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन ठीक से होता है।",
"D_en": "Economic Growth ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan galat ho jata hai.",
"D_hi": "आर्थिक वृद्धि की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन गलत हो जाता है।",
"answer": "A",
"explanation_en": "Economic Growth ki ghataktaa ek prakriya hai jismein mooly ki sthiti badhti hai.",
"explanation_hi": "आर्थिक वृद्धि की घातकता एक प्रक्रिया है जिसमें मूल्य की स्थिति बढ़ती है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "Monetary Policy ki ghataktaa kya hai?",
"question_hi": "मनीषी नीति की घातकता क्या है?",
"A_en": "Monetary Policy ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan theek se hota hai.",
"A_hi": "मनीषी नीति की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन ठीक से होता है।",
"B_en": "Monetary Policy ki ghataktaa ek prakriya hai jismein inflation ki ghataktaa kam ki ja sakti hai.",
"B_hi": "मनीषी नीति की घातकता एक प्रक्रिया है जिसमें इन्फ्लेशन की घातकता कम की जा सकती है।",
"C_en": "Monetary Policy ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan galat ho jata hai.",
"C_hi": "मनीषी नीति की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन गलत हो जाता है।",
"D_en": "Monetary Policy ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan theek se hota hai.",
"D_hi": "मनीषी नीति की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन ठीक से होता है।",
"answer": "A",
"explanation_en": "Monetary Policy ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan theek se hota hai.",
"explanation_hi": "मनीषी नीति की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन ठीक से होता है।"
},
{
"subject": "Economy",
"topic": "Economic Indicators",
"question_en": "GDP (Gross Domestic Product) ki ghataktaa kya hai?",
"question_hi": "जीडीपी (ग्रॉस डोमेस्टिक प्रोडक्ट) की घातकता क्या है?",
"A_en": "GDP ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan theek se hota hai.",
"A_hi": "जीडीपी की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन ठीक से होता है।",
"B_en": "GDP ki ghataktaa ek prakriya hai jismein inflation ki ghataktaa kam ki ja sakti hai.",
"B_hi": "जीडीपी की घातकता एक प्रक्रिया है जिसमें इन्फ्लेशन की घातकता कम की जा सकती है।",
"C_en": "GDP ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan galat ho jata hai.",
"C_hi": "जीडीपी की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन गलत हो जाता है।",
"D_en": "GDP ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan theek se hota hai.",
"D_hi": "जीडीपी की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन ठीक से होता है।",
"answer": "A",
"explanation_en": "GDP ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan theek se hota hai.",
"explanation_hi": "जीडीपी की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन ठीक से होता है।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "Public Finance ki ghataktaa kya hai?",
"question_hi": "सार्वजनिक वित्त की घातकता क्या है?",
"A_en": "Public Finance ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan theek se hota hai.",
"A_hi": "सार्वजनिक वित्त की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन ठीक से होता है।",
"B_en": "Public Finance ki ghataktaa ek prakriya hai jismein inflation ki ghataktaa kam ki ja sakti hai.",
"B_hi": "सार्वजनिक वित्त की घातकता एक प्रक्रिया है जिसमें इन्फ्लेशन की घातकता कम की जा सकती है।",
"C_en": "Public Finance ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan galat ho jata hai.",
"C_hi": "सार्वजनिक वित्त की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन गलत हो जाता है।",
"D_en": "Public Finance ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan theek se hota hai.",
"D_hi": "सार्वजनिक वित्त की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन ठीक से होता है।",
"answer": "A",
"explanation_en": "Public Finance ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan theek se hota hai.",
"explanation_hi": "सार्वजनिक वित्त की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन ठीक से होता है।"
},
{
"subject": "Economy",
"topic": "Economic Growth",
"question_en": "Economic Growth ki ghataktaa kya hai?",
"question_hi": "आर्थिक वृद्धि की घातकता क्या है?",
"A_en": "Economic Growth ki ghataktaa ek prakriya hai jismein arthvyavastha ka sanchalan theek se hota hai.",
"A_hi": "आर्थिक वृद्धि की घातकता एक प्रक्रिया है जिसमें अर्थव्यवस्था का संचालन ठीक से होता है।",
"B_en": "Economic Growth ki ghataktaa ek prakriya hai jismein inflation ki ghataktaa kam ki ja sakti