[
{
"subject": "Economy",
"topic": "National Income and Expenditure",
"question_en": "What is the main difference between Gross National Product (GNP) and Gross Domestic Product (GDP)?",
"question_hi": "ग्रोस नेशनल प्रोडक्ट (जीएनपी) और ग्रोस डोमेस्टिक प्रोडक्ट (जीडीपी) में मुख्य अंतर क्या है?",
"A_en": "GNP only includes domestic production, while GDP includes international transactions.", 
"A_hi": "जीएनपी में केवल घरेलू उत्पादन शामिल होता है, जबकि जीडीपी में अंतरराष्ट्रीय लेनदेन शामिल होते हैं।",
"B_en": "GNP includes international transactions, while GDP only includes domestic production.",
"B_hi": "जीएनपी में अंतरराष्ट्रीय लेनदेन शामिल होते हैं, जबकि जीडीपी में केवल घरेलू उत्पादन शामिल होता है।",
"C_en": "GNP is calculated at market price, while GDP is calculated at factor cost.",
"C_hi": "जीएनपी की गणना बाजार मूल्य पर की जाती है, जबकि जीडीपी की गणना कारक लागत पर की जाती है।",
"D_en": "GNP is a measure of national well-being, while GDP is a measure of national production.",
"D_hi": "जीएनपी राष्ट्रीय सुख का एक उपाय है, जबकि जीडीपी राष्ट्रीय उत्पादन का एक उपाय है।",
"answer": "A",
"explanation_en": "GNP includes international transactions, whereas GDP only includes domestic production.",
"explanation_hi": "जीएनपी में अंतरराष्ट्रीय लेनदेन शामिल होते हैं, जबकि जीडीपी में केवल घरेलू उत्पादन शामिल होता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the main advantage of free trade?",
"question_hi": "मुक्त व्यापार का मुख्य लाभ क्या है?",
"A_en": "Increased competition leads to higher prices.",
"A_hi": "वृद्धि हुई प्रतिस्पर्धा के कारण दाम बढ़ जाते हैं।",
"B_en": "Increased competition leads to lower prices.",
"B_hi": "वृद्धि हुई प्रतिस्पर्धा के कारण दाम कम हो जाते हैं।",
"C_en": "Free trade leads to a loss of jobs for workers in the domestic industry.",
"C_hi": "मुक्त व्यापार घरेलू उद्योग के कामगारों के लिए नौकरियों का नुकसान होता है।",
"D_en": "Free trade allows countries to specialize in their comparative advantage.",
"D_hi": "मुक्त व्यापार देशों को अपने तुलनात्मक लाभ में विशेषज्ञता प्राप्त करने की अनुमति देता है।",
"answer": "D",
"explanation_en": "Free trade allows countries to specialize in their comparative advantage, leading to increased efficiency and economic growth.",
"explanation_hi": "मुक्त व्यापार देशों को अपने तुलनात्मक लाभ में विशेषज्ञता प्राप्त करने की अनुमति देता है, जिससे कार्यक्षमता में वृद्धि और आर्थिक विकास होता है।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "What is the main difference between direct and indirect taxes?",
"question_hi": "सीधे और अप्रत्यक्ष करों में मुख्य अंतर क्या है?",
"A_en": "Direct taxes are paid by individuals, while indirect taxes are paid by businesses.",
"A_hi": "सीधे कर व्यक्तियों द्वारा दिए जाते हैं, जबकि अप्रत्यक्ष कर व्यवसायों द्वारा दिए जाते हैं।",
"B_en": "Direct taxes are paid by businesses, while indirect taxes are paid by individuals.",
"B_hi": "सीधे कर व्यवसायों द्वारा दिए जाते हैं, जबकि अप्रत्यक्ष कर व्यक्तियों द्वारा दिए जाते हैं।",
"C_en": "Direct taxes are levied on income, while indirect taxes are levied on consumption.",
"C_hi": "सीधे कर आय पर लगाए जाते हैं, जबकि अप्रत्यक्ष कर उपभोग पर लगाए जाते हैं।",
"D_en": "Direct taxes are used to finance government expenditure, while indirect taxes are used to finance government revenue.",
"D_hi": "सीधे कर सरकारी व्यय को वित्तपोषित करने के लिए उपयोग किए जाते हैं, जबकि अप्रत्यक्ष कर सरकारी राजस्व को वित्तपोषित करने के लिए उपयोग किए जाते हैं।",
"answer": "C",
"explanation_en": "Direct taxes are levied on income, while indirect taxes are levied on consumption.",
"explanation_hi": "सीधे कर आय पर लगाए जाते हैं, जबकि अप्रत्यक्ष कर उपभोग पर लगाए जाते हैं।"
},
{
"subject": "Economy",
"topic": "Monopoly",
"question_en": "What is the main characteristic of a monopoly?",
"question_hi": "एक मोनोपोली का मुख्य विशेषता क्या है?",
"A_en": "A single firm produces a good or service.",
"A_hi": "एक ही कंपनी एक वस्तु या सेवा उत्पादित करती है।",
"B_en": "A single firm has a significant share of the market.",
"B_hi": "एक ही कंपनी बाजार में महत्वपूर्ण हिस्सेदारी रखती है।",
"C_en": "A single firm is the only supplier of a good or service.",
"C_hi": "एक ही कंपनी एक ही वस्तु या सेवा का एकमात्र आपूर्तिकर्ता है।",
"D_en": "A single firm has a dominant position in the market.",
"D_hi": "एक ही कंपनी बाजार में हावी स्थिति रखती है।",
"answer": "C",
"explanation_en": "A single firm is the only supplier of a good or service, which gives it significant market power.",
"explanation_hi": "एक ही कंपनी एक ही वस्तु या सेवा का एकमात्र आपूर्तिकर्ता है, जिससे उसे बाजार में महत्वपूर्ण शakti मिलती है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the main objective of fiscal policy?",
"question_hi": "राजकोषीय नीति का मुख्य लक्ष्य क्या है?",
"A_en": "To increase government revenue.",
"A_hi": "सरकारी आय बढ़ाना।",
"B_en": "To reduce government expenditure.",
"B_hi": "सरकारी व्यय कम करना।",
"C_en": "To promote economic growth and stability.",
"C_hi": "आर्थिक विकास और स्थिरता को बढ़ावा देना।",
"D_en": "To control inflation.",
"D_hi": "चोटी को नियंत्रित करना।",
"answer": "C",
"explanation_en": "The main objective of fiscal policy is to promote economic growth and stability.",
"explanation_hi": "राजकोषीय नीति का मुख्य लक्ष्य आर्थिक विकास और स्थिरता को बढ़ावा देना है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the main cause of inflation?",
"question_hi": "फ्लेटिंग का मुख्य कारण क्या है?",
"A_en": "Increase in aggregate demand.",
"A_hi": "सामान्य मांग में वृद्धि।",
"B_en": "Increase in aggregate supply.",
"B_hi": "सामान्य आपूर्ति में वृद्धि।",
"C_en": "Monetary policy.",
"C_hi": "राजकोषीय नीति।",
"D_en": "Fiscal policy.",
"D_hi": "राजकोषीय नीति।",
"answer": "A",
"explanation_en": "Increase in aggregate demand is the main cause of inflation.",
"explanation_hi": "सामान्य मांग में वृद्धि फ्लेटिंग का मुख्य कारण है।"
},
{
"subject": "Economy",
"topic": "Unemployment",
"question_en": "What is the main cause of unemployment?",
"question_hi": "बेरोजगारी का मुख्य कारण क्या है?",
"A_en": "Increase in aggregate demand.",
"A_hi": "सामान्य मांग में वृद्धि।",
"B_en": "Increase in aggregate supply.",
"B_hi": "सामान्य आपूर्ति में वृद्धि।",
"C_en": "Monetary policy.",
"C_hi": "राजकोषीय नीति।",
"D_en": "Fiscal policy.",
"D_hi": "राजकोषीय नीति।",
"answer": "B",
"explanation_en": "Increase in aggregate supply is the main cause of unemployment.",
"explanation_hi": "सामान्य आपूर्ति में वृद्धि बेरोजगारी का मुख्य कारण है।"
},
{
"subject": "Economy",
"topic": "GDP",
"question_en": "What is the main component of GDP?",
"question_hi": "जीडीपी का मुख्य घटक क्या है?",
"A_en": "Consumption.",
"A_hi": "उपभोग।",
"B_en": "Investment.",
"B_hi": "निवेश।",
"C_en": "Government expenditure.",
"C_hi": "सरकारी व्यय।",
"D_en": "Net exports.",
"D_hi": "नेट एक्सपोर्ट्स।",
"answer": "A",
"explanation_en": "Consumption is the main component of GDP.",
"explanation_hi": "उपभोग जीडीपी का मुख्य घटक है।"
},
{
"subject": "Economy",
"topic": "Inflation Rate",
"question_en": "What is the main indicator of inflation rate?",
"question_hi": "फ्लेटिंग दर का मुख्य संकेतक क्या है?",
"A_en": "CPI.",
"A_hi": "सीपीआई (कंज्यूमर प्राइस इंडेक्स)।",
"B_en": "GDP deflator.",
"B_hi": "जीडीपी डेफ्लेटर।",
"C_en": "Producer Price Index.",
"C_hi": "उत्पादक मूल्य सूचकांक (पीपीआई)।",
"D_en": "WPI.",
"D_hi": "डब्ल्यूपीआई (व्होल्सेल प्राइस इंडेक्स)।",
"answer": "A",
"explanation_en": "CPI is the main indicator of inflation rate.",
"explanation_hi": "सीपीआई फ्लेटिंग दर का मुख्य संकेतक है।"
}