[
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the primary objective of monetary policy?",
"question_hi": "वित्तीय नीति का मुख्य उद्देश्य क्या है?",
"A_en": "Achieve high economic growth", "A_hi": "उच्च आर्थिक वृद्धि हासिल करना",
"B_en": "Maintain price stability", "B_hi": "भाव स्थिरता बनाए रखना",
"C_en": "Reduce unemployment", "C_hi": "रोजगार को कम करना",
"D_en": "Increase foreign exchange reserves", "D_hi": "विदेशी मुद्रा भंडार बढ़ाना",
"answer": "B",
"explanation_en": "Monetary policy aims to maintain price stability, which is essential for economic growth and development.",
"explanation_hi": "वित्तीय नीति भाव स्थिरता की दिशा में काम करती है, जो आर्थिक वृद्धि और विकास के लिए आवश्यक है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the law of diminishing marginal utility?",
"question_hi": "न्यूनतम उपयोगिता का कानून क्या है?",
"A_en": "The law states that as the quantity of a good increases, its marginal utility also increases", "A_hi": "कानून के अनुसार, किसी उत्पाद की मात्रा बढ़ने पर उसकी मार्जिनल उपयोगिता भी बढ़ती है",
"B_en": "The law states that as the quantity of a good increases, its marginal utility decreases", "B_hi": "कानून के अनुसार, किसी उत्पाद की मात्रा बढ़ने पर उसकी मार्जिनल उपयोगिता घटती है",
"C_en": "The law states that as the quantity of a good increases, its total utility also increases", "C_hi": "कानून के अनुसार, किसी उत्पाद की मात्रा बढ़ने पर उसकी कुल उपयोगिता भी बढ़ती है",
"D_en": "The law states that as the quantity of a good increases, its marginal utility remains constant", "D_hi": "कानून के अनुसार, किसी उत्पाद की मात्रा बढ़ने पर उसकी मार्जिनल उपयोगिता स्थिर रहती है",
"answer": "B",
"explanation_en": "The law of diminishing marginal utility states that as the quantity of a good increases, its marginal utility decreases.",
"explanation_hi": "न्यूनतम उपयोगिता का कानून कहता है कि किसी उत्पाद की मात्रा बढ़ने पर उसकी मार्जिनल उपयोगिता घटती है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the main advantage of free trade?",
"question_hi": "स्वतंत्र व्यापार का मुख्य लाभ क्या है?",
"A_en": "Increased protectionism", "A_hi": "बढ़ी हुई संरक्षणवाद",
"B_en": "Improved economic growth", "B_hi": "सुधारी हुई आर्थिक वृद्धि",
"C_en": "Reduced economic inequality", "C_hi": "कम हुई आर्थिक असमानता",
"D_en": "Increased employment opportunities", "D_hi": "बढ़े हुए रोजगार के अवसर",
"answer": "B",
"explanation_en": "Free trade leads to improved economic growth as it allows for specialization and increased efficiency.",
"explanation_hi": "स्वतंत्र व्यापार से आर्थिक वृद्धि में सुधार होता है, क्योंकि यह विशेषज्ञता और प्रभावशीलता में वृद्धि की अनुमति देता है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the primary objective of fiscal policy?",
"question_hi": "वित्तीय नीति का मुख्य उद्देश्य क्या है?",
"A_en": "Achieve high economic growth", "A_hi": "उच्च आर्थिक वृद्धि हासिल करना",
"B_en": "Maintain price stability", "B_hi": "भाव स्थिरता बनाए रखना",
"C_en": "Reduce unemployment", "C_hi": "रोजगार को कम करना",
"D_en": "Increase government revenue", "D_hi": "सरकारी आय बढ़ाना",
"answer": "C",
"explanation_en": "Fiscal policy aims to reduce unemployment, which is a key objective of macroeconomic policy.",
"explanation_hi": "वित्तीय नीति रोजगार को कम करने का लक्ष्य रखती है, जो मैक्रोआर्थिक नीति का एक प्रमुख उद्देश्य है।"
},
{
"subject": "Economy",
"topic": "GDP and Inflation",
"question_en": "What is the difference between nominal GDP and real GDP?",
"question_hi": "क्या है मुद्रास्फीति और वास्तविक जीडीपी के बीच का अंतर?",
"A_en": "Nominal GDP measures the value of goods and services in current prices, while real GDP measures the value in constant prices", "A_hi": "मुद्रास्फीति जीडीपी वर्तमान मूल्यों में वस्तुओं और सेवाओं का मूल्य मापता है, जबकि वास्तविक जीडीपी स्थिर मूल्यों में मापता है",
"B_en": "Nominal GDP measures the value of goods and services in constant prices, while real GDP measures the value in current prices", "B_hi": "मुद्रास्फीति जीडीपी स्थिर मूल्यों में वस्तुओं और सेवाओं का मूल्य मापता है, जबकि वास्तविक जीडीपी वर्तमान मूल्यों में मापता है",
"C_en": "Nominal GDP measures the value of goods and services in real terms, while real GDP measures the value in nominal terms", "C_hi": "मुद्रास्फीति जीडीपी वास्तविक शब्दों में वस्तुओं और सेवाओं का मूल्य मापता है, जबकि वास्तविक जीडीपी मुद्रास्फीति शब्दों में मापता है",
"D_en": "Nominal GDP measures the value of goods and services in nominal terms, while real GDP measures the value in real terms", "D_hi": "मुद्रास्फीति जीडीपी मुद्रास्फीति शब्दों में वस्तुओं और सेवाओं का मूल्य मापता है, जबकि वास्तविक जीडीपी वास्तविक शब्दों में मापता है",
"answer": "A",
"explanation_en": "Nominal GDP measures the value of goods and services in current prices, while real GDP measures the value in constant prices.",
"explanation_hi": "मुद्रास्फीति जीडीपी वर्तमान मूल्यों में वस्तुओं और सेवाओं का मूल्य मापता है, जबकि वास्तविक जीडीपी स्थिर मूल्यों में मापता है।"
},
{
"subject": "Economy",
"topic": "Balance of Payments",
"question_en": "What is the purpose of the balance of payments account?",
"question_hi": "वहां के भुगतान के संतुलन के खाते का उद्देश्य क्या है?",
"A_en": "To record the flow of goods and services between a country and its trading partners", "A_hi": "किसी देश और उसके व्यापारिक भागीदारों के बीच वस्तुओं और सेवाओं के प्रवाह को दर्ज करने के लिए",
"B_en": "To record the flow of capital between a country and its trading partners", "B_hi": "किसी देश और उसके व्यापारिक भागीदारों के बीच पूंजी के प्रवाह को दर्ज करने के लिए",
"C_en": "To record the flow of income between a country and its trading partners", "C_hi": "किसी देश और उसके व्यापारिक भागीदारों के बीच आय के प्रवाह को दर्ज करने के लिए",
"D_en": "To record the flow of government transactions between a country and its trading partners", "D_hi": "किसी देश और उसके व्यापारिक भागीदारों के बीच सरकारी लेनदेन को दर्ज करने के लिए",
"answer": "A",
"explanation_en": "The balance of payments account records the flow of goods and services between a country and its trading partners.",
"explanation_hi": "वहां के भुगतान के संतुलन के खाते का उद्देश्य किसी देश और उसके व्यापारिक भागीदारों के बीच वस्तुओं और सेवाओं के प्रवाह को दर्ज करना है।"
},
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the formula for calculating national income?",
"question_hi": "राष्ट्रीय आय की गणना के लिए सूत्र क्या है?",
"A_en": "Y = C + I + G + (X - M)", "A_hi": "यू = सी + आई + जी + (एक्स - एम)",
"B_en": "Y = C + I + G - (X - M)", "B_hi": "यू = सी + आई + जी - (एक्स - एम)",
"C_en": "Y = C + I + G + M - X", "C_hi": "यू = सी + आई + जी + एम - एक्स",
"D_en": "Y = C + I + G + (M - X)", "D_hi": "यू = सी + आई + जी + (एम - एक्स)",
"answer": "A",
"explanation_en": "The formula for calculating national income is Y = C + I + G + (X - M), where Y is national income, C is consumption, I is investment, G is government spending, X is exports, and M is imports.",
"explanation_hi": "राष्ट्रीय आय की गणना के लिए सूत्र है यू = सी + आई + जी + (एक्स - एम), जहां यू राष्ट्रीय आय, सी उपभोग, आई निवेश, जी सरकारी खर्च, एक्स निर्यात, और एम आयात है।"
},
{
"subject": "Economy",
"topic": "Gini Coefficient",
"question_en": "What is the Gini coefficient, and what does it measure?",
"question_hi": "गिनी का सूचकांक क्या है, और यह क्या मापता है?",
"A_en": "The Gini coefficient is a measure of income inequality, with a value of 0 representing perfect equality and a value of 1 representing perfect inequality", "A_hi": "गिनी का सूचकांक आय असमानता का माप है, जिसका मान 0 पूर्ण समानता का प्रतिनिधित्व करता है और 1 पूर्ण असमानता का प्रतिनिधित्व करता है",
"B_en": "The Gini coefficient is a measure of economic growth, with a value of 0 representing low growth and a value of 1 representing high growth", "B_hi": "गिनी का सूचकांक आर्थिक वृद्धि का माप है, जिसका मान 0 कम वृद्धि का प्रतिनिधित्व करता है और 1 उच्च वृद्धि का प्रतिनिधित्व करता है",
"C_en": "The Gini coefficient is a measure of poverty, with a value of 0 representing high poverty and a value of 1 representing low poverty", "C_hi": "गिनी का सूचकांक गरीबी का माप है, जिसका मान 0 उच्च गरीबी का प्रतिनिधित्व करता है और 1 कम गरीबी का प्रतिनिधित्व करता है",
"D_en": "The Gini coefficient is a measure of inflation, with a value of 0 representing low inflation and a value of 1 representing high inflation", "D_hi": "गिनी का सूचकांक मुद्रास्फीति का माप है, जिसका मान 0 कम मुद्रास्फीति का प्रतिनिधित्व करता है और 1 उच्च मुद्रास्फीति का प्रतिनिधित्व करता है",
"answer": "A",
"explanation_en": "The Gini coefficient is a measure of income inequality, with a value of 0 representing perfect equality and a value of 1 representing perfect inequality.",
"explanation_hi": "गिनी का सूचकांक आय असमानता का माप है, जिसका मान 0 पूर्ण समानता का प्रतिनिधित्व करता है और 1 पूर्ण असमानता का प्रतिनिधित्व करता है।"
},
{
"subject": "Economy",
"topic": "Fiscal Deficit",
"question_en": "What is the fiscal deficit, and how is it calculated?",
"question_hi": "केंद्रीय घाटा क्या है, और इसकी गणना कैसे की जाती है?",
"A_en": "The fiscal deficit is the difference between government spending and revenue, calculated as (G - T)", "A_hi": "केंद्रीय घाटा सरकारी खर्च और आय के बीच का अंतर है, जो गणना में (जी - टी) के रूप में किया जाता है",
"B_en": "The fiscal deficit is the difference between government revenue and spending, calculated as (T - G)", "B_hi": "केंद्रीय घाटा सरकारी आय और खर्च के बीच का अंतर है, जो गणना में (टी - जी) के रूप में किया जाता है",
"C_en": "The fiscal deficit is the difference between government spending and investment, calculated as (G - I)", "C_hi": "केंद्रीय घाटा सरकारी खर्च और निवेश के बीच का अंतर है, जो गणना में (जी - आई) के रूप में किया जाता है",
"D_en": "The fiscal deficit is the difference between government revenue and investment, calculated as (T - I)", "D_hi": "केंद्रीय घाटा सरकारी आय और निवेश के बीच का अंतर है, जो गणना में (टी - आई) के रूप में किया जाता है",
"answer": "A",
"explanation_en": "The fiscal deficit is the difference between government spending and revenue, calculated as (G - T), where G is government spending and T is government revenue.",
"explanation_hi": "केंद्रीय घाटा सरकारी खर्च और आय के बीच का अंतर है, जो गणना में (जी - टी) के रूप में किया जाता है, जहां जी सरकारी खर्च और टी सरकारी आय है।"
}