[
{
"subject": "Economy",
"topic": "",
"question_en": "What is Gross Domestic Product (GDP) and how is it calculated?",
"question_hi": "Gross आरक्षण क्या है और उन्हें कैसे प्रमाणित किया जाता है?",
"A_en": "GDP is the total value of goods and services produced within a country in a specific time period. It is calculated by adding up the values of all industries.",
"A_hi": "Gross Domestic Product (GDP) राज्य में समाज और सहीतलकरण का कार्यालय में सबसे उच्च तिथि का टिप्पीय अनुसारियाँ शामिल होंगी।",
"B_en": "GDP is calculated by adding up the values of all industries within a country.\n1. Primary Sector: Includes agriculture, forestry, and fishing.\n2. Secondary Sector: Includes manufacturing, construction, and mining.\n3. Tertiary Sector: Includes services such as education, healthcare, and transportation.\n4. Quaternary Sector: Includes information technology, research, and development.",
"B_hi": "राज्य में बद्देल का टिप्पीय अनुसारियाँ शामिल होंगीं।",
"C_en": "GDP is calculated by considering the value of goods and services produced in a country.\n1. Agricultural Sector: Agriculture and allied activities.\n2. Industrial Sector: Manufacturing, mining, and construction activities.\n3. Service Sector: Banking, education, tourism, and transportation services.\n4. High-tech Sector: Information technology, research, and development activities.",
"C_hi": "राज्य में GDP करने के लिए का टिपी अनुसारियाँ शामिल होंगीं।",
"D_en": "GDP is calculated by considering the value of goods and services produced within a country.\n1. Agricultural Sector: Agriculture, forestry, and fishing.\n2. Industrial Sector: Manufacturing, mining, and construction.\n3. Service Sector: Banking, education, healthcare, tourism, and transportation services.\n4. High-tech Sector: Information technology, research, and development activities.",
"D_hi": "राज्य में GDP करने के लिए का टिपी अनुसारियाँ शामिल होंगीं।",
"E_en": "Economy of Rajasthan is developed through various sectors.\n1. Agriculture: Agriculture, forestry, and fisheries.\n2. Industry: Manufacturing, mining, and construction.\n3. Service Sector: Banking, education, healthcare, tourism, and transportation services.\n4. Technology Sector: Information technology, research, and development activities.\n5. Infrastructure: Roads, railways, and public utilities.",
"E_hi": "राजस्थान के आर्थिक विकास के लिए का टिपी अनुसारियाँ शामिल होंगीं।",
"F_en": "Economic development in Rajasthan is driven by various sectors.\n1. Agriculture: Agriculture, forestry, and fisheries.\n2. Industry: Manufacturing, mining, and construction.\n3. Service Sector: Banking, education, healthcare, tourism, and transportation services.\n4. Technology Sector: Information technology, research, and development activities.\n5. Infrastructure: Roads, railways, and public utilities.",
"F_hi": "राजस्थान के आर्थिक विकास के लिएका टिपी अनुसारियाँ शामिल होंगीं।",
"G_en": "In Rajasthan, economic growth is influenced by various sectors.\n1. Agriculture: Grain production, dairy farming, and horticulture.\n2. Industry: Steel, textiles, and auto components.\n3. Service Sector: Banking, education, tourism, and hospitality.\n4. Technology Sector: Information technology, biotechnology, and R&D.\n5. Infrastructure: Power, water supply, and communication.",
"G_hi": "राजस्थान मेंसेंचणी उचतीचणी विकास: वनी उचतीचणी उचतीचणी उचतीचणी उचतीचणी विकासचणी उचतीचणी उचतीचणी उचतीचणी",
"H_en": "Economy of Rajasthan is supported by various sectors.\n1. Agriculture: Agriculture, forestry, and livestock.\n2. Manufacturing: Textile, automobile, and electronics.\n3. Service Sector: Banking, education, and hospitality.\n4. Technology: ICT, biotechnology, and R&D.\n5. Infrastructure: Power, water supply, and transportation.",
"H_hi": "राजसतीचणी उचणी उचणी उचणी उचणी उचणी",
{
"subject": "Economy",
"topic": "Rajasthan",
"question_en": "What is the major contributing factor in Rajasthan's economy?",
"question_hi": "राजसती उचणी उचणी उचणी उचणी",
"A_en": "Agriculture",
"A_hi": "गमाकणी",
"B_en": "Industry",
"B_hi": "सती",
"C_en": "Service Sector",
"C_hi": "राजी",
"D_en": "Technology",
"D_hi": "ती",
"E_en": "Economics",
"E_hi": "राजी",
"F_en": "GDP",
"F_hi": "राजी",
"Answer": "राजी",
"Explanation_en": "राजी उचणी",
"Explanation_hi": "राजी उचणी",
}
]