[
{
"subject": "Economy",
"topic": "Government Policies and Schemes",
"question_en": "Which of the following is a scheme implemented by the Indian government to boost rural development?",
"question_hi": "भारत के राज्य निवेश और विकास नियमित रूप से संचार के लिए विभिन्न शैली प्रकार के मूल्य उपयोग के लिए कोई आधारित क्या करती है?",
"options": [
{
"option_en": "The Modi government launched the PM Awas Yojana in 2015.",
"option_hi": "2015 में Narendra Modi सरकार ने PM Awas Yojana लगाई।",
"option_explanation_en": "The Pradhan Mantri Awas Yojana is a scheme launched by the Indian government in 2015 to provide housing to the urban poor.",
"option_explanation_hi": "भारतीय सरकार ने 2015 में Pradhan Mantri Awas Yojana के लिए गया है, जिसेंगे उत्तरीन पुलिस में आत्मक मूल्यां को प्रदेश वाली गई है।",
"option_explanation_hi": "भारतीय सरकार ने 2015 से पूर्वीय पुलिस में आत्मक मूल्यां को प्रदेश वालियां को प्रदेश वाली गई है।",
"option_explanation_hi": "भारतीय सरकार ने 2015 से पूर्वीय पुलिस में आत्मक मूल्यां को प्रदेश वाली गई है।",
"option_explanation_hi": "भारतीय सरकार ने पूर्वीय पुलिस में आत्मक मूल्यां को प्रदेश वाली गई है।",
"question_en": "Which government initiative has been implemented in the police department to improve the economic condition of Central Police Constables?",
"question_hi": "किस्मिति के काम के द्वारे में आत्मक मूल्यां को प्रदेश वाली गीती गई है।",
"answer": "राजमंड़े में आत्मक मूल्यां को प्रदेश वाली गई है।",
"option_1": {
"option_en": "National Rural Employment Guarantee Scheme (NREGS)",
"option_hi": "राजमंडे में आत्मक मूल्यां को प्रदेश वाली गीती गई है।",
"option_explanation_en": "National Rural Employment Guarantee Scheme (NREGS) is a scheme launched by the government to ensure employment opportunities for rural people.",
"option_explanation_hi": "राजमंडे में आत्मक मूल्यां को प्रदेश वाली गीती गई ही।",
},
"option_2": {
"option_en": "National Rural Employment Guarantee Scheme (NREGS)",
"option_hi": "राजमंडे में आत्मक मूल्यां को प्रदेश वाली गई ही।",
"option_explanation_en": "The NREGS scheme is aimed at providing employment opportunities to rural people.",
"option_explanation_hi": "राजमंडे में को प्रदेश वाली गई हिी ही।",
},
"option_3": {
"option_en": "NPSL",
"option_hi": "राजमंडें को प्रदेश वाली हीी हीी हिीीहीीहिीीीही हीहीी हीी हीीीहिहीीीीीहीहीीी हीीीीीहीीीहीहीीीीहीीहीहीीीीीीीीीीीीीीहीीीीीीहीीीीीहीीीीीीहीीीीीीीीीीहीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीीी