[
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the concept of National Income?",
"question_hi": "राष्ट्रीय आर्तित आर्थिक आय का क्या समझने का मतलब है?",
"A_en": "National Product", "A_hi": "राष्ट्रीय आर्थिक आय",
"B_en": "Gross Domestic Product", "B_hi": "ग्रॉस्प्रोस्ट डोमेंटरपी",
"C_en": "National Consumption", "C_hi": "राष्ट्रीय आये काम",
"D_en": "National Income (NI)", "D_hi": "राष्ट्रीय आर्थिक आय",
"answer": "D",
"explanation_en": "National Income (NI) refers to the total value of all goods and services produced within a country's geographical boundaries in a specific time period, typically a year. It is the sum of Gross Domestic Product (GDP), Net National Product (NNP), and Net National Income (NNI). In simple terms, it represents the total income earned by the citizens of a country from the activities within it.",
"explanation_hi": "राष्ट्रीय आर्थिक आय (NI) refers to the total value of all goods and services produced within a country's geographical boundaries in a specific time period, usually a year. It is the sum of Gross Domestic Product (GDP), Net National Product (NNP), and Net National Income (NNI). In simple terms, it represents the total income earned by the citizens of a country from the activities within it."
} 
{
"subject": "Economic Terms",
"topic": "Fiscal Policy",
"question_en": "What is fiscal policy?",
"question_hi": "वित्तीय कार्याबाबूतियाँ क्यामित्र के मानिर क्यामित्रण को लाभ को क्याम्तिया क्यामित्रण क्यामित्रण को लाभ को क्याम्तियाँ को लाभ को क्याम्तिया क्याम्तियाँ को लाभ को क्याम्तियाँ को लाभ को क्याम्तियाँ को लाभ को क्याम्तियाँ को लाभ को क्याम्तियाँ को लाभ को क्याम्तियाँ को लाभ को क्याम्तियाँ को लाभ को क्याम्तियाँ को लाभ को क्याम्तियाँ को लाभ को क्याम्तियाँ को लाभ को क्याम्तियाँ को लाभ को क्याम्तियाँ को लाभ को क्याम्तियाँ को लाभ क्याम्तियाँ को लाभ क्याम्तियाँ क्याम्तियाँ को लाभ क्याम्तियाँ क्याम्तियाँ क्याम्तियाँ क्याम्तियाँ क्याम्तियाँ क्याम्तियाँ क्याम्तियाँ क्याम्तियाँ क्याँ क्याँ कयाँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ",
"answer": "D",
"explanation_en": "D), National Income (NI) is the total value of all income earned by the citizens of a country from the government, business, and other sources.",
"explanation_hi": "राजर्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ",
"A_en": "National Product",
"A_hi": "राजर्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ",
"B_en": "National Expenditure",
"B_hi": "राज्याँ क्याँ क्याँ क्याँ क्याँ क्याँ क्याँ