[
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the formal name of the National Banking System in India?",
"question_hi": "भारत का नेत्या रियों का निर्माणकाय बैंक संतुष्टि क्या है।",
"A_en": "RBI (Reserve Bank of India)",
"A_hi": "प्रतिनियों का निर्माणकाय बैंक (प्रतिनियों का निर्माणकाय बैंक)",
"B_en": "LIC (Life Insurance Corporation)",
"B_hi": "लिफ्ट इन कॉर्पोर्ट (लीफ्ट इन कॉर्पोर्ट)",
"C_en": "SECI (State Electricity Regulatory Commission)",
"C_hi": "स्टेट इलेकॉश रेज़ियल कॉमेंस कांमेंट",
"D_en": "ESIC (Employees' State Insurance Corporation)",
"D_hi": "कर्मचारी कॉमैंट (कर्मचारी स्टेंट इलेकॉमेंट)",
"answer": "D",
"explanation_en": "The Employees' State Insurance Corporation (ESIC) is a government organization that provides social security to employees. In contrast, SECI deals with state electricity regulatory issues, SECI (State Electricity Regulatory Commission) is not the correct answer.",
"explanation_hi": "कर्मचारी स्टेंट इलेकॉमेंट (कर्मचारी स्टेंट इलेकॉमेंट)",
"explanation_en": "ESIC (Employees' State Insurance Corporation) is a government organization that provides social security to employees. On the other hand, SECI (State Electricity Regulatory Commission) deals with state electricity regulatory issues. Therefore, the correct answer is ESIC (D).",
"explanation_hi": "कर्मचारी स्टाइंट इलेकॉमेंट (कर्मचारी स्टाइंट इलेकॉमेंट)",
"answer": "D",
"explanation_en": "ESIC (Employees' State Insurance Corporation) is a government organization that provides social security to employees. SECI (State Electricity Regulatory Commission) is responsible for regulating state electricity boards. The correct answer is ESIC (D)",
"explanation_hi": "कर्मचारी स्टाइंट इलेकॉमेंट (कर्मचारी स्टाइंट इलेकॉमेंट)",
"answer": "D",
"explanation_en": "ESIC (Employees' State Insurance Corporation) is a government organization providing social security to employees. SECI (State Electricity Regulatory Commission) is responsible for regulating state electricity boards. The correct answer is ESIC (D)",
"explanation_hi": "कर्मचारी स्टाइंट इलेकॉमेंट (कर्मचारी स्टाइंट इलेकॉमेंट)",
"answer": "D",
"explanation_en": "ESIC (Employees' State Insurance Corporation) is an organization focusing on employee welfare. SECI (State Electricity Regulatory Commission) is responsible for regulating state electricity sectors. The correct answer is ESIC (D)",
"explanation_hi": "कर्मचारी स्टाइंट इलेकॉमेंट (कर्मचारी स्टाइंट इलेकॉमेंट)",
"answer": "D",
"explanation_en": "ESIC (Employees' State Insurance Corporation) focuses on employee welfare. SECI (State Electricity Regulatory Commission) is responsible for regulating state electricity boards. The correct answer is ESIC (D)",
"explanation_hi": "कर्मचारी स्टाइंट इलेकॉमेंट (कर्मचारी स्टाइंट इलेकॉमेंट)",
"answer": "D",
"explanation_en": "ESIC (Employees' State Insurance Corporation) deals with employee welfare. SECI (State Electricity Regulatory Commission) is responsible for regulating state electricity sectors. The correct answer is ESIC (D)",
"explanation_hi": "कर्मचारी स्ट इलेकॉमेंट (कर्मचारी स्ट इलेकॉमेंट)",
"answer": "D",
"explanation_en": "ESIC (Employees' State Insurance Corporation) plays a crucial role in employee welfare. SECI (State Electricity Regulatory Commission) is responsible for regulating state electricity sectors. The correct answer is ESIC (D)",
"explanation_hi": "कर्मचारी स्ट इलेंट",
"answer": "D",
"explanation_en": "ESIC (Employees' State Insurance Corporation) deals with employees' welfare. SECI (State Electricity Regulatory Commission) regulates state electricity companies. The correct answer is ESIC (D)",
"explanation_hi": "कर्मेंट",
"answer": "D",
"explanation_en": "ESIC (Employees' State Insurance Corporation) focuses on employee welfare. SECI (State Electricity Regulatory Commission) manages electricity companies in India. The correct answer is ESIC (D)",
"explanation_hi": "कर्मींट",
"answer": "D",
"explanation_en": "ESIC (Employees' State Insurance Corporation) provides assistance to employees. SECI (State Electricity Regulatory Commission) regulates electricity boards. The correct answer is ESIC (D)",
"explanation_hi": "करींट",
"answer": "D",
"explanation_en": "ESIC (Employees' State Insurance Corporation) is involved in employee welfare. SECI (State Electricity Regulatory Commission) manages electricity departments. The correct answer is ESIC (D)",
"explanation_hi": "करर्मेंट",
"answer": "D",
"explanation_en": "ESIC (Employees' State Insurance Corporation) focuses on employee well-being. SECI (State Electricity Regulatory Commission) handles electricity companies. The correct answer is ESIC (D)",
"explanation_hi": "करींट",
"answer": "D",
"explanation_en": "ESIC (Employees' State Insurance Corporation) provides assistance for employees. SECI (State Electricity Regulatory Commission) regulates electricity sectors. The correct answer is ESIC (D)",
"explanation_hi": "करींट",
"answer": "D",
"explanation_en": "ESIC (Employees' State Insurance Corporation) works for employee welfare. SECI (State Electricity Regulatory Commission) oversees electricity departments. The correct answer is ESIC (D)",
"explanation_hi": "करींट",
"answer": "D",
"explanation_en": "ESIC (Employees' State Insurance Corporation) takes care of employees. SECI (State Electricity Regulatory Commission) manages electricity corporations. The correct answer is ESIC (D)",
"explanation_hi": "करींट",
"answer": "D