[
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the concept of national income?",
"question_hi": "राष्ट्रीय आयाम क्या है?",
"A_en": "Gross Domestic Product (GDP)", "A_hi": "ग्रॉस डोमेनपुर्तगान (GDP)",
"B_en": "Gross National Product (GNP)", "B_hi": "ग्रॉस नागरिक विकास (GNV)",
"C_en": "Net Domestic Product (NDP)", "C_hi": "नेट डोमेनपुर्तगान (NDP)",
"D_en": "Gross World Product (GWP)", "D_hi": "ग्रॉस विशालीन (GWP)",
"answer": "B",
"explanation_en": "Gross National Product (GNP) refers to the total value of all goods and services produced within a country's borders, including both domestic and foreign-owned assets. It measures the economic activity of a country as a whole, unlike Gross Domestic Product (GDP), which measures only the economic activity within a country's territorial boundaries.",
"explanation_hi": "नेट देश के आर्थविक्रेंस (NDP) अंगीजनक अंक (NDP) - जमा प्रतीकरण के मार्चेंस (NCP) को क्या समझना समझना के अंगीजनक अंक (NDP) को क्या समझना समझना को क्या समझना समझना के अंगीजनक अंक (NCP) को समझना समझना को समझना समझना के अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजनक अंगीजन