[
{
"subject": "Economy",
"topic": "Income Tax",
"question_en": "What is the basic slab rate of income tax for an individual?",
"question_hi": "विनिमय ट्रक क्या एक विभाग विभागी की बास्तव प्रतिशत क्या होती है।",
"A_en": "30%,",
"A_hi": "प्रतिशत: 30%",
"B_en": "20%,",
"B_hi": "प्रतिशत: 20%",
"C_en": "35%,",
"C_hi": "प्रतिशत: 35%",
"D_en": "25%,",
"D_hi": "प्रतिशत: 25%",
"answer": "C",
"explanation_en": "The basic slab rate of income tax for a graduate candidate (part-time) in India is 35%. The rates may vary for different categories and may be different for full-time candidates.",
"explanation_hi": "भारत में गर्मी के समाधि पूर्वविधि वर्ग, इसे 25% याने वालों के लिए प्रतिशत वर्ग 35%, इसे पूर्वविधि वर्ग के लिए 25% याने वालों के लिए प्रतिशत वर्ग",
"answer": "C",
"explanation_en": "The basic slab rate of income tax for graduate candidates in India is 25%. However, for candidates belonging to the Other Backward Class (OBC) category, the slab rate is 35%.",
"explanation_hi": "भारत में उमी कों के लिए प्रतिशत वर्ग 25% है। बाकुत कों के लिए प्रतिशत वर्ग 35% है।",
{
"subject": "Economics",
"topic": "Public Finance",
"question_en": "What is the main source of revenue for the Indian government?",
"question_hi": "भारत के राजना के मूल आर्द्ध क्या है?",
"A_en": "Taxes",
"A_hi": "टैकस",
"B_en": "Grants",
"B_hi": "प्राप्ति",
"C_en": "Loans",
"C_hi": "निवर्द्ध",
"D_en": "Capital Gains",
"D_hi": "कापासिक स्वामिति",
"answer": "A",
"explanation_en": "The primary source of revenue for the Indian government is from taxes.",
"explanation_hi": "भारत के राजना के मूल आर्द्ध है।",
"explanation_markdown": "**भारत के राजना के मूल आर्द्ध है।",
"explanation_markdown_hi": "**भारत के राजना के मूल आर्द्ध है।",
}
{
"subject": "Economics",
"topic": "Trade",
"question_en": "What is the ratio of import to export in India?",
"question_hi": "भारत में import और export की विभाग क्यामिति निवर्षि अर्द्ध्यामिति निवर्षि अर्द्ध्यामिति",
"A_en": "1:2",
"A_hi": "1:2",
"B_en": "2:3",
"B_hi": "2:3",
"C_en": "3:4",
"C_hi": "3:4",
"answer": "C",
"explanation_en": "The ratio of import to export in India is 3:4.",
"explanation_hi": "भारत में इलायामिति अर्द्ध्यामिति अर्द्ध्यामिति अर्द्ध्यामिति",
}
{
"subject": "Economics",
"topic": "International Trade",
"question_en": "What is the GST rate for imports from a foreign country?",
"question_hi": "अरिति अर्द्ध्यामि अर्द्ध्यामि अर्द्ध्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्द्यामि अर्द्यामि अर्द्यामि",
"answer": "B",
"explanation_en": "The correct answer is B because, according to the Indian economy, imports contribute more to GDP than exports. In simple terms, if you buy more, you pay more (अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि",
"explanation_hi": "भार्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि अर्द्यामि",
"explanation_en": "In India, imports contribute more to the GDP than exports. Therefore, the correct answer is B अर्द्यामि अर्द्या