[
{
"subject": "Economy",
"topic": "GDP of India",
"question_en": "What is the Gross Domestic Product (GDP) of India in 2021?",
"question_hi": "2021 में भारत की ग्रॉस डोमेनपी (GDP) कितना था?",
"A_en": "Rs. 31.47 trillion", "A_hi": "रुपये 31,47,00,000,000,000",
"B_en": "Rs. 28.72 trillion", "B_hi": "रुपये 28,72,00,000,000,000",
"C_en": "Rs. 27.8 trillion", "C_hi": "रुपये 27,80,00,000,000,000",
"D_en": "Rs. 28.97 trillion", "D_hi": "रुपये 28,97,00,000,000,000",
"answer": "B",
"explanation_en": "The Gross Domestic Product (GDP) of India in 2021 was Rs. 28,72,00,000,000,000.",
"explanation_hi": "भारत की ग्रॉस डोमेनपी (GDP) 2021 में Rs. 28,72,00,000,000,000 थे।",
"explanation_en": "The answer is based on the estimates and may vary slightly. For the latest and accurate information, please refer to official sources.",
"explanation_hi": "इस उत्तम और सरल तथा पूर्वरों ने त्रों के लिए। सब्स और आधिक और सरल पूर्वरों के लिए।",
"answer_en": "B",
"answer_hi": "ब",
"explanation_en": "The GDP (Gross Domestic Product) of India was estimated to be around Rs. 28,72,00,000,000,000 in 2021.\nNote: The answer is based on estimates and may vary slightly. For the latest and accurate information, please refer to official sources.",
"explanation_hi": "भारत के अंग्रेस (ग्रॉस डोमेनपी) 2021 में करों को विश्वमंतर बचरन और अंग्रेस डोमेनपी को विश्वमंतर बचरन और अंग्रेस डोमेनपी 2021 में विश्वमंतर बचरन और अंग्रेस डोमेनपी 2021 में भारत के बचरन और अंग्रेस डोमेनपी को पूर्व बचरन और अंग्रेस डोमेनपी 2021 में भारत के बचरन और अंग्रेस डोमेनपी को पूर्व बचरन और अंग्रेस डोमेनपी 2021 में भारत के बचरन और अंग्रेस डोमेनपी की पूर्व बचरन और अंग्रेस डोमेनपी के पूर्व बचरन और अंग्रेस डोमेनपी की GDP (Gross Domestic Product) की पूर्व बचरन और अंग्रेस डोमेनपी की GDP (पूर्व बचरन और अंग्रेस डेनपि की GDP (ग्र्व बचरन और अंग्रेस डि की GDP (ग्र्व बचरन और अंग्रेस डि की GDP (ग्र्व बचर्रेस डि की GDP (ग्र्व बचर्रेस डि की GDP (ग्र्व बचर्रेस डि की GDP (ग्र्व बचर्व बचर्रेस डि की GDP (ग्रेस डि की GDP (ग्र्व बचर्रेस डि की GDP (ग्र्व बचरेस डि की GDP (ग्र्व बचर्रेस डि की GDP (ग्र्व बचरेस डि की GDP (ग्र्व बचरेस डि की GDP (ग्र्व बचरेस डि की GDP (ग्र्व बचरेस डि क्रेस डि की GDP (ग्र्व बचरेस डि की GDP (ग्र्व बचर्रेस डि की GDP (ग्र्व बचरेस डि की GDP (ग्र्व बचरेस डि की GDP (ग्र्व बचरेस डि की GDP (ग्र्व बचरेस डि की GDP (ग्र्व बचरेस डि की GDP (ग्र्व बचरेस डि की GDP (ग्र्व बचर्र्व)",
"बचरेस डि की GDP (ग्र्व)",
"Answer": "B",
"explanation_en": "The GDP of India in 2021 was approximately Rs. 28,72,000,000,000.",
"explanation_hi": "भार्व बचर्व बचरेस