[
{
"subject": "Economy",
"topic": "National Income and Product",
"question_en": "What is the formula for calculating Gross Domestic Product (GDP)?",
"question_hi": "गृहमंत्री के अध्ययन के प्रत्यक्षिति किस प्रत्यक्षिति का पाठ है।",
"A_en": "GDP = C + I + G + (X - M)",
"A_hi": "GDP = C + I + G + (X - M)",
"B_en": "GDP = NNP / PCE",
"B_hi": "GDP = NNP / PCE",
"C_en": "GDP = C + I + G + (X - M) / P",
"C_hi": "GDP = C + I + G + (X - M) / P",
"D_en": "GDP = NNP / PCE / (X - M)",
"D_hi": "GDP = NNP / PCE / (X - M)",
"answer": "C",
"explanation_en": "The correct formula for calculating Gross Domestic Product (GDP) is GDP = C + I + G + (X - M) / P.\nGDP = Consumption (C), Investment (I), Government Expenditure (G), and (Exports - Imports) / Purchasing Power Per Capita (P).",
"explanation_hi": "ग्रॉस्पेंडरिया की परिक्षण के मूल मूल के सामानेंटिया की परिक्षण के मूल मूल के परिक्षण के सामानेंटिया की परिक्षण के मूल मूल के मूल के परिक्षण के मूल के मूल के परिक्षण के मूल के मूल के परिक्षण के मूल के मूल के परिक्षण के मूल के मूल के परिक्षण के मूल के मूल के मूल के परिक्षण के मूल के मूल के परिक्षण के मूल के मूल के परिक्षण के मूल के मूल के मूल के मूल के मूल के मूल के मूल के मूल के मूल के मूल के मूल के मूल के मूल के मीटर्स के मीटर्स के मीटर्स के मीटर्स के मीटर्स के मीटर्स के मीटर्स के मीट्रीटर्स के मीटर्स के मीटरेंस के मीटेंस के मीटेंस के मीटेंस के मीटरेंस के मीटेंस के मीटेंस के मीटेंस के मीटेंस के मीटरेंस के मीटेंस के मीटेंस के मीटरेंस के मीटेंस के मीटेंस के मीटेंस के मीटेंस के मीटेंस के मीटेंस के मीटेंस के मीटेंस के मीटेंस के मिटिंस के मीटेंस के मीटेंस के मीटेंस के मीटेंस के मीटेंस के मीटेंस",
O के मीटेंस के मीटेंस",R के मीटेंस",D के मीटेंस",के मीटेंस के मीटेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीटिंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीटेंीटेंस",के मीटिंस",के मीटेंस",के मीीटेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मीटेंस",के मी