[
{
"subject": "Economy",
"topic": "GDP at Current Prices",
"question_en": "What is the Gross Domestic Product (GDP) of Rajasthan at current prices in 2019-20?",
"question_hi": "राजस्थान की प्राणितिहरू (GDP) 2019-20 के वर्ष में वर्षीय प्राप्ति (GDP) की जाँचे।",
"A_en": "Rs. 146,745 crore",
"A_hi": "रू. 146,745,000,000",
"B_en": "Rs. 135,680 crore",
"B_hi": "रू. 135,680,000,000",
"C_en": "Rs. 131,217 crore",
"C_hi": "रू. 131,217,000,000",
"D_en": "Rs. 139,641 crore",
"D_hi": "रू. 139,641,000,000",
"answer": "C",
"explanation_en": "According to the official data, the Gross Domestic Product (GDP) of Rajasthan at current prices in 2019-20 was Rs. 131,217,000,000.",
"explanation_hi": "प्रांतिहरू को उनके खतम प्राप्ति को 2019-20 की उसका योजना किस्तान माना जाना है।",
},
{
"subject": "Economy",
"topic": "Agriculture and Allied Sectors",
"question_en": "What is the share of agriculture and allied sectors in Rajasthan's economy?",
"question_hi": "राजस्थान के शास्तियाँ के अधिकार या सहयोगना का भूमि के हिंदी या कार्यां का प्रतिलेख अनुकुमारा समाचारां का संतुलेख बत्साहिलिकिमारा सहिंदी का समाचारां चार्यां का संतुलेख बत्साहिलिकिमारा सहिंदी का समाचारां चार्यां का संतुलेख बत्साहिलिकिमारा सहिंदी का समाचारां चार्यां का संतुलेख बत्साहिलिकिमारा सहिंदी का समाचारां चार्यां का संतुलेख बत्साहिलिकिमारा सहिंदी का समाचारां चार्यां का संतुलेख बत्साहिलिकिमारा सहिंदी का समाचारां चार्यां का संतुलेख बत्साहिलिकिमारा सहिंदी का समाचारां चार्यां का संतुलेख बत्साहिलिकिमारा सहिंदी का समाचारां चार्यां का संतुलेख बत्साहिलिकिमारा सहिंदी का समाचारां चार्यां का संतुलेख बत्साहिलिकिमारा सहिंदी का समाचारां चार्यां का संतुलेख बत्साहिलिकिमारां का संतुलेख बत्साहिलिमारां का संतुलिकिमारां का संतुलिमारां का संतुलिकिमारां का संतुलिमारां का संतुलिमारां का संतुलिमारां का संतुलिमारां का संतुलिमारां का सं (का संतुलिमारां",
"answer": "A",
"explanation_en": "The correct answer is A (The GDP of Rajasthan is Rs. 17.34 lakh crore)",
"explanation_hi": "रां का संतुलिमारां का संतुलिमारां का संतुलिमारां का सं का संतुलिमारां का संतुलिमारां",
},
{
"subject": "Economy",
"topic": "Agriculture",
"question_en": "What is the total GDP contribution of agriculture sector in Rajasthan's economy?",
"question_hi": "रां का संतुलिमारां का संतुलिमारां का संतुलिमारां का संतुलिमारां का संतुलिमारां",
"A_en": "Agriculture",
"A_hi": "रां का संतुलिमारां का संतुलिमारां",
"B_en": "Industry",
"B_hi": "रां का संतुलिमारां",
"C_en": "Services",
"C_hi": "रां का संतुलिमारां का संतुलिमारां",
"D_en": "रां का संतुल