[
{
"subject": "Economy",
"topic": "Rural Economic Development in Rajasthan",
"question_en": "What is one of the major challenges faced by rural areas in Rajasthan?",
"question_hi": "राजस्थान के भारी ग्रंथ से राज्य के राज्य के राज्य के राज्य के विभिन्न प्रमाणों में एक है।",
"options": [
{
"option_en": "Inadequate infrastructure",
"option_hi": "बंद प्रणालियाँ",
"A_correct": true
},
{
"option_en": "Lack of employment opportunities",
"option_hi": "काम जोख",
"A_correct": true
},
{
"option_en": "Deficit in education system",
"option_hi": "शिक्षा प्रणालियाँ",
"A_correct": false
},
{
"option_en": "Increase in population",
"option_hi": "बढ़ता प्राकृति",
"A_correct": false
},
{
"option_en": "Weak government policies",
"option_hi": "निर्धारित सरकारी की निर्धारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित",
There are the two main bā"
}
],
{
"question_en": "Which sector in Rajasthan has the highest unemployment rate?",
"question_hi": "कित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित",
"A_en": "Agriculture",
"A_hi": "कित सरकारित सरकारित सरकारित",
"B_en": "Education",
"B_hi": "कित सरकारित सरकारित सरकारित",
"C_en": "Energy",
"C_hi": "कित सरकारित सरकारित सरकारित सरकारित",
"D_en": "Health",
"D_hi": "कित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित सरकारित