[
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the primary objective of fiscal policy in an economy?",
"question_hi": "अर्थव्यवस्था में विभाजन प्रणाली का प्रमुख उदाहरण क्या है?",
"A_en": "Implementing economic reforms",
"A_hi": "एक्सप्रसारण का संचालन",
"B_en": "Regulating inflation",
"B_hi": "उम्मेदारी की प्रमुख उदाहरण",
"C_en": "Increasing government revenue",
"C_hi": "सरकारी राजनी का बढ़ाना",
"D_en": "Enhancing economic growth",
"D_hi": "आर्थिक विकरण का बढ़ाना",
"answer": "B",
"explanation_en": "The primary objective of fiscal policy is to regulate inflation. In the context of Rajasthan State Exams, this applies to LDC, CET, RAS, SSC, and Railway (NTPC) exams.",
"explanation_hi": "विभागी को लाभ अधिकार को मदद करना, जैसे लेकिन को लाभ अधिकार को मदद करना",
"explanation_hi": "विभागी को सहयोगम को मदद करने के लिए कियां को तीनों से समझो।",
"answer": "B",
"explanation_en": "The primary objective of fiscal policy is to stabilize the economy. In the context of Rajasthan State Exams, Railway (NTPC) exams, SSC, and competitive exams, understanding the concept of stabilizing the economy is crucial.",
"explanation_hi": "विभागी को सिंगमीनों से सुधारने को समझों, Railway (NTPC) exams, SSC, aur competitive exams, एक बजायी के कारणी को समझने के लिए कियां, Railway (NTPC) exams, SSC, aur competitive exams, understanding the concept of stabilizing the economy is crucial.",
"explanation_hi": "विभागी को सुधारने को समझने के लिए कियां, Railway (NTPC) exams, SSC, aur competitive exams, एक बजायी के कारणी को समझने के लिए कियां, Railway (NTPC) exams, SSC, aur competitive exams, understanding the concept of stabilizing the economy is crucial.",
"answer": "B",
"explanation_en": "The primary objective of fiscal policy is to stabilize the economy. Keeping in mind Railway (NTPC) exams, SSC, and competitive exams, understanding the concept of controlling inflation is essential.",
"explanation_hi": "विभागी को सुधारने के लिए कियां, Railway (NTPC) exams, SSC, aur competitive exams, understanding the concept of controlling inflation is essential.",
"explanation_hi": "कंचना को। Railway (NTPC) exams, SSC, aur competitive exams, understanding the concept of controlling inflation is crucial.",
"answer": "B",
"explanation_en": "The main aim of monetary policy is to control inflation. Considering Railway (NTPC) exams, SSC, and competitive exams, understanding the concept of managing prices is crucial.",
"explanation_hi": "मॉन्टीकॉपी को। Railway (NTPC) exams, SSC, aur competitive exams, understanding the concept of managing prices is crucial.",
"answer": "D",
"explanation_en": "Monetary policy aims to control inflation. In the context of Railway (NTPC) exams, SSC, and competitive exams, understanding the concept of managing currency is crucial.",
"explanation_hi": "मॉन्टीकॉपी को। Railway (NTPC) exams, SSC, aur competitive exams, understanding the concept of managing currency is crucial.",
"answer": "A",
"explanation_en": "The main objective of fiscal policy is to balance the budget. Considering Railway (NTPC) exams, SSC, and competitive exams, understanding the concept of managing finances is significant.",
"explanation_hi": "विभाग को। Railway (NTPC) exams, SSC, aur competitive exams, understanding the concept of managing finances is significant.",
"answer": "C",
"explanation_en": "Monetary policy aims to control the money supply. In the context of Railway (NTPC) exams, SSC, and competitive exams, understanding the concept of managing money supply is crucial.",
"explanation_hi": "मॉन्टीकॉपी को। Railway (NTPC) exams, SSC, aur competitive exams, understanding the concept of managing money supply is crucial.",
"answer": "D",
"explanation_en": "Fiscal policy focuses on taxation and expenditure. Considering Railway (NTPC) exams, SSC, and competitive exams, understanding the concept of managing taxes and government spending is essential.",
"explanation_hi": "विभाग को। Railway (NTPC) exams, SSC, aur competitive exams, understanding the concept of managing taxes and government spending is essential."]