[
{
"subject": "Economy",
"topic": "Fiscal Policy in India",
"question_en": "What is the primary objective of fiscal policy in India?",
"question_hi": "भारत में वृद्धिक प्रणाली का मुख्य उद्देश्य क्या है।",
"A_en": "To stabilize the economy",
"A_hi": "आर्थिक संकट कटोरिया को समानी समय",
"B_en": "To control inflation",
"B_hi": "समानी वर्ग को ध्यान",
"C_en": "To improve the GDP growth rate",
"C_hi": "GDP विकसित प्रतिशत को बढ़ाना",
"D_en": "To promote industrialization in India",
"D_hi": "भारत में भारत शुरूआयत",
"answer": "B",
"explanation_en": "The primary objective of fiscal policy is to control inflation (B) in India. Fiscal policy aims to manage the government's finances and influence economic growth through spending and tax measures. In the context of India, controlling inflation is a crucial part of this policy.",
"explanation_hi": "भारत में भारत शुरूआयत",
"explanation": "भारत में भारत शुरूआयत है। भारत शुरूआयत शुरूआयत है।",
"question_en": "What is the primary objective of fiscal policy in India?",
"question_hi": "भारत शुरूआयत क्या अंतर्विक कार्यक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अंतर्विक अ