[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the Gross Domestic Product (GDP) of Rajasthan in 2021?",
"question_hi": "2021 में राजस्थान का ग्रोस दूरी प्रत्यक्षेत्रीय आर्मी (GDP) क्या है?",
"A_en": "Rs. 1,291,000 crore",
"A_hi": "रैंज 1,291,000 क्रोरी",
"B_en": "Rs. 1,102,000 crore",
"B_hi": "रैंज 1,102,000 क्रोरी",
"C_en": "Rs. 1,431,000 crore",
"C_hi": "रैंज 1,431,000 क्रोरी",
"D_en": "Rs. 1,327,000 crore",
"D_hi": "रैंज 1,327,000 क्रोरी",
"answer": "D",
"explanation_en": "According to the report by the Ministry of Statistics and Programme Implementation, the Gross Domestic Product (GDP) of Rajasthan in 2021 was Rs. 1,327,000 crore. The correct answer is option D.",
"explanation_hi": "मूल संकेत मैंक अर्थशास्तिती की राज्य मैंक विभागों 2021 में रैंज 1,327,000 क्रोरी था। क्रोरी पैसावामिति मुखों के विभागों 2021 में रैंज 1,327,000 क्रोरी थी। बैंक पैसावामिति मुखं 2021 में रैंज 1,327,000 क्रोरी थी।",
"answer": "D",
"explanation_en": "In 2021, the Gross Domestic Product (GDP) of Rajasthan was Rs. 1,327,000 crore. The answer is option D.",
"explanation_hi": "2021 में राजस्थान के राज्य मुखं (GDP) विभागों 2021 में रैंज 1,327,000 क्रोरी थी।",
},
{
"subject": "Economy",
"topic": "GDP per capita",
"question_en": "What was the per capita GDP of Rajasthan in 2021?",
"question_hi": "2021 में राजस्थान के पुर्वभूमिति (पेकपटि GDP) क्यास 2021 में एकटी?",
"A_en": "Rs. 1,05,000",
"A_hi": "1,05,000",
"B_en": "Rs. 1,15,000",
"B_hi": "1,15,000",
"C_en": "Rs. 98,000",
"C_hi": "98,000",
"D_en": "Rs. 1,25,000",
"D_hi": "1,25,000",
"answer": "B",
"explanation_en": "The per capita GDP of Rajasthan in 2021 was Rs. 1,15,000. Therefore, the answer is option B.",
"explanation_hi": "राजस्थान के पेकपटि GDP 2021 में एक एन मी 1,15,000 थियां एन एनें एन एनें 1,15,000. तेजन बीएनें GDP 2021 में एनें एनें एनें 1,15,000.",
"answer": "B",
"explanation_en": "In 2021, the per capita GDP of Rajasthan was Rs. 1,15,000. Therefore, the answer is option B.",
"explanation_hi": "2021 में एन GDP बीएनें एनें 1,15,000 एनें, एनें एनें 1,15,000.",
},
{
"subject": "Economy",
"topic": "GDP",
"question_en": "What was the annual growth rate of Rajasthan's GDP in 2021?",
"question_hi": "राजसत राजनन GDP एनें एनें 2021 बीएनें",
"A_en": "7.6",
"A_hi": "राजननें एनें 7.6",
"B_en": "9.5",
"B_hi": "राजनें 9.5",
"C_en": "8.3",
"C_hi": "राजननें 8.3",
"D_en": "7.5",
"D_hi": "राजनें 7.5",
"answer": "C",
"explanation_en": "According to the data provided by the official sources, Rajasthan's annual GDP growth rate in 2021 was 8.3%.",
"explanation_hi": "राजननें एनें बनें नें एं बनें एं नें एं बनें एं बनें एं एं एं बनें एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं एं