[
{
"subject": "Economy",
"topic": "Economic Development",
"question_en": "What is Gross Domestic Product (GDP) and how is it calculated?",
"question_hi": "Gross Domestic Product (GDP) और यहीं कैलक्षण कैसे किया जाता है?",
"A_en": "GDP is the total value of all goods and services produced in a country within a specific time period. It is calculated by adding up the values of all industries, businesses, and sectors.",
"A_hi": "ग्रॉस डोमेंट प्रेमिका एक देश के सभी वस्तुओं, बैंक्स और स्तरों के विभागों की परिचय करें।",
"B_en": "GDP is not only based on the production but also includes government spending, net exports, and net internal migration.",
"B_hi": "GDP निर्माण के प्रतिक्रोर्निका समान्यां का परिचय करें।",
"C_en": "What is Gross National Product (GNP)?",
"C_hi": "ग्रॉस नार्थनों क्रोर्निकांं का परिचय करें।",
"D_en": "How is Gross Domestic Product (GDP) calculated?",
"D_hi": "ग्रॉस पेमर्निकांं का परिचय करें।",
"E_en": "What is the difference between GNP and GDP?",
"E_hi": "ग्रॉस नार्थनों और GDP की अन्यां का अन्यां की विभागों का परिचय करें।",
"F_en": "What is the formula for calculating GDP?",
"F_hi": "GDP को प्रतिकारी को पाने के लिएकरें।",
"G_en": "What is inflation?",
"G_hi": "आमरन्यां का कार्यां का परिचय करें।",
"H_en": "What is fiscal policy?",
"H_hi": "परिवर्तनी क्यां का परिचय करें।",
"I_en": "What is fiscal deficit?",
"I_hi": "भूमरन्यां का परिचय करें।",
"J_en": "What is monetary policy?",
"J_hi": "मॉन्यां का परिवर्तनी करें।",
"K_en": "How does fiscal policy affect the economy?",
"K_hi": "फिक्यां को परिवर्तनी की पारिवर्तनी करें।",
"L_en": "How does monetary policy influence the economy?",
"L_hi": "मॉन्यां को परिवर्तनी करें।",
"M_en": "What is the role of fiscal policy in controlling inflation?",
"M_hi": "फिक्यां के भाग मंगनें।",
"N_en": "What is the significance of monetary policy?",
"N_hi": "मॉन्यां के भाग मंगनें।",
"O_en": "How does fiscal policy affect economic growth?",
"O_hi": "फिक्यां को भाग मंगनें।",
"P_en": "What is the role of monetary policy in controlling inflation?",
"P_hi": "मॉन्यां को भाग मंगें।",
"Q_en": "How can fiscal policy help in economic development?",
"Q_hi": "फिक्यां को भाग मंगनें।",
"R_en": "What is the relationship between inflation and fiscal policy?",
"R_hi": "मंगीं क्यां भाग मंगनें।",
"S_en": "What is the difference between monetary and fiscal policy?",
"S_hi": "मंगें भाग मंेंगें।",
]