[
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the formula for calculating Gross Domestic Product (GDP) at market price?",
"question_hi": "ग्रॉस कामांक के मामले में मार्केट प्रकल्प का प्रकार कैसा है? ",
"A_en": "GDP = C + I + G + (X - M)",
"A_hi": "GDP = C + I + G + (X - M)",
"B_en": "GDP = NNP + TNI + RNI",
"B_hi": "GDP = NNP + TNI + RNI",
"C_en": "GDP = C + I + G + (X - M) + (TNI + RNI)",
"C_hi": "GDP = C + I + G + (X - M) + (TNI + RNI)",
"D_en": "GDP = NNP + TNI + RNI + (X - M)",
"D_hi": "GDP = NNP + TNI + RNI + (X - M)",
"answer": "C",
"explanation_en": "The formula for calculating Gross Domestic Product (GDP) at market price is: GDP = C + I + G + (X - M), where C represents consumption, I represents investment, G represents government expenditure, X represents exports, and M represents imports.\n\nNote: In the context of the exam, the formula should be GDP at market price, not nominal GDP. ",
"explanation_hi": "ग्रॉस डॉलीनेंट (GDP) मार्केट प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण",
"explanation_en": "The formula for calculating Gross Domestic Product (GDP) at market price is: GDP at market price = C + I + G + (X - M)",
"explanation_hi": "ग्रॉस डॉलीनेंट (प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण",
"question_en": "What is the formula for calculating Gross Domestic Product (GDP) at market price?",
"question_hi": "ग्रॉस GDP (मार्क्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रमण प्रतिक्रम प्रतिक्रमण प्रतिक्रमण प्रतिक्रत्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रत्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रत्रतिक्रतिक्रत्रतिक्रतिक्रतिक्रतिक्रत्रतिक्रतिक्रतिक्रतिक्रतिक्रतिक्रत्रत