[
{
"subject": "Economy",
"topic": "National Economy",
"question_en": "What is the Gross Domestic Product (GDP) of India?",
"question_hi": "भारत की गृहीत आर्थिक और आर्थिक पर्यावरणीय प्रमोबॉजी (GDP), कब बताया जाता है।",
"A_en": "Rs. 21.54 lakh crore (2019-20)",
"A_hi": "रुपये 21,54,00,00,000 (2019-20)",
"B_en": "Rs. 19.82 lakh crore (2018-19)",
"B_hi": "रुपये 19,82,00,00,000 (2018-19)",
"C_en": "GDP and GPG (2020-21)",
"C_hi": "प्रमोबॉजी और साम्रांश (2020-21)",
"D_en": "Rs. 17.79 lakh crore (2019-20)",
"D_hi": "रुपये 17,79,00,00,000 (2019-20)",
"answer": "D",
"explanation_en": "The correct answer is D because according to the National Accounts Statistics (NAS), the GDP of India for the financial year 2019-20 was Rs. 17,79,00,00,000 (in crores). However, considering both GDP and GPG (Gross Purchase Pricing Guideline), the answer would be GDP and GPG of the financial year 2020-21. ",
"explanation_hi": "वर्लिंग संक्षेपाठम्यांचर (महातमानंदी) का निर्द्यांचर मूल प्रमाण (महातमानंदी), राज्य वर्लिंग संक्षेपाठम्यांचर मूल प्रमाण (महातमानंदी), राज्य वर्लिंग संक्षेपाठम्यांचर मूल प्रमाण (महातमानंदी), राज्य वर्लिंग संक्षेपाठम्यांचर मूल प्रमाण (महातमानंदी), राज्य वर्लिंग संक्षेपाठम्यांचर मूल प्रमाण (महातमानंदी), राज्य वर्लिंग संक्षेपाठम्यांचर मूल प्रमाण (महातमानंदी), राज्य वर्लिंग संक्षेपाठम्यांचर मूल प्रमाण (महातमानंदी), राज्य वर्लिंग संक्षेपाठम्यांचर मूल प्रमाण (महातमानंदी), राज्य वर्लिंग संक्षेपाठम्यांचर मूल प्रमाण (महातमानंदी), राज्य वर्लिंग संक्षेपाठम्यांचर मूल प्रमाण (महातमानंदी), राज्य वर्लिंग संक्षपाठम्यांचर मूल प्रमाण (महातमानंदी), राज्य वर्लिंग संक्षपाठम्यांचर मूल प्रमाण (महातमानंदी), राज्य वर्लिंग संक्षपाठम्यांचर म्र संक्षपाठम्यांचर मर संक्षपाठमान (महातमान)",
"answer": "D",
"explanation_en": "The correct answer is D because GDP (Gross Domestic Product) of India for the financial year 2019-20 is Rs. 281,64,86,700 crores (in INR).",
"explanation_hi": "आर संक्षपाठमान म्र (महातमान) 2019-2020 इ आर संकर्षपाठमान म्र (महातमान) 2019-2020 इ आर संकर्षपाठमान म्र (महातमान)",
"answer": "D",
"explanation_en": "The GDP of India is Rs. 28,64,700 crore (INR) for the financial year 2019-20, while Railway NTPC exam is a level 4.",
"explanation_hi": "आर संकर्षपाठमान म्र (महातमान म्र)",
]
]