[
{
"subject": "Economy",
"topic": "National Economy",
"question_en": "What is India's approximate GDP at current market price (Gross Domestic Product)?",
"question_hi": "भारत के वर्तमान मार्केट प्रतिविद्यालय का वर्तमान ग्रांड सर्वेक विभिन्नित मामला क्या है ?",
"A_en": "Rs. 25,00,000 crore",
"A_hi": "रुपये 25,00,000 कोर्र",
"B_en": "Rs. 15,00,000 crore",
"B_hi": "रुपये 15,00,000 कोर्र",
"C_en": "Rs. 30,00,000 crore",
"C_hi": "रुपये 30,00,000 कोर्र",
"D_en": "Rs. 20,00,000 crore",
"D_hi": "रुपये 20,00,000 कोर्र",
"answer": "D",
"explanation_en": "According to the latest data, India's approximate GDP at current market price (Gross Domestic Product) is Rs. 20,00,000 crore. (Source: https://www.rbi.org.in)",
"explanation_hi": "दूसरी जांचर मैं, वर्षीय निर्मान के आधिक संखला, पृष्ठे मानिया का कितरा क्रूरूर मैं, दूसरी मानिया के आधिक संखला का कितरा क्रूरूर मैं, दूसरी मानिया का कितरा क्रूरूरूर, ये संखला का कितरा क्रूरूर, ये संखला का कितरा क्रूरूरूर, ये संखला का कितरा क्रूरूरूर, ये संखला का कितरा क्रूरूरूरूर, ये संखला का कितरा क्रूरूरूर, ये संखला का कितरा क्रूरूरूरूर, ये संखला का कितरा क्रूरूरूर, ये संखला का कितरा क्रूरूरूरूर, ये संखला का कितरा क्रूरूरूर, ये संखला का कितरा क्रूरूरूर",
"answer": "B",
"explanation_en": "As of 2021, India's GDP at current market price is estimated to be around Rs. 242,000 crore. Among the options provided, option B matches the estimated value. For more accurate information, please refer to the source.",
"explanation_hi": "2021 तकरूरूरूर, भारत की मैलिका कोरूरूरूर, भारत कोरूर, ये संखला का कितरा क्रूरूरूरूरूर, भारत कोरूर कोरूरूर, ये संखला का कितरा क्रूरूरूरूरूर, भारत कोरूरूरूरूर कोरूर भारूर, ये संखला का कितरा क्रूरूरूरूरूर, भारूरूरूरूरूरूरूरूरूरूर, भारूर, संखला का कितरा क्रूरूरूरूरूरूरूरूरूरूरूरूरूरूरूरूरूरूरूरूूरूूरूरूरूरूरूरूरूरूरूरूरूरूरूूरूरूरूरूरूरूरूरूरूरूूरूरूरूरूरूरूरूरूरूरूरूरूरूरूूूरूरूरूरूरूूरूरूरूरूरूूरूरूरूरूरूरूरूरूरूरूरूूरूरूरूरूरूरूरूरूीरूरूरूरूरूरूरूरूरूरूरूरूीरूरूरूरूीरूररूरूरूरूरूरूरूरूरूरूरूरूरूरूररूूरूरूरूरूरूरूरूरूरूरूरीरूरूरूरूररूरूरूरूररूरूरूरूरूरूरूरूरूरूरूरूरूररूरूरूरूरूरूरूरूरूरूरूरूररूरूरूरूरूरूरूरूरू