[
{
"subject": "Economy",
"topic": "",
"question_en": "What is Gross Domestic Product (GDP)?",
"question_hi": "GDP क्या है?",
"A_en": "Gross National Product", "A_hi": "राष्ट्रीय उन्नेस्ट (GNP)",
"B_en": "Gross State Product", "B_hi": "राज्य की उन्नेस्ट (GSP)",
"C_en": "Gross Domestic Product", "C_hi": "ग्रॉस डोमेनटिव प्रोडक्शन (GDP)",
"D_en": "Gross Regional Product", "D_hi": "ग्रॉस रेजियन प्रोडक्शन (GRP)",
"answer": "C",
"explanation_en": "Gross Domestic Product (GDP) refers to the total value of all goods and services produced within a country's borders during a specific period (usually a year), considering both the production and consumption. It is the broadest measure of a country's economic activity.",
"explanation_hi": "ग्रॉस डोमेंटिव प्रोडक्शन (GDP) - राज्य के अंतरांग की सामना के विभागों का समूंग कोणती (GNP) से अलता हिलेंग कोणती (GNI) से अलता हिलेंग कोणती (GNI) से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती (GNI) कोणती से अलता हिलेंग कोणती से अलता हिलेंग कोणती से अलता हिलेंग कोणती से अलता हिलेंग कोणती से अलता हिलेंग कोणती से अलता हिलेंग कोणती से अलता हिलेंग कोणती से अलता हिलेंग के अलता हिलता हिलेंग कोणती से अलता हिलेंग कोणती से अलता हिलेंग कोणती से अलता हिलेंग कोणती से अलता हिलेंग कोणती से अलता हिलेंग कोणती से अलता हिलेंग कोणती से अलता हिलेंग कोणती से अलता हिलेंग कोणती से अलता हिलेंग कोणती से अलता हिलेंग क