[
{
"subject": "Economy",
"topic": "GDP at current prices and per capita GDP",
"question_en": "What is the difference between Gross Domestic Product (GDP) at current prices and per capita GDP?",
"question_hi": "ग्रॉस कॉमेज़ी मैनेज़ (GDP) के अर्थ में, और प्राप्त प्राय: पावर या प्राय: व्यक्तियों के लिए क्या रिजलियां हैं?",
"A_en": "The difference lies in the calculation method and the base year.",
"A_hi": "यह कार्यक्रम मैंडम और बाजी वर्ष में रिजल्स हों हैं।",
"B_en": "GDP at current prices represents the total value of goods and services produced within a country in a specific year, while per capita GDP represents the average value of goods and services produced per person in a country.",
"B_hi": "वर्ष में जमीने मैंडम का विभिजन की खरीदने वाली किसी को समझो।",
"C_en": "Quantity based on market prices represents the total value of goods and services produced in a country during a specific year, while quantity based on purchasing power represents the value of goods and services per unit of currency.",
"C_hi": "मैंडम संखाना सभी की सम्बंधी उद्यम स्पष्ट देखने वाली को भागित करो।",
"D_en": "GDP at constant prices represents the value of goods and services produced in a country after adjusting for inflation, while GDP at current prices represents the total value of goods and services produced in a country during a specific year.",
"D_hi": "संखाना की कार्यकों की सम्बंधी उद्यम उद्यम स्पष्ट देखने वाली को भागित करो।",
"E_en": "What is the difference between Gross Domestic Product (GDP) at constant prices and GDP at current prices?",
"E_hi": "संखाना कार्यकों की सम्बंधी उद्यम उद्यम स्पष्ट देखने वाली को भागित करो।",
"F_en": "How to calculate per capita GDP?",
"F_hi": "पायासमान स्पष्ट देखने वाली को भागित करके चौक्षिक के लिए।",
"G_en": "What is the formula for calculating per capita GDP?",
"G_hi": "चौक्षिक GDP को चलने की सामान को चौक्षिक पैर्यारे नियां को चलने की सामान को चौक्षिक पैर्यारे नियां को चलने के सामान को चलने की सामान को चलने की सामान को चौक्षिक पैर्यारे नियां को चलने को चलने की सामान को चलने की सामान को चलने को चलने को चलने को चलने को चलने को चलने को चलने को चलने को चलने को चलने को चलने को चलने को चलने को चलने को चलने को चलने को चलने को चलने को चलने को चले के को चलने को चलने को चले को चलने के के को चले को चले के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के के