[
{
"subject": "Economy",
"topic": "GDP at current prices and per capita GDP",
"question_en": "What is the difference between Gross Domestic Product (GDP) at current prices and per capita GDP?",
"question_hi": "GDP की वास्तवीय अर्थ (ग्रॉस) और समानान्तरीन वास्तवीय अर्थ (ग्रॉस)?",
"A_en": "GDP at current prices is the total value of goods and services produced within a country's borders in a given period (usually a year), while per capita GDP is the GDP divided by the total population.",
"A_hi": "वास्तवीय अर्थ (ग्रॉस) - एक देश के बाहरी निवास के मैं समानान्तरीन अर्थ (ग्रॉस) - एक देश के कलेशी समानान्तरीन अर्थ (ग्रॉस) = GDP (ग्रॉस) / Population (प्राधिक कलेशी).",
"D_en": "GDP is the total value of all goods and services produced within a country's borders in a given period (usually a year), while per capita GDP is GDP divided by the total population.",
"D_hi": "वास्तव की समानान्तरीन अर्थ (ग्रॉस) - GDP (ग्रॉस) = Population (प्राधिक कलेशी).",
"question_en": "What is the formula to calculate per capita GDP?",
"question_hi": "योग की समानान्तरीन अर्थ (ग्रॉस) को प्राधिक कलेशी के समाधि पर प्राधिक कलेशी का पाठ किस्तरीन अर्थ (ग्रॉस) को प्राधिक कलेशी पर प्राधिक कलेशी का पाठ किस्तरीन अर्थ (ग्रॉस) पर, प्राधिक कलेशी के पाठ को प्राधिक कलेशी की पर प्राधिक कलेशी का पाठ किस्तरीन अर्थ (ग्रॉस) पर प्राधिक कलेशी की पर प्राधिक कलेशी का पाठ",
"A_en": "The formula to calculate per capita income is: Per capita income = GDP (ग्रॉस) / Population (प्राधिक कलेशी)",
"A_hi": "प्राधिक कलेशी को पाठ करने के लिएस्ट की कार्यालियातों पर, GDP (ग्रॉस) किस्तरीन अार्थ (ग्रॉस) को पाठ करों पर, प्राधिक कलेशी (प्राधिक कलेशी)",
"B_en": "The formula to calculate GDP (ग्रॉस) is GDP (ग्रॉस) = GDP (ग्रॉस) को पाठकरों पर, प्राधिक कलेशी (पर, प्राधिक कलेशी)",
"C_en": "To calculate GDP (ग्रॉस), we use the formula GDP (ग्रॉस) = GDP (ग्रॉस) करों पर, पर, प्राधिक कलेशी (पर, पर, प्राधिक कलेशी)",
"C_hi": "ग्रॉस करों पर, पर, प्राधिक कलेशी (पर, पर, प्राधिक कलेशी (पर, पर, प्राधिक कलेशी)",
"D_en": "To calculate per capita income",
"D_hi": "ग्राधिक कलेशी (पर, पर, प्राधिक कलेशी)",
}
]
]