[
{
"subject": "Economy",
"topic": "GDP of India",
"question_en": "What was the Gross Domestic Product (GDP) of India in 2020?",
"question_hi": "2020 में भारत का ग्रॉस रीयन प्रौद्योगिक सेना (GDP) क्या था?",
"A_en": "Rs. 217,000 crore",
"A_hi": "रुल 21,70,000 करोड़",
"B_en": "Rs. 205,000 crore",
"B_hi": "रुल 20,50,000 करोड़",
"C_en": "Rs. 192,000 crore",
"C_hi": "रुल 19,20,000 करोड़",
"D_en": "Rs. 181,000 crore",
"D_hi": "रुल 18,10,000 करोड़",
"answer": "D",
"explanation_en": "The Gross Domestic Product (GDP) of India in 2020 was Rs. 181,000 crore. The correct answer is D.",
"explanation_hi": "भारत के 2020 मैं रुल 181,000 करोड़ का GDP था। हिंदी मैं तत्व का निर्द्वार्थ (GDP) को तत्व का निर्द्वार्थ (GDP) को तत्व, भारत मैं निर्द्वार्थ (GDP) का निर्द्वार्थ (GDP) को तत्व को निर्द्वार्थ (GDP) का निर्द्वार्थ (GDP) को तत्व को निर्द्वार्थ (GDP) का निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को न्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वार्थ (GDP) को निर्द्वा