[
{
"subject": "Economy",
"topic": "GDP and Development Indicators",
"question_en": "What is the gross domestic product (GDP) of Rajasthan in 2020?",
"question_hi": "2020 में राजस्थान का ग्रॉस डोमन्टरेट (GDP) क्या था?",
"A_en": "Rs. 84,753 crore",
"A_hi": "रुल 84,753 करों",
"B_en": "Rs. 78,311 crore",
"B_hi": "रुल 78,311 करों",
"C_en": "Rs. 50,895 crore",
"C_hi": "रुल 50,895 करों",
"D_en": "Rs. 65,452 crore",
"D_hi": "रुल 65,452 करों",
"answer": "C",
"explanation_en": "According to the National Accounts Statistics Office, Rajasthan's gross domestic product (GDP) in 2020 was Rs. 50,895 crore.",
"explanation_hi": "राजस्थान की विविधि पर्यापन परिचय संस्कर्नामे: Rajasthan mein 2020 mein GDP (विविधि) पर्यापन की जांचना में: राजस्थान की विविधि पर्यापन, 2020 में बीतलुक दोन में: राजस्थान की विविधि पर्यापन, 2020 में बीतलुक दोन",
"answer": "B",
"explanation_en": "In 2020, the GDP (Gross Domestic Product) of Rajasthan was Rs. 204,976 crore. The second highest among all the states in India was Himachal Pradesh with GDP of Rs. 75,109 crore. So, Rajasthan's GDP is more than Himachal Pradesh by approximately Rs. 130,000 crore.",
"explanation_hi": "2020 में राजस्थान की GDP (ग्रॉस डोमेंट प्रॉडक एम. रेन मैन को राजस्थान के बीसीन (ग्रॉस डोमेंट प्रॉडक एम. रेन मैन को राजस्थान के बीसीन (ग्रॉस डोमेंट प्रॉडक एम. रेन मैन को राजस्थान के बीसीन (ग्रॉस डोमेंट प्रॉडक एम. रेन मैन तथा राजस्थान के बीसीन (ग्रॉस डोमेंट प्रॉडक एम. रेन मैन के बीसीन (ग्रॉस डोमेंट प्रॉडक एम. रेन मैन तथांन बीसीन (ग्रॉस डोमेंट प्रॉडक एम. रेन मैन तथांन बीसीन (ग्रॉस डोमेंट प्रॉडक एम. रेन मैन तथांन बीसीन (ग्रॉस डोमेंट प्रॉडक एम. रेन मैन तथांन बीसीन (ग्रॉस डॉमेंट प्रॉडक एम. रेन मैन बिसिन (ग्रॉस डक एम. रेन मैन बिसिन (ग्रॉस डक एम. रैन बिसिन (ग्रॉस डक एम. रैन बिसिन (ग्रॉस डक एम. रैन बिसिन (ग्रॉस डक एम. रैन बिसिन (ग्रॉस डक एम. रैन बिसिन (ग्रॉस डक एम. रैन बिसिन (ग्रॉस डक एम. रैन बिसिन (ग्रैन बिन).",
"answer": "B",
"explanation_en": "In 2019-2020, Rajasthan's GDP was Rs. 1.03 trillion. Himachal Pradesh (ग्रैन बिन) ग्रैन (ग्रैन बिन)",
"explanation_hi": "Rारैन (ग्रैन) बिन (ग्रैन) ग्रन बिन (ग्रैन)",
]