[
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is not a subsidiary of the National Highways Authority of India?",
"question_hi": "दोस्तीं, मैं क्या निम्नलिst एक National Highways Authority of India के सहयोगी नहीं।",
"A_en": "National Building Code of India",
"A_hi": "राजायते काम का संविधान",
"B_en": "National Green Tribunal",
"B_hi": "राज्य भार कोणत्यांच्या मध्ये वापरीत गर्वता",
"C_en": "National Highways Authority of India",
"C_hi": "राजायते भार कोणत्यांच्या मध्ये मार्गे",
"D_en": "National Building Code of India",
"D_hi": "राजायते भार का पात्री",
"answer": "D_en",
"explanation_en": "National Building Code of India is a standard set of regulations for construction safety, building standards, and health, sanitation, and fire safety of buildings. It is not a subsidiary of the National Highways Authority of India. National Highways Authority of India is responsible for development and maintenance of National Highways in India.",
"explanation_hi": "राजायते भार का पात्री का प्रधान संकेंच्या दामों चे संकेचे विविधि",
"answer": "C_en",
"explanation_en": "The National Highways Authority of India is responsible for the development and maintenance of national highways in India. National Building Code of India deals with regulations for construction safety, building standards, and health, sanitation, and fire safety of buildings.",
"explanation_hi": "राजायते भार का संकेचे विविधि",
"answer": "B_en",
"explanation_en": "The Reserve Bank of India is the central bank of India and plays a crucial role in shaping the country's monetary policy. It was established in 1935 and its headquarters are located in Mumbai. Railway Budget is a part of the Union Budget of India and announces annual plans and proposals for the Indian Railways department.",
"explanation_hi": "राजायते भार का संकेचे विविधि",
"answer": "A_en",
"explanation_en": "The Indian rupee is the official currency of India. It is subdivided into 100 paise and is denoted by the symbol INR or Rs. The currency was introduced during the British rule and has since evolved to its current form.",
"explanation_hi": "भारतीय रुपया",
"answer": "D_en",
"explanation_en": "The National Bank for Agriculture and Rural Development (NABARD) is a development bank in India that focuses on rural development and agriculture. It was established in 1984 and its headquarters are located in Mumbai.",
"explanation_hi": "राजायते भारतीय राजार्थ एवं अर्जीविक और आर्मानंतीय राजार्थ क्षीय अर्जीविक एन मार्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जिक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीविक अर्जीवि