[
{
"subject": "Economy",
"topic": "GDP at Current Market Price",
"question_en": "What is the Gross Domestic Product (GDP) of Rajasthan at Current Market Price in 2020?",
"question_hi": "2020 में राजस्थान का अवसर समाजशास्त्रीय आयात (GDP) किस विभाग में मैनून किया गया था?",
"A_en": "Rs. 1,08,434 Cr.",
"A_hi": "रुपये 1,08,434 करोड़",
"B_en": "Rs. 1,00,000 Cr.",
"B_hi": "रुपये 1,00,000 करोड़",
"C_en": "Rs. 85,000 Cr.",
"C_hi": "रुपये 85,000 करोड़",
"D_en": "Rs. 1,20,000 Cr.",
"D_hi": "रुपये 1,20,000 करोड़",
"answer": "C",
"explanation_en": "According to the National Accounts Statistics, in 2020, the GDP of Rajasthan in Current Prices was Rs. 85,000 Cr. (RoC).",
"explanation_hi": "राजस्थान के वर्षीय आयात कें वर्षीय प्रमाण (RoC) कें, राजस्थान के वर्षीय आयात (Rs. 85,000 Cr.) है।",
"explanation_en": "According to the National Accounts Statistics, the GDP of Rajasthan in Current Prices was Rs. 85,000 Crore in 2020.",
"explanation_hi": "राजस्थान के बीएस, 2020 के वर्षीय प्रमाण (Rs. 85,000 Crore) है।",
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "Which of the following is the annual inflation rate of India in the year 2020?",
"question_hi": "बाजार शिकारी के ये परिमाणी कें ये वर्षीय प्रमाण (योजीकार के योजीकर कें वर्षीय प्रमाण (योजीकार कें योजीकर कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वरषीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कर कें वर्षीय प्रमाण (योजकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें वर्षीय प्रमाण (योजीकार कें व