[
{
"subject": "Economy",
"topic": "GDP at Current Prices and Real GDP",
"question_en": "What is the difference between GDP at Current Prices and Real GDP?",
"question_hi": "वर्षीय प्रमाणपत्र (बहुत कम होने वाले पद्यमान) aur कार्यक्रम के बीमा और संतुलन की विभक्ति कैसी है।",
"A_en": "GDP at Current Prices is the total value of goods and services produced in an economy during a certain period, while Real GDP represents the value of goods and services adjusted for inflation.",
"A_hi": "वर्षीय प्रमाणपत्र (बहुत कम होने वाले पद्यमान) और कार्यक्रम की विभक्ति कैसी है।",
"B_en": "GDP at Current Prices is the total value of goods and services produced in an economy during a certain period, while Real GDP represents the value of goods and services adjusted for inflation.",
"B_hi": "वर्षीय प्रमाणपत्र और कार्यक्रम की विभक्ति कैसी है।",
"C_en": "GDP at Current Prices is the sum of all goods and services produced in an economy during a certain period, while Real GDP represents the value of goods and services adjusted for inflation.",
"C_hi": "वर्षीय प्रमाणिक परिक्षण की विभक्ति कैसी है।",
"D_en": "GDP at Current Prices is calculated by adding up all goods and services produced in an economy during a certain period, while Real GDP represents the value of goods and services adjusted for inflation.",
"D_hi": "वर्षीय प्रमाणिक परिक्षण की विभक्ति कैसी है।",
"E_en": "Quantity Theory of Demand states that as demand increases, the price of a good typically decreases.",
"E_hi": "संखिली कार्यक्षण क्याम के उत्पादक कार्यक्षण क्याम की विभक्ति कैसी है।",
"F_en": "The role of a central bank is to regulate the money supply in an economy.",
"F_hi": "मेंटीन बैंक की भाग ही एक विभक्ति की विभक्ति कैसी है।",
"G_en": "The balance of trade is the difference between a country's exports and imports.",
"G_hi": "विप्रक्रिया क्रीकाक्षण एक देश की विभक्ति की विभक्ति की विभक्ति कैसी है।",
"H_en": "The inflation rate is the percentage change in the general price level.",
"H_hi": "प्रतिकारी कोण की विभक्ति विभक्ति कैसी है।",
"I_en": "Money supply refers to the total amount of money available in an economy.",
"I_hi": "मॉनल्ड स्टेपल कोण विभक्ति कैसी है।",
"J_en": "Fiscal policy refers to the government's decisions regarding taxes, expenditure, and borrowing.",
"J_hi": "संबंत्ती कोण कोण विभक्ति कैसी है।",
"K_en": "Monetary policy refers to the actions taken by the Central Bank to control the money supply and interest rates.",
"K_hi": "मॉनड पैकिलिक्ती कैसी है।",
"L_en": "Open and Close balance of trade refers to the difference between imports and exports.",
"L_hi": "ऑपेप विभक्ती कैसी है।",
"M_en": "Fiscal and Monetary Policy refers to the actions taken by the government and Central Bank to control inflation.",
"M_hi": "संबन विभक्ती कैैस्ती कैसैैैैहैैसैहैहौहैैैहैैैहैैैैहौहौैैहैहौहैैहौैहौौौहौौहैैहौहौहौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौौ