[
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the formula to calculate National Income? ",
"question_hi": "राष्ट्रीय आय को किया जाने के लिए कैसे एकाए किया जाना है।",
"A_en": "Adjusted Gross National Product (AGNP)",
"A_hi": "सुन्दर्भवन राष्ट्रीय प्रतियोगी (सुन्दर्भवन) ",
"B_en": "Gross National Product (GNP)",
"B_hi": "ग्रॉस राष्ट्रीय प्रतियोगी",
"C_en": "Gross Domestic Product (GDP)",
"C_hi": "ग्रॉस कॉमोजनिक प्रतियोगी",
"D_en": "National Income",
"D_hi": "राष्ट्रीय आय",
"answer": "D",
"explanation_en": "National Income is the overall value of all goods and services produced within a country's borders in a given period of time (usually a year). It is calculated by adding up the Gross Domestic Product (GDP) and Gross State Product (GSP) of each state.",
"explanation_hi": "राष्ट्रीय आय एक दीवान की विकल्पूर्व के निवासी कितीय डायन के पूर्वीय कितीय डायन के निवासी पूर्वीय कितीय डायन",
"answer": "B",
"explanation_en": "The Gross Domestic Product (GDP) is the total value of all goods and services produced within a country's borders during a specific period of time (usually a year). It is calculated by adding up the values of all goods and services produced.",
"explanation_hi": "राष्ट्रीय एचयीं कितीय डायन की पूर्वीय एचयीं की पूर्वीय एचयीं की कितीय डायन",
"explanation_hi": "राष्ट्रीय एची की पूर्वीय एची की कितीय डायन",
"answer": "B",
"explanation_en": "Gross National Product (GNP) is the total value of goods and services produced by a country's citizens, both at home and abroad.",
"explanation_hi": "राष्ट्रीय एची कितीय डायन",
"explanation_en": "National Income is the total value of goods and services produced within a country during a specific period, usually a year.",
"explanation_hi": "राष्ट्रीय एची कितीय डायन",
"explanation_en": "National Income is calculated by adding up the values of all goods and services produced within the country.",
"explanation_hi": "राष्ट्रीय एची कितीय डायन",
"explanation_en": "National Product is the total value of goods and services produced by citizens both at home and abroad.",
"explanation_hi": "राष्ट्रीय एची कितीय डायन",
"explanation_en": "National Product is calculated by considering the production of goods and services both within the country and outside it.",
"explanation_hi": "राष्ट्रीय एची कितीय डायन",
"explanation_en": "National Income is determined by adding up the values of goods and services produced within the country.",
"explanation_hi": "राष्ट्रीय एची कितीय डायन",
]