[
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the formula for calculating Gross Domestic Product (GDP)?",
"question_hi": "ग्रॉस देशीय आय (GDP) को कैसे समझने का पाठ बनाया जाता है।",
"A_en": "GDP = C + I + G + (X - M)",
"A_hi": "GDP = C + I + G + (X - M)",
"B_en": "GDP = C + I + G + NX",
"B_hi": "GDP = C + I + G + NX",
"C_en": "GDP = C + I + (G + NX)",
"C_hi": "GDP = C + I + (G + NX)",
"D_en": "GDP = C + I + (G + X - M)",
"D_hi": "GDP = C + I + (G + X - M)",
"answer": "D",
"explanation_en": "The correct formula for calculating Gross Domestic Product (GDP) is GDP = C + I + (G + X - M)",
"explanation_hi": "स्वरूपने की सही पाठ है, GDP = C + I + (G + X - M)।",
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is Inflation and how is it measured?",
"question_hi": "तमन्त्री क्या है और किसी तरह मानदींग गयी करने के लिए।",
"A_en": "Inflation is the rate at which prices of goods and services are rising in an economy over time. It is measured as the percentage increase in the Consumer Price Index (CPI) or Producer Price Index (PPI).",
"A_hi": "तमन्त्री योग्रान्त्री किस्त्री के लिएकी गयी अन्तर्रान्त्री की तरह करने कुचदारी अन्तर्रान्त्री की तरह करने कुचदारी अन्तर्रान्त्री की तरह करने कुचदारी अन्तर्रान्त्री की तरह करने कुचदारी अन्तर्रान्त्री की तरह करने कुचदारी अन्तर्रान्त्री की तरह करने कुचदारी अन्तर्रान्त्रों की तरह करने को कुचदारी अन्तर्रान्त्रों का प्रतिकरण को कुचदारी अन्तर्रान्त्रों की तरह करने को कुचदारी अन्तर्रान्त्रों की तरह करने को कुचदारी अन्तर्रान्त्रों की तरह करने को कुचदारी अन्तर्रान्त्रों की तरह करने को कुचदारी अन्तर्रान्त्रों की तरह करने को कुचदारी अन्त्रान्त्रों की तरह करने को कुचदारी अन्त्रान्त्रान्त्रों की तरह करने को कुचदारी अन्त्रान्र्त्रान्र्रान्त्रान्र्र्रान्रान्र्रान््र्र्रान्रान्रान्रान्र्र्रान्र्रान्रान्र्रान्रान्रान्रान्र्रान्रान्रान्रान्रान्रान्रान्रान्रान्रान्रान्रान्रान्रान्रान्रान्रा्रान्रान्रान्रा्रान्रान्रान्रा्रा्रान्रान्रान्रा्रा्रा न््रा्रान्रा्रान्रान्रान्रा्रान्रा्रा्रा्रान्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रान्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा्रा