[
{
"subject": "Economy",
"topic": "",
"question_en": "Which of the following is not a sector of Indian Economy?",
"question_hi": "भारत के एकीकरण में कौन-सा नहीं है?",
"A_en": "Agriculture",
"A_hi": "आजमा",
"B_en": "Industry",
"B_hi": "भाषा",
"C_en": "Finance",
"C_hi": "वित्त",
"D_en": "Education",
"D_hi": "शिक्षा",
"answer": "B",
"explanation_en": "Industry is not a sector of Indian Economy.",
"explanation_hi": "भाषा भारत के एकीकरण में नहीं है।",
"explanation_hi": "Industry is not a sector of Indian Economy."
},
{
"subject": "Economy",
"topic": "",
"question_en": "Which of the following is India's largest sector?",
"question_hi": "भारत के बड़े विभाग कौन-कौन है।",
"A_en": "Agriculture",
"A_hi": "आजमा",
"B_en": "Manufacturing",
"B_hi": "तंत्रोत्र",
"C_en": "Services",
"C_hi": "सेवा",
"D_en": "Trade",
"D_hi": "बाजी",
"answer": "C",
"explanation_en": "Services sector accounts for a larger share of India's GDP compared to Agriculture and Manufacturing sectors.",
"explanation_hi": "सेवा भारत के GDP के बढ़ी अनुभवन्तिज्ञान और तंत्रोत्र से पूर्वपूर्व सामरण",
"explanation_hi": "सेवा, भारत के GDP की कुल्यान्तिज्ञान और तंत्रोत्र से पूर्वपूर्व सामरण",
"answer": "C",
"explanation_en": "Industry and Trade sector contribute more to India's GDP compared to Agriculture and Education.",
"explanation_hi": "भारत के GDP के कुल्यान्तिज्ञान और तंत्रोत्र से पूर्वपूर्व सामरण",
"explanation_en": "Industry and Trade sectors contribute more to the Indian economy than Agriculture and Education.",
"explanation_hi": "भारतीय वित्तीय स्वयंतिज्ञान और तंत्रोत्र से पूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वपूर्वैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैेैैेैेैेेैेैैेैैैैैैैैैैैैैैैैैैैैैैैैैैैैेैैेेैेैेैेैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैैै