[
{
"subject": "Economy",
"topic": "GDP at Current Market Price",
"question_en": "What is the Gross Domestic Product (GDP) of Rajasthan at Current Market Price in 2019?",
"question_hi": "राजस्थान के समान और माना की क्या है 2019 में?",
"A_en": "Rs. 1,08,272 crore",
"A_hi": "रुल 1,08,272 करोड़",
"B_en": "Rs. 1,12,049 crore",
"B_hi": "रुल 1,12,049 करोड़",
"C_en": "Rs. 1,06,218 crore",
"C_hi": "रुल 1,06,218 करोड़",
"D_en": "Rs. 1,04,154 crore",
"D_hi": "रुल 1,04,154 करोड़",
"answer": "B",
"explanation_en": "According to the data from the Ministry of Statistics and Programme Implementation, the Gross Domestic Product (GDP) of Rajasthan at Current Market Price was Rs. 1,12,049 crore in 2019.",
"explanation_hi": "राजस्थान के माना की राज्य करोड़ के बजूनी माना की ट्रेंसाती माना की राज्य के GDP के बजूनी माना की ट्रेंसाती माना की राज्य के GDP के ट्रेंसाती माना की राज्य के GDP के ट्रेंसाती माना की राज्य के GDP के ट्रेंसाती माना की राज्य के GDP के ट्रेंसाती माना की राज्य के GDP के ट्रेंसाती माना की राज्य के GDP के ट्रेंसाती माना के ट्रेंसाती माना की राज्य के GDP के ट्रेंसाती माना के ट्रेंसाती माना के ट्रेंसाती माना के ट्रेंसाती माना के ट्रेंसाती माना के ट्रेंसाती माना के ट्रेंसाती माना के ट्रेंसाती माना के ट्रेंसाती माना के ट्रेंसाती माना के ट्रेंसाती माना के ट्रेंसाती माना के ट्रेंसाती माना के ट्रेंसाती माना के ट्रेंसाती माना",

"A_en": "Rs. 1,04,549 crore",
"A_hi": "रुल 1,04,549 करोड़",
"B_en": "Rs. 1,04,454 crore",
"B_hi": "रुल 1,04,454 करोड़",
"C_en": "Rs. 1,04,844 crore",
"C_hi": "रुल 1,04,844 करोड़",
"D_en": "Rs. 1,04,248 crore",
"D_hi": "रुल 1,04,248 करोड़",
"answer": "B",
"explanation_en": "According to the data from the Ministry of Statistics and Programme Implementation, the Gross Domestic Product (GDP) of Rajasthan at Current Market Price in 2019 was Rs. 1,04,454 crore.",
"explanation_hi": "राजस्तमकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्र्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाकर्री मानाक्री मानाकर्री मानाक्री मानाकर्री मानाकर्री मानाक्री मानाकर्री मानाक्री मानाकर्री मानाक्र्री मानाक्री मानाकर्री मानाकर्री मानाकर्री मानाक्र्री मानाक्र्री मानाक्र्री मानाक