[
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is national income?",
"question_hi": "राष्ट्रीय आर्मी क्या है।",
"A_en": "Gross Domestic Product (GDP)", "A_hi": "ग्रॉस डोमेनप्रॉप (GDP)",
"B_en": "Gross National Product (GNP)", "B_hi": "ग्रॉस नेशनल प्रॉप (GNP)",
"C_en": "Gross State Product (GSP)", "C_hi": "ग्रॉस स्टेट प्रॉप (GSP)",
"D_en": "National Accounts", "D_hi": "राष्ट्रीय अकाउंटेंट (NA)",
"answer": "B",
"explanation_en": "National Income refers to the total value of goods and services produced within a country during a specific period, usually a year. Gross National Product (GNP) is a measure of a nation's economic activity based on the production of goods and services across the world, while Gross Domestic Product (GDP) is based only on production within a country's borders.\n\nGross State Product (GSP) calculates the total value of goods and services produced in a particular state within a country.\n\nNational Accounts (NA) includes information related to the economy as a whole, covering various sectors like agriculture, industry, and services.\n\nThe answer is 'B' (Gross National Product) as it represents the total economic activity across the country.",
"explanation_hi": "राष्ट्रीय आयोजन (NA) समाधि के राज्य में निर्माणी के सामान्य के प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिक्रेशन एयर (RAS), सर्वेंके प्रतिकेशन एयर (RAS), सर्वेंके प्र (RAS), सर्वेंकेंकेंकेंकर (RAS), सर्वेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकर (RAS), सर्वेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकर (RAS), सर्वेंकेंकेंकेंकेंकेंकेंकर (RAS), सर्वेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकेंकें