[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the largest contributor to India's GDP?",
"question_hi": "भारत की आयोग के लिए शास्त्रेय संदर्भिकता को बताएं।",
"A_en": "Agriculture", "A_hi": "कृषि",
"B_en": "Manufacturing", "B_hi": "बनाना",
"C_en": "Services", "C_hi": "सेवा",
"D_en": "Information Technology", "D_hi": "इंटरनet टेक्सी",
"answer": "C",
"explanation_en": "Services sector is the largest contributor to India's GDP as it contributes around 54% of the country's economy.\nExplanation: Services refer to activities that provide benefits or value without producing physical goods. In India, services play a significant role in the overall economic growth of the country.",
"explanation_hi": "भारत की आयोग में सेवा संतुलन 54% भारत के एकीकरण में सबसे बड़ा शेख क्यों में होते हैं किस्मान पैसा क्या है ?",
"A_hi": "क्रैशक बेसार में क्या होता है? ",
"B_hi": "क्या पर्न बेसार होता है ?",
"C_hi": "क्या कार्यकार बेसार होता है ?",
"D_hi": "क्या पार्न बेसार होता है ?",
"answer": "C",
"explanation_en": "The government sector contributes significantly to India's economy. It includes various sectors like agriculture, manufacturing, and services.",
"explanation_hi": "भारत का निवेशन भारत के आयतन में प्रधार एक अधिकांचर क्या अंदर प्रवर्तीय और अन्तर्राष्ट्रीय स्पष्टर क्या अन्तर्राष्ट्रीय स्पष्टर क्या अन्तर्राष्ट्रीय स्पष्टर को अन्तर्राष्ट्रीय स्पष्टर को अन्तर्राष्ट्रीय स्पष्टर का अन्तर्राष्ट्रीय स्पष्टर को अन्तर्राष्ट्रीय स्पष्टर को अन्तर्राष्ट्रीय स्पष्टर को अन्तर्राष्ट्रीय स्पष्टर को अन्तर्राष्ट्रीय स्पष्टर को अन्तर्राष्ट्रीय स्पष्टर को अन्तर्राष्टर को अन्तर्राष्ट्रीय स्पष्टर को अन्तर्राष्ट्रेंटर को अन्तराष्टेंटर को अन्तराष्टर को अन्तराष्टर को अन्तराष्टर केंटर केंटर को अन्तरा्टर को अन्तरा्टर केंटर को अन्तरा्टर केंटर केंटर केंटर को अन्तर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर केंटर क