[
{
"subject": "Economy",
"topic": "Government Policies and Schemes",
"question_en": "Which of the following schemes is not a part of Atal Pension Yojana?",
"question_hi": "आतंक पॉनिस्ट के माध्यम से निष्कर्षणिक योजना में कौन से नियमित प्रश्न है ?",
"A_en": "New Pension Scheme",
"A_hi": "नई पॉनिस्ट योजना",
"B_en": "Pradhan Mantri Jeevan Jyoti Bima Yojana",
"B_hi": "प्रधानमंत्री जीवन ज्यादा योजना",
"C_en": "National Pension Scheme",
"C_hi": "राष्ट्रीय पॉनिस्ट योजना",
"D_en": "Mudra Yojana",
"D_hi": "मुद्रा योजना",
"answer": "D",
"explanation_en": "The scheme introduced by the government to provide credit to small businesses and artisans is Mudra Yojana. National Pension Scheme, Pradhan Mantri Jeevan Jyoti Bima Yojana, and Pradhan Mantri Mudra Yojana are included in National Pension Scheme category.",
"explanation_hi": "सरकार ने मैं विश्वामिति प्रधानमंत्री मुद्रा योजना वाली है, निज़ादा योजना aur प्रधानमंत्री मुद्रा योजना के माध्यम वाली है।",
"answer": "D",
"explanation_en": "The scheme introduced by the Government to provide financial assistance to unemployed youth is Pradhan Mantri Mudra Yojana. National Pension Scheme and Pradhan Mantri Jeevan Jyoti Bima Yojana are part of the National Pension Scheme category.",
"explanation_hi": "राष्ट्रीय नौकरी योजना के आधारन के माध्यम वाली है।",
},
{
"subject": "Economy",
"topic": "Economic Development",
"question_en": "Which of the following is not a part of the Make in India campaign?",
"question_hi": "क्या निर्माण योजना के कार्यकर्म के सम्मान के सार्वेदिक कार्यकर्म के सार्वेदिक कार्यकर्म कारण्यामी समाना निर्माण मंत्री के सार्वेदिक कार्यकर्म के सार्वेदिक कार्यकर्म के सार्वेदिक कार्यकर्म कार्यामी सार्वेदिक कार्यामी सार्वेदिक कार्यामी सार्वेदिक कार्यकर्म कार्यामी सार्वेदिक कार्यामी सार्वेदिक कार्यामी सार्वेदिक कार्यामी सार्वेदिक कार्यामी सार्वेदिक कार्यामी सार्वेदिक कार्यामी सार्वेदिक कार्यामी सार्वेदिक कार्यामी सार्वेदिक कार्यामी सार्वेदिक कार्यामी सारेदिक कार्यामी सारेदिक कार्यामी सारैदिक कार्यामी सारैदिक कारेदिक कारेदिक कारेदिक कारैदिक कारेदिक कारेदिक कारेदिक कारैदिक कारेदिक कारेदिक कारेदिक कारैदिक कारेदिक कारिक कारैदिक कारेदिक कारेदिक कारेदिक कारेदिक कारेदिक कारैदिक कारेदिक कारेदिक",
"
],
"question_en": "Which of the following is not a part of Make in India campaign?",
"question_hi": "केदिक कारेदिक कारेदिक कारेदिक कारेदिक",
"A_en": "E-Promotional Scheme",
"A_hi": "केदिक कारेदिक कारेदिक कारेदिक",
"B_en": "National Infrastructure Development Programme",
"B_hi": "केदिक कारेदिक कारेदिक कारेदिक",
"C_en": "Economic Empowerment Scheme",
"C_hi": "केदिक कारेदिक कारेदिक कारेदिक",
"D_en": "Dual Development Scheme",
"D_hi": "केदिक कारेदिक कारेदिक",
"answer": "C",
"explanation_en": "National Infrastructure Development Programme is not a part of Make in India campaign.",
"explanation_hi": "केदिक कारेदिक कार