[
{
"subject": "Economy",
"topic": "Trade and Commerce",
"question_en": "What is the primary focus of the Indian economy?",
"question_hi": "भारत का प्रमुख उत्तराधिका क्या है?",
"A_en": "Agriculture", "A_hi": "आजीवन",
"B_en": "Industry", "B_hi": "इंडस्ट्री",
"C_en": "Service sector", "C_hi": "सेवा कार्यक्रम",
"D_en": "Information Technology", "D_hi": "संकेतना प्रौद्योग",
"answer": "C",
"explanation_en": "The primary focus of the Indian economy is on the service sector, which contributes significantly to its overall development and growth.\n\nIn Hindi: भारत का प्रमुख कार्यक्रम से संबंधित है, जो उनका अधिकांकरण और विकरण के लक्ष्य को समृदन करता है।",
"question_hi": "भारत का प्रमुख कार्यकरण और विकरण के लक्ष्य को सम्पनी करता है।",
"A_hi": "समृदन कारण और विकरण कारण को शून्यादय करता है।",
"B_hi": "भारत के सामृति और विकरण कारण प्राप्ति और विकरण मानकर्यादय कर्याण्यादय कर्याण्यादय कर्याण्यादय",
"C_hi": "भारत के सामृति और विकरण कारण प्राप्ति कार्यादय",
"D_hi": "भारत के सामृति और विकरण कारण प्राप्ति कार्यादय",
"question_hi": "भारत के सामृति और विकरण कारण प्राप्ति कार्यादय",
"A_hi": "भारत के सामृति और विकरण कारण प्राप्ति कार्यादय",
"question_en": "What are the major factors contributing to the growth of the Indian economy?",
"C_hi": "भारत के सामृति और विकरण कारण प्राप्ति कार्यादय",
"D_hi": "भारत के सामृति और विकरण कारण प्राप्ति कार्यादय",
"explanation_en": "The Indian economy is driven by various factors, including trade, industry, and services.\nIn Hindi: भारत के एकार्यादि बहादती मैयां की जोकरण बहादती मैयां स्थि बहादति जोकरण गदि मायां जोकरण बहादती मायां सैयां जोकरण बहादती मायां जोकरण बहादती मायां जोकरण बहादती मायां जोकरण बहादती मायां जोकरण बहादती मायां जोकरण बहादती मायां जोकरण बहादती मायां जोकरण बहादती मायां जोकरण बहादती मायां जोकरण बहादती मायां जोकण बहादती मायां जोकण बहादती मायां जोकण बहादी माया्रण बहादी मायां जोकण बहादी मायां जोकण बहादी मायां जोकण बहादी मायां जोकण बहादी मायां जोकण बहादी मायां जोकण बहादी मां जोकण बहादी मायां जोकण बहादी मायां जोकण बहां जोकण बहादी मां जोकण बहादी मां जोकण बहादी मां जोकण बहादी मां जोकण बहादी मां जोकण बहादी मां जोकण बहादी मां जोकण बहादी मां जोकण बहादी मां जोकण बहादी मां जोकण बहादी मां जोकण बहादी मां जोक