[
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the formula to calculate the National Income of a country?",
"question_hi": "राष्ट्रीय आय को कैसे चलने के लिए एक formula होता है।",
"A_en": "GNP Formula",
"A_hi": "GNP का पाठ",
"B_en": "National Income Formula",
"B_hi": "राष्ट्रीय आय का पाठ",
"C_en": "GNP Formula and National Product Formula Combined",
"C_hi": "GNP और राष्ट्रीय आराम प्रतिलिख",
"D_en": "GNP Formula and GDP Formula Combined",
"D_hi": "GNP और GDP का पाठ",
"answer": "B",
"explanation_en": "The correct answer is B: National Income Formula. The formula to calculate the National Income of a country is based on Gross Domestic Product (GDP) and is represented as GDS (Gross Domestic Services) + GDS (Gross Domestic Product of Agriculture) + GDS (Gross Domestic Product of Industries) + GDS (Gross Domestic Product of Services).",
"explanation_hi": "उत्पन्न को राष्ट्रीय आराम का पाठ. राष्ट्रीय उत्पन्न के पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन्न का पाठ - GDS (राष्ट्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन का पाठ - GDS (राीय उत्पन)",
"RAS": "राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन)",
"CET": "राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन)",
"SCS": "राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन)",
"Railway NTPC": "राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन)",
"RAS/CET/SCS/Railway NTPC": "राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन)",
"Subject": "Economy",
"Topic": "National Income",
"Question_en": "What is the formula to calculate National Income of a country?",
"Question_hi": "राष्रीय उत्पन का पाठ - GDS (राष्रीय उत्पन)",
"A_en": "National Income Formula",
"A_hi": "राष्रीय उत्पन का पाठ - GDS (