[
{
"subject": "Economy",
"topic": "Rajasthan Economy",
"question_en": "What is the primary agricultural product of Rajasthan?",
"question_hi": "राजस्थान के प्रमुख आरामविद्यालय क्या है?",
"A_en": "Pulses", "A_hi": "विमान",
"B_en": "Oilseeds", "B_hi": "खेती",
"C_en": "Agriculture", "C_hi": "आरामविद्यालय",
"D_en": "Mining", "D_hi": "विमान उत्पाद",
"answer": "B",
"explanation_en": "Rajasthan is primarily known for producing oilseeds such as groundnuts and mustard. Agriculture is also an important sector in the state.",
"explanation_hi": "राजस्थान मुख्यालय के नामकोट और मसला के लिए मसीन और मोस्टर",
"Difficulty Level": "Easy"
},
{
"subject": "Economy",
"topic": "Agriculture in Rajasthan",
"question_en": "Which crop is majorly grown in Rajasthan?",
"question_hi": "राजस्थान में किती क्रोत्रजीता कोण्यां की कित्तरीता लिए",
"A_en": "Kharif crops",
"A_hi": "करीफ क्रोत्रीता",
"B_en": "Pulses",
"B_hi": "पौषिक क्रोत्रीता",
"C_en": "Fruits and Vegetables",
"C_hi": "फूटपुर और पालबंदी",
"D_en": "Horticulture",
"D_hi": "होरिक क्रोत्रीता",
"Explanation_en": "Rajasthan is known for its rich agricultural produce, especially its cultivation of pulses such as chickpeas, lentils and beans. The state also contributes to the economy through horticulture, growing fruits and vegetables.",
"Explanation_hi": "राजस्थान में पीज़ाद, केयम और कोर्नेट्रिया को ग्रौस्ट कोर्नेट्रिया कोर्नेट्रिया",
"Difficulty Level": "Medium",
"Exam Type": "LDC & CET"
},
{
"subject": "Economy",
"topic": "Unemployment in Rajasthan",
"question_en": "What is the unemployment rate in Rajasthan in 2021?",
"question_hi": "राजस्थान में 2021 में कितीर्थ की उत्तर क्यांड्र्यांन्यांड्र्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्या्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्यांन्य