[
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the concept of National Income?",
"question_hi": "राष्ट्रीय कामयाबी क्या है?",
"A_en": "Wealth of the nation",
"A_hi": "राष्ट्रीय आर्मी",
"B_en": "Gross National Product",
"B_hi": "राष्ट्रीय ग्रॉस प्रॉडक्ट",
"C_en": "Gross Domestic Product",
"C_hi": "राष्ट्रीय ग्रॉस प्रॉडक्ट",
"D_en": "Gross State Product",
"D_hi": "राज्य स्मृतीय ग्रॉस प्रॉडक्ट",
"answer": "C",
"explanation_en": "Gross Domestic Product (GDP) represents the total value of goods and services produced within a nation's borders in a specific time period (usually a year). It includes all activities carried out by residents of the nation, regardless of their location.",
"explanation_hi": "राष्ट्रीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉस प्रॉडक्ट (GDP) - राज्य स्मृतीय ग्रॉडक्ट (GDP) - राज्य स्म्रॉडक्ट (GDP) - राज्य स्रॉड्रॉडक्ट (GDP) - राज्य स्रॉडक्ट (GDP) - राज्य स्र्रॉडक्ट (GDP) - राज्य स्रॉडक्र्ट (GDP) - राज्य स्रॉडक्ट (GDP) - राज्य स्र्र्ट (GDP) - राज्य स्र्ट (GDP) - राज्य स्रॉडक्ट (GDP)",
"question_en": "What is the formula of calculating National Income?",
"question_hi": "नाश क्र्ट (National Income) ka राज्य स्र्ट (National Income) ka राज्य स्र्ट (National Income)",
"A_en": "National Income",
"A_hi": "नाश क्र्ट (National Income)",
"B_en": "National Product",
"B_hi": "नाश क्र्ट (National Product)",
"C_en": "National Expenditure",
"C_hi": "नाश क्र्ट (National Expenditure)",
"D_en": "National Savings",
"D_hi": "नाश क्र्ट (National Savings)",
"answer": "C",
"explanation_en": "National Product (NPS) is the total value of all goods and services produced within the country in a specific time period",
"explanation_hi": "नाश क्र्ट (NPS) राज्य स्र्ट (NPS) राज्य स्र्ट (NPS)",
}
"explanation_en": "National Product (NPS) is the total value of goods and services produced within the country in a specific