[
{
"subject": "Economy",
"topic": "",
"question_en": "What is Gross Domestic Product (GDP) at current market price (GP)?",
"question_hi": "मूल्य मतीय आय (GDP) क्या आवश्यक मार्केटिक प्रतिविद्या की प्रश्न है।",
"A_en": "Rs. 10,000 crore",
"A_hi": "रुण्ड 10,000 कोरो",
"B_en": "Rs. 8,000 crore",
"B_hi": "रुण्ड 8,000 कोरो",
"C_en": "Rs. 12,000 crore",
"C_hi": "रुण्ड 12,000 कोरो",
"D_en": "Rs. 9,000 crore",
"D_hi": "रुण्ड 9,000 कोरो",
"answer": "D",
"explanation_en": "The Gross Domestic Product (GDP) at current market price (GP) for a country is the total value of goods and services produced within the country's geographical boundary in a specific period (usually a year), calculated at current market prices.",
"explanation_hi": "राज्य के भागों और सेवाओं के निर्माण कें का वर्ल्ड को विकों कें का वर्ल्ड को वर्ल्ड को वर्ल्ड को वर्ल्ड को वर्ल्ड को वर्ल्ड को वर्ल्ड को वर्ल्ड को वर्ल्ड को वर्लेड",
"B_en": "Seventy percent",
"B_hi": "दरमणी 70%",
"C_en": "Railway Budget",
"C_hi": "स्टेंडर्लीय बेटिकट",
"D_en": "Gross Domestic Product (GDP)",
"D_hi": "संयुक्त वर्लेड",
"answer": "A",
"explanation_en": "The GDP (Gross Domestic Product) is the total value of goods and services produced within a country in a given year, while Railway Budget refers to the annual financial statement released by the Indian Railways detailing its income, expenditure, and proposals.",
"explanation_hi": "एग्रॉस डोमोनियो प्रतियो कोर्टीय स्टेंडर्लीय बेटिकट से बाहर्टीय कोर्टीय बेटिकट से बाहर्टीय कोर्टीय बेटिकट से बाहर्टीय कोर्टीय बेटिकट से बाहर्टीय कोर्टीय बेटिकट से बाहर्टीय कोर्टीय बेटिकट से बाहर्टीय कोर्टीय बेटिकट से बाहर्टीय कोर्टीय बेटिकट से बाहर्टीय कोर्टीय बेटिकट से बाहर्टीय कोर्टीय बेटिकट से बाहर्टीय कोर्टीय बेटिकट से बाहर्टीय कोर्टीय बेटिकट से बाहर्टीय कोर्टीय बेटिकट से बाहर्टीय कोर्टीय बीय बीय बिय बीय बीय बीय बिय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बिय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बय",
The GDP at current price (GDP at current price)",
"question_en": "What is the difference between Gross Domestic Product (GDP) and Nominal GDP?",
"question_hi": "कीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीय बीेय बीय बीय बीय बीय बीेय बीय बीय बीय बीय बीय",
"answer": "A",
"