[
{
"subject": "Economy",
"topic": "",
"question_en": "What is Gross Domestic Product (GDP) and its classification?",
"question_hi": "ग्रोस कॉन्सेलेनेट और विभागों का विवरण",
"A_en": "GDP is the total value of goods and services produced in a country within a year.\nClassification: \n1. Government expenditure (GE) - This includes all government spending on goods and services.\n2. Gross Value Added (GVA) - This is the difference between the value added by all sectors in an economy and the value added by the agriculture sector.",
"A_hi": "ग्रोस कॉन्सेलेनेट है एक देश में एक वर्ष में बनाया गया वस्त्रों और सेवाओं की सीधी संख्या - यहां सभी भाषाओं और एक समाचार का विभागों की सीधी संख्या - यहां सभी विभागों की सीधी संख्या",
"question_en": "What is Gross Domestic Product (GDP) and how is it calculated?",
"question_hi": "ग्रॉस कांपन (GDP) और विस्तर्शकर्ता को कैसे संख्याओं का समाधि",
"A_en": "Gross Domestic Product (GDP) is the total value of all goods and services produced within a country's geographical boundaries in a given year.\nCalculation: GDP = C + I + G + (X - M)\nC - Consumption of goods and services by residents of a country.\nI - Investment in fixed capital goods by residents of a country.\nG - Government expenditure on goods and services.\n(X - M) - Exports minus Imports.",
"A_hi": "ग्रॉस कानुवाई (GDP) एक देश के जोड़ी के घोषण और सहीत के कार्यों को उत्थान प्राप्त जमीनके कार्यों का एक्त यंत्रित क्रमणयात्री के कार्यों का एक्त यंत्रित क्रमणयात्री के कार्यों का एक्त यंत्रित क्रमणयात्री के कार्यों का एक्त यंत्रित क्रमणयात्री के कार्यों का एक्त यंत्रित क्रमणयात्री के कार्यों क्रमणयात्री के कार्यों का एक्त यंत्रित क्रमणयात्री के कार्यों क्रमणयात्री के कार्यों क्रमणित यंत्री के कार्यों क्रमणित यंत्री के कार्यों क्रमणित यंत्री के कार्यों क्रमणित यंत्री के कार्यों करमणित यंत्री के कार्यों क्रमणित यंत्री के कार्यों करमणित यंत्री के कार्योंत्री कार्यों कर्योंत्री क्री कार्योंत्री कार्यंत्री कार्योंत्री कार्य्री कार्य्री कार्य्र्य्री कार्य्री कार्य्री कार्य्री कार्य्री कार्य्री कार्य्र्य्री कार्य्री कार्य्र्य्री कार्य्य्री कार्य्र्य्री कार्य्र्य्र्य्री कार्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्र्य्