[
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the term used for the total value of goods and services produced within a country's borders in a given year?",
"question_hi": "एक देश की एक वर्ष में तथाकतीय उत्पादन का कार्यक्रम क्या है?",
"A_en": "Gross National Product (GNP)",
"A_hi": "ग्रॉस नेशनल प्रोडक्शन (GNP)",
"B_en": "Gross Domestic Product (GDP)",
"B_hi": "ग्रॉस डॉमिक प्रोडक्शन (GDP)",
"C_en": "Net National Product (NNP)",
"C_hi": "नेशनल नेशनल प्रोडक्शन (NNP)",
"D_en": "Total Domestic Product (TDP)",
"D_hi": "संधि डॉमिक प्रोडक्शन (TDP)",
"answer": "B",
"explanation_en": "Gross Domestic Product (GDP) is the total value of goods and services produced within a country's borders in a given year. It includes both consumption and investment goods but excludes government consumption and net exports. In contrast, Net National Product (NNP) includes government consumption and net exports.",
"explanation_hi": "ग्रॉस डॉमिक प्रोडक्शन (GDP) - सर्वेकों और बीजेपी के अनुस्पनी का विवर्वाचा प्रोडक्शन (GNP) - दूर्वाचा प्रोडक्शन (GNP) - सर्वेकों का विवर्वाचा प्रोडक्शन (GNP) - दूर्वाचा प्रोडक्शन (GNP) - दूर्वाचा प्रोडक्शन (GNP) - दूर्वाचा प्रोडक्शन (GNP) - सर्वेकों का प्रोडक्शन (GNP) - दूर्वाचा प्रोडक्शन (GNP) - सर्वेकों का प्रोडक्शन (GNP) - दूर्वाचा प्रोडक्शन (GNP) - सर्वेकों का प्रोडक्शन (GNP) - दूर्वाचा प्रोडक्शन (GNP) - सर्वेकों का प्रोडक्शन (GNP) - दूर्वाचा प्रोडक्शन (GNP) - सर्वेकों का प्रोडक्शन (GNP) - दूर्वाचा प्रोडक्शन (GNP) - सर्वेकों का प्रोडक्शन (GNP) - दूर्वाचा प्रोडक्शन (GNP) - सर्वेकों का प्रोडक्शन (GNP) - दूर्वाचा प्रोडक्शन (GNP) - सर्वेकों का प्रोडक्शन (GNP) - दूर्वाचा प्रोडक्शन (GNP) - सर्वेकों का प्रोडक्शन (GNP) - दूर्वाचा प्रोडक्शन (GNP) - सर्वेकों का प्रोडक्शन (GNP) - दोर्वाचा प्रोडक्शन (GNP) - सर्वाचा प्रोडक्शन (GNP) - दोर्वाचा प्रोडक्शन (GNP) - सर्वाचा प्र्वाचा प्रोडक्शन (GNP) - द्र्वाचा प्र्वाचा प्र्वाचा प््र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प््र्वाचा प्र्वाचा प््र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प््र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्वाचा प्र्