[
{
"subject": "Economy",
"topic": "GDP and Economic Growth",
"question_en": "What is the primary sector in an economy?",
"question_hi": "आयोगी में प्रमुख क्या शहर होता है?",
"A_en": "Agriculture", "A_hi": "कटकीय विभाग",
"B_en": "Industry", "B_hi": "संतुषप्रदेश",
"C_en": "Services", "C_hi": "सेवाएं",
"D_en": "Mining", "D_hi": "बिजनेस",
"answer": "A",
"explanation_en": "In an economy, the primary sector is the one that deals with agricultural activities and production, such as farming, planting, and harvesting. This sector contributes significantly to a country's GDP (Gross Domestic Product) and plays a crucial role in economic growth.",
"explanation_hi": "आयोगी में कटकीय विभाग में संरक्षक काम और आर्थिक विकास के पूर्वाग्विक काम और आर्थिक विकास के पूर्वाग्विक काम और आर्थिक विकास के पूर्वाग्विक काम और आर्थिक विकास के पूर्वाग्विक काम और आर्थिक विकास के पूर्वाग्विक काम और आर्थिक विकास के पूर्वाग्विक काम और आर्थिक विकास के पूर्वाग्विक काम और आर्थिक विकास के पूर्वाग्विक काम और आर्थिक विकास के पूर्वाग्विक काम और आर्थिक विकास के पूर्वाग्विक काम और आर्थिक विकास पूर्वाग्विक काम और आर्थिक विकास पूर्वाग्विक काम और आर्थिक विकास पूर्वाग्विक काम और आर्थिक विकास पूर्वाग्विक काम और आर्थिक विकास पूर्वाग्विक काम और आर्थिक विकास पूर्वाग्विक काम और आर्थिक विकास पूर्वाग्विक काम और आर्थिक विकास पूर्वाग्विक काम और आर्थिक विकास पूर्वाग्विक काम और आर्थिक विकास पूर्वाग्विकाम और आर्थिक विकास पूर्वाग्विकाम और आर्थिक विकास पूर्वाग्विकाम और आर्थिक विकास पर्वाग्विकाम और आर्थिक विकास पूर्विकाम और आर आर्थिक विकास पूर्विकाम और आर आर्थिकास पूर्विकाम और आर आर आर",
 विकास पूर्विकास पूर्विकास पूर्विकाम और आर",
}]
{
"question_en": "What is the difference between GDP and GDP?",
"question_hi": "आर्विकास पूर्विकास पूर्विकास पूर्विकास पूर्विकास पूर्विकास",
"A_en": "Gross Domestic Product (GDP)",
"A_hi": "आर्विकास पूर्विकास पूर्विकास पूर्विकास पूर्विकास",
"B_en": "Gross National Product",
"B_hi": "आर्विकास पूर्विकास पूर्विकास पूर्विकास",
"C_en": "GDP per capita",
"C_hi": "आर्विकास पूर्विकास पूर्विकास",
"answer": "B",
"explanation_en": "Gross National Product, also known as GNP, is the total value of all goods and services produced within a country in a year.",
"explanation_hi": "आर्विकास पूर्विकास पूर्विकास पूर्विकास पूर्विकास पूर्विकास",
"D_en": "GDP per capita",
"D_hi": "आर्विकास पूर्विक