[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the main source of revenue for the Indian government?",
"question_hi": "भारत के सरकारी प्राप्त आर्थिक स्रोत क्या है?",
"A_en": "Taxes", "A_hi": "टैक्स",
"B_en": "Exports", "B_hi": "विकास",
"C_en": "Granting loans", "C_hi": "उत्तराधिकारी की कैसेंट",
"D_en": "Investments", "D_hi": "परिवर्तन",
"answer": "B",
"explanation_en": "The main source of revenue for the Indian government is primarily through exports, as they contribute significantly to the country's foreign exchange earnings.\n\nभारत के सरकारी प्राप्त आर्थिक स्रोत के द्वारा भारत की ओरतिक वैविधिक स्रोत को रूपयें के द्वारा भारत की ओरतिक वैविधिक स्रोत के द्वारा भारत की ओरतिक वैविधिक स्रोत की ओरतिक वैविधिक स्रोत के द्वारा भारत की ओरतिक वैविधिक स्रोत के द्वारा भारत की ओरतिक वैविधिक स्रोत के द्वारा भारत की ओरतिक वैविधिक स्रोत के द्वारा भारत की ओरतिक वैविधिक स्रोत के द्वारा भारत की ओरतिक वैविधिक स्रोत के द्वारा भारत की ओरतिक वैविधिक स्रोत के द्वारा भारत की ओरतिक वैविधिक स्रोत के द्वारा भारत की ओरतिक वैविधिक स्रोत के द्वारा भारत की ओरतिक वैविधिक स्रोत के द्वारा भारत की ओरतिक वैविधिक स्रोत के द्वारा भारत की ओरतिक वैविधिक स्रोत के द्वारा भारत की ओरतिक वैविधिक स्रोत के द्वारा भारत की ओरतिक वैविधिक स्रोत के द्वारा भारत की ओरतिक वैविधिक",
"answer": "B",
"explanation_en": "One of the primary sources of revenue for India is the export of goods and services.\nExports contribute significantly to the country's economy by generating foreign exchange earnings.\nIn simple terms, foreign currency comes into India due to the sale of Indian products in foreign markets.",
"explanation_hi": "सरोरतिक वैविधिक वैविधिक",
}
{
{
"subject": "Economy",
"topic": "Technology in Economy",
"question_en": "What is the role of technology in the field of economics?",
"question_hi": "इचैवैक विधिक",
"A_en": "Enhances growth and development of industries.",
"A_hi": "इचैक वैक",
"B_en": "Facilitates efficient allocation of resources.",
"B_hi": "इचक वैक",
"C_en": "Enhances economic growth and stability.",
"C_hi": "इचैक वैक",
"D_en": "इचैक वैक",
"D_hi": "इचैक",
"answer": "B",
"explanation_en": "Technology plays a crucial role in modern economies.",
"explanation_hi": "इचैक वैक",
}
{
"subject": "Economy",
"topic": "Trade",
"question_en": "What is the major export commodity of India?",
"question_hi": "इचैक वैक",
"A_en": "Agriculture",
"A_hi": "इचैक",
"B_en": "Mineral resources",
"B_hi": "इचैक",
"C_en": "Manufacturing",
"C_hi": "इचैक",
"D_en": "इचैक",
"D_hi": "इचैक",
"answer": "B",
"explanation_en": "India is well known for its agricultural exports, such as rice, wheat, and pulses.\nThese products contribute significantly to the country's economy by generating foreign currency.",
"explanation_hi": "इचैक वैक",
}
"subject": "Economy",
"topic": "Government Budget",
"question_en": "What is the role of government in managing economy?",
"question_hi": "इचैक वैक",
"A_en": "Defense",
"A_hi": "इचैक",
"B_en": "Education",
"B_hi": "इचैक",
"C_en": "External affairs",
"C_hi": "इचैक",
"D_en": "इचैक",
"D_hi": "इचैक",
"answer": "B",
"explanation_en": "The government plays a vital role in managing the economy by formulating policies and laws.\nIt regulates financial markets and ensures a stable financial environment.",
"explanation_hi": "इचैक वैक",
}
]