[
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is inflation?",
"question_hi": "गैरीता क्या होता है।",
"A_en": "Inflation is the increase in the general price level of goods and services.",
"A_hi": "गैरीता के मामले के लिए, सर्वश्रेष्ठ विभिन्न क्या होता है।",
"B_en": "Inflation is the decrease in the value of money.",
"B_hi": "गैरीता के लिए, मैंन की निर्माण क्या होता है।",
"C_en": "Inflation is the growth in the production of goods and services.",
"C_hi": "गैरीता के लिए, स्वस्तीयता क्या होता है।",
"D_en": "Inflation is the decrease in the purchasing power of money.",
"D_hi": "गैरीता के लिए, मैंनीता क्या होता है।",
"E_en": "Inflation is the increase in the supply of money in an economy.",
"E_hi": "गैरीता के लिए, बाज़ार मैनी क्या होता है।",
"F_en": "Inflation is the decrease in the purchasing power of money due to increase in the price level.",
"F_hi": "गैरीता के लिए, मैनी के वित्तीयता क्या होता है।",
"G_en": "Inflation is the increase in the supply of money in an economy.",
"G_hi": "गैरीता के लिए, बाज़ार मैनी क्या होता है।",
"H_en": "Inflation is the increase in the level of prices of goods and services.",
"H_hi": "गैरीता के लिए, विकार क्या होता है।",
"I_en": "Inflation is the decrease in the value of money due to the increase in the number of units of currency.",
"I_hi": "गैरीता के लिए, मैनी क्या होता है।",
"J_en": "Inflation is the increase in the demand for goods and services.",
"J_hi": "गैरीता के लिए, मया क्या होता है।",
"K_en": "Inflation is the change in the price level of goods and services.",
"K_hi": "गैरीता के लिए, विकार क्या होता है।",
"L_en": "Inflation is the decrease in the purchasing power of money due to the increase in the price level of goods and services.",
"L_hi": "गैरीता के लिए, मैनी क्या होता है।",
"M_en": "Inflation is the increase in the quantity of money in circulation.",
"M_hi": "गैरीता के लिए, मैनी क्या होता है।",
"N_en": "Inflation is the rise in the demand for goods and services.",
"N_hi": "गैरीता के लिए, उत्तमीया क्या होता है।",
"O_en": "Inflation is the decrease in the supply of goods and services.",
"O_hi": "गैरीता के लिए, उत्तमा क्या होता है।",
"P_en": "Inflation is the increase in the quantity of money in circulation.",
"P_hi": "गैरीता के लिए, मैनीया क्या होता है।",
"Q_en": "Inflation is the increase in the demand for goods and services.",
"Q_hi": "गैरीता के लिए, उत्ता क्या होता है।",
"R_en": "Inflation is the decrease in the purchasing power of money.",
"R_hi": "गैरीता के लिए, उता क्या होता है।",
"S_en": "Inflation is the increase in the supply of goods and services.",
"S_hi": "गैरीता के लिए, उता क्या हैै।"
]
{
"question_en": "What is inflation?",
"question_hi": "गैरीता के लिए, उता क्या हैैैैैरिए, उता क्या हैैैरीैैरीए, उता क्या हैैैैरिए, उता क्या हैैरिए, उता के लिए, उता क्या हैैरिए, उता क्या हैैैरिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या हैरिए, उता क्या हैैरिए, उता के लिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या हैैरिए, उता क्या ह