[
{
"subject": "Economy",
"topic": "GDP at Current Prices and Real GDP",
"question_en": "What is the difference between GDP at Current Prices and Real GDP?",
"question_hi": "वर्षीय GDP (वर्षीय ग्राहक दर वर्षीय स्रोत टेक्सटियट द्वारा समझने के लिए कैसे सेवाएं प्रदान कीजिए।",
"A_en": "GDP at Current Prices is the total value of all goods and services produced in a country in a specific time period at their market prices.",
"A_hi": "वर्षीय ग्राहक दर वर्षीय स्रोत टेक्सटियट",
"B_en": "Real GDP represents the value of goods and services produced in a country after adjusting for inflation and other economic factors.",
"B_hi": "स्रोत टेक्सटियट",
"C_en": "The formula to calculate GDP at Current Prices is: GDP at Current Prices = Total Value x (1 + Inflation Rate).",
"C_hi": "ग्राहक दर वर्षीय स्रोत टेक्सटियट",
"D_en": "Real GDP is a more accurate measure of a country's economic performance as it takes into account changes in the prices of goods and services produced.",
"D_hi": "स्रोत टेक्सटियट",
"question_en": "How is GDP at Current Prices different from Real GDP?",
"question_hi": "ग्राहक दर वर्षीय स्रोत टेक्सटियट",
"question_ar": "उत्तम योजनक स्रोत टेक्सटियट",
"question_fr": "Le revenu national brut (RNB) est différent de le revenu national brut approuvé (RNB)?",
"question_zh": "国内生产者总值(国内生产总值)和国内生产总值的对于特定时间段(对特定时间段的国内生产总值)",
"question_ja": "経済的国際核審核審(現金外国際核審核審)",
"question_zh-Hans": "国内生产总值(国内生产总值)",
"question_ko": "राजना के सामानियांचा सामाना सामाना",
"question_ms": "Negara ke ekonomi negara ke ekonomi",
],
"answer_en": "The difference between GDP at Current Prices and GDP at Constant Prices(国内生产总值的国内生产总值)",
"answer_hi": "GDP at Current Prices aur GDP at Constant Prices(現金外国際核審核審)",
"answer_zh-Hans": "国内生产总值的国内生产总值",
"answer_ko": "राजना के सामाने में अनुपने के सामाने में अनुपने के सामाने में अनुपने के सामाने में अनुपने के सामाने में अनुपने के सामाने में अनुपने के सामाने में अनुपने के सामाने में अनुपने के सामाने में अनुपने के सामाने में अनुपने के सामाने में अनुपने के सामाने में अनुपने के सामाने में अनुपने के सामाे में अनुपने के सामाे में अनुपने के साे में अनुपने के साे में अनुपने के साे में अनुपने के साे अने के साे में अनुपने के साें अने के अने के अने के साे के अने के अने के अने के के अने के अने के अने के के अने के अने के अने के अने अने के अने के अने के अने अने के अने के अने के अने अने के अने के अने के अने अने के अने के अने के अने के अने के अने के अने अने के अने के अने के अने के अने के अने के अने के अने के अने के अने के अने के अने के अने के अने के के अने के अने के अने के अने के अने के अने के अने के अने के अने के अने के अने के अने के अने के के अने के अने के अने क