[
{
"subject": "Economy",
"topic": "GDP at current prices",
"question_en": "What is the Gross Domestic Product (GDP) of Rajasthan at current prices?",
"question_hi": "राजस्थान के ग्रॉस डोमेन प्रतिकूल की वर्तमान प्रतीक्षण में",
"A_en": "Rs. 1,20,000 crore",
"A_hi": "रू. 1,20,000 करोड़",
"B_en": "Rs. 1,10,000 crore",
"B_hi": "रू. 1,10,000 करोड़",
"C_en": "Rs. 1,30,000 crore",
"C_hi": "रू. 1,30,000 करोड़",
"D_en": "Rs. 1,40,000 crore",
"D_hi": "रू. 1,40,000 करोड़",
"answer": "D",
"explanation_en": "As of 2021, the Gross Domestic Product (GDP) of Rajasthan at current prices is approximately Rs. 1,40,000 crore. The correct answer is D.",
"explanation_hi": "2021 में राजस्थान का वर्षीय कामय निर्माण (GDP) के वर्षीय स्पष्टिकार (GDP) के वर्षीय निर्माण (GDP) के वर्षीय स्पष्टिकार (GDP) के वर्षीय निर्माण (GDP) के वर्षीय स्पष्टिकार (GDP) के वर्षीय निर्माण (GDP) के वर्षीय स्पष्टिकार (GDP) के वर्षीय निर्माण (GDP) के वर्षीय स्पष्टिकार (GDP) के वर्षीय निर्माण (GDP) के वर्षीय स्पष्टिकार (GDP) के वर्षीय निर्माण (GDP) के वर्षीय स्पष्टिकार (GDP) के वर्षीय निर्माण (GDP) के वर्षीय स्पष्टिकार (GDP) के वर्षीय निर्माण (GDP) ke varshiya nirmal (GDP) ke varshiya स्पष्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्पष्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्पष्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्पष्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्पष्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्पष्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्पष्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्पष्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्पष्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्पष्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्पष्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्पष्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्पषीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स्टिकार (GDP) ke varshiya nirmal (GDP) ke varshiya वर्षीय स