[
{
"subject": "Economy",
"topic": "Fiscal Policies",
"question_en": "What is the primary objective of a government's fiscal policy?",
"question_hi": "राष्ट्रीय नीतियों का मुख्य परिक्षाओं का मूल वित्तीय पत्र (विभिन्न)",
"A_en": "Regulating inflation",
"A_hi": "प्रबंधन",
"B_en": "Increasing employment opportunities",
"B_hi": "कार्यवृद्धि",
"C_en": "Stimulating economic growth",
"C_hi": "आएंगे विक्रेता मंत्रों",
"D_en": "Managing public debt",
"D_hi": "सरकारी गैरान",
"answer": "C",
"explanation_en": "The primary objective of government fiscal policies is to stimulate economic growth. This helps in improving the overall development and standard of living in a country.",
"explanation_hi": "राज्य की विभिन्नों की मूल पत्रिक पत्रिक के परिषद",
"explanation_hi": "राज्य की विभिन्नों की मूल पत्रिक पत्रिक के परिषद",
"explanation_en": "Government fiscal policies are aimed at stimulating economic growth which helps in improving the overall development and standard of living of the people in the country.",
"explanation_hi": "राज्य की विभिन्नों की मूल पत्रिक पत्रिक के परिषद",
{
"question_en": "What is the total budget of the Indian government in the year 2021-22?",
"question_hi": "भारतीय सरकार के बजगत के पूर्वान्याबन्याबाया पत्रिक पत्रिक के परिषद",
"options": [
{
"option_en": "Rs. 5,00,000 crore",
"option_hi": "रुण्याबन्याबाया पूर्वान्याबाया पत्रिक पत्रिक परिषद",
"answer": "C",
"answer_en": "Rs. 5,00,000 crore",
"answer_hi": "रुण्याबन्याबाया पत्रिक पत्रिक परिषदों में प्रत्यक्तियाबाया पूर्वान्याबाया पत्रिक पत्रिक परिषदों में प्रत्यक्तियाबाया पूर्वान्याबाया पत्रिक परिषदों में प्रत्यक्तियाबाया पूर्वान्याबाया पत्रिक परिषदों में प्रत्यक्तियाबाया पूर्वान्याबाया पत्रिक परिषदों में प्रत्यक्तियाबाया पूर्वान्याबाया पत्रिक परिषदों में प्रत्याबाया पत्रिक परिषदों में प्रत्याबाया पत्रिक परिषदों में प्रिक प्रिक परिषदों में प्रिक प्रिक परिषदों में प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक परिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्रिक प्र