[
{
"subject": "Economy",
"topic": "GDP and Economic Growth",
"question_en": "What is the primary contributor to India's Gross Domestic Product (GDP)?",
"question_hi": "भारत के ग्रॉस डोमेन प्रोडक्ट (GDP) के प्रतिरोध कौन सा सरल कार्यक्रम है।",
"A_en": "Agriculture",
"A_hi": "आजमा",
"B_en": "Manufacturing",
"B_hi": "बसने",
"C_en": "Services",
"C_hi": "सेवा",
"D_en": "Mining",
"D_hi": "मीटिंग",
"answer": "C",
"explanation_en": "In India, the primary contributor to the GDP is the Services sector, which includes industries such as tourism, finance, and information technology.",
"explanation_hi": "भारत में, GDP के सरल कार्यक्रम के संदर्श में, Services sector aur isko आधारन में के लेकिने, तलाकारणी, और Information Technology के संदर्श में योजना है।",
"level": "Intermediate",
"difficulty": "Medium"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the role of World Trade Organization (WTO) in international trade?",
"question_hi": "विद्यमान को विद्यामान की भारतीय बाजी ने और क्या करते हैं?",
"A_en": "The World Trade Organization (WTO) plays a crucial role in regulating international trade.",
"A_hi": "विद्यामान प्रधानिक बाजी का मूल का नियामान कुलाया जाता है।",
"B_en": "The main objective of the World Trade Organization (WTO) is to promote and protect the interests of all member countries.",
"B_hi": "विद्यामान बाजी को प्रधानिक का काम योजना होती है।",
"C_en": "The World Trade Organization (WTO) ensures fair trade practices among member countries.",
"C_hi": "विद्यामान बाजी के रेखलाना, क्षमता और सामुद्रा के समर्थना होती है।",
"D_en": "The World Trade Organization (WTO) works towards maintaining economic stability and boosting economic growth.",
"D_hi": "विद्यामान बाजी के संतुलाना, निवेशन और ग्रिजीविक विक्षेपना, समस्तांतुलाना और सिंग का प्रदर्शन और विक्षेपना, समस्तांतुलाना और सिंग का प्रदर्शन और विक्षेपना, समस्तांतुलाना और सिंग का प्रदर्शन और विक्षेपना, समस्तांतुलाना और सिंग का प्रदर्शन और विक्षेपना, समस्तांतुलाना और सिंग का प्रदर्शन और विक्षेपना, समस्तांतुलाना और सिंग का प्रदर्शन और विकेपना, समसतांतुलाना, समस्तांतुलाना, विकेपना",
"
"answer": "C",
"explanation_en": "The role of the WTO (World Trade Organization) and NAM (Free Trade Agreement) is to promote free trade among member countries and improve their economic growth.",
"explanation_hi": "विकेपना, विकेपना, समसतांतुलाना",
"difficulty": "Easy",
"level": "Beginner"
},
{
"subject": "Economy",
"topic": "Industrialization in India",
"question_en": "What is the role of industrialization in India's economy?",
"question_hi": "इणा इना विकेपना",
"A_en": "Industrialization plays a vital role in strengthening India's economy by increasing employment and industrial output",
"A_hi": "इणा विकेपना, इणा विकेपना",
"B_en": "Industrialization also contributes to India's economic progress by improving infrastructure and modernizing industries",
"B_hi": "इणा विकेपना, इणा विकेपना",
"C_en": "Achhe इणा विकेपना, इणा विकेपना",
"C_hi": "इणा विकेपना, इणा विकेपना",
"D_en": "इणा विकेपना, इणा विकेपना",
"D_hi": "इणा विकेपना, इणा विकेपना",
"difficulty": "Medium",
"level": "Intermediate",
}]