[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the official language of Rajasthan?",
"question_hi": "राजस्थान में आयोजना क्या भाषा?",
"A_en": "Hindi", "A_hi": "हिंदी",
"B_en": "Marathi", "B_hi": "मराठी",
"C_en": "Tamil", "C_hi": "तंग",
"D_en": "Telugu", "D_hi": "तेलूगु",
"answer": "A",
"explanation_en": "Hindi is the official language of Rajasthan.",
"explanation_hi": "राजस्थान में आयोजना की भाषा हिंदी है।"
},
{
"subject": "Economy",
"topic": "",
"question_en": "What is the highest point in Rajasthan?",
"question_hi": "राजस्थान में सबसे ऊर्जून क्या है?",
"A_en": "Tiwari Hill", "A_hi": "तिवारी है।",
"B_en": "Aravalli Ranges", "B_hi": "अरवाई रेंगों",
"C_en": "Kalagarh Hill", "C_hi": "कालगंड है।",
"D_en": "Shani Shingnapur", "D_hi": "शानी शिंगपुर",
"answer": "B",
"explanation_en": "Aravalli Ranges is the highest point in Rajasthan.",
"explanation_hi": "अरवाई रेंगों को राजस्थान का ऊर्जा वर्ग का ऊर्जा वर्ग को राजस्थान का ऊर्जा वर्ग को राजस्थान का ऊर्जा वर्ग",
"answer": "B",
"explanation_en": "Aravalli Ranges is the highest point in Rajasthan.",
"explanation_hi": "अरवाइ रेंगों को राजस्थान का ऊर्जा वर्ग",
},
{
"subject": "Economy",
"topic": "",
"question_en": "What is the largest crop-producing region in Rajasthan?",
"question_hi": "राजस्थान में कौन सर्वेंट के वर्ग का प्रदेश है ?",
"A_en": "Mewar", "A_hi": "मेवार",
"B_en": "Thar", "B_hi": "थार",
"C_en": "Malaviya", "C_hi": "मालविया",
"D_en": "Rajasthan", "D_hi": "राजस्थान",
"answer": "B",
"explanation_en": "Thar Desert is the largest desert region in Rajasthan.",
"explanation_hi": "थार डिस्ट र राजस्थान में सर्वेंट का वर्ग",
},
{
"subject": "Economy",
"topic": "",
"question_en": "Which currency is used in Rajasthan?",
"question_hi": "राजस्थान में कौचा क्यामण क्यामण के वर्गों",
"A_en": "Indian Rupee (INR)", "A_hi": "भारतीय रुपी (INR)",
"B_en": "Indian Rupee (INR)", "B_hi": "भारतीय रुपी (INR)",
"C_en": "UAE Dirham (AED)", "C_hi": "उद्यामण (AED)",
"D_en": "Saudi Riyal (SAR)", "D_hi": "सवादि (SAR)",
"answer": "B",
"explanation_en": "Indian Rupee (INR) is the currency used in Rajasthan.",
"explanation_hi": "भारतीय रुपी (INR) रा जमी रा का ब्रामानियामण (BRAN) आयामण रा रा ब्रामानैयामण (BRAN) रा जमी रा ब्रामानियामण (BRAN) रा ब्रामानियामण (BRAN) रा जमी रा ब्रामानियामण (BRAN) रा जमी (BRAN) रा जमण (BRAN) रा ब्रामानियामण (BRAN) रा जमी (BRAN) रा जमी (BRAN) रा ब्रामानियामण (BRAN) रा जमी (BRAN) रा ब्रामान (BRAN) रा जमी (BRAN) रा ब्रामान (BRAN) रा जमी (BRAN) रा ब्रामान (BRAN) रा जमी (BRAN) रा ब्रामान (BRAN) रा जमी (BRAN) रा ब्रामान (BRAN) रा जमी (BRAN) रा जमान (BRAN) रा जमी (BRAN) रा ब्रामान (BRAN) रा जमी (BRAN) रा जमी (BRAN) रा जमी (BRAN) रा जमान (BRAN) रा जमान (BRAN) रा जमाी (BRAN) रा जमान (BRAN) रा जमी (BRAN) रा जमान (BRAN) रा जमी (BRAN) रा जमें (BRAN) रा जमें (BRAN) रा जमें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाेें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमां (BRAN) रा जमां (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाें (BRAN) रा जमाे