[
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the definition of Gross Domestic Product (GDP)?",
"question_hi": "ग्रॉस कॉमनिक प्रतिक्रम (GDP) क्या समझने के लिए क्या कहेंगे?",
"A_en": "GDP is the total value of all goods and services produced in a country within a specific time period.",
"A_hi": "ग्रॉस कॉमनिक प्रतिक्रम (GDP) को एक दिन या वर्ष के माध्यमिक प्रतिक्रम (GDP) के लिए क्या कहेंगे?",
"B_en": "GDP is the sum of all the value of goods and services produced in a country within a specific time period.",
"B_hi": "ग्रॉस कॉमनिक प्रतिक्रम (GDP) को एक माध्यमिक प्रतिक्रम (GDP) के लिए क्या कहेंगे?",
"C_en": "GDP is a measure of a country's total economic activity over a specific time period.",
"C_hi": "ग्रॉस कॉमनिक प्रतिक्रम (GDP) को एक माध्यमिक अर्थविविक प्रतिक्रम (GDP) को कैसे समझेंगे?",
"D_en": "GDP represents the total value of all goods and services produced within a country over a specific period.",
"D_hi": "ग्रॉस कॉमनिक प्रतिक्रम (GDP) को कैसे समझेंगें?",
"E_en": "GDP is the sum of all the goods and services produced within a country in a given time period.",
"E_hi": "ग्रॉस कॉमनिक प्रतिक्रम (GDP) को कैसे समझेंगें?",
"F_en": "GDP is a measure of a country's total economic activity and reflects the overall health of its economy.",
"F_hi": "ग्रॉस कॉमनिक प्रतिक्रम (GDP) को कैसे समझेंगें?",
"G_en": "GDP helps in understanding the overall growth and development level of a country.",
"G_hi": "ग्रॉस कॉमनिक प्रतिक्रम (GDP) को कैसे समझेंगें?",
"H_en": "GDP is the total value of all the goods and services produced within a country.",
"H_hi": "ग्रॉस कॉमनिक प्रतिक्रम (GDP) को कैसे समझेंगें?",
"I_en": "It represents the total output of goods and services produced within a country.",
"I_hi": "ग्रॉस कॉमनिक प्रतिक्रम (GDP) को कैसे समझेंगें?",
"J_en": "It measures the overall economic activity of a country.",
"J_hi": "ग्रॉस कॉमनिक प्रतिक्रम (GDP) को कैसे समझेंगें?",
"K_en": "GDP helps in understanding the overall growth and development of an economy.",
"K_hi": "ग्रॉस कॉमनिक प्रतिक्रम (GDP) को कैसे समझेंगें?"
]
]