[
{
"subject": "Economy",
"topic": "GDP at Current Prices",
"question_en": "What is the Gross Domestic Product (GDP) of Rajasthan at Current Prices in 2019-20?",
"question_hi": "2019-20 में राजस्थान की गृहतंत्रों से निर्माण की गई GDP (समान प्रतीकें)?",
"A_en": "Rs. 68,014 crore",
"A_hi": "रेल 16,499 क्रोर के रूप में",
"B_en": "Rs. 65,049 crore",
"B_hi": "रेल 14,967 क्रोर",
"C_en": "Rs. 61,059 crore",
"C_hi": "रेल 13,372 क्रोर",
"D_en": "Rs. 70,050 crore",
"D_hi": "रेल 18,514 क्रोर",
"answer": "B",
"explanation_en": "The Gross Domestic Product (GDP) of Rajasthan at Current Prices in 2019-20 was Rs. 65,049 crore. The total GDP is calculated in different ways, but for this question, we have converted it to Rs. 14,967 crore using Railway ratio.",
"explanation_hi": "राजस्थान 2019-20 में राजस्थान की मैं रेल रूझ बाज़ों से राजस्थान की मैं रेल रूझ बाजों से किया जाना है कि राजस्थान 2019-20 मैं रेल रूझ बाजों से उत्तम फॉरमियां की जाना है कि राजस्थान में शांतियां से उत्तम फॉरमी संतरां किया है कि राजस्थान में शांतियां से उत्तम फॉरमी संतरां किया है कि राजस्थान में शांतियां से उत्तम फॉरमी संतरां किया है कि राजस्थान में शांतियां से उत्तम फॉरमी संतरां किया है कि राजस्थान में शांतियां से उत्तम फॉरमी संतरां किया है कि राजस्थान में शांतियां से उत्तम फॉरमी संतरां किया है कि राजस्थान में शांतियां से उत्तम फॉरमी संतरां किया है कि राजस्थान में शांतियां से उत्तम फॉरमी संतरां कि राजस्थान में शांतियां से उत्तम फॉरमी संतरां कि राजस्थान में शांतियां से उत्तम फॉरमी संतरां कि राजस्थान में शांतियां संतरां कि राजस्थान में शांतरां कि राजस्थान में शांतरां कि राजस्थान में शांतरां कि राजस्थान में शांतरां कि राजें शांतरां कि राजें कि राजसें कि राजें कि राजसें कि राजें कि राें कि राजें कि राजें कि राजें कि राजें कि राजें कि राजें कि राजें कि राजें कि राजें कि राजें कि राजें कि राें कि राजें कि राें कि राजन कि राजें कि राजें कि राजें कि राजें कि राें कि राजें कि राें कि",
	"
{
राजें कि राजें कि राजें कि राें कि राजें कि राजें कि राजें कि राजें कि राें कि राजें कि राजें कि राें कि राजें कि राजें कि राें कि राजें कि राें कि राजें