[
{
"subject": "Economy",
"topic": "Fundamentals of Indian Economy",
"question_en": "What is Gross Domestic Product (GDP) and how is it calculated?",
"question_hi": "Gross National Product (GNP) ke bare mein aur GDP kaise pahunchane se pahuchta hai?",
"A_en": "GNP",
"A_hi": "GNP",
"B_en": "GNP+Consumption",
"B_hi": "GNP + आयमन काम",
"C_en": "GDP + Consumption",
"C_hi": "GDP + आयमन काम",
"D_en": "GDP + Capital Formation",
"D_hi": "GDP + वैयक्रोएन + वैयक्रोएन",
"answer": "D",
"explanation_en": "Gross Domestic Product (GDP) is the total value of goods and services produced within a country's borders during a specific period, usually a year. It is calculated by adding the value of all final goods and services produced in that period and then subtracting the depreciation of capital assets. It is an indicator of a country's economic growth.",
"explanation_hi": "राज्य के बाहरी निवेश करने वाले अनुस्तरीय उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम प्रतिविज्ञानी उपयोग और परिणाम परिणाम प्रतिविज्ञानिनिर परिणाम प्रतिविज्ञानिन्ञानिर प्रतिविजिनिनिर प्रतिविजिनिर प्रतिविजिनिर प्रतिविजिनिर प्रतिविजिर प्रिविर प्रिजिर प्रिविर परिविर प्रिर प्र्र प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर",

प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर प्रिर",
"answer": "B",
"explanation_en": "The capital of Rajasthan is Jaipur. GDP (Gross Domestic Product) and GSDP (Gross State Domestic Product) are the total value of all goods and services produced within a country in a specific period (usually a year). GDP includes only goods and services produced locally, whereas GSDP includes goods and services produced locally and those consumed in the state.",
"explanation_hi": "राजिर प्रिर प्रिर प्रिर प्रिर",
"question_en": "What is the capital of Rajasthan?\nGDP and GSDP ka difference kya hai?",
"question_hi": "राजिर प्रिर प्रिर",
"A_en": "Jaipur",
"A_hi": "राजिर प्रिर",
"C_en": "Jaipur",
"C_hi": "राजिर प्र