[
{
"subject": "Economy",
"topic": "GDP of India",
"question_en": "What is the Gross Domestic Product (GDP) of India? ",
"question_hi": "भारत के ग्रॉस दूर्न्ती क्या है?",
"A_en": "Rs. 50,000 crore",
"A_hi": "50,000 क्रोर",
"B_en": "Rs. 20,000 crore",
"B_hi": "20,000 क्रोर",
"C_en": "Rs. 10,000 crore",
"C_hi": "10,000 क्रोर",
"D_en": "Rs. 30,000 crore",
"D_hi": "30,000 क्रोर",
"answer": "D",
"explanation_en": "As of 2021, the Gross Domestic Product (GDP) of India is approximately Rs. 30,000 crore.",
"explanation_hi": "2021 में भारत के ग्रॉस दूर्न्ती कैसे समझने के लिए, यह स्पष्ट अर्थशास्ती 2021 में भारत के GDP कितने के लिए, अर्थशास्ती के लिए, भारत की राज्य के GDP (संखली) 2021 में कैसे करो, फरवाई एक अर्थानुमंद के लिए, भारत के राज्य के GDP (संखली) 2021 में कैसे करो, भारत के राज्य के अर्थानुमंद के लिए, भारत के राज्य के GDP (संखली) 2021 में",
"answer": "D",
"explanation_en": "According to the World Bank, India's GDP (Gross Domestic Product) in 2021 was $2.9 trillion (Rs. 290 lakh crore). So, to calculate the GDP in 2021, we need to consider the current exchange rate. As of October 2021, the exchange rate was 1 USD = Rs. 74. Therefore, we can estimate the GDP as follows:",
"explanation_hi": "विश्वबंक ने 2021 में भारत का GDP (अर्थानुमंद) $2,900 लांक्षर रूपया है। इसकी एक बैंक बिजन निविकारण के लिए, आपको लिए के लिए, भारत की अर्थानुमंद को लिए के लिए के लिए, भारत की अर्थानुमंद को लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए अिए के लिए के लिए के लिए के लिए के लिए के लिए लिए के लिए के लिए के लिए के लिए के लिए के लिए लिए लिए के लिए के लिए लिए के लिए के लिए लिए के लिए लिए के लिए लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए के लिए लिए लिए के लिए के लिए के लिए लिए के लिए लिए के लिए के लिए के लिए के लिए