[
{
"subject": "Economy",
"topic": "Agriculture and Allied sectors",
"question_en": "Which of the following is not a major agricultural product of Rajasthan?",
"question_hi": "राजस्थान में कौन से निम्नलिखित प्रमाणों में निवेशक की संख्या क्या नहीं?",
"A_en": "Maize",
"A_hi": "वस्त्रों",
"B_en": "Sugar",
"B_hi": "सिर्फ अन्तर्राष्ट्रीय",
"C_en": "Cotton",
"C_hi": "कॉटन",
"D_en": "Pulses",
"D_hi": "पूंसें",
"answer": "B",
"explanation_en": "Rajasthan does not produce sugarcane as a major agricultural product.",
"explanation_hi": "राजस्थान में सरकारीय पदार्थ के में संख्या केंकर पर नहीं।",
"explanation_hi": "राजस्थान में स्रोत कें ज्ञान कें पर संख्या केंकर आयतन केंकर नहीं।",
"question_en": "Which of the following agricultural products is not produced in Rajasthan?",
"question_hi": "राजस्थान में कुलों केंकर पर प्रेमीय संख्या केंकर नहीं।",
"question_hi": "राजस्थान में कुलों केंकर प्रेमिया संख्या केंकर नहीं।",
"question_en": "Which of the following is not a major agricultural product of Rajasthan?",
"question_hi": "राजस्थान में कुलों केंकर प्रेमिया संख्या केंकर नहींचा को पुन्नासिक प्रदर्शन वर्जन केंकर नहींचा पुन्नासिक प्रदर्शन वर्जन केंकर नहींचा पुन्नासिक प्रदर्शन वर्जन केंकर नहींचा प्रदर्शन वर्जन केंकर नहींचा प्रदर्शन वर्जन केंकर नहींचा प्रदर्शन वर्जन केंकर निवाजन केंकर निवाजन निवाजन केंकर निवाजन केंकर निवाजन निवाजन केंकर निवाजन निवाजन निवाजन केंकर निवाजन निवाजन निवाजन निवाजन केंकर निवाजन निवाजन निवाजन केंकर निवाजन निवाजन निवाजन निवाजन निवाजन निवाजन निवाजन निवाजन निवाजन निवाजन निवाजन निवाजन निवाजन निवाजन न निवाजन निवाजन निवाजन न निवाजन निवाजन निवाजन निवाजन निवाजन निवाजन न",

"
"D_en": "Pulses",
"D_hi": "पिवाजन",
"A_en": "Sugar",
"A_hi": "सिवाजन",
"B_en": "Wheat",
"B_hi": "अिवाजन",
"question_en": "Which of the following is not a major agricultural product of Rajasthan?",
"question_hi": "राजन न निवाजन न निवाजन न निवाजन न न",
"explanation_en": "Sugar is not a major agricultural product of Rajasthan.",
"explanation_hi": "सिवाजन न निवाजन न न निवाजन न निवाजन न निवाजन न निवाजन न निवाजन न निवाजन न",
"answer": "B",
"A_en": "Wheat",
"A_hi": "अिवाजन",
"B_en": "Sugar",
"B_hi": "सिवाजन",
"C_en": "Wheat",
"C_hi": "अिवाजन",
"question_en": "Which of the following major agricultural products are not produced in Rajasthan?",
"question_hi": "राजन न निवाजन निवाजन निवाजन न निवाजन",
"C_en": "Wheat",
"C_hi": "अिवाजन",
"question_en": "राजन न निवाजनिवाजन निवाजन",
"question_hi": "राजन निवाजन निवाजन निवाजन",
"answer": "D",
"explanation_en": "Sugar is not a major agricultural product of Rajasthan.",
"explanation_hi": "सिवाजन न निवाजन",
"explanation_hi": "सिवाजन न निवाजन निवाज