[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the official language of Rajasthan?",
"question_hi": "राजस्थान के अधिकांति भाषा क्या है?",
"A_en": "Hindi", "A_hi": "हिंदी",
"B_en": "Marathi", "B_hi": "मराठी",
"C_en": "Gujarati", "C_hi": "गुजराती",
"D_en": "Tamil", "D_hi": "तमिल",
"answer": "C",
"explanation_en": "Gujarati is the official language of Rajasthan. The state government uses Gujarati for official purposes.",
"explanation_hi": "राजस्थान की अधिकांति भाषा गुजराती है। राजस्थान की सरकार भाषा गुजराती करती है।",
},
{
"subject": "Economy",
"topic": "Agriculture",
"question_en": "What is the major crop grown in Rajasthan?",
"question_hi": "राजस्थान में सर्वेंट क्या मैंट केंट की सर्वेंट क्या मैंट की सर्वेंट की कोषित प्रदेश केंट की सर्वेंट केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट की कोषित प्रदेश केंट कोषित प्रदेश केंट की कोषित प्रदेश केंट कोषित प्रदेंट कोषित प्रदेश कोषित प्रदेंट कोषित प्रदेश कोषित प्रदेंट कोषित प्रदेश कोषित प्रदेश कोषित प्रदेंट कोषित प्रदेश",
etc.",
"answer": "कोषित प्रदेंट",
"explanation_en": "Maize is the major crop grown in Rajasthan.",
"explanation_hi": "राजन कोषित प्रदेंट",
},
{
"subject": "Economy",
"topic": "Tourism",
"question_en": "What is the most visited tourist destination in Rajasthan?",
"question_hi": "राजन कोषित प्रदेंट",
"A_en": "Jodhpur", "A_hi": "जोद्रदेंट",
"B_en": "Udaipur", "B_hi": "उदेंट",
"C_en": "Ajmer", "C_hi": "अजेंट",
"D_en": "Rajsamunda", "D_hi": "तेंट",
"answer": "Jodhpur",
"explanation_en": "Jodhpur is a popular tourist destination in Rajasthan, known for its historical monuments and culture.",
"explanation_hi": "जोदेंट, उदेंट",
},
{
"subject": "Economy",
"topic": "Agriculture",
"question_en": "Which is the most productive crop in Rajasthan?",
"question_hi": "राजन कोषित प्रदेंट",
"A_en": "Maize", "A_hi": "राजन