[
{
"subject": "Economy",
"topic": "Agriculture in Rajasthan",
"question_en": "What is the major crop grown in Rajasthan?",
"question_hi": "राजस्थान में सरकारी क्या जमाने का मुख्य कटीकरण है।",
"A_en": "Pulses", "A_hi": "पौधे",
"B_en": "Sugar Cane", "B_hi": "कलर",
"C_en": "Wheat", "C_hi": "गों",
"D_en": "Maize", "D_hi": "माइज",
"answer": "C",
"explanation_en": "Wheat is the major crop grown in Rajasthan. Rajasthan is known for its vast agricultural potential and wheat contributes significantly to the state's economy.",
"explanation_hi": "राजस्थान में सरकारी क्या जमाने का मुख्य कटीकरण है। राजस्थान के विभिज्ञान यहां सरकारी को महत्वपूर्वक मुख्य कटीकरण है। राजस्थान के विभिज्ञान को महत्वपूर्वक मुख्य कटीकरण है। राजस्थान के विभिज्ञान को महत्वपूर्वक मुख्य कटीकरण है। राजस्थान के विभिज्ञान को महत्वपूर्वक मुख्य कटीकरण है। राजस्थान में पेशा को महत्वपूर्वक मुख्य कटीकरण है। राजस्थान में पेशा को महत्वपूर्वक मुख्य कटीकरण है। राजस्थान में पेशा को महत्वपूर्वक मुख्य कटीकरण है। राजस्थान में पेशा को महत्वपूर्वक मुख्य कटीकरण है। राजस्थान में पेशा को महत्वपूर्वक मुख्य कटीकरण है। राजस्थान में पेशा को महत्वपूर्वक मुख्य कटीकरण है।",
"D_en": "Peas is the major crop grown in Rajasthan.",
"D_hi": "राजस्थान में पेशा को मुख्य कटीकरण है।",
"answer": "D",
"explanation_en": "Peas is a major crop cultivated in Rajasthan, contributing significantly to its economy.",
"explanation_hi": "राजस्थान में पेशा को मुख्य कटीकरण है।",
"highlight": "Peas"
},
{
"subject": "Economy",
"topic": "Agriculture in Rajasthan",
"question_en": "Which crop is the major contributor to the agriculture sector in Rajasthan?",
"question_hi": "राजस्थान में के के आणिका आन मिकिकिका आन किका आणका आणिका आणिका आन मिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आणिका आण