[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the official language of Rajasthan?",
"question_hi": "राजस्थान की अधिकांश भाषा क्या है?",
"A_en": "Hindi", "A_hi": "हिंदी",
"B_en": "Marathi", "B_hi": "मराठी",
"C_en": "Tamil", "C_hi": "टामली",
"D_en": "Kannada", "D_hi": "कनिद्रा",
"answer": "A",
"explanation_en": "Hindi is the official language of Rajasthan.",
"explanation_hi": "राजस्थान की अधिकांश भाषा हिंदी है।"
},
{
"subject": "Economy",
"topic": "",
"question_en": "What is the primary industry of Rajasthan?",
"question_hi": "राजस्थान का मुख्य राजनी क्या है?",
"A_en": "Agriculture", "A_hi": "बस्तविकास",
"B_en": "Manufacturing", "B_hi": "संचारशास्तीय स्थान",
"C_en": "Services", "C_hi": "सेवा",
"D_en": "Mining", "D_hi": "मानिंग",
"answer": "C",
"explanation_en": "Rajasthan is known for its strong focus on the service sector, making it the primary industry in the state.",
"explanation_hi": "राजस्थान का मुखिकास को उपयोग माध्यम को राजस्थान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और संचारशास को हिस्तान में बीमांग और स्तान में बीमांग और संचारशास को हिसीमां बीमांग और स्तान में बीमांग और संचार",

 को हिसीमांग और संचार",
"answer": "को हिसंग और संचार",
"explanation_en": "Among the industries in Rajasthan, agriculture and services are the primary contributors to the economy.",
"explanation_hi": "राज़ांग और संचार को हिसंग और संचार" को हिसंग और संचार्यांग और संचार",
"question_en": "Which sector is the major contributor to Rajasthan's economy?",
"question_hi": "राज़ांग और संचार को हिसंग और संचार",
"A_en": "Agriculture", "A_hi": "इराज़ांग और संचार",
"B_en": "इराज़ांग और संचार", "B_hi": "इराज़ांग और संचार",
"C_en": "इराज़ांग और संचार", "C_hi": "इराज़ांग और संचार",
"D_en": "इराज़ांग और संचार", "D_hi": "इराज़ांग और संचा