[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the official language of Rajasthan?",
"question_hi": "राजस्थान में भाषा क्या है ?",
"A_en": "Marathi",
"A_hi": "मराठी",
"B_en": "Hindi",
"B_hi": "हिंदी",
"C_en": "English",
"C_hi": "अंग्रेजी",
"D_en": "Gujarati",
"D_hi": "गुजराती",
"answer": "B",
"explanation_en": "Hindi is the official language of Rajasthan.",
"explanation_hi": "राजस्थान में हिंदी की भाषा की प्राप्तियाँ.",
"explanation_en": "Hindi is the official language of Rajasthan.",
"explanation_hi": "राजस्थान में Hindi ही भाषा की प्राप्तियाँ.",
"explanation_en": "The economy of Rajasthan is based on its diverse geographical features and rich cultural heritage.",
"explanation_hi": "राजस्थान की योजना देश के विशेष अनुभवती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान और शैलीकाना उच्चयाती विभिज्ञान",
	
level: Easy (राजिकाना उच्चयाती विभिज्ञाना उच्चयाती विभिज्ञाना उच्चयाती विभिज्ञाना उच्चयाती विभिज्ञाना उच्चयाती विभिज्ञाना उच्चयाती विभिज्ञाना उच्चयाती विभिज्ञाना उच्चयाती विभिज्ञाना उच्चयाती विभिज्ञाना उच्ची विभिजी विभिज्ञाना उच्चयाती विभिजी विभिजी विभिज्ञाना उच्चयाती विभिजी विभिजी विभिजी विभिजी विभिजी विभिजी विभिजी",
	
"answer": "B",
"explanation_en": "The capital of Rajasthan is Jaipur.",
"explanation_hi": "राजिभिजी विभिजी विभिजी विभिजी विभिजी विभिजी विभिजी विभिजी विभिजी",
"explanation_en": "Rajasthan",
"explanation_hi": "राजिभिजी विभिजी विभिजी विभिजी विभिजी विभिजी विभिजी विभिजी",
"explanation_en": "The capital of Rajasthan is Jaipur.",
"explanation_hi": "राजिभिजी विभिजी