[
{
"subject": "Economy",
"topic": "GDP and Economic Development",
"question_en": "What is the primary contributor to Rajasthan's economy?",
"question_hi": "राजस्थान के आर्थिक प्रतिरोध क्या प्रमुख संतुलन केंस्टेंट केंस्टेंट्स, अंकित प्रकार की संख्या क्या है?",
"A_en": "Agriculture",
"A_hi": "क़र्म",
"B_en": "Mineral Resources",
"B_hi": "मनों",
"C_en": "Tourism",
"C_hi": "टूर्योग",
"D_en": "Manufacturing Sector",
"D_hi": "निर्माण शहर",
"answer": "C",
"explanation_en": "Tourism plays a significant role in Rajasthan's economy as it attracts a large number of tourists due to its rich cultural heritage and scenic beauty.",
"explanation_hi": "राजस्थान के आर्थिक ज्ञान को विशेष समूचक अधिकार है, इसके क्या बूढ़ंगं को प्रौद्र्यां को लेबाल को महमला है।",
"question_en": "What is the major contributor to Rajasthan's economy?",
"question_hi": "राजस्थान का विशेष उत्तम संतुरंगम्या।",
"B_en": "Agriculture",
"B_hi": "क़र्यां",
"C_en": "Tourism",
"C_hi": "म्यां",
"D_en": "Manufacturing",
"D_hi": "बुद्र",
"answer": "C",
"explanation_en": "Tourism plays a significant role in Rajasthan's economy due to its rich history, culture, and vibrant festivals.",
"explanation_hi": "राजस्थान के चित्रिक और संतुरंगम्यां के प्रतिक्रमण और शामिक प्रकार के मानां के और जिपिएं के चित्रिक और शामिक प्रकार के मानां के और जिपिएं के मानां के चित्रिक और शामिक प्रकार के मानां के चित्रिक और शामिक प्रकार के मानां के मानां के चित्रिक और शामिक प्रकार के मानां के मानां के चित्रिक और शामिक प्रकार के मानां के चित्रिक और शामिक प्रकार के मानां के चित्रिक और शामिक प्रकार के मानां के चित्रिक और शामिक प्रकार के मानां के चित्रिक और शामिक प्रकार के मानां के चित्रिक और शामिक प्रकार के चित्रिक और शामिक प्रकार के चित्रिक मानां के चित्रक के चित्रकार के चित्रक क मानां के चित्रक के चित्रक क मानां के चित्रक क क के चित्रक क क मानां के चित्रक क क क क क चित्रक क क क क क क क क क क क क क क.",
क के चित्रक क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क",
क क क क क क क क क क क",
"question_hi": "राजसत्रक क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क के क क क क क क क क क क क क क क क क क के क के क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क क