[
{
"subject": "Economy",
"topic": "",
"question_en": "What is Gross Domestic Product (GDP) and how is it calculated?",
"question_hi": "Gross Domestic Product (GDP) और निर्धारित किया जाता है।",
"A_en": "GDP is the total value of goods and services produced in a country.",
"A_hi": "राष्ट्रीय उत्पादन के संतुलन राज्य में एक देश में उत्पादन का समतलन है।",
"B_en": "GDP is calculated by adding up the value of all goods and services produced in the country.",
"B_hi": "राष्ट्रीय GDP राज्य में उत्पादन का संतुलन, क्या करना प्रतिरोध किया जाता है।",
"C_en": "GDP is calculated by considering the prices of goods and services produced in the country.",
"C_hi": "राष्ट्रीय GDP करने में मूल और क्या करने के लेबाल और सम्पदों को क्या करना होता है।",
"D_en": "GDP includes both the value of goods and services produced, regardless of whether they are consumed or saved.",
"D_hi": "राष्ट्रीय GDP को सबसे मूल और सम्पदों का वर्तमान करना होता है।",
"E_en": "GDP is calculated using current prices, not the original prices of goods and services.",
"E_hi": "राष्ट्रीय GDP का वर्तमान करने के लिए क्या करने के लिए करने के लिए क्या करने के लिए करने के लिए क्या करने के लिए करनी क्या करने के लिए क्या करने के लिए करने के लिए करनी के लिए करने के लिए करनी करने के लिए करनी करनी करने के लिए करनी करने के लिए करनी करने के लिए करनी करने के लिए करने के लिए करनी करने के लिए करने के लिए करने के लिए करने के लिए करनी करने के लिए करने के लिए करनी करने के लिए करने के लिए करनी करने के लिए करने के लिए करने के लिए करने के लिए करने के लिए करने के लिए करने के लिए करने के लिए करने के लिए करे करने के लिए करे लिए करे लिए करे करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए करे लिए