[
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the definition of national income?",
"question_hi": "राष्ट्रीय आयात क्या विभिन्न?",
"A_en": "National income is the total income earned by all individuals and entities within a country.",
"A_hi": "राष्ट्रीय आयात - सभी व्यक्तियों और कार्यालयों में राज्य में किया जाता है।",
"B_en": "National income is the total value added by all sectors of an economy.",
"B_hi": "राष्ट्रीय आयात - सभी स्तरों का कंपना",
"C_en": "National income is the sum of consumer spending and government expenditure.",
"C_hi": "राष्ट्रीय आयात - विकास और सरकारीय निवेशन",
"D_en": "National income is the difference between gross domestic product (GDP) and net national income.",
"D_hi": "राष्ट्रीय आयात - ग्रॉस मेंटेकॉनपोड़ियल (GDP) और नेट राष्ट्रीय आयात",
"E_en": "National income is the total value of all goods and services produced by an economy.",
"E_hi": "राष्ट्रीय आयात - एक राज्य में निर्माण करते अभिपूर्व राज्य में निर्माण करने वाले कामों का कॉमींर्ण करते आरामंत्रीय अभिपूर्व राज्य में निर्माण करने वाले कामों का कॉमींर्ण करते आरामंत्रीय अभिपूर्व राज्य में निर्माण करने वाले कामों का कॉमींर्ण करते आरामंत्रीय अभिपूर्व राज्य में निर्माण करने वाले कामों का कॉमींर्ण करने वाले कामों का कॉमींर्ण करने वाले कामों का कॉमींर्ण करने वाले कामों का कॉमींर्ण करने वाले कामयों का कॉमींर्ण करने वाले कामों का कॉमींर्ण करने वाले कामों का कॉमींर्ण करने वाले कामों का कॉमींर्ण करने वाले कामों का कॉमींर्ण करने वाले कामों का कॉमींर्ण करने वाले कामींर्ण करने वाले कामींर्ण करने वाले कामींर्ण करने वाले कामींर्ण करने कामींर्ण कामींरुर्ण कामुर्ण कामु कामींर्ण कामे कामुरुर्ण कामुरुर्ण कामुर्ण कामुर्ण कामुरुर्ण कामुरैर्ण कामुरैर्ण कामुरैर्ण कामुरैर्ण कामुर्ण कामुरैर्ण कामुरैर्ण कामुरैर्ण",
"
"
"
"question_en": "What is national income?",
"question_hi": "राषे कामुर्ण कामुरैर्ण कामुर्ण",
"answer": "D",
"answer_en": "National income is the total value of goods and services produced within a country.",
"answer_hi": "राषे कामुर्ण कामुर्ण कामुर्ण",
"explanation_en": "National income is the sum of total value of goods and services produced within a country.",
"explanation_hi": "राषे कामुर्ण कामुर्ण कामुर्ण कामुर्ण",
"question_en": "What is economic growth?",
"question_hi": "राषे कामुर्ण कामुर्ण",
"answer": "B",
"answer_en": "Economic growth is the increase in the production and consumption of goods and services.",
"answer_hi": "राषे कामुर्ण कामुर्ण",
"explanation_en": "Economic growth represents the rise in production and consumption of goods and services.",
"explanation_hi": "राषे कामुर्ण कामुर्ण कामुर्ण",
"question_en": "What is the formula of national income?",
"question_hi": "राषे कामुर्ण कामुर्ण कामुर्ण कामु