[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the primary industry in Rajasthan?",
"question_hi": "राजस्थान में प्रधान विकास क्या है?",
"A_en": "Agriculture",
"A_hi": "जंगली केंद्र",
"B_en": "Textile",
"B_hi": "टेक्सटिल",
"C_en": "Mineral",
"C_hi": "मिनियल",
"D_en": "Handicrafts",
"D_hi": "हांड क्राफ्ट",
"answer": "A",
"explanation_en": "Rajasthan is known for its rich mineral resources and agriculture. The primary industry in the state revolves around extracting and processing minerals, as well as developing and promoting the handicraft sector.",
"explanation_hi": "राजस्थान में मिनियल और कमांचरण और उत्पन्न और कांचरण और कांचरण और प्रणम को बनाने के लिए गए हैंगे।",
"D_en": "Agriculture and handicrafts are the primary sectors that drive the economy of Rajasthan.",
"explanation_en": "Agriculture is the backbone of Rajasthan's economy, contributing significantly to its GDP and providing livelihood to a large section of the population. Handicrafts, including textiles and pottery, are also important sectors in terms of employment generation and promoting local culture.",
"explanation_hi": "राजस्थान के एक्सपन का निर्मान में, यह अम्बारी के प्रतिक्रम्यान का मूल क्रम्यान में, राजस्थान के प्रतिक्रम्यान का मूल क्रम्यान में, राजस्थान के प्रतिक्रम्यान का मूल क्रम्यान में, राजस्थान के प्रतिक्रम्यान में, राजस्थान के प्रतिक्रम्यान में, राजस्थान के प्रतिक्रम्यान में, राजस्थान के प्रतिक्रम्यान में, राजस्थान के प्रतिक्रम्यान में, राजस्थान के प्रतिक्रम्यान में, राजस्थान के प्रतिक्रम्यान में, राजस्थान के प्रतिक्रम्यान में, राजस्थान के प्रतिक्रम्यान में, राजस्थान के प्रतिक्रम्यान में, राजस्थान के प्रतिक्रम्यान में, राजस्थान के प्रतिक्रम्यान में, राजस्थान के प्रतिक्र्यान में, राजस्थान के प्रतिक्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान मं, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राज्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राजस्थान के प्र्यान में, राज