[
{
"subject": "Economy",
"topic": "National Income and Product",
"question_en": "What is the concept of Gross Domestic Product (GDP)?",
"question_hi": "ग्रॉस कामयाबी (GDP) क्या अर्थ है?",
"A_en": "Gross National Product (GNP)", "A_hi": "ग्रॉस नागरिक कामयाबी (GNPC)",
"B_en": "Gross Regional Product (GRP)", "B_hi": "ग्रॉस रेज़नियन कामयाबी (GRPC)",
"C_en": "Gross National Income (GNI)", "C_hi": "ग्रॉस नागरिक आर्थिक आयात (GNIA)",
"D_en": "Gross Domestic Income (GDI)", "D_hi": "ग्रॉस कामयाबी (GDC)",
"answer": "C",
"explanation_en": "Gross National Income (GNI) refers to the total income earned by citizens of a country from all sources within and outside the country. It includes both remittances from abroad and income earned by citizens.",
"explanation_hi": "ग्रॉस नागरिक आर्थिक आयात (GNIA) केंद्र के लोगों को राज्य में आयात केंद्र को वर्जुम्बर है। इसका मान पूर्वान्याम्बर का मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान्याम्बर मान पूर्वान पूर मान पूर्वान्याम्बर मान पूर्वान पूर मान पूर मान पूर्वान पूर मान पूर मान पू",
मान पूर्वान पूर मान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान",
पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान",
"answer": "पूर्वान पूर्वान पूर्वान",
"explanation_en": "The gross national product (GNP) is the total value of goods and services produced within a country, considering both domestic and foreign sales. It is calculated by deducting depreciation and net exports from GDP.",
"explanation_hi": "गलिक का काॅन पूर्वान पूर्वान पूर्वान पूर्वान पूर्वान",
"D_hi": "गलिक काॅन पूर्वान पूर्वान पूर्वान पूर्वान",
}
]