[
{
"subject": "Economy",
"topic": "Nominal GDP",
"question_en": "What is Nominal GDP and how is it calculated?",
"question_hi": "निम्नलिखित आर्थिक आरंभ (Nominal GDP) और कैसे प्रसंतुषित कीजिये।",
"A_en": "Real GDP", "A_hi": "सरल आर्थिक आरंभ",
"B_en": "Producer Price Index", "B_hi": "उत्पदाचार प्रतिकृति नंबर",
"C_en": "Consumer Price Index", "C_hi": "भूमि प्रतिकृति नंबर",
"D_en": "Gross Domestic Product", "D_hi": "गृहीत आर्थिक आरंभ",
"answer": "D",
"explanation_en": "Nominal GDP is the total value of all goods and services produced within a country in a given time period. Real GDP, on the other hand, is nominal GDP adjusted for inflation. Producer Price Index and Consumer Price Index are measures of inflation. Gross Domestic Product is the total value of goods and services produced in a country's economy. So, the correct answer is D - Gross Domestic Product.",
"explanation_hi": "राज्य में एक विभिज्ञानी आर्थिक आरंभ (Nominal GDP) हेंचरण प्रतिकृत्र (Real GDP) में Nominal GDP यात्रिक आरंभ (Real GDP) को विभिज्ञानी आरंभ प्रतिकृत्र आरंभ (Real GDP) में Nominal GDP यात्रिक आरंभ (Real GDP) को विभिज्ञानी आरंभ प्रतिकृत्र आरंभ (Real GDP) यात्रिक आरंभ (Real GDP) में Nominal GDP यात्रिक आरंभ (Real GDP) को विभिज्ञानी आरंभ (Real GDP) में Nominal GDP यात्रिक आरंभ (Real GDP) को विभिज्ञानी आरंभ (Real GDP) में विभिज्ञानी आरंभ (Real GDP) को विभिज्ञानी आरंभ (Real GDP) में विभिज्ञानी आरंभ (Real GDP) को विभिज्ञानी आरंभ (Real GDP) में विभिज्ञानी आरंभ (Real GDP) को विभिज्ञानी आरंभ (Real GDP) में विभिज्ञानी आरंभ (Real GDP) को विभिज्ञानी आरंभ (Real GDP) में विभिज्ञानी आरंभ (Real GDP) में विभिज्ञानी आरंभ (Real GDP) को विभिज्ञानी आरंभ (Real GDP) में विभिज्ञानी आरंभ (Real GDP) में विभिज्ञानी आरंभ (Real GDP) को विभिज्ञानीनी आरंभ (Real GDP) में विभिज्ञानी आरंभ (Real GDP) में विभिज्ञानीनीनी आरंभ (Real GDP) को विभिज्ञानीनीनीनीनीनीनीनीनीनीननीनीनीनीनीनीनीनीनीनीनीनीननीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीनीननीनीनीनीनीनीनीनीनीनीनीनीनीनीीनीनीनीनीनीनीनीनीनीनीनीनी