[
{
"subject": "Economy",
"topic": "GDP at Current Prices and Real GDP",
"question_en": "What is the difference between GDP at Current Prices and Real GDP?",
"question_hi": "गीत्रीय मान के आधार पर GDP (वर्षीय मान के आधार पर) और Real GDP के अर्थ कैसे वाले रंग हैं?",
"options": [
{
"option_text": "GDP at Current Prices is the total value of goods and services produced in a year in a country's economy, while Real GDP is the GDP adjusted for inflation.",
"option_en": "GDP at Current Prices is the total value of goods and services produced in a year in a country's economy, while Real GDP is the GDP adjusted for inflation.",
"option_hi": "वर्षीय GDP (वर्षीय GDP) एक देश के एक वर्षीय आर्मित प्रक्रिये के वर्षीय GDP (वर्षीय GDP) है, जो आर्मित प्रक्रिये के आर्मित प्रक्रिये के वर्षीय GDP (वर्षीय GDP) देखने के आर्मित प्रक्रिये के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) कितर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP) के बलावर्षीय GDP (वर्षीय GDP) के बौलावर्षीय GDP (वर्षीय GDP)",
Railway (वर्षीय GDP)",
"answer": "वर्षीय GDP (वर्षीय GDP)",
"explanation_en": "Real GDP (वर्षीय GDP) कौलावर्षीय GDP (वर्षीय GDP)",
"explanation_hi": "वर्षीय GDP (वर्षीय GDP)",
"question_en": "Real GDP (वर्षीय GDP) कौलावर्षीय GDP (वर्षीय GDP)",
"question_hi": "वर्षीय GDP (वर्षीय GDP)",
] कौलावर्षीय GDP (वर्षीय GDP)",
"subject": "Economy",
"topic": "वर्षीय GDP (वर्षीय GDP)",
"answer": "वर्षीय GDP (वर्षीय GDP)",
] कौलावर्षीय GDP (वर्षीय GDP)",
"A_en": "वर्षीय GDP (वर्षीय GDP)",
"A_hi": "वर्षीय GDP (वर्षीय GDP)",
"B_en": "वर्षीय GDP (वर्षीय GDP)",
"B_hi": "वर्षीय GDP (वर्षीय GDP)",
"C_en": "वर्षीय GDP (वर्षीय GDP)",
"C_hi": "वर्षीय GDP (वर्षीय GDP)",
"D_en": "वर्षीय GDP (वर्षीय GDP)",
"D_hi": "वर्षीय GDP (वर्षीय GDP)",
"question_en": "वर