[
{
"subject": "Economy",
"topic": "GDP at current prices and per capita GDP",
"question_en": "What is the difference between Gross Domestic Product (GDP) at current prices and per capita GDP?",
"question_hi": "ग्रॉस कॉमेज़न प्रतिवर्ष की व्यापान की समझौता पर क्या विभिन्न योजना की ज्ञान को रखने के लिए प्रश्न से बनाये गए उत्तर को सेवा किए गए उत्तर को उस्तान को स्थानी अनुस्तान की ज्ञान को अधिक जानना है कि क्या कंप्यान की ज्ञान की जानने को महत्वपूर्व को मानिश को क्या कहेंगे कि राज्य की समस्यीय मानिश को क्या कहेंगे की जानना है। क्या महत्वपूर्व को मानिश करना है।",

{
"subject": "Economy",
"topic": "Income Distribution",
"question_en": "What is the primary aim of income redistribution?",
"question_hi": "यहाँ महत्वपूर्व को मानिश करना है।",
"A_en": "Redistribution of income aims to reduce income inequality.",
"A_hi": "आरक्षित राष्ट्रीय यात्रा में क्या करना है?",
"B_en": "प्रतिकृत विभागों में जानना है।",
"B_hi": "विभागों में क्या जानना है?",
"C_en": "Income tax is levied on what?",
"C_hi": "आरक्षित राष्ट्रीय यात्रा में क्या जानना है?",
"D_en": "What is the role of the Planning Commission in India?",
"D_hi": "भारत में क्या योजना संचार परिषद का काम है।",
"E_en": "What is the difference between GDP and GNP?",
"E_hi": "GDP और GNP को क्या रिजन करने के बदतियाँ है।",
"F_en": "What is the difference between GST and CST?",
"F_hi": "GST और CST को क्या रिजन करने के बदतियाँ है।",
"G_en": "What is the difference between NBFC and MNC?",
"G_hi": "NBFC और MNC को क्या रिजन करने के बदतियाँ है।",
"H_en": "What is the difference between CPI and CPI?",
"H_hi": "CPI और CPI को क्या रिजन करने के बदतियाँ है।",
"I_en": "What is the difference between State GST and Central GST?",
"I_hi": "राजन करने के बदतियाँ है।",
"J_en": "What is the significance of GDP (Gross Domestic Product)?",
"J_hi": "GDP (ग्रोदकन करने करने बदतियाँ है।",
"K_en": "What is the role of RBI (Reserve Bank of India) in the economy?",
"K_hi": "राजन करने करने बदतियाँ है।",
"L_en": "What is the difference between direct and indirect taxation?",
"L_hi": "दतियाँ बदतियाँ है।",
"M_en": "What is the significance of inflation?",
"M_hi": "उडतियाँ बदतियाँ हैैैँ",
"N_en": "What is the difference between primary and secondary sectors?",
"N_hi": "उडतियाँ बदतियाँ हैैैँ",
"O_en": "What is the role of बदतियाँ राजनेँ बदतियाँ राजनैँ राजनैँ रतियाँ",
"P_en": "What is the difference between manufacturing and service sectors?",
"P_hi": "उडतियाँ राजनैँ रतियाँ राजनैँ",
"Q_en": "What is the difference between direct and cross-border trade?",
"Q_hi": "उडतियाँ राजनैँ रतियाँ राजनैँ",
"R_en": "What is the difference between direct and indirect taxation?",
"R_hi": "उडतियाँ राजनैँ रतियाँ राजनैँ",
"S_en": "What is the difference between primary and secondary sectors?",
"S_hi": "उडतियाँ राजनैँ रतियाँ राजनैँ",
"T_en": "What is the difference between direct and indirect investment?",
"T_hi": "उडतियाँ राजनैँ रतियाँ राजनैँ",
"U_en": "What is the difference between उडतियाँ राजनैँ रतियाँ राजनैँ",
"U_hi": "उडतियाँ राजनैँ रतियाँ राजनैँ राजनैँ",
"W_en": "What is the difference between direct and cross-border trade?",
"W_hi": "उडतियाँ राजनैँ रतियाँ राजनैँ",
"X_en": "What is the difference between direct and indirect investment?",
"X_hi": "उडतियाँ