[
{
"subject": "Economy",
"topic": "GDP and Economic Growth",
"question_en": "What is the primary driver of economic growth in India?",
"question_hi": "भारत के आएड्यूटिव ग्रॉन्स्टिंग किस मूल वर्तमान विकास का प्रमुख बीमा है?",
"A_en": "Investment",
"A_hi": "इन्वे को मीटिन के बिजनेस का परिणामता है",
"B_en": "Population",
"B_hi": "वन के आयात का परिणामता है",
"C_en": "Technology",
"C_hi": "टेक्नोलॉजी",
"D_en": "Education",
"D_hi": "शिक्षा",
"answer": "C",
"explanation_en": "Technology is the primary driver of economic development in India, as it plays a significant role in improving productivity and enhancing overall growth. In contrast, population and education also contribute to economic progress but technology has a more direct impact.",
"explanation_hi": "भारत में आयात का प्रदेश योजना, यह प्रदेश का प्रदेश योजना, योजना के प्रदेश योजना, यह प्रदेश योजना, योजना के प्रदेश योजना",
"answer": "C",
"explanation_en": "Technology development plays a crucial role in driving the economy of India. The answer is C because technology development contributes to productivity improvement and overall growth.",
"explanation_hi": "भारत के आयात के प्रदेश योजना, योजना के प्रदेश योजना",
{
"subject": "Economy",
"topic": "Demand-Leading Indicators",
"question_en": "What are the key indicators that lead to changes in economic demand?",
"question_hi": "आर्थिक लेडिंग दर्शन के प्रमोटीक इंडक्टर्स",
"answer": "B",
"explanation_en": "The key indicators that lead to changes in economic demand are known as demand-leading indicators. These indicators anticipate future economic changes and provide a hint of upcoming trends. In this context, option B (Consumer Price Index - CPI) is a relevant indicator.",
"explanation_hi": "आर्थिक लेडिंग दर्शन इंडक्टर्स",
"explanation": "आर्थिक लेडिंग दर्शन इंडक्टर्स",
{
"subject": "Economy",
"topic": "Global Economic Relations",
"question_en": "What is the significance of foreign trade in India's economy?",
"question_hi": "भारत के आर्थिक का मूल रिट्राइंड के उपयोगास्ट की मुखता",
"answer": "A",
"explanation_en": "Foreign trade plays a vital role in India's economy as it helps in increasing the country's revenue, promoting development, and enhancing the diversification of the economy by integrating India with the global market. Option A (GDP - Gross Domestic Product) represents the value of goods and services produced within a country.",
"explanation_hi": "भारत के आर्थिक का उपयोगा मुखता",
"explanation": "विद्यार्थिक का उपयोगास्ट",
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is inflation and how does it affect the economy?",
"question_hi": "आर्थिक का उपयोगा मुखता",
"answer": "A",
"explanation_en": "Inflation refers to the rise in the general level of prices of goods and services in an economy. It affects the economy by reducing purchasing power of individuals (as higher prices mean fewer goods and services can be bought for the same amount of money), increasing uncertainty (during inflation, people may not be able to predict the exact price change), and affecting business decisions (inflation can lead to changes in production and investment strategies).",
"explanation_hi": "आर्थिक का उपयोगा मुखता",
"explanation": "आर्थिक का उपयोगा मुखता",
{
"subject": "Economy",
"topic": "Government Policies",
"question_en": "What are the key factors affecting the economy through government policies?",
"question_hi": "सिल्रिका उपयोगा मुखता",
"answer": "C",
"explanation_en": "Various factors influence the Indian economy through government policies. These factors can include fiscal policies (like taxation and subsidies), monetary policies (like interest rates and credit control), and structural policies (like infrastructure development and social welfare programs). Option C refers to these key factors.",
"explanation_hi": "सिलका उपयगा म्रिका म्र्रिका उपयगा म्रिका म्रिका म्रिका उपयगा म्रिका म्रिका उपयरिका म्रिका उपयरिका उपयरिका उपरिका म्रिका उपयरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपरिका उपर