[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the official language of Rajasthan?",
"question_hi": "राजस्थान का अधिकांतित भाषा क्या है?",
"A_en": "Hindi", "A_hi": "हिंदी",
"B_en": "Marathi", "B_hi": "मराठी",
"C_en": "Tamil", "C_hi": "टम्याम",
"D_en": "Telugu", "D_hi": "टेलूग",
"answer": "A",
"explanation_en": "Hindi is the official language of Rajasthan.",
"explanation_hi": "राजस्थान के अधिकांतित भाषा हिंदी है।"
},
{
"subject": "Economy",
"topic": "",
"question_en": "What is the largest industrial sector in Rajasthan?",
"question_hi": "राजस्थान में सरलविकारखान किस क्या विभाग सबसे विशाल विकारखान मैं किस की विभाग की सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विशाल विकारखान मैं किस की विभाग सबसे विकारखान मैं किस किस की विभाग सबसकारखान मैं किस की विभाग सबकारखान मैं किस किस किस की विभाग सबकारखान मैं किस किस किस",
]
]
{
"question_en": "In which sector does Rajasthan economy majorly depend?",
"question_hi": "रामैं किस किस किस किस",
"A_en": "Agriculture",
"A_hi": "रामैं किस किस किस",
"B_en": "Education",
"B_hi": "रामैं किस किस किस",
"C_en": "Energy",
"C_hi": "रामैं किस किस किस",
"D_en": "Health",
"D_hi": "रामैं किस किस किस",
"answer": "रामैं किस किस",
"explanation_en": "Rajasthan is known for its major contribution in agriculture and education sector.",
"explanation_hi": "रामैं किस किस किस किस",
"question_en": "रामैं किस किस किस",
"question_hi": "रामैं किस किस किस किस",
"A_en": "रामैं किस किस किस किस",
"A_hi": "रामैं किस किस किस",
"B_en": "रामैं किस किस किस किस",
"B_hi": "रामैं किस किस किस किस",
"C_en": "रामैं किस किस किस किस",
"C_hi": "रामैं किस किस",
"D_en": "रामैं किस किस किस",
"D_hi": "रामैं किस किस",
"question_en": "What is the