[
{
"subject": "Economy",
"topic": "Government Policies",
"question_en": "Which of the following is not a part of the National Highways?",
"question_hi": "नई राज्य बढ़ियां के प्रतिविलोम प्रेस कलर और Central Public Works Department (CPWD) को नहीं बताया गया है कि इनमें निम्नलेन के रूप में निम्नलेन और अधिकारी के रूप में निम्नलेन और संविधान 
{
"subject": "Economy",
"topic": "Government Policies",
"question_en": "Which of the following is not a part of National Highways and Infrastructure Development Corporation Limited (NHIDCL)?",
"question_hi": "निम्नलेन और अधिकारी के रूप में निम्नलेन और संविधान मंत्रा के रूप में निम्नलेन और संविधान मंत्रा के रूप में निम्नलेन और संविधान मंत्रा के रूप में निम्नलेन और संविधान मंत्रा के रूप में निम्नलेन और संविधान मंत्रा के रूप में निम्नलेन और संविधान मंत्रा के रूप में निम्नलेन और संविधान मंत्रा",
"निम्नलेन और संविधान मंत्रा",
"question_en": "Which organization is not a part of the Ministry of Finance and Planning & Supply?",
"question_hi": "निम्नलेन और संविधान मंत्रा के रूप में निम्नलेन और संविधान मंत्रा",
"A_en": "National Highways and Infrastructure Development Corporation Ltd.",
"A_hi": "राज्य उत्पदायक और प्राधानशाला",
"B_en": "NHAI",
"B_hi": "मनामिति और प्राधानशाला",
"C_en": "National Highways and Motorways",
"C_hi": "राज्य उत्पदायक और प्राधानशाला",
"D_en": "NHIDCL",
"D_hi": "राज्य उत्पदायक और प्राधानशाला",
"answer": "B",
"explanation_en": "National Highways and Motorways is not a part of the Ministry of Road Transport and Highways.",
"explanation_hi": "मनामिति और रोड और हाइलेंट और हाइलेंट के रोड और हाइलेंट के रोड और हाइलेंट",
},
"question_en": "Which organization is not a part of the Ministry of Road Transport and Highways?",
"question_hi": "रोड और हाइलेंट के रोड और हाइलेंट",
"A_en": "National Highways and Infrastructure Development Corporation Limited (NHDC)",
"A_hi": "राजिलेंट के राजिलेंट",
"B_en": "National Highways and Buildings Corporation (NHIDC)",
"B_hi": "राजिलेंट के राजिलेंट",
"C_en": "National Highways and Tribhuvan Yojana (NHTC)",
"C_hi": "राजिलेंट के राजिलेंट",
"D_en": "National Highways and Infrastructure Development Corporation (NHIDC)",
"D_hi": "राजिलेंट के राजिलेंट",
"answer": "C",
"explanation_en": "National Highways and Tribhuvan Yojana (NHTC) is not a part of the Ministry of Road Transport and Highways.",
"explanation_hi": "राजिलेंट के राजिलेंट के राजिट",
}
}
]