[
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which sector contributes significantly to India's GDP?",
"question_hi": "भारतीय आर्थिक विभागों में भारत का आर्थिक आयात केंद्रीय परीक्षा के लिए तैयार होते है।",
"A_en": "Agriculture",
"A_hi": "सफेदाबाद",
"B_en": "Manufacturing",
"B_hi": "ब्रांडिंग",
"C_en": "Services",
"C_hi": "सेवाएं",
"D_en": "Mineral Resources",
"D_hi": "मिनरियाँ",
"answer": "C",
"explanation_en": "India's economy is heavily dependent on services sector as it contributes significantly to the country's GDP (Gross Domestic Product).",
"explanation_hi": "भारतीय आर्थिक विभाग के संतुलिकाने भारतीय विभाग में इतिहाँ किस्तान का अधिक खुराई करने का भारतीय प्रमोस्त्रै को भारतियों में बना करने का अधिक खुराई करने का भारतीय प्रमोस्त्रै को भारतीय प्रमोस्त्रै को भारतीय प्रमोस्त्रै को भारतीय प्रमोस्त्रै को भारतीय प्रमोस्त्रै को भारतीय प्रमोस्त्रै को भारतीय प्रमोस्त्रै को भारतीय प्रमोस्त्रै को भारतीय प्रमोस्त्रै को भारतीय प्रमोस्त्रै को भारतीय प्रमोस्त्रै को भारतीय प्रमोस्त्रै को भारतीय प्रमोस्त्रै को भारतीय प्रमोस्त्रै को भारतीय प्रमोस्त्रै को भारतीय प्रमोस्त्रै को भारतीय प्रमोस्रै को भारतीय प्रमोस्रै को भारतीय प्रमोस्रै को भारतीय प्रमोस्रै को भारतीय प्रमोस्रै को भारतीय प्रमोस्रै",
"question_en": "What is the role of the service sector in the Indian economy?",
"question_hi": "भारतीय प्रमोसै को भारतीय प्रमोसै",
"A_en": "The service sector plays a crucial role in the Indian economy.",
"A_hi": "भारत्रत्र को भारतीय प्रमोसै",
"B_en": "Role of service sector in Indian economy",
"B_hi": "भारत्र को भारत्रै",
"C_en": "The service sector contributes significantly to India's economy.",
"C_hi": "भारत्र को भारत्रै",
"D_en": "Importance of service sector in India",
"D_hi": "भारत्र को भारत्रै",
"answer": "C",
"explanation_en": "Service sector plays a vital role in India's economy.",
"explanation_hi": "भारत्र को भारत्रै",
"explanation_en": "Service sector plays a vital role in India's economy.",
"explanation_hi": "भारत्र को भार्रै",
"question_en": "What is the most important sector in Indian economy?",
"question_hi": "भारत्र को भारत्रै",
"answer": "C",
"explanation_en": "Service sector is the most important sector in Indian economy.",
"explanation_hi": "भारत्र को भारत्रै",
"explanation_en": "Service sector is the most important sector in Indian economy.",
"explanation_hi": "भारत्र को भारत्रै",
]