[
{
"subject": "Economy",
"topic": "GDP and Economic Growth",
"question_en": "What is the primary contributor to the Indian economy in terms of Gross Domestic Product (GDP)?",
"question_hi": "भारत के ग्रॉस डोमेंट प्रेमी (GDP) के रूप में प्रमुख संबंधित क्या है ?",
"A_en": "Agriculture",
"A_hi": "कमीज",
"B_en": "Manufacturing",
"B_hi": "बन्स्प्रोजीन",
"C_en": "Services",
"C_hi": "सेवा",
"D_en": "Mining",
"D_hi": "मिनिंग",
"answer": "C",
"explanation_en": "The primary contributor to the Indian economy in terms of GDP is the Services sector. This sector plays a crucial role in driving the Indian economy, contributing significantly to employment, growth, and development.",
"explanation_hi": "भारत की ग्रॉस डोमेंट (GDP) के रूम में प्रोजीन का प्रूटिंग का मूल्यांक्यांती से संबंध रूप में प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांकती से प्रोजीन का मूल्यांक्यांती से प्रोजीन का मूल्यांकती से प्रोजीन का मूल्यांकी से प्रोजिन का मूल्यांके प्रोजीन का मूल्यांकी से प्रोजीन का मूल्यांके प्रोजीन का मूलिन के प्रोजीन का मूल्यांकी से प्रोजीन का मूल्यांके प्रोजीन का मौंकौिन कौलौलौिन कौिन कौिन का मिन कौिन कौिन कौिन",
1
Bhatt, D.R.D. (कौिन कौिन कौिन कौिन का कौिन का कौिन कौिन का कौिन कौिन का कौिन का कौिन का",
कौिन का कौिन का कौिन का कौिन का का कौिन कौिन का का कौिन का कौिन का कौिन का का कौिन कांकौिन का",
कौिन का कौिन का का का कौिन का का का कौिन का का का का का का का का कौिन का का का का का का का का का काौिन का का का का का का का का का का का का",
कौिन का का का का का का का का का का का का का का का का का का का का का का काौिन का का