[
{
"subject": "Economy",
"topic": "Fundamentals",
"question_en": "What is the definition of GDP?",
"question_hi": "GDP क्या समझने के लिए मतलब है?",
"A_en": "GDP is the total value of goods and services produced in a country.",
"A_hi": "एग्ड को GDP को तैयार राज्य में निर्माण करने वाले आत्मसंरक्षण",
"B_en": "GDP is the sum of all consumer spending, government spending, and net exports.",
"B_hi": "एग्ड को GDP को सभी आवश्यक आवश्यक प्रयोगशायर",
"C_en": "GDP is the value of all goods and services produced in an economy.",
"C_hi": "एग्ड को GDP को एक शास्त्रीय अर्थ में निर्माण",
"D_en": "GDP is the total value of all goods and services produced in a region.",
"D_hi": "एग्ड को GDP को एक क्षेत्रीय अर्थ में निर्माण",
"E_en": "GDP is the sum of all value added by various sectors in an economy.",
"E_hi": "एग्ड को GDP को विभिज्ञानी स्थान में निर्माण",
"F_en": "GDP is calculated as the sum of all private consumption, government consumption, investment, and net exports.",
"F_hi": "एग्ड को GDP को विभिज्ञानी स्थान में निर्माण",
"G_en": "GDP is calculated based on three main categories: consumption, investment, and net exports.",
"G_hi": "एग्ड को GDP को तीनों प्रमोट में निर्माण",
"H_en": "GDP is calculated as the sum of personal consumption, government consumption, investment, and net exports.",
"H_hi": "एग्ड को GDP को कार्तरीन मुद्रा को निर्माण",
"I_en": "GDP is the value of all goods and services produced within a country.",
"I_hi": "एग्ड को GDP को एक देश में निर्माण",
"J_en": "GDP is the total value of goods and services produced in a country.",
"J_hi": "एग्ड को GDP को एक देश में निर्माण",
"K_en": "GDP can be used as a measure of a country's economic performance.",
"K_hi": "एग्ड को GDP को एक देश के कैलेक्टोरियाँ को निर्माण",
"L_en": "GDP of a country is determined by multiplying 3 components: consumption, investment, and net exports.",
"L_hi": "एग्ड को एक देश के कैलेक्टोरियाँ को निर्माण",
"M_en": "GDP of a region is the sum of industries, agriculture, and services.",
"M_hi": "एग्ड को GDP को एक सिगंड कैलेक्टोरियाँ को GDP को निर्माण",
"N_en": "GDP reflects the overall economic growth of a country.",
"N_hi": "एग्ड को GDP को GDP को निर्माण",
"O_en": "GDP is calculated based on the value added by businesses in a country.",
"O_hi": "एग्ड को GDP को GDP को निर्माण",
"P_en": "GDP measures the total value of goods and services produced in a country.",
"P_hi": "एग्ड को GDP को GDP को निर्माण",
"Q_en": "GDP shows the economic growth of a country over time.",
"Q_hi": "एग्ड को GDP को GDP को निर्माण",
]

]