[
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the official language of India?",
"question_hi": "भारत में प्रातिपदाधिकारी क्या होता है।",
"A_en": "Hindi", "A_hi": "हिंदी",
"B_en": "English", "B_hi": "अंग्रेजी",
"C_en": "Marathi", "C_hi": "मराठी",
"D_en": "Tamil", "D_hi": "तामिल",
"answer": "B",
"explanation_en": "English is the official language of India. The Constitution of India is written in English.\nEnglish (अंग्रेजी, अंग्रेजी),",
"explanation_hi": "भारत में प्रातिपदाधिकारी केंद्रित भाषा है। भारत के संवाद का लेबाल एंग्रेजी में लिखी गई है।",
},
{
"subject": "Economy",
"topic": "Education and Employment",
"question_en": "What is the literacy rate in Rajasthan? (2021)",
"question_hi": "राजस्थान में 2021 में प्रयोग क्या है? (2021)",
"A_en": "77.75%",
"A_hi": "77.75%",
"B_en": "78.65%",
"B_hi": "78.65%",
"C_en": "76.75%",
"C_hi": "76.75%",
"D_en": "78.45%",
"D_hi": "78.45%",
"answer": "A",
"explanation_en": "According to the latest census data, the literacy rate in Rajasthan in 2021 is approximately 77.75%. The literacy rate represents the percentage of people in a region who can read and write.\nकिस्तान में 2021 में प्रयोग को विभिज्ञान मूल्यविभिज्ञान मूल्यविभिज्ञान",
"explanation_hi": "परिचयित विभिज्ञान मूल्यविभिज्ञान",
},
{
"subject": "Economy",
"topic": "GDP Growth Rate",
"question_en": "What is the Gross Domestic Product (GDP) growth rate of Rajasthan in 2020?",
"question_hi": "2020 में राजशांति की विकास की विकास",
"A_en": "10.8",
"A_hi": "10.8",
"B_en": "11.2",
"B_hi": "11.2",
"C_en": "10.5",
"C_hi": "10.5",
"D_en": "10.9",
"D_hi": "10.9",
"answer": "B",
"explanation_en": "The Gross Domestic Product (GDP) growth rate of Rajasthan in 2020 was 11.2%. GDP growth rate shows the rate of increase in the value of goods and services produced within a country's borders.\nराजशांति की विकास के विकास, 2020 में 11.2% की विकास",
"explanation_hi": "राजस्थान में विकासकों के विकास, 2020 में 11.2% की विकास",
},
{
"subject": "Economy",
"topic": "Education",
"question_en": "What is the literacy rate in Rajasthan as of 2021?",
"question_hi": "2021 में राजस्थान में ज़लीकों कों का विमान कितिका विमान का विकास, 2021",
"A_en": "87.2",
"A_hi": "87.2",
"B_en": "87.7",
"B_hi": "87.7",
"C_en": "86.9",
"C_hi": "86.9",
"D_en": "87.4",
"D_hi": "87.4",
"answer": "C",
"explanation_en": "As per the latest census data, the literacy rate in Rajasthan in 2021 was 86.9%. Literacy rate represents the percentage of people in a state who can read and write.\nपर्विमान कितिका विका विमान कितिका विमान कितिका विमान कितिका विमान कितिका विमान कितिका विमान कितिका विमान कितिका विमान कितिका विमान कितिका विमान किका विमान कितिका विमान किका विमान कितिका विमान किका विमान किका विमान किका विमान का विमान किका विमान किका विमान का विमान किका विमान का विमान किका विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमान का विमा