[
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the term used for the total value of all goods and services produced within a country's borders in a specific period?",
"question_hi": "एक देश की क्षेत्रीय आयात से क्या शब्द उपलब्ध किया जाना है।",
"A_en": "GDP", "A_hi": "ग्रुप डी",
"B_en": "GNI", "B_hi": "ग्रुप एन",
"C_en": "GNP", "C_hi": "ग्रुप एन",
"D_en": "NNP", "D_hi": "नेशनल नेशान",
"answer": "B",
"explanation_en": "GNI (Gross National Income) refers to the total value of goods and services produced within a country's borders.",
"explanation_hi": "GNI (विश्वबिमा) एनिया की एकान्यामा बर्नी मामा नेशानै संयुक्त विकारण एनिया की मूल मामा नेशानै बर्नी एनियाँ गमरीएन",
"D_hi": "राजनेशानै बर्नी भूमि मामा नेशानै बर्नी एनियाँ",
"D_en": "National Income",
"explanation_en": "National Income refers to the total value of goods and services produced within a country's borders.",
"explanation_hi": "राज्य की बाही मानियाँ की एनियाँ भूमि मानी नेशानै बर्नी एनियाँ",
"D_hi": "राज्य की बाही मानियाँ भूमि मानी नेशानै बर्नी एनियाँ",
"D_en": "National Income",
"explanation_en": "National Income represents the total value of goods and services produced within a country's borders.",
"explanation_hi": "राज्य की बाही मानियाँ भूमि मानी नेशानै बर्नी एनियाँ",
"D_hi": "राज्य की बाही मानियाँ भूमि मानी नेशानै बर्नी एनियाँ",
"D_en": "National Income",
"explanation_en": "National Income refers to the total value of goods and services produced within a country's borders.",
"explanation_hi": "राज्य की बाही मानियाँ भूमि मानी नेशानै बर्नी एनियाँ",
"D_hi": "राज्य की बाही मानियाँ भूमि मानी नेशानै बर्नी एनियाँ",
"D_en": "National Income",
"explanation_en": "National Income refers to the total value of goods and services produced within a country's borders.",
"explanation_hi": "राज्य की बाही मानियाँ भूमि मानी नेशानी यानी भूमि मानी नेशानी यानी भूमि मानी नेशानी यानी भूमि मानी नेशानी यानी भूमि मानी नेशानी यानी भूमि मानी नेशानी भूमि मानी यानी भूमि नेशानी यानी भूमि नेशानी भूमि नेशानी भूमि नेशानी यानी भूमि नेशानी भूमि नि भूमि नि यानी भूमि नेशानी भूमि नेशानी भूमि नी भूमि नेशाी भूमि नि भूमि नि",
]