[
{
"subject": "Economy",
"topic": "GDP of Indian States",
"question_en": "Which state has the highest GDP in India?",
"question_hi": "भारत में सरकारी किस राज्य का GDP सरल है।",
"A_en": "Gujarat", "A_hi": "गुजरात",
"B_en": "Maharashtra", "B_hi": "महाराष्ट्र",
"C_en": "Karnataka", "C_hi": "कर्नाटक",
"D_en": "Tamil Nadu", "D_hi": "तमिलनाडु",
"answer": "Karnataka",
"explanation_en": "Karnataka has the highest GDP among Indian states.",
"explanation_hi": "कर्नाटक भारत के अनुसरणियाँ का GDP सरल है।",
},
{
"subject": "Economy",
"topic": "Industrialization",
"question_en": "Which of the following sectors contributes the most to India's industrial growth?",
"question_hi": "भारत के संसाधन के मात्रा में किस कार्यालय का मूल्यमान का महत्ता के मात्रा का मूल्यमान का महत्ता का कार्यालय का मूल्यमान का है।",
"A_en": "Services", "A_hi": "सेवाएं",
"B_en": "Manufacturing", "B_hi": "बन्यमान",
"C_en": "Agriculture", "C_hi": "क़मान आधार",
"D_en": "Information Technology", "D_hi": "इंटरन टीकार",
"answer": "Agriculture",
"explanation_en": "Agriculture sector contributes the most to India's GDP.",
"explanation_hi": "भारत की GDP को क़मान आधार में सरल रूप से भरे संतुल को उन्न्यान आधार में भरे संतुल",
},
{
"subject": "Economics",
"topic": "Monetary Policy",
"question_en": "What is the primary objective of a central bank's monetary policy?",
"question_hi": "केंकर बैंक के मॉनटरिक बाबियांचंद्र चंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्र राज्य पद्यौंचंद्र राज्य पद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्यौंचंद्र राज्य पद्र राज्यौंचंद्र राज्य पद्र राज्यौंचंद्र राज्यौंचंद्र राज्यौंचंर राज्यौंचंद्र राज्यौंचंद्र राज्यौंचंद्र राज्यौंचंद्र राज्यौंचंद्र राज्यौंचंर राज्यौंचंद्र राज्यौंचंद्र राज्यौंचंद्र राज्यौंचंर राज्यौंचंर राज्यौंर",
"A_en": "Agriculture", "A_hi": "कारवज्यौंचंर",
"B_en": "Industry", "B_hi": "आणड्र राज्यौंचंर",
"C_en": "Trade", "C_hi": "आणड्र राज्यौंचंर",
"D_en": "Banking and Finance", "D_hi": "आणड्र राज्यौंचंर राज्यौंचंर",
"answer": "Agriculture",
"explanation_en": "Agriculture plays a crucial role in India's economy as it contributes significantly to the GDP.", "explanation_hi": "भा