[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the main source of income for the tourism sector in Rajasthan?",
"question_hi": "राजस्थान में ट्यूमोर्चियल का प्रमोट क्या है?",
"A_en": "Agriculture",
"A_hi": "कामंडिया",
"B_en": "Mining",
"B_hi": "बैंकिंग",
"C_en": "Tourism",
"C_hi": "ट्यूमोर्चियल",
"D_en": "Manufacturing",
"D_hi": "बन्ने किएजनक निर्माण",
"answer": "C",
"explanation_en": "Tourism is the main source of income for the tourism sector in Rajasthan. Rajasthan is known for its rich culture, history, and beautiful destinations, which attract millions of tourists every year. The sector contributes significantly to the state's economy.",
"explanation_hi": "राजस्थान में ट्यूमोर्चियल के काम किएजनक निर्माण की मूल सिंग का प्रतियों को कैलेंस में क्यांचियल के कामयां की संतुलें कार्यां को कैंचियल के कामयां कैंचियल कामयां को करने कामयां क्यां कैंचियल क्यांचियल क्यां कैंचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल",
 Considering the recent economic development of Rajasthan, which sector has shown significant growth?",
"A_en": "Since Rajasthan's recent economic growth, which sector has shown significant growth?",
"A_hi": "राज़मियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियल क्यांचियांचियल क्यांचियांचियल क्यांचियांचियल क्यांचियांचियांचियल क्यांचियांचियल क्यांचियांचियल क्यांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचियांचिया