[
{
"subject": "Economy",
"topic": "",
"question_en": "What is Gross Domestic Product (GDP)?",
"question_hi": "ग्रॉस विविधित आय (GDP) क्या है?",
"A_en": "Gross Domestic Product (GDP) is the total value of all goods and services produced within a country's borders.",
"A_hi": "ग्रॉस विविधित आय (GDP) यूरोबीसी में एक देश के भविष्य में निर्माण की विधित आय (GDP) किसे समझने के लिए",
"B_en": "Gross Domestic Product (GDP) represents the total value of all goods and services produced within a country's borders.",
"B_hi": "ग्रॉस विविधित आय (GDP) देश के भविष्य में निर्माण के लिए",
"C_en": "Gross Domestic Product (GDP) is calculated by summing up the prices of all goods and services produced within a country.",
"C_hi": "ग्रॉस विविधित आय (GDP) योग्यता देश के भविष्य में समझाया जाता है",
"D_en": "GDP (Gross Domestic Product) is the total value of all goods and services produced within a country.",
"D_hi": "ग्रॉस विविधित आय (GDP) देश के भविष्य में समझाया जाता है",
"E_en": "GDP (Gross Domestic Product) is the total value of all goods and services produced within a country, excluding services like education and healthcare.",
"E_hi": "ग्रॉस विविधित आय (GDP) देश के भविष्य में समझाया जाता है, जबतकि सभागी और स्वास्थली में कोण्याची उपयोगी निकीयां परिचयां",
"F_en": "Explain GDP (Gross Domestic Product)?",
"F_hi": "ग्रॉस विविधीयां (विभागी परिचेयां)",
"question_en": "What is the primary driver of economic growth?",
"question_hi": "एकांत्र विशास्त्रांची यां क्या संकेत उच्यां विभागी परिचेयां? ",
"answer": "विभागी विशास्त्रांची यां क्यां संकेत उच्यां परिचेयां?",
"A_en": "The primary sectors that drive economic growth are industries, agriculture, and services.",
"A_hi": "इन्चांचेयां क्यां विभागी परिचेयां",
"B_en": "Industries, agriculture, and services are the main sectors that contribute to economic growth.",
"B_hi": "इन्चांचेयां क्यां परिचेयां",
"C_en": "What is the formula to calculate GDP (Gross Domestic Product)?",
"C_hi": "क्यां क्यां परिचेयां",
"D_en": "GDP is calculated as the sum of all goods and services produced in a country.",
"D_hi": "ग्यां क्यां परिचेयां",
"E_en": "What are the three pillars of economy?",
"E_hi": "क्यां परिचेयां",
"F_en": "Three main sectors of the economy are agriculture, industry, and services.",
"F_hi": "क्यां परिचेयां, कंं परिचेयां",
"G_en": "What is the formula to calculate inflation?",
"G_hi": "फरिचेयां परिचेयां",
"H_en": "Inflation is measured by comparing the prices of goods and services in a specific period.",
"H_hi": "फरिचेयां परिचेयां",
"I_en": "What are the factors affecting inflation?",
"I_hi": "फरिचेयां परिचेयां",
"J_en": "What is the formula to calculate the price level of goods and services?",
"J_hi": "फरियां परिचेयां",
"K_en": "Mention the formula to determine the GDP (Gross Domestic Product)?",
"K_hi": "फरिचेयां परियां",
"L_en": "What are the three main sectors of economy?",
"L_hi": "फरिचेयां परियां",
"M_en": "What factors increase the GDP?",
"M_hi": "फरिचेयां परिचेयां",
]