[
{
"subject": "Economy",
"topic": "GDP and Economic Growth",
"question_en": "What is the primary indicator of a country's economic growth?",
"question_hi": "एक देश की आर्थिक वृद्धि का मुख्य संकेतक क्या है?",
"A_en": "Unemployment Rate", "A_hi": "बेरोजगारी दर",
"B_en": "GDP Growth Rate", "B_hi": "जीडीपी वृद्धि दर",
"C_en": "Inflation Rate", "C_hi": "वक्रता दर",
"D_en": "Poverty Rate", "D_hi": "गरीबी दर",
"answer": "B",
"explanation_en": "GDP Growth Rate is the primary indicator of a country's economic growth, as it measures the change in the value of goods and services produced within a country over a specific period.",
"explanation_hi": "जीडीपी वृद्धि दर एक देश की आर्थिक वृद्धि का मुख्य संकेतक है, क्योंकि यह एक विशिष्ट अवधि के भीतर देश में उत्पादित वस्तुओं और सेवाओं के मूल्य में परिवर्तन को मापता है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the primary objective of monetary policy?",
"question_hi": "मौद्रिक नीति का मुख्य उद्देश्य क्या है?",
"A_en": "Price Stability", "A_hi": "मूल्य स्थिरता",
"B_en": "Full Employment", "B_hi": "पूर्ण रोजगार",
"C_en": "Economic Growth", "C_hi": "आर्थिक वृद्धि",
"D_en": "Fiscal Discipline", "D_hi": "राजकोषीय अनुशासन",
"answer": "A",
"explanation_en": "The primary objective of monetary policy is to maintain price stability, which means keeping inflation low and stable.",
"explanation_hi": "मौद्रिक नीति का मुख्य उद्देश्य मूल्य स्थिरता बनाए रखना है, जिसका अर्थ है कि उच्च और स्थिर स्तर पर मुद्रास्फीति को बनाए रखना।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the primary tool of fiscal policy?",
"question_hi": "राजकोषीय नीति का मुख्य औजार क्या है?",
"A_en": "Government Spending", "A_hi": "सरकारी व्यय",
"B_en": "Taxation", "B_hi": "कर",
"C_en": "Monetary Policy", "C_hi": "मौद्रिक नीति",
"D_en": "Trade Policy", "D_hi": "व्यापार नीति",
"answer": "A",
"explanation_en": "Government spending is the primary tool of fiscal policy, as it allows the government to stimulate economic activity by increasing aggregate demand.",
"explanation_hi": "सरकारी व्यय राजकोषीय नीति का मुख्य औजार है, क्योंकि यह सरकार को आर्थिक गतिविधि को बढ़ावा देने के लिए एकत्रित मांग को बढ़ाने की अनुमति देता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the main advantage of international trade?",
"question_hi": "अंतर्राष्ट्रीय व्यापार का मुख्य लाभ क्या है?",
"A_en": "Increased Competition", "A_hi": "बढ़ी हुई प्रतिस्पर्धा",
"B_en": "Increased Efficiency", "B_hi": "बढ़ी हुई कार्यक्षमता",
"C_en": "Increased Employment", "C_hi": "बढ़ी हुई रोजगार",
"D_en": "Increased Government Revenue", "D_hi": "बढ़ी हुई सरकारी आय",
"answer": "B",
"explanation_en": "The main advantage of international trade is increased efficiency, as it allows countries to specialize in the production of goods and services in which they have a comparative advantage.",
"explanation_hi": "अंतर्राष्ट्रीय व्यापार का मुख्य लाभ बढ़ी हुई कार्यक्षमता है, क्योंकि यह देशों को उन वस्तुओं और सेवाओं की उत्पादन में विशेषज्ञता हासिल करने की अनुमति देता है जिनमें उन्हें तुलनात्मक लाभ होता है।"
},
{
"subject": "Economy",
"topic": "GDP and Economic Growth",
"question_en": "What is the formula for calculating GDP?",
"question_hi": "जीडीपी की गणना करने के लिए समीकरण क्या है?",
"A_en": "C + I + G + (X - M)", "A_hi": "सी + आयी + जी + (X - एम)",
"B_en": "C + I + G + (M - X)", "B_hi": "सी + आयी + जी + (एम - X)",
"C_en": "C + I + (X - M) + G", "C_hi": "सी + आयी + (X - एम) + जी",
"D_en": "C + (X - M) + I + G", "D_hi": "सी + (X - एम) + आयी + जी",
"answer": "A",
"explanation_en": "The formula for calculating GDP is C + I + G + (X - M), where C is consumption, I is investment, G is government spending, X is exports, and M is imports.",
"explanation_hi": "जीडीपी की गणना करने के लिए समीकरण सी + आयी + जी + (X - एम) है, जहां सी उपभोग, आयी निवेश, जी सरकारी व्यय, X निर्यात, और एम आयात है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the primary tool of monetary policy?",
"question_hi": "मौद्रिक नीति का मुख्य औजार क्या है?",
"A_en": "Central Bank Lending Rate", "A_hi": "केंद्रीय बैंक ऋण दर",
"B_en": "Open Market Operations", "B_hi": "खुले बाजार कार्रवाई",
"C_en": "Reserve Requirements", "C_hi": "भंडार आवश्यकताएं",
"D_en": "Inflation Targeting", "D_hi": "मुद्रास्फीति लक्ष्य",
"answer": "B",
"explanation_en": "The primary tool of monetary policy is open market operations, which involves the central bank buying or selling government securities on the open market to influence the money supply.",
"explanation_hi": "मौद्रिक नीति का मुख्य औजार खुले बाजार कार्रवाई है, जिसमें केंद्रीय बैंक सरकारी सुरक्षाओं को खुले बाजार में खरीदने या बेचने के माध्यम से पैसे आपूर्ति को प्रभावित करता है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the primary objective of fiscal policy?",
"question_hi": "राजकोषीय नीति का मुख्य उद्देश्य क्या है?",
"A_en": "Price Stability", "A_hi": "मूल्य स्थिरता",
"B_en": "Full Employment", "B_hi": "पूर्ण रोजगार",
"C_en": "Economic Growth", "C_hi": "आर्थिक वृद्धि",
"D_en": "Fiscal Discipline", "D_hi": "राजकोषीय अनुशासन",
"answer": "C",
"explanation_en": "The primary objective of fiscal policy is to promote economic growth, which is achieved through government spending and taxation policies.",
"explanation_hi": "राजकोषीय नीति का मुख्य उद्देश्य आर्थिक वृद्धि को बढ़ावा देना है, जो सरकारी व्यय और कर नीतियों के माध्यम से प्राप्त किया जाता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the term for the exchange of goods and services between countries?",
"question_hi": "देशों के बीच वस्तुओं और सेवाओं के आदान-प्रदान के लिए क्या शब्द है?",
"A_en": "Import", "A_hi": "आयात",
"B_en": "Export", "B_hi": "निर्यात",
"C_en": "Trade", "C_hi": "व्यापार",
"D_en": "Investment", "D_hi": "निवेश",
"answer": "C",
"explanation_en": "The term for the exchange of goods and services between countries is trade, which includes both imports and exports.",
"explanation_hi": "देशों के बीच वस्तुओं और सेवाओं के आदान-प्रदान के लिए व्यापार शब्द है, जिसमें आयात और निर्यात दोनों शामिल हैं।"
},
{
"subject": "Economy",
"topic": "GDP and Economic Growth",
"question_en": "What is the formula for calculating GDP at factor cost?",
"question_hi": "फैक्टर कॉस्ट पर जीडीपी की गणना करने के लिए समीकरण क्या है?",
"A_en": "C + I + G + (X - M)", "A_hi": "सी + आयी + जी + (X - एम)",
"B_en": "C + I + (X - M) + G", "B_hi": "सी + आयी + (X - एम) + जी",
"C_en": "C + I + G + W", "C_hi": "सी + आयी + जी + वी",
"D_en": "C + (X - M) + I + G", "D_hi": "सी + (X - एम) + आयी + जी",
"answer": "C",
"explanation_en": "The formula for calculating GDP at factor cost is C + I + G + W, where C is consumption, I is investment, G is government spending, and W is indirect taxes minus subsidies.",
"explanation_hi": "फैक्टर कॉस्ट पर जीडीपी की गणना करने के लिए समीकरण सी + आयी + जी + वी है, जहां सी उपभोग, आयी निवेश, जी सरकारी व्यय, और वी अप्रत्यक्ष करों से सब्सिडी घटाने है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the term for the policy of keeping inflation low and stable?",
"question_hi": "मुद्रास्फीति को कम और स्थिर रखने के लिए क्या नीति है?",
"A_en": "Monetary Targeting", "A_hi": "मौद्रिक लक्ष्य",
"B_en": "Inflation Targeting", "B_hi": "मुद्रास्फीति लक्ष्य",
"C_en": "Price Stability", "C_hi": "मूल्य स्थिरता",
"D_en": "Fiscal Discipline", "D_hi": "राजकोषीय अनुशासन",
"answer": "B",
"explanation_en": "The term for the policy of keeping inflation low and stable is inflation targeting, which involves setting an inflation target and using monetary policy tools to achieve it.",
"explanation_hi": "मुद्रास्फीति को कम और स्थिर रखने के लिए मुद्रास्फीति लक्ष्य नीति है, जिसमें मुद्रास्फीति लक्ष्य निर्धारित किया जाता है और मौद्रिक नीति के औजारों का उपयोग करके उसे प्राप्त किया जाता है।"
}