[
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the primary function of the Central Bank in a country?",
"question_hi": "किसी देश में केंद्रीय बैंक का मुख्य कार्य क्या है?",
"A_en": "To control inflation", "A_hi": "विस्तार को नियंत्रित करना",
"B_en": "To regulate money supply", "B_hi": "नकदी आपूर्ति को नियमित करना",
"C_en": "To provide loans to citizens", "C_hi": "नागरिकों को ऋण प्रदान करना",
"D_en": "To collect taxes", "D_hi": "कारों को संग्रह करना",
"answer": "B",
"explanation_en": "The Central Bank plays a crucial role in regulating the money supply in a country, which helps in maintaining economic stability.",
"explanation_hi": "केंद्रीय बैंक देश में नकदी आपूर्ति को नियमित करने में एक महत्वपूर्ण भूमिका निभाता है, जिससे आर्थिक स्थिरता बनाए रखने में मदद मिलती है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the law of diminishing marginal utility?",
"question_hi": "कम करने की वैकल्पिक उपयोगिता का क़ानून क्या है?",
"A_en": "The law states that as the quantity of a good increases, its marginal utility decreases", "A_hi": "यह क़ानून कहता है कि एक वस्तु की मात्रा बढ़ने पर उसकी वैकल्पिक उपयोगिता कम हो जाती है",
"B_en": "The law states that as the quantity of a good increases, its marginal utility remains constant", "B_hi": "यह क़ानून कहता है कि एक वस्तु की मात्रा बढ़ने पर उसकी वैकल्पिक उपयोगिता स्थिर रहती है",
"C_en": "The law states that as the quantity of a good increases, its marginal utility increases", "C_hi": "यह क़ानून कहता है कि एक वस्तु की मात्रा बढ़ने पर उसकी वैकल्पिक उपयोगिता बढ़ती है",
"D_en": "The law states that as the quantity of a good decreases, its marginal utility increases", "D_hi": "यह क़ानून कहता है कि एक वस्तु की मात्रा कम होने पर उसकी वैकल्पिक उपयोगिता बढ़ती है",
"answer": "A",
"explanation_en": "The law of diminishing marginal utility states that as the quantity of a good increases, its marginal utility decreases, leading to a decrease in consumer satisfaction.",
"explanation_hi": "कम करने की वैकल्पिक उपयोगिता का क़ानून कहता है कि एक वस्तु की मात्रा बढ़ने पर उसकी वैकल्पिक उपयोगिता कम हो जाती है, जिससे उपभोक्ता तृप्ति में कमी आती है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the primary advantage of free trade?",
"question_hi": "स्वतंत्र व्यापार का मुख्य लाभ क्या है?",
"A_en": "Increased government revenue", "A_hi": "सरकार की आय में वृद्धि",
"B_en": "Reduced trade barriers", "B_hi": "व्यापार बाधाओं में कमी",
"C_en": "Increased employment opportunities", "C_hi": "रोजगार के अवसरों में वृद्धि",
"D_en": "Increased protectionism", "D_hi": "संरक्षणवाद में वृद्धि",
"answer": "B",
"explanation_en": "Free trade allows countries to trade goods and services with each other without any restrictions or barriers, leading to increased economic efficiency and growth.",
"explanation_hi": "स्वतंत्र व्यापार देशों को एक दूसरे के साथ वस्तुओं और सेवाओं का व्यापार करने की अनुमति देता है बिना किसी प्रतिबंध या बाधाओं के, जिससे आर्थिक कार्यशीलता और विकास में वृद्धि होती है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the primary tool of monetary policy?",
"question_hi": "आर्थिक नीति का मुख्य उपकरण क्या है?",
"A_en": "Fiscal policy", "A_hi": "वित्तीय नीति",
"B_en": "Monetary policy", "B_hi": "नकदी नीति",
"C_en": "Supply-side policy", "C_hi": "आपूर्ति-पक्ष की नीति",
"D_en": "Demand-side policy", "D_hi": "आपत्ति-पक्ष की नीति",
"answer": "B",
"explanation_en": "Monetary policy is the primary tool of central banks to control inflation, interest rates, and money supply in a country.",
"explanation_hi": "नकदी नीति केंद्रीय बैंकों का मुख्य उपकरण है जो विस्तार, सांद्रता दर, और देश में नकदी आपूर्ति नियंत्रित करने के लिए उपयोग किया जाता है।"
},
{
"subject": "Economy",
"topic": "GDP and Inflation",
"question_en": "What is the difference between nominal GDP and real GDP?",
"question_hi": "नाममात्र जीडीपी और वास्तविक जीडीपी के बीच अंतर क्या है?",
"A_en": "Nominal GDP is adjusted for inflation, while real GDP is not", "A_hi": "नाममात्र जीडीपी में विस्तार से समायोजित किया जाता है, जबकि वास्तविक जीडीपी में नहीं",
"B_en": "Real GDP is adjusted for inflation, while nominal GDP is not", "B_hi": "वास्तविक जीडीपी में विस्तार से समायोजित किया जाता है, जबकि नाममात्र जीडीपी में नहीं",
"C_en": "Both nominal and real GDP are adjusted for inflation", "C_hi": "दोनों नाममात्र और वास्तविक जीडीपी में विस्तार से समायोजित किया जाता है",
"D_en": "Neither nominal nor real GDP is adjusted for inflation", "D_hi": "नाममात्र और वास्तविक जीडीपी दोनों में विस्तार से समायोजित नहीं किया जाता",
"answer": "B",
"explanation_en": "Real GDP is adjusted for inflation to get the true picture of economic growth, while nominal GDP is not adjusted for inflation.",
"explanation_hi": "वास्तविक जीडीपी में विस्तार से समायोजित किया जाता है ताकि अर्थव्यवस्था की वास्तविक वृद्धि का सही चित्र मिल सके, जबकि नाममात्र जीडीपी में विस्तार से समायोजित नहीं किया जाता है।"
},
{
"subject": "Economy",
"topic": "Unemployment",
"question_en": "What is the difference between frictional unemployment and structural unemployment?",
"question_hi": "सक्रिय बेरोजगारी और संरचनात्मक बेरोजगारी के बीच अंतर क्या है?",
"A_en": "Frictional unemployment is temporary and due to job search, while structural unemployment is permanent and due to lack of skills", "A_hi": "सक्रिय बेरोजगारी अस्थायी और नौकरी की तलाश के कारण होती है, जबकि संरचनात्मक बेरोजगारी स्थायी और कौशल की कमी के कारण होती है",
"B_en": "Structural unemployment is temporary and due to job search, while frictional unemployment is permanent and due to lack of skills", "B_hi": "संरचनात्मक बेरोजगारी अस्थायी और नौकरी की तलाश के कारण होती है, जबकि सक्रिय बेरोजगारी स्थायी और कौशल की कमी के कारण होती है",
"C_en": "Both frictional and structural unemployment are temporary and due to job search", "C_hi": "दोनों सक्रिय और संरचनात्मक बेरोजगारी अस्थायी और नौकरी की तलाश के कारण होती है",
"D_en": "Neither frictional nor structural unemployment is temporary or permanent", "D_hi": "सक्रिय और संरचनात्मक बेरोजगारी दोनों अस्थायी या स्थायी नहीं होती",
"answer": "A",
"explanation_en": "Frictional unemployment is temporary and due to job search, while structural unemployment is permanent and due to lack of skills.",
"explanation_hi": "सक्रिय बेरोजगारी अस्थायी और नौकरी की तलाश के कारण होती है, जबकि संरचनात्मक बेरोजगारी स्थायी और कौशल की कमी के कारण होती है।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "What is the difference between direct and indirect taxes?",
"question_hi": "सीधे और अप्रत्यक्ष करों के बीच अंतर क्या है?",
"A_en": "Direct taxes are paid directly by the taxpayer, while indirect taxes are paid by the consumer", "A_hi": "सीधे कर सीधे करदाता द्वारा चुकाए जाते हैं, जबकि अप्रत्यक्ष कर उपभोक्ता द्वारा चुकाए जाते हैं",
"B_en": "Indirect taxes are paid directly by the taxpayer, while direct taxes are paid by the consumer", "B_hi": "अप्रत्यक्ष कर सीधे करदाता द्वारा चुकाए जाते हैं, जबकि सीधे कर उपभोक्ता द्वारा चुकाए जाते हैं",
"C_en": "Both direct and indirect taxes are paid directly by the taxpayer", "C_hi": "दोनों सीधे और अप्रत्यक्ष कर सीधे करदाता द्वारा चुकाए जाते हैं",
"D_en": "Neither direct nor indirect taxes are paid directly by the taxpayer", "D_hi": "सीधे और अप्रत्यक्ष कर दोनों सीधे करदाता द्वारा नहीं चुकाए जाते",
"answer": "A",
"explanation_en": "Direct taxes are paid directly by the taxpayer, while indirect taxes are paid by the consumer.",
"explanation_hi": "सीधे कर सीधे करदाता द्वारा चुकाए जाते हैं, जबकि अप्रत्यक्ष कर उपभोक्ता द्वारा चुकाए जाते हैं।"
},
{
"subject": "Economy",
"topic": "Economic Indicators",
"question_en": "What is the primary purpose of the GDP deflator?",
"question_hi": "जीडीपी का मुद्रास्फीति सूचक का मुख्य उद्देश्य क्या है?",
"A_en": "To measure the rate of inflation", "A_hi": "विस्तार दर को मापने के लिए",
"B_en": "To measure the rate of economic growth", "B_hi": "आर्थिक विकास दर को मापने के लिए",
"C_en": "To measure the rate of unemployment", "C_hi": "बेरोजगारी दर को मापने के लिए",
"D_en": "To measure the rate of GDP growth", "D_hi": "जीडीपी विकास दर को मापने के लिए",
"answer": "A",
"explanation_en": "The GDP deflator is a measure of inflation that reflects the change in prices of goods and services over time.",
"explanation_hi": "जीडीपी का मुद्रास्फीति सूचक विस्तार का सूचक है जो समय के साथ वस्तुओं और सेवाओं की कीमतों में परिवर्तन को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Development Economics",
"question_en": "What is the concept of 'trickle-down economics'?",
"question_hi": "'ट्रिकल-डाउन अर्थशास्त्र' का अवधारणा क्या है?",
"A_en": "The idea that economic growth will automatically benefit the poor", "A_hi": "विचार कि आर्थिक विकास स्वचालित रूप से गरीबों का लाभ पहुंचाएगा",
"B_en": "The idea that economic growth will automatically benefit the rich", "B_hi": "विचार कि आर्थिक विकास स्वचालित रूप से अमीरों का लाभ पहुंचाएगा",
"C_en": "The idea that economic growth will benefit all sectors of society", "C_hi": "विचार कि आर्थिक विकास समाज के सभी क्षेत्रों का लाभ पहुंचाएगा",
"D_en": "The idea that economic growth will only benefit the government", "D_hi": "विचार कि आर्थिक विकास केवल सरकार का लाभ पहुंचाएगा",
"answer": "A",
"explanation_en": "Trickle-down economics is the idea that economic growth will automatically benefit the poor, as the wealthy invest their money and create jobs.",
"explanation_hi": "ट्रिकल-डाउन अर्थशास्त्र का विचार है कि आर्थिक विकास स्वचालित रूप से गरीबों का लाभ पहुंचाएगा, क्योंकि अमीर अपने पैसे निवेश करते हैं और नौकरियां बनाते हैं।"
}