[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the annual growth rate of India's GDP in 2021?",
"question_hi": "2021 में भारत की गृहीत प्रतिवर्ष भूमिका की गीता क्या है?",
"A_en": "12%",
"A_hi": "12%",
"B_en": "14%",
"B_hi": "14%",
"C_en": "10%",
"C_hi": "10%",
"D_en": "9%",
"D_hi": "9%",
"answer": "D",
"explanation_en": "According to the National Statistical Office of India, the annual growth rate of India's GDP in 2021 was 9%.",
"explanation_hi": "भारत की गृहीत प्रतिवर्षीय गीता क्या है?"
},
{
"subject": "Economy",
"topic": "",
"question_en": "Define inflation.",
"question_hi": "आर्थिक किस अर्थ है?",
"A_en": "Inflation is the rate of increase in prices of goods and services over a period of time.",
"A_hi": "आर्थिक रूप है जो एक समय के अर्थों और सहज से उपयोग क्या है।",
"B_en": "Inflation measures the rate of increase in prices of goods and services over a period of time.",
"B_hi": "आर्थिक अर्थों और सहज से उपयोग की प्रतिशत क्या है?",
"C_en": "Inflation is the rate at which the prices of goods and services increase over time.",
"C_hi": "आर्थिक अर्थों और सहज से उपयोग की प्रतिशत क्या है?",
"D_en": "Inflation is a general increase in the prices of goods and services.",
"D_hi": "आर्थिक अर्थों और सहज से उपयोग की प्रतिशत क्या है?",
"E_en": "Inflation is an increase in the prices of goods and services due to various factors.",
"E_hi": "आर्थिक अर्थों और सहज से उपयोग की प्रतिशत क्या है?",
"F_en": "Inflation is the rise in prices of goods and services over a period of time.",
"F_hi": "आर्थिक अर्थों और सहज से उपयोग की प्रतिशत की परंतु क्या होगी?",
"G_en": "Inflation is the general increase in prices of goods and services.",
"G_hi": "आर्थिक अर्थों और सहज से उपयोग की प्रतिशत की किति क्या होगी?",
"H_en": "Inflation refers to the general rise in prices of goods and services.",
"H_hi": "आर्थिक अर्थों और सहज से उपयोग के निक्षपाठिक अर्थों और सहज से उपयोग की प्रतिशत की किति की निक्षपाठिक अर्थों और सहज से उपयोग की प्रतिशत की किति की निक्षपाठिक अर्थों और सहज से उपयोग की प्रतिशत की निक अर्थों और सहज सिक निक अर्थो ं और सहज सिक निक अर्थों और सहज सिक निक अर सिक ं और सहज सिक अर सिक ं और सहज सिक निक अर सिक ं और सहज सिक अर सिक ं और सहज सिक अर सिक ं और सिक अर सिक अर सिक ं और सिक अर सिक अर सिक ं और सिक अर सिक अर सिक ं और सिक अर सिक अर सिक ं और सिक अर सिक अर सिक ं और सिक अर सिक अर सिक अर सिक ं और सिक अर सिक अर सिक अर सिक ं और सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सिक अर सि