[
{
"subject": "Economy",
"topic": "GDP and Macroeconomics",
"question_en": "GDP (Gross Domestic Product) is calculated at?",
"question_hi": "जीडीपी (ग्रॉस डोमेस्टिक प्रोडक्ट) की गणना किस पर की जाती है?",
"A_en": "Nominal GDP", "A_hi": "नाममात्र जीडीपी",
"B_en": "Real GDP", "B_hi": "वास्तविक जीडीपी",
"C_en": "Both Nominal and Real GDP", "C_hi": "नाममात्र और वास्तविक जीडीपी दोनों",
"D_en": "None of the above", "D_hi": "उपरोक्त कोई भी नहीं",
"answer": "B",
"explanation_en": "Real GDP is the value of goods and services produced within a country after adjusting for inflation.",
"explanation_hi": "वास्तविक जीडीपी एक देश में उत्पादित सामानों और सेवाओं के मूल्य का प्रतिनिधित्व करता है, जिसे मुद्रास्फीति के लिए समायोजित किया जाता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "Which of the following is a benefit of international trade?",
"question_hi": "अंतरराष्ट्रीय व्यापार के निम्नलिखित लाभों में से कौन सा है?",
"A_en": "Increased competition", "A_hi": "बढ़ा हुआ प्रतिस्पर्धा",
"B_en": "Reduced prices", "B_hi": "कम कीमतें",
"C_en": "All of the above", "C_hi": "ऊपरोक्त सभी",
"D_en": "None of the above", "D_hi": "उपरोक्त कोई भी नहीं",
"answer": "C",
"explanation_en": "International trade can lead to increased competition, reduced prices, and improved product quality.",
"explanation_hi": "अंतरराष्ट्रीय व्यापार प्रतिस्पर्धा, कम कीमतें, और उत्पाद की गुणवत्ता में सुधार जैसे लाभ प्रदान कर सकता है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the primary goal of monetary policy?",
"question_hi": "केंद्रीय बैंक के मौद्रिक नीति का मुख्य उद्देश्य क्या है?",
"A_en": "Price stability", "A_hi": "मुद्रास्फीति कontrol",
"B_en": "Full employment", "B_hi": "पूर्ण रोजगार",
"C_en": "Economic growth", "C_hi": "आर्थिक वृद्धि",
"D_en": "All of the above", "D_hi": "ऊपरोक्त सभी",
"answer": "A",
"explanation_en": "The primary goal of monetary policy is to maintain price stability, which is achieved by controlling inflation.",
"explanation_hi": "केंद्रीय बैंक के मौद्रिक नीति का मुख्य उद्देश्य मुद्रास्फीति को नियंत्रित करके मुद्रास्फीति स्थिरता का प्रबंधन करना है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the law of diminishing marginal utility?",
"question_hi": "न्यूनतम शेष उपयोगिता का कानून क्या है?",
"A_en": "As the quantity of a good increases, its marginal utility also increases.", "A_hi": "एक वस्तु की मात्रा बढ़ने पर, इसकी शेष उपयोगिता भी बढ़ती है।",
"B_en": "As the quantity of a good increases, its marginal utility remains constant.", "B_hi": "एक वस्तु की मात्रा बढ़ने पर, इसकी शेष उपयोगिता बनी रहती है।",
"C_en": "As the quantity of a good increases, its marginal utility decreases.", "C_hi": "एक वस्तु की मात्रा बढ़ने पर, इसकी शेष उपयोगिता कम हो जाती है।",
"D_en": "None of the above", "D_hi": "उपरोक्त कोई भी नहीं",
"answer": "C",
"explanation_en": "The law of diminishing marginal utility states that as the quantity of a good increases, its marginal utility decreases.",
"explanation_hi": "न्यूनतम शेष उपयोगिता का कानून कहता है कि एक वस्तु की मात्रा बढ़ने पर, इसकी शेष उपयोगिता कम हो जाती है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the purpose of fiscal policy?",
"question_hi": "निवेश नीति का उद्देश्य क्या है?",
"A_en": "To increase government revenue", "A_hi": "सरकारी राजस्व बढ़ाना",
"B_en": "To reduce government expenditure", "B_hi": "सरकारी व्यय कम करना",
"C_en": "To stabilize the economy", "C_hi": "आर्थिक स्थिरता स्थापित करना",
"D_en": "All of the above", "D_hi": "ऊपरोक्त सभी",
"answer": "C",
"explanation_en": "The primary purpose of fiscal policy is to stabilize the economy, which can be achieved by adjusting government spending and taxation.",
"explanation_hi": "निवेश नीति का मुख्य उद्देश्य आर्थिक स्थिरता स्थापित करना है, जो सरकारी व्यय और करों को समायोजित करके प्राप्त किया जा सकता है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the main cause of inflation?",
"question_hi": "मुद्रास्फीति का मुख्य कारण क्या है?",
"A_en": "Increase in aggregate demand", "A_hi": "सामान्य मांग में वृद्धि",
"B_en": "Decrease in aggregate supply", "B_hi": "सामान्य आपूर्ति में कमी",
"C_en": "Monetary policy", "C_hi": "मौद्रिक नीति",
"D_en": "All of the above", "D_hi": "ऊपरोक्त सभी",
"answer": "A",
"explanation_en": "The main cause of inflation is an increase in aggregate demand, which can lead to a shortage of goods and services.",
"explanation_hi": "मुद्रास्फीति का मुख्य कारण सामान्य मांग में वृद्धि है, जो सामानों और सेवाओं की कमी का कारण बन सकती है।"
},
{
"subject": "Economy",
"topic": "Growth and Development",
"question_en": "What is the difference between growth and development?",
"question_hi": "वृद्धि और विकास के बीच क्या अंतर है?",
"A_en": "Growth is a short-term increase in output, while development is a long-term increase in output.", "A_hi": "वृद्धि एक छोटी अवधि में उत्पादकता में वृद्धि है, जबकि विकास एक लंबी अवधि में उत्पादकता में वृद्धि है।",
"B_en": "Growth is a long-term increase in output, while development is a short-term increase in output.", "B_hi": "वृद्धि एक लंबी अवधि में उत्पादकता में वृद्धि है, जबकि विकास एक छोटी अवधि में उत्पादकता में वृद्धि है।",
"C_en": "Growth is an increase in output, while development is an increase in income.", "C_hi": "वृद्धि उत्पादकता में वृद्धि है, जबकि विकास आय में वृद्धि है।",
"D_en": "None of the above", "D_hi": "उपरोक्त कोई भी नहीं",
"answer": "A",
"explanation_en": "Growth refers to a short-term increase in output, while development refers to a long-term increase in output and income.",
"explanation_hi": "वृद्धि एक छोटी अवधि में उत्पादकता में वृद्धि को संदर्भित करता है, जबकि विकास एक लंबी अवधि में उत्पादकता और आय में वृद्धि को संदर्भित करता है।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "What is the budget of a government?",
"question_hi": "सरकार का बजट क्या है?",
"A_en": "A plan of action for a specific period of time", "A_hi": "एक विशिष्ट अवधि के लिए कार्य योजना।",
"B_en": "A statement of government's revenues and expenditures", "B_hi": "सरकार के राजस्व और व्यय का विवरण।",
"C_en": "A plan of government's economic policy", "C_hi": "सरकार के आर्थिक नीति का विवरण।",
"D_en": "All of the above", "D_hi": "ऊपरोक्त सभी",
"answer": "B",
"explanation_en": "A budget is a statement of government's revenues and expenditures, which outlines the government's financial plans and policies.",
"explanation_hi": "एक बजट सरकार के राजस्व और व्यय का विवरण है, जो सरकार के वित्तीय योजनाओं और नीतियों को प्रस्तुत करता है।"
},
{
"subject": "Economy",
"topic": "Trade Cycle",
"question_en": "What is the trade cycle?",
"question_hi": "व्यापार चक्र क्या है?",
"A_en": "A short-term fluctuation in economic activity", "A_hi": "आर्थिक गतिविधि की छोटी अवधि की उतार-चढ़ाव।",
"B_en": "A long-term fluctuation in economic activity", "B_hi": "आर्थिक गतिविधि की लंबी अवधि की उतार-चढ़ाव।",
"C_en": "A continuous growth in economic activity", "C_hi": "आर्थिक गतिविधि में लगातार वृद्धि।",
"D_en": "All of the above", "D_hi": "ऊपरोक्त सभी",
"answer": "A",
"explanation_en": "A trade cycle refers to a short-term fluctuation in economic activity, which includes periods of expansion and contraction.",
"explanation_hi": "व्यापार चक्र आर्थिक गतिविधि की छोटी अवधि की उतार-चढ़ाव को संदर्भित करता है, जिसमें विस्तार और संकुचन के चरण शामिल हैं।"
}
]