[
{
"subject": "Economy",
"topic": "Globalization",
"question_en": "Globalization is defined as the increased interconnectedness of the world's economies through?",
"question_hi": "वैश्वीकरण को दुनिया की अर्थव्यवस्थाओं के बीच बढ़ती संबंधिता के माध्यम से परिभाषित किया जाता है?",
"A_en": "Trade in goods and services", "A_hi": "सामान और सेवाओं में व्यापार",
"B_en": "Investment and financial flows", "B_hi": "निवेश और वित्तीय प्रवाह",
"C_en": "Movement of people and ideas", "C_hi": "लोगों और विचारों का चलन",
"D_en": "All of the above", "D_hi": "सभी उपरोक्त",
"answer": "D",
"explanation_en": "Globalization is a complex and multifaceted phenomenon that involves the increased interconnectedness of the world's economies through various channels, including trade in goods and services, investment and financial flows, and the movement of people and ideas.",
"explanation_hi": "वैश्वीकरण एक जटिल और बहु-आयामी घटना है जिसमें दुनिया की अर्थव्यवस्थाओं के बीच बढ़ती संबंधिता के लिए विभिन्न माध्यमों का उपयोग किया जाता है, जिनमें सामान और सेवाओं का व्यापार, निवेश और वित्तीय प्रवाह, और लोगों और विचारों का चलन शामिल हैं।"
},
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "Which of the following is a characteristic of a recession?",
"question_hi": "निम्नलिखित में से कौन सा रिकवरी की विशेषता है?",
"A_en": "Increased GDP", "A_hi": "बढ़ा हुआ जीडीपी",
"B_en": "Decreased GDP", "B_hi": "घटा हुआ जीडीपी",
"C_en": "Low unemployment rate", "C_hi": "निम्न बेरोजगारी दर",
"D_en": "High inflation rate", "D_hi": "उच्च आर्थिक वृद्धि दर",
"answer": "B",
"explanation_en": "A recession is a period of economic decline, typically defined as a decline in gross domestic product (GDP) for two or more consecutive quarters.",
"explanation_hi": "एक रिकवरी एक आर्थिक वृद्धि की अवधि है, आमतौर पर दो या अधिक सीधे चौथाइयों के लिए घटता जीडीपी के रूप में परिभाषित किया जाता है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the law of diminishing marginal utility?",
"question_hi": "क्या है मान्यता का कमी का सीमित मार्जिनल उपयोगिता का नियम?",
"A_en": "As the quantity of a good increases, its price decreases", "A_hi": "किसी भी उत्पाद की मात्रा बढ़ती है, तो इसकी कीमत कम होती जाती है",
"B_en": "As the quantity of a good increases, its price increases", "B_hi": "किसी भी उत्पाद की मात्रा बढ़ती है, तो इसकी कीमत बढ़ती जाती है",
"C_en": "As the quantity of a good consumed increases, the marginal utility of each additional unit decreases", "C_hi": "किसी भी उत्पाद के उपभोग की मात्रा बढ़ती है, तो अतिरिक्त इकाई का मार्जिनल उपयोगिता कम होता जाता है",
"D_en": "As the quantity of a good consumed decreases, the marginal utility of each additional unit increases", "D_hi": "किसी भी उत्पाद के उपभोग की मात्रा कम होती है, तो अतिरिक्त इकाई का मार्जिनल उपयोगिता बढ़ता जाता है",
"answer": "C",
"explanation_en": "The law of diminishing marginal utility states that as the quantity of a good consumed increases, the marginal utility of each additional unit decreases.",
"explanation_hi": "मान्यता का कमी का सीमित मार्जिनल उपयोगिता का नियम कहता है कि किसी भी उत्पाद के उपभोग की मात्रा बढ़ती है, तो अतिरिक्त इकाई का मार्जिनल उपयोगिता कम होता जाता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the main purpose of the World Trade Organization (WTO)?",
"question_hi": "विश्व व्यापार संगठन (WTO) का मुख्य उद्देश्य क्या है?",
"A_en": "To promote free trade among its member countries", "A_hi": "अपने सदस्य देशों के बीच मुक्त व्यापार को बढ़ावा देना",
"B_en": "To regulate international trade", "B_hi": "अंतरराष्ट्रीय व्यापार को नियंत्रित करना",
"C_en": "To provide technical assistance to developing countries", "C_hi": "विकासशील देशों को तकनीकी सहायता प्रदान करना",
"D_en": "To protect the intellectual property rights of its member countries", "D_hi": "अपने सदस्य देशों के बौद्धिक संपदा अधिकारों की रक्षा करना",
"answer": "A",
"explanation_en": "The main purpose of the World Trade Organization (WTO) is to promote free trade among its member countries by reducing trade barriers and promoting fair competition.",
"explanation_hi": "विश्व व्यापार संगठन (WTO) का मुख्य उद्देश्य अपने सदस्य देशों के बीच मुक्त व्यापार को बढ़ावा देना है, जिसमें व्यापार बाधाएं कम करना और संतुलित प्रतिस्पर्धा को बढ़ावा देना शामिल है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the primary objective of monetary policy?",
"question_hi": "वित्तीय नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To control inflation", "A_hi": "वास्तविक दर को नियंत्रित करना",
"B_en": "To control unemployment", "B_hi": "बेरोजगारी को नियंत्रित करना",
"C_en": "To promote economic growth", "C_hi": "आर्थिक वृद्धि को बढ़ावा देना",
"D_en": "All of the above", "D_hi": "सभी उपरोक्त",
"answer": "D",
"explanation_en": "The primary objective of monetary policy is to promote economic growth, control inflation, and control unemployment.",
"explanation_hi": "वित्तीय नीति का मुख्य उद्देश्य आर्थिक वृद्धि, वास्तविक दर और बेरोजगारी को नियंत्रित करना है।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "What is the difference between a budget and a financial plan?",
"question_hi": "बजट और वित्तीय योजना के बीच क्या अंतर है?",
"A_en": "A budget is a document that outlines the government's spending and revenue plans, while a financial plan is a comprehensive plan that outlines the government's overall financial strategy", "A_hi": "बजट एक दस्तावेज है जिसमें सरकार की व्यय और राजस्व योजनाएं शामिल होती हैं, जबकि एक वित्तीय योजना सरकार के वित्तीय योजना का एक व्यापक दस्तावेज है",
"B_en": "A budget is a comprehensive plan that outlines the government's overall financial strategy, while a financial plan is a document that outlines the government's spending and revenue plans", "B_hi": "बजट एक व्यापक योजना है जिसमें सरकार के वित्तीय योजना का विवरण होता है, जबकि एक वित्तीय योजना एक दस्तावेज है जिसमें सरकार की व्यय और राजस्व योजनाएं शामिल होती हैं",
"C_en": "A budget is a document that outlines the government's overall financial strategy, while a financial plan is a comprehensive plan that outlines the government's spending and revenue plans", "C_hi": "बजट एक दस्तावेज है जिसमें सरकार के वित्तीय योजना का विवरण होता है, जबकि एक वित्तीय योजना एक व्यापक योजना है जिसमें सरकार की व्यय और राजस्व योजनाएं शामिल होती हैं",
"D_en": "There is no difference between a budget and a financial plan", "D_hi": "बजट और वित्तीय योजना के बीच कोई अंतर नहीं है",
"answer": "A",
"explanation_en": "A budget is a document that outlines the government's spending and revenue plans, while a financial plan is a comprehensive plan that outlines the government's overall financial strategy.",
"explanation_hi": "बजट एक दस्तावेज है जिसमें सरकार की व्यय और राजस्व योजनाएं शामिल होती हैं, जबकि एक वित्तीय योजना सरकार के वित्तीय योजना का एक व्यापक दस्तावेज है।"
},
{
"subject": "Economy",
"topic": "Development Economics",
"question_en": "What is the main challenge facing developing countries in terms of economic development?",
"question_hi": "आर्थिक विकास के मामले में विकासशील देशों का मुख्य चुनौती क्या है?",
"A_en": "To reduce poverty and inequality", "A_hi": "गरीबी और असमानता को कम करना",
"B_en": "To increase economic growth", "B_hi": "आर्थिक वृद्धि को बढ़ावा देना",
"C_en": "To improve infrastructure and human development", "C_hi": "आधुनिकीकरण और मानव विकास में सुधार करना",
"D_en": "All of the above", "D_hi": "सभी उपरोक्त",
"answer": "D",
"explanation_en": "The main challenge facing developing countries in terms of economic development is to reduce poverty and inequality, increase economic growth, and improve infrastructure and human development.",
"explanation_hi": "आर्थिक विकास के मामले में विकासशील देशों की मुख्य चुनौती गरीबी और असमानता को कम करना, आर्थिक वृद्धि को बढ़ावा देना, और आधुनिकीकरण और मानव विकास में सुधार करना है।"
},
{
"subject": "Economy",
"topic": "Economic Systems",
"question_en": "What is the main difference between a command economy and a market economy?",
"question_hi": "कमांड अर्थव्यवस्था और मार्केट अर्थव्यवस्था के बीच क्या मुख्य अंतर है?",
"A_en": "A command economy is a system in which the government controls the production and distribution of goods and services, while a market economy is a system in which the market forces determine the production and distribution of goods and services", "A_hi": "कमांड अर्थव्यवस्था एक ऐसी प्रणाली है जिसमें सरकार उत्पादन और वितरण का नियंत्रण करती है, जबकि एक मार्केट अर्थव्यवस्था एक ऐसी प्रणाली है जिसमें बाजार बल उत्पादन और वितरण का निर्धारण करते हैं",
"B_en": "A command economy is a system in which the market forces determine the production and distribution of goods and services, while a market economy is a system in which the government controls the production and distribution of goods and services", "B_hi": "कमांड अर्थव्यवस्था एक ऐसी प्रणाली है जिसमें बाजार बल उत्पादन और वितरण का निर्धारण करते हैं, जबकि एक मार्केट अर्थव्यवस्था एक ऐसी प्रणाली है जिसमें सरकार उत्पादन और वितरण का नियंत्रण करती है",
"C_en": "A command economy is a system in which the government controls the production and distribution of goods and services, while a market economy is a system in which the government controls the production and distribution of goods and services", "C_hi": "कमांड अर्थव्यवस्था एक ऐसी प्रणाली है जिसमें सरकार उत्पादन और वितरण का नियंत्रण करती है, जबकि एक मार्केट अर्थव्यवस्था एक ऐसी प्रणाली है जिसमें सरकार उत्पादन और वितरण का नियंत्रण करती है",
"D_en": "There is no difference between a command economy and a market economy", "D_hi": "कमांड अर्थव्यवस्था और मार्केट अर्थव्यवस्था के बीच कोई अंतर नहीं है",
"answer": "A",
"explanation_en": "The main difference between a command economy and a market economy is that a command economy is a system in which the government controls the production and distribution of goods and services, while a market economy is a system in which the market forces determine the production and distribution of goods and services.",
"explanation_hi": "कमांड अर्थव्यवस्था और मार्केट अर्थव्यवस्था के बीच का मुख्य अंतर यह है कि कमांड अर्थव्यवस्था एक ऐसी प्रणाली है जिसमें सरकार उत्पादन और वितरण का नियंत्रण करती है, जबकि एक मार्केट अर्थव्यवस्था एक ऐसी प्रणाली है जिसमें बाजार बल उत्पादन और वितरण का निर्धारण करते हैं।"
},
{
"subject": "Economy",
"topic": "Business Economics",
"question_en": "What is the main objective of a business firm?",
"question_hi": "एक व्यवसायिक कंपनी का मुख्य उद्देश्य क्या है?",
"A_en": "To maximize profits", "A_hi": "फायदे को अधिकतम करना",
"B_en": "To minimize costs", "B_hi": "लागत को कम करना",
"C_en": "To increase market share", "C_hi": "बाजार हिस्सेदारी बढ़ाना",
"D_en": "To satisfy customer needs", "D_hi": "ग्राहकों की आवश्यकताओं को पूरा करना",
"answer": "D",
"explanation_en": "The main objective of a business firm is to satisfy customer needs.",
"explanation_hi": "एक व्यवसायिक कंपनी का मुख्य उद्देश्य ग्राहकों की आवश्यकताओं को पूरा करना है।"
}