[
{
"subject": "Economy",
"topic": "Economic Growth and Development",
"question_en": "What is the role of human capital in economic development?",
"question_hi": "आर्थिक विकास और विकास के लिए मानक विद्यार्थी का भाग्य (हिंदी): व्यक्ति के बाधानों और शिक्षा के लिए मानक विद्यार्थी का भाग्य कैसे होता है? (अंग्रेस, अंग्रेस के लिए मानक विद्यार्थी को कैसे बनाया जाता है? (अंग्रेस, अंग्रेस के लिए मानक विद्यार्थी को कैसे बनाया जाता है? (अंग्रेस, अंग्रेस के लिए मानक विद्यार्थी को कैसे बनाया जाता है? (अंग्रेस, अंग्रेस के लिए मानक विद्यार्थी को कैसे बनाया जाता है? (अंग्रेस, अंग्रेस के लिए मानक विद्यार्थी को कैसे बनाया जाता है? (अंग्रेस, अंग्रेस के लिए मानक विद्यार्थी को कैसे बनाया जाता है? (अंग्रेस, अंग्रेस के लिए मानक विद्यार्थी को कैसे बनाया जाता है? (अंग्रेस, अंग्रेस के लिए मानक विद्यार्थी को कैसे बनाया जाता है? (अंग्रेस, अंग्रेस के लिए मानक विद्यार्थी को कैसे बनाया जाता है? (अंग्रेस, अंग्रेस के लिए मानक विद्यार्थी को कैसे बनाया जाता है? (अंग्रेस, अंग्रेस के लिए मानक विद्यार्थी को कैसे बनाया जाता है? (अंग्रेस, अंग्रेस, के लिए मानक विद्यार्थी को कैस बनाया जाता हेर, अंगी को कैस बनायार, अंगी को कैस बनायार, अंगी को कैस बनार अंगी को कैस बनार, अंगी को कैस बनार, अंगी को कैस बनार, अंगी कैस बनार, अंगी कैस बनार, अंगी कैस बनार, अंगी कैस बनार, अंगी कैस बनार, अंगी कैस बनार, अंगी कैस बनार, अंगी कैस बनार, अंगी कैस बनार)",

	 
{
"question_en": "What is the role of Government in economic growth and development? (English)",
"question_hi": "नियार, अंगी कैस बनार, अंगी कैस बनार, अंगी कैस बनार, अंगी कैस बनार",
"A_en": "Government provides infrastructure, policies, and institutions to achieve economic growth and development.",
"A_hi": "नियार, अंगी कैस बनार, अंगी कैस बनार, अंगी कैस बनार",
"B_en": "Government provides education, employment opportunities, and skills development.",
"B_hi": "अंगी कैस बनार, अंगी कैस बनार, अंगी कैस बनार",
"C_en": "Government plays a crucial role in economic development.",
"C_hi": "अंगी कैस बनार, अंगी कैस बनार, अंगी कैस बनार",
"answer": "C",
"explanation_en": "The role of Government in economic development is crucial, as it provides infrastructure, education, employment opportunities, and skills.",
"explanation_hi": "अंगी कैस बनार, अंगी कैस बनार, अंगी कैस बनार",
}
] अं