[
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "Which of the following is an example of a macroeconomic variable?",
"question_hi": "निम्नलिखित में से कौन सा मैक्रोइकॉनॉमिक वैरिएबल का उदाहरण है?",
"A_en": "Unemployment rate", "A_hi": " बेरोजगारी दर",
"B_en": "Inflation rate", "B_hi": "चालू खाता घाटा दर",
"C_en": "Fiscal policy", "C_hi": "नीति नियंत्रण",
"D_en": "Monetary policy", "D_hi": "धनव्यय नीति",
"answer": "A",
"explanation_en": "Unemployment rate is a macroeconomic variable that measures the percentage of labor force that is currently unemployed.",
"explanation_hi": "बेरोजगारी दर एक मैक्रोइकॉनॉमिक वैरिएबल है जो श्रम शक्ति के वर्तमान में बेरोजगार होने की दर को मापता है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the law of diminishing marginal utility?",
"question_hi": "निम्नलिखित में से क्या है मार्जिनल उपयोगिता का कम होने का कानून?",
"A_en": "As the quantity of a good increases, its price also increases.", "A_hi": "एक वस्तु की मात्रा बढ़ती है, इसकी कीमत भी बढ़ती है।",
"B_en": "As the quantity of a good increases, its price decreases.", "B_hi": "एक वस्तु की मात्रा बढ़ती है, इसकी कीमत भी कम होती है।",
"C_en": "As the quantity of a good increases, its marginal utility also increases.", "C_hi": "एक वस्तु की मात्रा बढ़ती है, इसकी मार्जिनल उपयोगिता भी बढ़ती है।",
"D_en": "As the quantity of a good increases, its marginal utility decreases.", "D_hi": "एक वस्तु की मात्रा बढ़ती है, इसकी मार्जिनल उपयोगिता भी कम होती है।",
"answer": "D",
"explanation_en": "The law of diminishing marginal utility states that as the quantity of a good increases, its marginal utility decreases.",
"explanation_hi": "मार्जिनल उपयोगिता का कम होने का कानून कहता है कि एक वस्तु की मात्रा बढ़ती है, इसकी मार्जिनल उपयोगिता भी कम होती है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the term for the export of goods and services from one country to another?",
"question_hi": "दो देशों के बीच वस्तुओं और सेवाओं के निर्यात को क्या कहा जाता है?",
"A_en": "Import", "A_hi": "आयात",
"B_en": "Export", "B_hi": "निर्यात",
"C_en": "Trade deficit", "C_hi": "व्यापार घाटा",
"D_en": "Trade surplus", "D_hi": "व्यापार लाभ",
"answer": "B",
"explanation_en": "Export is the term for the export of goods and services from one country to another.",
"explanation_hi": "निर्यात दो देशों के बीच वस्तुओं और सेवाओं के निर्यात का शब्द है।"
},
{
"subject": "Economy",
"topic": "Growth and Development",
"question_en": "What is the term for the increase in the standard of living of a country's people?",
"question_hi": "एक देश के लोगों के जीवन स्तर में वृद्धि को क्या कहा जाता है?",
"A_en": "Growth", "A_hi": "विकास",
"B_en": "Development", "B_hi": "विकास",
"C_en": "Progress", "C_hi": "प्रगति",
"D_en": "Improvement", "D_hi": "बेहतरी",
"answer": "B",
"explanation_en": "Development is the term for the increase in the standard of living of a country's people.",
"explanation_hi": "विकास एक देश के लोगों के जीवन स्तर में वृद्धि का शब्द है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the term for the government's use of taxation and public expenditure to control the economy?",
"question_hi": "सरकार के वित्तीय नीति को क्या कहा जाता है?",
"A_en": "Monetary policy", "A_hi": "धनव्यय नीति",
"B_en": "Fiscal policy", "B_hi": "वित्तीय नीति",
"C_en": "Supply-side policy", "C_hi": "सप्लाई-साइड नीति",
"D_en": "Demand-side policy", "D_hi": "डिमांड-साइड नीति",
"answer": "B",
"explanation_en": "Fiscal policy is the term for the government's use of taxation and public expenditure to control the economy.",
"explanation_hi": "वित्तीय नीति सरकार के वित्तीय नीति का शब्द है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the term for the central bank's use of interest rates and money supply to control the economy?",
"question_hi": "रिजर्व बैंक के द्वारा अर्थव्यवस्था को नियंत्रित करने के लिए ब्याज दर और नकदी आपूर्ति का उपयोग करना क्या कहा जाता है?",
"A_en": "Fiscal policy", "A_hi": "वित्तीय नीति",
"B_en": "Monetary policy", "B_hi": "धनव्यय नीति",
"C_en": "Supply-side policy", "C_hi": "सप्लाई-साइड नीति",
"D_en": "Demand-side policy", "D_hi": "डिमांड-साइड नीति",
"answer": "B",
"explanation_en": "Monetary policy is the term for the central bank's use of interest rates and money supply to control the economy.",
"explanation_hi": "धनव्यय नीति रिजर्व बैंक के द्वारा अर्थव्यवस्था को नियंत्रित करने के लिए ब्याज दर और नकदी आपूर्ति का उपयोग करने का शब्द है।"
},
{
"subject": "Economy",
"topic": "Globalization",
"question_en": "What is the term for the increasing interconnectedness of the world's economies?",
"question_hi": "दुनिया की अर्थव्यवस्थाओं के बीच बढ़ती जुड़ाव को क्या कहा जाता है?",
"A_en": "Globalization", "A_hi": "वैश्वीकरण",
"B_en": "International trade", "B_hi": "अंतर्राष्ट्रीय व्यापार",
"C_en": "Economic integration", "C_hi": "आर्थिक एकीकरण",
"D_en": "Economic interdependence", "D_hi": "आर्थिक आपटि",
"answer": "A",
"explanation_en": "Globalization is the term for the increasing interconnectedness of the world's economies.",
"explanation_hi": "वैश्वीकरण दुनिया की अर्थव्यवस्थाओं के बीच बढ़ती जुड़ाव का शब्द है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the term for the rate at which prices for goods and services are rising?",
"question_hi": "वस्तुओं और सेवाओं के लिए मूल्यों की दर में बढ़ोतरी की दर को क्या कहा जाता है?",
"A_en": "Inflation rate", "A_hi": "चालू खाता दर",
"B_en": "Deflation rate", "B_hi": "गिरता दर",
"C_en": "Stagflation rate", "C_hi": "विकास दर",
"D_en": "Unemployment rate", "D_hi": "बेरोजगारी दर",
"answer": "A",
"explanation_en": "Inflation rate is the term for the rate at which prices for goods and services are rising.",
"explanation_hi": "चालू खाता दर वस्तुओं और सेवाओं के लिए मूल्यों की दर में बढ़ोतरी की दर का शब्द है।"
},
{
"subject": "Economy",
"topic": "Poverty",
"question_en": "What is the term for the condition of being unable to meet one's basic needs?",
"question_hi": "अपने मूलभूत आवश्यकताओं को पूरा न करने की स्थिति को क्या कहा जाता है?",
"A_en": "Poverty", "A_hi": "गरीबी",
"B_en": "Unemployment", "B_hi": "बेरोजगारी",
"C_en": "Inflation", "C_hi": "चालू खाता दर",
"D_en": "Stagflation", "D_hi": "विकास दर",
"answer": "A",
"explanation_en": "Poverty is the term for the condition of being unable to meet one's basic needs.",
"explanation_hi": "गरीबी अपने मूलभूत आवश्यकताओं को पूरा न करने की स्थिति का शब्द है।"
}
]