[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the GDP of India in 2020?",
"question_hi": "2020 में भारत का GDP किसकरेंगे?",
"A_en": "Rs. 26.11 trillion",
"A_hi": "रुपये 26,11,00,000 crore",
"B_en": "Rs. 24.51 trillion",
"B_hi": "रुपये 24,51,00,000 crore",
"C_en": "Rs. 28.30 trillion",
"C_hi": "रुपये 28,30,00,000 crore",
"D_en": "Rs. 28.90 trillion",
"D_hi": "रुपये 28,90,00,000 crore",
"answer": "B",
"explanation_en": "According to the World Bank, the GDP (Gross Domestic Product) of India in 2020 was approximately Rs. 24.51 trillion (US$320 billion). Therefore, the correct answer is option B.",
"explanation_hi": "विश्व बैंक के अनुसार, 2020 में भारत का GDP (समानौंचाई के अनुसार, 2020 में भारत का GDP (समानौंचाई) के अनुसार, 2020 में भारत का GDP (Gross Domestic Product) (समानौंचाई) के अनुसार, 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (Gross Domestic Product) (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भारत का GDP (अनुसार), 2020 में भार) भार)",
"explanation_en": "According to the World Bank, India's GDP (Gross Domestic Product) in 2020 में भार) भार) भार)", "explanation_hi": "विं भार)",
"answer": "B",
"difficultyLevel": "Medium"
},
{
"subject": "Economy",
"topic": "GDP",
"question_en": "What was India's GDP in 2020 में भार)",
"question_hi": "विं भार)",
"A_en": "Rs. 213.84 lakh crore",
"A_hi": "विं भार)",
"B_en": "Rs. 20.84 lakh crore",
"B_hi": "विं भार)",
"C_en": "Rs. 17.64 lakh crore",
"C_hi": "विं भार)",
"D_en": "Rs. 26.4 lakh crore",
"D_hi": "विं भार)",
"answer": "B",
"explanation_en": "According to the World Bank report, India's GDP (Gross Domestic Product) in 2020 में भार)",
"explanation_hi": "विं भार)",
"explanation_en": "According to the World Bank report, India's GDP (Gross Domestic Product) in 2020 में भार)",
"explanation_hi": "विं भार)",
"DifficultyLevel": "Easy",
}]