[
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the law of decreasing cost in microeconomics?",
"question_hi": "माइक्रोइकॉनॉमिक्स में कॉस्ट कानून का क्या अर्थ है?",
"A_en": "The law of increasing returns", "A_hi": "वृद्धि के कानून",
"B_en": "The law of decreasing cost", "B_hi": "कॉस्ट कम करने का कानून",
"C_en": "The law of supply and demand", "C_hi": "आपूर्ति और मांग का कानून",
"D_en": "The law of diminishing returns", "D_hi": "कमी के कानून",
"answer": "B",
"explanation_en": "The law of decreasing cost states that as the output of a firm increases, the cost per unit decreases.",
"explanation_hi": "कॉस्ट कम करने का कानून कहता है कि कंपनी की उत्पादन मात्रा बढ़ने पर प्रति इकाई की लागत कम होती है।"
},
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the concept of inflation in macroeconomics?",
"question_hi": "मैक्रोइकॉनॉमिक्स में फ्लेटिनेशन का विचार क्या है?",
"A_en": "A sustained increase in the general price level", "A_hi": "सामान्य कीमत स्तर में स्थायी वृद्धि",
"B_en": "A decrease in the money supply", "B_hi": "रिजर्व बैंक द्वारा पैसे की आपूर्ति का कमी",
"C_en": "A decrease in the general price level", "C_hi": "सामान्य कीमत स्तर में कमी",
"D_en": "A decrease in aggregate demand", "D_hi": "कुल मांग में कमी",
"answer": "A",
"explanation_en": "Inflation refers to a sustained increase in the general price level of goods and services in an economy.",
"explanation_hi": "फ्लेटिनेशन का अर्थ है कि एक अर्थव्यवस्था में सामान्य कीमत स्तर में स्थायी वृद्धि होती है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the concept of comparative advantage in international trade?",
"question_hi": "अंतर्राष्ट्रीय व्यापार में तुलनात्मक लाभ का विचार क्या है?",
"A_en": "The ability of a country to produce a good at a lower cost than another country", "A_hi": "एक देश द्वारा एक उत्पाद को दूसरे देश की तुलना में कम लागत पर उत्पादित करने की क्षमता",
"B_en": "The ability of a country to export a good at a higher price than another country", "B_hi": "एक देश द्वारा एक उत्पाद को दूसरे देश की तुलना में अधिक कीमत पर निर्यात करने की क्षमता",
"C_en": "The ability of a country to import a good at a lower price than another country", "C_hi": "एक देश द्वारा एक उत्पाद को दूसरे देश की तुलना में कम कीमत पर आयात करने की क्षमता",
"D_en": "The ability of a country to produce a good at the same cost as another country", "D_hi": "एक देश द्वारा एक उत्पाद को दूसरे देश की तुलना में समान लागत पर उत्पादित करने की क्षमता",
"answer": "A",
"explanation_en": "Comparative advantage refers to the ability of a country to produce a good at a lower cost than another country, making it more efficient to specialize in that good.",
"explanation_hi": "तुलनात्मक लाभ का अर्थ है एक देश द्वारा एक उत्पाद को दूसरे देश की तुलना में कम लागत पर उत्पादित करने की क्षमता, जिससे वह उत्पाद में विशेषज्ञता हासिल करना अधिक कारगर होता है।"
},
{
"subject": "Economy",
"topic": "GDP",
"question_en": "What is the formula for calculating GDP?",
"question_hi": "जीडीपी की गणना करने का सूत्र क्या है?",
"A_en": "GDP = C + I + G + (X - M)", "A_hi": "जीडीपी = सी + आई + जी + (एक्स - एम)",
"B_en": "GDP = C + I + G + X", "B_hi": "जीडीपी = सी + आई + जी + एक्स",
"C_en": "GDP = C + I + G - (X - M)", "C_hi": "जीडीपी = सी + आई + जी - (एक्स - एम)",
"D_en": "GDP = C + I + G - X", "D_hi": "जीडीपी = सी + आई + जी - एक्स",
"answer": "A",
"explanation_en": "The formula for calculating GDP is GDP = C + I + G + (X - M), where C represents consumer spending, I represents investment, G represents government spending, X represents exports, and M represents imports.",
"explanation_hi": "जीडीपी की गणना करने के लिए सूत्र है जीडीपी = सी + आई + जी + (एक्स - एम), जहां सी संस्थागत व्यय का प्रतिनिधित्व करता है, आई निवेश का प्रतिनिधित्व करता है, जी सरकारी व्यय का प्रतिनिधित्व करता है, एक्स निर्यात का प्रतिनिधित्व करता है और एम आयात का प्रतिनिधित्व करता है।"
},
{
"subject": "Economy",
"topic": "Monopoly",
"question_en": "What is the main characteristic of a monopoly?",
"question_hi": "एक विलासिता का मुख्य विशेषता क्या है?",
"A_en": "A single seller in a market with no close substitutes", "A_hi": "एक बाजार में एकल विक्रेता जिसके पास समान उत्पाद के लिए कोई करीबी विकल्प नहीं है",
"B_en": "A single buyer in a market with no close substitutes", "B_hi": "एक बाजार में एकल खरीददार जिसके पास समान उत्पाद के लिए कोई करीबी विकल्प नहीं है",
"C_en": "Multiple sellers in a market with close substitutes", "C_hi": "एक बाजार में कई विक्रेता जिनके पास समान उत्पाद के लिए करीबी विकल्प हैं",
"D_en": "A market with no buyers or sellers", "D_hi": "एक बाजार जिसमें कोई खरीददार या विक्रेता नहीं है",
"answer": "A",
"explanation_en": "A monopoly is characterized by a single seller in a market with no close substitutes, allowing the seller to dictate prices and output.",
"explanation_hi": "एक विलासिता में एकल विक्रेता होता है जिसके पास समान उत्पाद के लिए कोई करीबी विकल्प नहीं होता है, जिससे विक्रेता को मूल्य और उत्पादन निर्धारित करने का अधिकार होता है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the main goal of fiscal policy?",
"question_hi": "वित्तीय नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To achieve full employment and price stability", "A_hi": "पूर्ण रोजगार और मुद्रास्फीति स्थिरता प्राप्त करना",
"B_en": "To reduce the budget deficit", "B_hi": "बजट घाटे को कम करना",
"C_en": "To increase government revenue", "C_hi": "सरकारी आय को बढ़ाना",
"D_en": "To reduce government spending", "D_hi": "सरकारी व्यय को कम करना",
"answer": "A",
"explanation_en": "The main goal of fiscal policy is to achieve full employment and price stability, which can be achieved through government spending and taxation.",
"explanation_hi": "वित्तीय नीति का मुख्य उद्देश्य पूर्ण रोजगार और मुद्रास्फीति स्थिरता प्राप्त करना है, जो सरकारी व्यय और करों के माध्यम से प्राप्त किया जा सकता है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the main goal of monetary policy?",
"question_hi": "मुद्रा नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To achieve low inflation and full employment", "A_hi": "निम्न मुद्रास्फीति और पूर्ण रोजगार प्राप्त करना",
"B_en": "To reduce the budget deficit", "B_hi": "बजट घाटे को कम करना",
"C_en": "To increase government revenue", "C_hi": "सरकारी आय को बढ़ाना",
"D_en": "To reduce the money supply", "D_hi": "रिजर्व बैंक द्वारा पैसे की आपूर्ति को कम करना",
"answer": "A",
"explanation_en": "The main goal of monetary policy is to achieve low inflation and full employment, which can be achieved through interest rates and the money supply.",
"explanation_hi": "मुद्रा नीति का मुख्य उद्देश्य निम्न मुद्रास्फीति और पूर्ण रोजगार प्राप्त करना है, जो ब्याज दरों और पैसे की आपूर्ति के माध्यम से प्राप्त किया जा सकता है।"
},
{
"subject": "Economy",
"topic": "GDP Deflator",
"question_en": "What is the GDP deflator?",
"question_hi": "जीडीपी डेफ्लेटर क्या है?",
"A_en": "A measure of the overall level of prices in an economy", "A_hi": "एक अर्थव्यवस्था में सामान्य कीमत स्तर का माप",
"B_en": "A measure of the rate of change of prices in an economy", "B_hi": "एक अर्थव्यवस्था में कीमतों के परिवर्तन की दर का माप",
"C_en": "A measure of the level of economic activity", "C_hi": "आर्थिक गतिविधि का स्तर का माप",
"D_en": "A measure of the level of government spending", "D_hi": "सरकारी व्यय का स्तर का माप",
"answer": "A",
"explanation_en": "The GDP deflator is a measure of the overall level of prices in an economy, which can be used to calculate the rate of inflation.",
"explanation_hi": "जीडीपी डेफ्लेटर एक अर्थव्यवस्था में सामान्य कीमत स्तर का माप है, जिसका उपयोग मुद्रास्फीति की दर की गणना करने के लिए किया जा सकता है।"
},
{
"subject": "Economy",
"topic": "Supply and Demand",
"question_en": "What is the law of supply?",
"question_hi": "आपूर्ति का कानून क्या है?",
"A_en": "The law that states that an increase in price leads to an increase in quantity supplied", "A_hi": "एक कानून जो कहता है कि मूल्य में वृद्धि से आपूर्ति में वृद्धि होती है",
"B_en": "The law that states that an increase in price leads to a decrease in quantity supplied", "B_hi": "एक कानून जो कहता है कि मूल्य में वृद्धि से आपूर्ति में कमी होती है",
"C_en": "The law that states that an increase in price leads to no change in quantity supplied", "C_hi": "एक कानून जो कहता है कि मूल्य में वृद्धि से आपूर्ति में कोई परिवर्तन नहीं होता है",
"D_en": "The law that states that an increase in price leads to an increase in quantity demanded", "D_hi": "एक कानून जो कहता है कि मूल्य में वृद्धि से मांग में वृद्धि होती है",
"answer": "B",
"explanation_en": "The law of supply states that an increase in price leads to a decrease in quantity supplied, as suppliers try to maximize their profits by reducing production.",
"explanation_hi": "आपूर्ति का कानून कहता है कि मूल्य में वृद्धि से आपूर्ति में कमी होती है, क्योंकि आपूर्तिकर्ता प्रोफिट्स को मैक्सिमाइज़ करने के लिए उत्पादन को कम करने का प्रयास करते हैं।"
}
]