[
{
"subject": "Economy",
"topic": "Government Policies",
"question_en": "Which of the following policies of the Indian government is related to rural development?",
"question_hi": "भारत के योजनाओं में राज्य विकृति का संबंधी किस योजना है।",
"A_en": "National Rural Development Programme", "A_hi": "राज्य विकृति कार्यक्रम",
"B_en": "National Rural Employment Guarantee Scheme", "B_hi": "राज्य स्थायी राज्य कार्यमूल उपयोग",
"C_en": "National Agriculture Development Programme", "C_hi": "राज्य आराम विक्रम",
"D_en": "National Rural Livelihood Mission", "D_hi": "राज्य उपयोग अभियोग",
"answer": "B",
"explanation_en": "The National Rural Employment Guarantee Scheme (MGNREGA) is related to rural development in India. It focuses on providing employment and income generation opportunities to the rural population.",
"explanation_hi": "राज्य स्थानी उपयोग (MGNREGA) भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA) सहज उपयोग के भारत के राज्य उपयोग (MGNREGA)",

",
"answer": "B",
"explanation_en": "The National Rural Employment Guarantee Scheme (MGNREGA) is a scheme launched by the Indian Government to provide employment opportunities to the rural population. Dus Tahasil kaise भारत के राज्य उपयोग (MGNREGA)",
"explanation_hi": "भारत के राज्य उपयोग (MGNREGA)",
"explanation_en": "The National Rural Employment Guarantee Scheme (MGNREGA) is a scheme launched by the Indian Government to provide employment opportunities to the rural population. Dus Tahasil kaise भारत के राज्य उपयोग (MGNREGA)",
"explanation_hi": "भारत के राज्य उपयोग (MGNREGA)"
"
"

{
"subject": "Economy",
"topic": "Government Policies",
"question_en": "Which scheme is responsible for providing employment to the rural population in Rajasthan?",
"question_hi": "राजे राजे उपयग (MGNREGA) भारत राजे राजत उपये उपये राजे राजे उपये राजे राजे राजे राजौग (MGNREGA)",
"answer": "D",
"explanation_en": "The MGNREGA (MGNREGA) scheme is responsible for providing employment to the rural population in Rajasthan.",
"explanation_hi": "राजे राजौग (MGNREGA)", "राजे राजौग (MGNREGA)",
"explanation_hi": "राजे राजौग (MGNREGA)", "राजौग (MGNREGA)", "राजे राजौग (MGNREGA)",
"answer": "D",
"राजौग (MGNREGA)", "राजौग (MGNREGA)", "राजौग (MGNREGA)",
"राजौग (MGNREGA)", "राजौग (MGNREGA)", "राजौग (MGNREGA)", "राजौग (MGNREGA)", "राजौग (MGNREGA)",
"राजौग (MGNREGA)", "राजौग (MGNREGA)", "राजौग (MGNREGA)",
"explanation_hi": "राजौग (MGNREGA)", "राजौग (MGNREGA)", "राजौग (MGNREGA)",
"राजौग (MGNREGA)", "राजौग (MGNREGA)", "राजौग (MGNREGA)", "राजौग (MGNREGA)",
"subject": "Economy", "topic": "MGNREGA (राजौग)", "question_en": "Which scheme is responsible for providing financial assistance to the farmers of Rajasthan?",
"question_hi": "राजौग (MGNREGA)", "राजौग (MGNREGA