[
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the primary goal of monetary policy?",
"question_hi": "वित्तीय नीति का प्राथमिक उद्देश्य क्या है?",
"A_en": "To control inflation", "A_hi": "चक्र को नियंत्रित करना",
"B_en": "To increase economic growth", "B_hi": "आर्थिक वृद्धि बढ़ाना",
"C_en": "To stabilize the exchange rate", "C_hi": "विनिमय दर स्थिर करना",
"D_en": "To reduce unemployment", "D_hi": "उपकरण को कम करना",
"answer": "C",
"explanation_en": "Monetary policy aims to stabilize the exchange rate and control inflation.",
"explanation_hi": "वित्तीय नीति विनिमय दर स्थिर करने और कीमतों को नियंत्रित करने का लक्ष्य रखती है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the law of diminishing marginal utility?",
"question_hi": "कमी की सीमांत उपभोगता का कानून क्या है?",
"A_en": "As the price of a commodity increases, its demand also increases.", "A_hi": "एक वस्तु की कीमत बढ़ती है, तो इसकी मांग भी बढ़ती है।",
"B_en": "As the quantity of a commodity consumed increases, its marginal utility also increases.", "B_hi": "एक वस्तु की खपत में वृद्धि होने पर उसकी सीमांत उपभोगता भी बढ़ती है।",
"C_en": "As the quantity of a commodity consumed increases, its marginal utility decreases.", "C_hi": "एक वस्तु की खपत में वृद्धि होने पर उसकी सीमांत उपभोगता कम होती है।",
"D_en": "As the price of a commodity increases, its supply also increases.", "D_hi": "एक वस्तु की कीमत बढ़ती है, तो इसकी आपूर्ति भी बढ़ती है।",
"answer": "C",
"explanation_en": "The law of diminishing marginal utility states that as the quantity of a commodity consumed increases, its marginal utility decreases.",
"explanation_hi": "कमी की सीमांत उपभोगता का कानून यह कहता है कि एक वस्तु की खपत में वृद्धि होने पर उसकी सीमांत उपभोगता कम होती है।"
},
{
"subject": "Economy",
"topic": "Economic Indicators",
"question_en": "What is the Gini coefficient?",
"question_hi": "जिनी कoefficient क्या है?",
"A_en": "A measure of economic growth", "A_hi": "आर्थिक विकास का माप",
"B_en": "A measure of income inequality", "B_hi": "आय की असमानता का माप",
"C_en": "A measure of inflation rate", "C_hi": "चक्र दर का माप",
"D_en": "A measure of unemployment rate", "D_hi": "उपकरण दर का माप",
"answer": "B",
"explanation_en": "The Gini coefficient is a measure of income inequality, indicating the extent to which the distribution of income among individuals or households deviates from perfect equality.",
"explanation_hi": "जिनी कoefficient आय की असमानता का माप है, जो व्यक्तियों या परिवारों के बीच आय की वितरण के संदर्भ में पूर्ण समानता से कितनी दूर है, इसका प्रदर्शन करता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the concept of comparative advantage?",
"question_hi": "समानांतर लाभ का सिद्धांत क्या है?",
"A_en": "A country should produce goods in which it has a absolute advantage", "A_hi": "एक देश उस उत्पाद का उत्पादन करना चाहिए जिसमें वह एक पूर्ण लाभ हासिल करता है।",
"B_en": "A country should specialize in producing goods in which it has a comparative advantage", "B_hi": "एक देश उस उत्पाद का उत्पादन करना चाहिए जिसमें वह एक तुलनात्मक लाभ हासिल करता है।",
"C_en": "A country should not trade with other countries", "C_hi": "एक देश को दूसरे देशों के साथ व्यापार नहीं करना चाहिए",
"D_en": "A country should produce goods in which it has a comparative disadvantage", "D_hi": "एक देश उस उत्पाद का उत्पादन करना चाहिए जिसमें वह एक तुलनात्मक अभाव हासिल करता है।",
"answer": "B",
"explanation_en": "Comparative advantage is the concept that a country should specialize in producing goods in which it has a lower opportunity cost compared to other countries.",
"explanation_hi": "समानांतर लाभ यह सिद्धांत है कि एक देश उस उत्पाद का उत्पादन करना चाहिए जिसमें वह एक कम अवसर खर्च का हासिल करता है, जो दूसरे देशों की तुलना में कम है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the purpose of a tax cut?",
"question_hi": "कर में कटौती का उद्देश्य क्या है?",
"A_en": "To increase government revenue", "A_hi": "सरकारी राजस्व में वृद्धि करना",
"B_en": "To reduce the budget deficit", "B_hi": "बजट घाटे को कम करना",
"C_en": "To stimulate economic growth", "C_hi": "आर्थिक विकास को प्रोत्साहित करना",
"D_en": "To increase the tax rate", "D_hi": "कर दर को बढ़ाना",
"answer": "C",
"explanation_en": "A tax cut is a reduction in tax rates, which can stimulate economic growth by increasing disposable income and consumption.",
"explanation_hi": "कर में कटौती कर दर को कम करने से होती है, जिससे व्यक्तियों के हाथ में अधिक नकदी हो जाती है और उपभोग में वृद्धि होती है, जिससे आर्थिक विकास प्रोत्साहित होता है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the purpose of open market operations?",
"question_hi": "खुले बाजार कार्यवाही का उद्देश्य क्या है?",
"A_en": "To control inflation", "A_hi": "चक्र को नियंत्रित करना",
"B_en": "To stabilize the exchange rate", "B_hi": "विनिमय दर स्थिर करना",
"C_en": "To increase the money supply", "C_hi": "पैसे की आपूर्ति बढ़ाना",
"D_en": "To reduce the interest rate", "D_hi": "ब्याज दर कम करना",
"answer": "C",
"explanation_en": "Open market operations involve the central bank buying or selling government securities to increase or decrease the money supply in the economy.",
"explanation_hi": "खुले बाजार कार्यवाही में सेंट्रल बैंक सरकारी ऋण प Papas खरीदने या बेचने से होती है, जिससे पैसे की आपूर्ति को बढ़ाया या कम किया जा सकता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the concept of absolute advantage?",
"question_hi": "पूर्ण लाभ का सिद्धांत क्या है?",
"A_en": "A country should produce goods in which it has a comparative advantage", "A_hi": "एक देश उस उत्पाद का उत्पादन करना चाहिए जिसमें वह एक तुलनात्मक लाभ हासिल करता है।",
"B_en": "A country should specialize in producing goods in which it has a absolute advantage", "B_hi": "एक देश उस उत्पाद का उत्पादन करना चाहिए जिसमें वह एक पूर्ण लाभ हासिल करता है।",
"C_en": "A country should not trade with other countries", "C_hi": "एक देश को दूसरे देशों के साथ व्यापार नहीं करना चाहिए",
"D_en": "A country should produce goods in which it has a comparative disadvantage", "D_hi": "एक देश उस उत्पाद का उत्पादन करना चाहिए जिसमें वह एक तुलनात्मक अभाव हासिल करता है।",
"answer": "B",
"explanation_en": "Absolute advantage is the concept that a country should specialize in producing goods in which it has a lower opportunity cost compared to other countries.",
"explanation_hi": "पूर्ण लाभ यह सिद्धांत है कि एक देश उस उत्पाद का उत्पादन करना चाहिए जिसमें वह एक कम अवसर खर्च का हासिल करता है, जो दूसरे देशों की तुलना में कम है।"
},
{
"subject": "Economy",
"topic": "Economic Indicators",
"question_en": "What is the Consumer Price Index (CPI)?",
"question_hi": " उपभोक्ता मूल्य सूचकांक (CPI) क्या है?",
"A_en": "A measure of economic growth", "A_hi": "आर्थिक विकास का माप",
"B_en": "A measure of income inequality", "B_hi": "आय की असमानता का माप",
"C_en": "A measure of inflation rate", "C_hi": "चक्र दर का माप",
"D_en": "A measure of unemployment rate", "D_hi": "उपकरण दर का माप",
"answer": "C",
"explanation_en": "The Consumer Price Index (CPI) is a measure of inflation rate, indicating the average change in prices of a basket of goods and services over time.",
"explanation_hi": "उपभोक्ता मूल्य सूचकांक (CPI) चक्र दर का माप है, जो समय के साथ एक बाग के सामान और सेवाओं की औसत मूल्य में परिवर्तन का प्रतिनिधित्व करता है।"
},
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the concept of the multiplier effect?",
"question_hi": "गुणक प्रभाव का सिद्धांत क्या है?",
"A_en": "A decrease in government spending leads to a decrease in aggregate demand", "A_hi": "सरकारी खर्च में कमी से समग्र मांग में भी कमी आती है।",
"B_en": "An increase in government spending leads to an increase in aggregate demand", "B_hi": "सरकारी खर्च में वृद्धि से समग्र मांग में भी वृद्धि होती है।",
"C_en": "A change in interest rates leads to a change in aggregate demand", "C_hi": "ब्याज दरों में परिवर्तन से समग्र मांग में भी परिवर्तन होता है।",
"D_en": "A decrease in taxes leads to an increase in aggregate demand", "D_hi": "कर में कटौती से समग्र मांग में भी वृद्धि होती है।",
"answer": "B",
"explanation_en": "The multiplier effect is the concept that a change in government spending or taxes leads to a change in aggregate demand, with the magnitude of the change being proportional to the change in government spending or taxes.",
"explanation_hi": "गुणक प्रभाव यह सिद्धांत है कि सरकारी खर्च या करों में परिवर्तन से समग्र मांग में भी परिवर्तन होता है, जिसमें परिवर्तन की मात्रा सरकारी खर्च या करों में परिवर्तन की मात्रा के अनुपात में होती है।"
}