[
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the term used to describe the movement of goods and services from a country with a high level of production to a country with a low level of production?",
"question_hi": "उच्च उत्पादन स्तर वाले देश से निम्न उत्पादन स्तर वाले देश में सामान और सेवाओं के आवागमन को क्या कहते हैं?",
"A_en": "Trade", "A_hi": "व्यापार",
"B_en": "Investment", "B_hi": "निवेश",
"C_en": "Migration", "C_hi": "प्रवासन",
"D_en": "Globalization", "D_hi": "वैश्वीकरण",
"answer": "A",
"explanation_en": "Trade is the exchange of goods and services between countries.",
"explanation_hi": "व्यापार देशों के बीच सामान और सेवाओं का आदान-प्रदान है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the law that states that the amount of a product that consumers are willing to buy at a given price is equal to the amount that producers are willing to sell at that price?",
"question_hi": "एक निश्चित मूल्य पर उपभोक्ता जितनी मात्रा में उत्पाद खरीदने के लिए तैयार होते हैं, उतनी ही मात्रा में उत्पादक उस मूल्य पर बेचने के लिए तैयार होते हैं, इस नियम को क्या कहा जाता है?",
"A_en": "Law of Demand", "A_hi": "आपूर्ति का नियम",
"B_en": "Law of Supply", "B_hi": "आपूर्ति का नियम",
"C_en": "Law of Equilibrium", "C_hi": "संतुलन का नियम",
"D_en": "Scarcity", "D_hi": "कमी",
"answer": "C",
"explanation_en": "Law of Equilibrium states that the supply and demand curves intersect at a single point, where the quantity of the good that consumers are willing to buy equals the quantity that producers are willing to sell.",
"explanation_hi": "संतुलन का नियम बताता है कि आपूर्ति और मांग के ग्राफ आपस में एक ही बिंदु पर मिलते हैं, जहां उपभोक्ता जितनी मात्रा में उत्पाद खरीदने के लिए तैयार होते हैं, उतनी ही मात्रा में उत्पादक उस मूल्य पर बेचने के लिए तैयार होते हैं।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the term used to describe the practice of imposing taxes on imported goods?",
"question_hi": "विदेशी माल के ऊपर लगाए जाने वाले कर को क्या कहा जाता है?",
"A_en": "Tariff", "A_hi": "कोटी",
"B_en": "Subsidy", "B_hi": "सब्सिडी",
"C_en": "Quota", "C_hi": "कोटा",
"D_en": "Export Tax", "D_hi": "आयात कर",
"answer": "A",
"explanation_en": "Tariff is a tax imposed on imported goods to protect domestic industries.",
"explanation_hi": "कोटी एक ऐसा कर है जो विदेशी माल पर लगाया जाता है जिससे घरेलू उद्योगों की रक्षा हो सके।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the term used to describe the use of government spending and taxation to influence economic activity?",
"question_hi": "सरकारी व्यय और करों का उपयोग करके अर्थव्यवस्था की गतिविधियों पर प्रभाव डालने को क्या कहा जाता है? ",
"A_en": "Monetary Policy", "A_hi": "货币 नीति",
"B_en": "Fiscal Policy", "B_hi": "राजकोषीय नीति",
"C_en": "Supply-Side Policy", "C_hi": "आपूर्ति पक्ष की नीति",
"D_en": "Demand-Side Policy", "D_hi": "मांग पक्ष की नीति",
"answer": "B",
"explanation_en": "Fiscal Policy is the use of government spending and taxation to influence economic activity.",
"explanation_hi": "राजकोषीय नीति सरकारी व्यय और करों का उपयोग करके अर्थव्यवस्था की गतिविधियों पर प्रभाव डालने के लिए किया जाता है।"
},
{
"subject": "Economy",
"topic": "Gross Domestic Product (GDP)",
"question_en": "What is the term used to describe the total value of all final goods and services produced within a country's borders?",
"question_hi": "एक देश के भीतर निर्मित सभी अंतिम सामानों और सेवाओं के कुल मूल्य को क्या कहा जाता है? ",
"A_en": "Gross National Product (GNP)", "A_hi": "जीएनपी",
"B_en": "Gross Domestic Product (GDP)", "B_hi": "जीडीपी",
"C_en": "Net National Product (NNP)", "C_hi": "एनएनपी",
"D_en": "Net Domestic Product (NDP)", "D_hi": "एनडीपी",
"answer": "B",
"explanation_en": "GDP is the total value of all final goods and services produced within a country's borders.",
"explanation_hi": "जीडीपी एक देश के भीतर निर्मित सभी अंतिम सामानों और सेवाओं के कुल मूल्य को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Unemployment",
"question_en": "What is the term used to describe the situation where people are able to work but are not employed?",
"question_hi": "व्यक्ति काम करने में सक्षम होते हैं लेकिन रोजगार में नहीं होते हैं, इस स्थिति को क्या कहा जाता है? ",
"A_en": "Poverty", "A_hi": "गरीबी",
"B_en": "Inflation", "B_hi": "उच्चारण",
"C_en": "Unemployment", "C_hi": "बेरोजगारी",
"D_en": "Depression", "D_hi": "मंदी",
"answer": "C",
"explanation_en": "Unemployment is the situation where people are able to work but are not employed.",
"explanation_hi": "बेरोजगारी वह स्थिति है जहां व्यक्ति काम करने में सक्षम होते हैं लेकिन रोजगार में नहीं होते हैं।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the term used to describe a sustained increase in the general price level of goods and services in an economy?",
"question_hi": "एक अर्थव्यवस्था में सामान्य मूल्य स्तर में एक निरंतर वृद्धि को क्या कहा जाता है? ",
"A_en": "Deflation", "A_hi": "मूल्य ह्रास",
"B_en": "Stagflation", "B_hi": "सगफल मंदी",
"C_en": "Inflation", "C_hi": "विस्फोट",
"D_en": "Hyperinflation", "D_hi": "अत्यधिक विस्फोट",
"answer": "C",
"explanation_en": "Inflation is a sustained increase in the general price level of goods and services in an economy.",
"explanation_hi": "विस्फोट एक अर्थव्यवस्था में सामान्य मूल्य स्तर में एक निरंतर वृद्धि को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the term used to describe the actions of a central bank to control the money supply and interest rates?",
"question_hi": "एक केंद्रीय बैंक के द्वारा पैसे की आपूर्ति और ब्याज दरों को नियंत्रित करने के लिए किए जाने वाले कार्यों को क्या कहा जाता है? ",
"A_en": "Fiscal Policy", "A_hi": "राजकोषीय नीति",
"B_en": "Monetary Policy", "B_hi": "मौद्रिक नीति",
"C_en": "Supply-Side Policy", "C_hi": "आपूर्ति पक्ष की नीति",
"D_en": "Demand-Side Policy", "D_hi": "मांग पक्ष की नीति",
"answer": "B",
"explanation_en": "Monetary Policy is the actions of a central bank to control the money supply and interest rates.",
"explanation_hi": "मौद्रिक नीति एक केंद्रीय बैंक के द्वारा पैसे की आपूर्ति और ब्याज दरों को नियंत्रित करने के लिए किए जाने वाले कार्यों को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Globalization",
"question_en": "What is the term used to describe the increasing interconnectedness of the world's economies?",
"question_hi": "विश्व की अर्थव्यवस्थाओं के बीच बढ़ती जुड़ाव को क्या कहा जाता है? ",
"A_en": "Trade", "A_hi": "व्यापार",
"B_en": "Investment", "B_hi": "निवेश",
"C_en": "Globalization", "C_hi": "वैश्वीकरण",
"D_en": "Migration", "D_hi": "प्रवासन",
"answer": "C",
"explanation_en": "Globalization is the increasing interconnectedness of the world's economies.",
"explanation_hi": "वैश्वीकरण विश्व की अर्थव्यवस्थाओं के बीच बढ़ती जुड़ाव को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Business Cycle",
"question_en": "What is the term used to describe the fluctuations in economic activity over time?",
"question_hi": "समय के साथ अर्थव्यवस्था में गतिविधियों में उतार-चढ़ाव को क्या कहा जाता है? ",
"A_en": "Boom", "A_hi": "उतार",
"B_en": "Bust", "B_hi": "उतार",
"C_en": "Business Cycle", "C_hi": "व्यवसाय चक्र",
"D_en": "Stagflation", "D_hi": "सगफल मंदी",
"answer": "C",
"explanation_en": "Business Cycle is the fluctuations in economic activity over time.",
"explanation_hi": "व्यवसाय चक्र समय के साथ अर्थव्यवस्था में गतिविधियों में उतार-चढ़ाव को दर्शाता है।"
}