[
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the term for a country's overall economic performance, including its growth rate, inflation rate, and unemployment rate?",
"question_hi": "एक देश की कुल अर्थव्यवस्था का प्रदर्शन, जिसमें वृद्धि दर, मुद्रास्फीति दर और बेरोजगारी दर शामिल है, को क्या कहा जाता है?",
"A_en": "Gross Domestic Product (GDP)", "A_hi": "बजटीय घरेलू उत्पाद (जीडीपी)",
"B_en": "National Income", "B_hi": "राष्ट्रीय आय",
"C_en": "Economic Indicators", "C_hi": "आर्थिक संकेतक",
"D_en": "Macroeconomic Indicators", "D_hi": "सामान्य आर्थिक संकेतक",
"answer": "A",
"explanation_en": "Gross Domestic Product (GDP) is a widely used indicator of a country's economic performance.",
"explanation_hi": "बजटीय घरेलू उत्पाद (जीडीपी) एक आम तौर पर उपयोग किया जाने वाला देश की अर्थव्यवस्था की प्रदर्शन का संकेतक है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the concept of diminishing marginal utility, which states that as the consumption of a good increases, the additional utility derived from each unit decreases?",
"question_hi": "एक सामान्य की उपभोग में वृद्धि के साथ, प्रत्येक इकाई से प्राप्त अतिरिक्त उपयोगिता की वृद्धि का सिद्धांत जिसे क्या कहा जाता है?",
"A_en": "Law of Diminishing Returns", "A_hi": "वापसी की कानून",
"B_en": "Law of Diminishing Marginal Utility", "B_hi": "वापसी से कम अतिरिक्त उपयोगिता का कानून",
"C_en": "Law of Increasing Costs", "C_hi": "लागत वृद्धि का कानून",
"D_en": "Law of Constant Returns", "D_hi": "स्थिर लाभ का कानून",
"answer": "B",
"explanation_en": "Law of Diminishing Marginal Utility states that as consumption of a good increases, the additional utility derived from each unit decreases.",
"explanation_hi": "वापसी से कम अतिरिक्त उपयोगिता का कानून के अनुसार, एक सामान्य की उपभोग में वृद्धि के साथ प्रत्येक इकाई से प्राप्त अतिरिक्त उपयोगिता कम हो जाती है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the term for a country's trade deficit, which occurs when the value of imports exceeds the value of exports?",
"question_hi": "एक देश का व्यापार घाटा, जो तब होता है जब आयात की कीमतें निर्यात की कीमतों से अधिक होती हैं, को क्या कहा जाता है?",
"A_en": "Trade Surplus", "A_hi": "व्यापार लाभ",
"B_en": "Trade Deficit", "B_hi": "व्यापार घाटा",
"C_en": "Balance of Trade", "C_hi": "व्यापार समतुल्य",
"D_en": "Current Account Deficit", "D_hi": "वर्तमान खाता घाटा",
"answer": "B",
"explanation_en": "Trade Deficit occurs when the value of imports exceeds the value of exports.",
"explanation_hi": "व्यापार घाटा तब होता है जब आयात की कीमतें निर्यात की कीमतों से अधिक होती हैं।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the primary tool used by central banks to control inflation, achieve economic growth, and maintain financial stability?",
"question_hi": "केंद्रीय बैंकों द्वारा मुद्रास्फीति को नियंत्रित करने, आर्थिक वृद्धि प्राप्त करने और वित्तीय स्थिरता बनाए रखने के लिए प्राथमिक उपकरण क्या है?",
"A_en": "Monetary Policy", "A_hi": "मौद्रिक नीति",
"B_en": "Fiscal Policy", "B_hi": "वित्तीय नीति",
"C_en": "Supply-Side Economics", "C_hi": "आपूर्ति पक्ष की अर्थव्यवस्था",
"D_en": "Demand-Side Economics", "D_hi": "आवश्यकता पक्ष की अर्थव्यवस्था",
"answer": "A",
"explanation_en": "Monetary Policy is the primary tool used by central banks to control inflation, achieve economic growth, and maintain financial stability.",
"explanation_hi": "मौद्रिक नीति केंद्रीय बैंकों द्वारा मुद्रास्फीति को नियंत्रित करने, आर्थिक वृद्धि प्राप्त करने और वित्तीय स्थिरता बनाए रखने के लिए प्राथमिक उपकरण है।"
},
{
"subject": "Economy",
"topic": "Growth and Development",
"question_en": "What is the term for a country's ability to achieve economic growth and reduce poverty, while protecting the environment?",
"question_hi": "एक देश की क्षमता को क्या कहा जाता है जिससे वह आर्थिक वृद्धि प्राप्त कर सकता है और गरीबी कम कर सकता है, जबकि पर्यावरण की रक्षा करता है?",
"A_en": "Sustainable Development", "A_hi": "स्थायी विकास",
"B_en": "Economic Growth", "B_hi": "आर्थिक वृद्धि",
"C_en": "Poverty Reduction", "C_hi": "गरीबी कम करना",
"D_en": "Environmental Protection", "D_hi": "पर्यावरण संरक्षण",
"answer": "A",
"explanation_en": "Sustainable Development is a country's ability to achieve economic growth and reduce poverty, while protecting the environment.",
"explanation_hi": "स्थायी विकास एक देश की क्षमता है जिससे वह आर्थिक वृद्धि प्राप्त कर सकता है और गरीबी कम कर सकता है, जबकि पर्यावरण की रक्षा करता है।"
},
{
"subject": "Economy",
"topic": "Business Cycles",
"question_en": "What is the term for a period of economic expansion, characterized by increasing production, employment, and income?",
"question_hi": "उत्पादन, रोजगार और आय में वृद्धि के साथ एक अवधि जो आर्थिक वृद्धि को दर्शाती है, को क्या कहा जाता है?",
"A_en": "Expansionary Phase", "A_hi": "विस्तारात्मक चरण",
"B_en": "Contractionary Phase", "B_hi": "संकुचनात्मक चरण",
"C_en": "Recession", "C_hi": "अवरोध",
"D_en": "Depression", "D_hi": "गहरी अवसाद",
"answer": "A",
"explanation_en": "Expansionary Phase is a period of economic expansion, characterized by increasing production, employment, and income.",
"explanation_hi": "विस्तारात्मक चरण आर्थिक वृद्धि की अवधि है, जिसमें उत्पादन, रोजगार और आय में वृद्धि होती है।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "What is the term for the government's revenue, which includes taxes, fees, and other sources of income?",
"question_hi": "सरकार की आय, जिसमें कर, शुल्क और अन्य आय के स्रोत शामिल हैं, को क्या कहा जाता है?",
"A_en": "Government Revenue", "A_hi": "सरकार की आय",
"B_en": "Government Expenditure", "B_hi": "सरकार का व्यय",
"C_en": "Budget", "C_hi": "बजट",
"D_en": "Public Sector Deficit", "D_hi": "सार्वजनिक क्षेत्र का घाटा",
"answer": "A",
"explanation_en": "Government Revenue is the government's income, which includes taxes, fees, and other sources of income.",
"explanation_hi": "सरकार की आय सरकार का आय है, जिसमें कर, शुल्क और अन्य आय के स्रोत शामिल हैं।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the term for a country's export of goods and services to another country, which is often subject to tariffs and other trade barriers?",
"question_hi": "एक देश द्वारा एक अन्य देश को वस्तुओं और सेवाओं का निर्यात करना, जो अक्सर उत्पाद शुल्क और अन्य व्यापार बाधाओं का विषय होता है, को क्या कहा जाता है?",
"A_en": "Export", "A_hi": "निर्यात",
"B_en": "Import", "B_hi": "आयात",
"C_en": "Trade Balance", "C_hi": "व्यापार समतुल्य",
"D_en": "Tariff", "D_hi": "उत्पाद शुल्क",
"answer": "A",
"explanation_en": "Export is the country's export of goods and services to another country, which is often subject to tariffs and other trade barriers.",
"explanation_hi": "निर्यात एक देश द्वारा एक अन्य देश को वस्तुओं और सेवाओं का निर्यात करना है, जो अक्सर उत्पाद शुल्क और अन्य व्यापार बाधाओं का विषय होता है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the term for a central bank's purchase of government securities, which increases the money supply and reduces interest rates?",
"question_hi": "केंद्रीय बैंक द्वारा सरकारी सुरक्षा की खरीद, जिससे पैसे की आपूर्ति बढ़ जाती है और ब्याज दरें कम हो जाती हैं, को क्या कहा जाता है?",
"A_en": "Open Market Operation", "A_hi": "खुला बाजार अभ्यास",
"B_en": "Reserve Requirement", "B_hi": "रिजर्व आवश्यकता",
"C_en": "Monetary Policy", "C_hi": "मौद्रिक नीति",
"D_en": "Fiscal Policy", "D_hi": "वित्तीय नीति",
"answer": "A",
"explanation_en": "Open Market Operation is the central bank's purchase of government securities, which increases the money supply and reduces interest rates.",
"explanation_hi": "खुला बाजार अभ्यास केंद्रीय बैंक द्वारा सरकारी सुरक्षा की खरीद है, जिससे पैसे की आपूर्ति बढ़ जाती है और ब्याज दरें कम हो जाती हैं।"
},
{
"subject": "Economy",
"topic": "Business Cycles",
"question_en": "What is the term for a period of economic decline, characterized by decreasing production, employment, and income?",
"question_hi": "उत्पादन, रोजगार और आय में कमी के साथ एक अवधि जो आर्थिक अवसाद को दर्शाती है, को क्या कहा जाता है?",
"A_en": "Recession", "A_hi": "अवरोध",
"B_en": "Expansionary Phase", "B_hi": "विस्तारात्मक चरण",
"C_en": "Contractionary Phase", "C_hi": "संकुचनात्मक चरण",
"D_en": "Depression", "D_hi": "गहरी अवसाद",
"answer": "A",
"explanation_en": "Recession is a period of economic decline, characterized by decreasing production, employment, and income.",
"explanation_hi": "अवरोध एक अवधि है जो आर्थिक अवसाद को दर्शाती है, जिसमें उत्पादन, रोजगार और आय में कमी होती है।"
}
]