[
{
"subject": "Economy",
"topic": "National Income and Product",
"question_en": "What is the concept of Gross Domestic Product (GDP)?",
"question_hi": "गैंडप्रोड्यूटी (GDP) क्या है?",
"A_en": "Gross National Product", "A_hi": "गैंडनेट नाटिक प्रोड्यूटी",
"B_en": "Gross State Product", "B_hi": "गैंडस्ट स्टेट प्रोड्यूटी",
"C_en": "Gross Regional Product", "C_hi": "गैंडरीज़ी रेज़नियन प्रोड्यूटी",
"D_en": "Net National Product", "D_hi": "नेट नाटिक प्रोड्यूटी",
"answer": "C",
"explanation_en": "Gross Regional Product refers to the total value of goods and services produced within a particular region. It measures the economic activity of a region as a whole. ",
"explanation_hi": "गैंडरीज़ी रेज़नियन प्रोड्यूटी"
},
{
"subject": "Economy",
"topic": "Services Sector",
"question_en": "What is the contribution of Services Sector in India's GDP?",
"question_hi": "भारत के एकीकरण में सेवा क्षेत्र की कर्म क्या है?",
"A_en": "The contribution of the Services Sector in India's GDP is ~60%.",
"A_hi": "भारत के एकीकरण में सेवा क्षेत्र की कर्म क्या है?",
"B_en": "The contribution of the Services Sector in India's GDP is around 52%.",
"B_hi": "भारत के एकीकरण में सेवा क्षेत्र की कर्म क्या है?",
"C_en": "The contribution of the Services Sector in India's GDP is approximately 44%.",
"C_hi": "भारत के एकीकरण में सेवा क्षेत्र की कर्म क्या है?",
"D_en": "The contribution of the Services Sector in India's GDP is around 39%.",
"D_hi": "भारत के एकीकरण में सेवा क्षेत्र की कर्म क्या है?",
"E_en": "The contribution of the Services Sector in India's GDP is about 28%.",
"E_hi": "भारत के एकीकरण में सेवा क्षेत्र की कर्म की कर्म क्या है?",
"F_en": "The contribution of the Services Sector in India's GDP is approximately 22%.",
"F_hi": "भारत के एकीकरण में सेवा क्षेत्र की कर्म की कर्म की कर्म क्या है?",
"G_en": "The contribution of the Services Sector in India's GDP is about 18%.",
"G_hi": "भारत के एकीकरण में सेवा क्षेत्र की कर्म कर्म की कर्म क्या है?",
"H_en": "The contribution of the Services Sector in India's GDP is about 11%.",
"H_hi": "भारत के एकीकरण में सेवा क्षेत्र कर्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म",
"answer": "C",
"explanation_en": "The Services Sector contributes around 55% to India's GDP.",
"explanation_hi": "भारत कीकरम कर्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म क्म कर्म कर्म्म कर्म कर्म कर्म कर्म कर्म कर्म्म कर्म कर्म कर्म कर्म कर्म्म कर्म कर्म कर्म कर्म कर्म कर्म कर्म कर्मकर्म कर्म कर्म्म कर्म कर्म कर्म कर्मक्म कर्म कर्म कर्म कर्म कर्म्म कर्म कर्म कर्म क्म कर्म कर्म कर्म कर्म कर्मकर्म कर्म्म कर्म कर्म कर्म्म कर्म कर्म कर्म कर्म कर्म कर्म्म कर्म कर्म कर्म्म कर्म कर्मकर्म कर्म कर्म्मकर्मकर्म कर्म्म कर्म्म कर्मकर