[
{
"subject": "Economy",
"topic": "GDP and Inflation",
"question_en": "What is the Gross Domestic Product (GDP)?",
"question_hi": "जीडीपी क्या है?",
"A_en": "The total value of all goods and services produced within a country's borders.", "A_hi": "एक देश के बॉर्डर के भीतर उत्पादित सभी सामानों और सेवाओं का कुल मूल्य।",
"B_en": "The total value of all exports and imports of a country.", "B_hi": "एक देश के सभी निर्यात और आयात का कुल मूल्य।",
"C_en": "The value of all goods and services produced by a country's citizens abroad.", "C_hi": "एक देश के नागरिकों द्वारा विदेशों में उत्पादित सभी सामानों और सेवाओं का मूल्य।",
"D_en": "The total value of all government spending in a country.", "D_hi": "एक देश में सरकार के सभी खर्च का कुल मूल्य।",
"answer": "A",
"explanation_en": "GDP is the total value of all final goods and services produced within a country's borders.",
"explanation_hi": "जीडीपी एक देश के बॉर्डर के भीतर उत्पादित सभी अंतिम सामानों और सेवाओं का कुल मूल्य है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the primary objective of monetary policy?",
"question_hi": "आर्थिक नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To control inflation and maintain price stability.", "A_hi": "उच्चता और मुद्रास्फीति को नियंत्रित करना।",
"B_en": "To stimulate economic growth and employment.", "B_hi": "आर्थिक विकास और रोजगार को प्रोत्साहित करना।",
"C_en": "To manage foreign exchange reserves and maintain exchange rate stability.", "C_hi": "विदेशी मुद्रा भंडार को प्रबंधित करना और विनिमय दर की स्थिरता बनाए रखना।",
"D_en": "To regulate bank lending rates and credit availability.", "D_hi": "बैंक ऋण दरों और क्रेडिट उपलब्धता का नियंत्रण।",
"answer": "A",
"explanation_en": "The primary objective of monetary policy is to control inflation and maintain price stability.",
"explanation_hi": "आर्थिक नीति का मुख्य उद्देश्य उच्चता और मुद्रास्फीति को नियंत्रित करना है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the main goal of fiscal policy?",
"question_hi": "आर्थिक नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To reduce budget deficit and increase government revenue.", "A_hi": "बजट घाटे को कम करना और सरकारी राजस्व को बढ़ाना।",
"B_en": "To stimulate economic growth and employment.", "B_hi": "आर्थिक विकास और रोजगार को प्रोत्साहित करना।",
"C_en": "To reduce inequality and poverty.", "C_hi": "समानता और गरीबी को कम करना।",
"D_en": "To control inflation and maintain price stability.", "D_hi": "उच्चता को नियंत्रित करना और मुद्रास्फीति की स्थिरता बनाए रखना।",
"answer": "B",
"explanation_en": "The main goal of fiscal policy is to stimulate economic growth and employment.",
"explanation_hi": "आर्थिक नीति का मुख्य उद्देश्य आर्थिक विकास और रोजगार को प्रोत्साहित करना है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the main advantage of international trade?",
"question_hi": "अंतर्राष्ट्रीय व्यापार का मुख्य लाभ क्या है?",
"A_en": "Increased competition and reduced prices.", "A_hi": "वृद्धि हुई प्रतिस्पर्धा और कम कीमतें।",
"B_en": "Improved technology and increased productivity.", "B_hi": "बेहतर प्रौद्योगिकी और उत्पादकता में वृद्धि।",
"C_en": "Increased economic growth and employment.", "C_hi": "आर्थिक विकास और रोजगार में वृद्धि।",
"D_en": "Increased government revenue and reduced budget deficit.", "D_hi": "सरकारी राजस्व में वृद्धि और बजट घाटे की कमी।",
"answer": "A",
"explanation_en": "The main advantage of international trade is increased competition and reduced prices.",
"explanation_hi": "अंतर्राष्ट्रीय व्यापार का मुख्य लाभ वृद्धि हुई प्रतिस्पर्धा और कम कीमतें हैं।"
},
{
"subject": "Economy",
"topic": "Unemployment",
"question_en": "What is the main cause of unemployment?",
"question_hi": "बेरोजगारी का मुख्य कारण क्या है?",
"A_en": "Lack of education and skills.", "A_hi": "शिक्षा और कौशल की कमी।",
"B_en": "Lack of job opportunities and low wages.", "B_hi": "नौकरी के अवसरों की कमी और कम वेतन।",
"C_en": "Poor economic conditions and high inflation.", "C_hi": "अर्थव्यवस्था की खराब स्थिति और उच्च मुद्रास्फीति।",
"D_en": "Lack of government policies and programs.", "D_hi": "सरकारी नीतियों और कार्यक्रमों की कमी।",
"answer": "B",
"explanation_en": "The main cause of unemployment is lack of job opportunities and low wages.",
"explanation_hi": "बेरोजगारी का मुख्य कारण नौकरी के अवसरों की कमी और कम वेतन है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the main effect of inflation?",
"question_hi": "मुद्रास्फीति का मुख्य प्रभाव क्या है?",
"A_en": "Reduction in purchasing power and increased prices.", "A_hi": "खरीदारी की शक्ति की कमी और बढ़ी हुई कीमतें।",
"B_en": "Increased economic growth and employment.", "B_hi": "आर्थिक विकास और रोजगार में वृद्धि।",
"C_en": "Reduced government revenue and increased budget deficit.", "C_hi": "सरकारी राजस्व की कमी और बजट घाटे की वृद्धि।",
"D_en": "Increased foreign exchange reserves and stable exchange rate.", "D_hi": "विदेशी मुद्रा भंडार की वृद्धि और स्थिर विनिमय दर।",
"answer": "A",
"explanation_en": "The main effect of inflation is reduction in purchasing power and increased prices.",
"explanation_hi": "मुद्रास्फीति का मुख्य प्रभाव खरीदारी की शक्ति की कमी और बढ़ी हुई कीमतें हैं।"
},
{
"subject": "Economy",
"topic": "GDP Deflator",
"question_en": "What is the GDP deflator?",
"question_hi": "जीडीपी डिफ़लेटर क्या है?",
"A_en": "A measure of the total value of goods and services produced within a country's borders.", "A_hi": "एक देश के बॉर्डर के भीतर उत्पादित सभी सामानों और सेवाओं का कुल मूल्य।",
"B_en": "A measure of the total value of imports and exports of a country.", "B_hi": "एक देश के सभी निर्यात और आयात का कुल मूल्य।",
"C_en": "A measure of the total value of goods and services produced within a country, adjusted for inflation.", "C_hi": "एक देश में उत्पादित सभी सामानों और सेवाओं का कुल मूल्य, मुद्रास्फीति के अनुसार समायोजित।",
"D_en": "A measure of the total value of government spending in a country.", "D_hi": "एक देश में सरकार के सभी खर्च का कुल मूल्य।",
"answer": "C",
"explanation_en": "The GDP deflator is a measure of the total value of goods and services produced within a country, adjusted for inflation.",
"explanation_hi": "जीडीपी डिफ़लेटर एक देश में उत्पादित सभी सामानों और सेवाओं का कुल मूल्य है, जो मुद्रास्फीति के अनुसार समायोजित किया जाता है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the purpose of fiscal policy?",
"question_hi": "आर्थिक नीति का प्रयोजन क्या है?",
"A_en": "To control inflation and maintain price stability.", "A_hi": "उच्चता को नियंत्रित करना और मुद्रास्फीति की स्थिरता बनाए रखना।",
"B_en": "To stimulate economic growth and employment.", "B_hi": "आर्थिक विकास और रोजगार को प्रोत्साहित करना।",
"C_en": "To reduce inequality and poverty.", "C_hi": "समानता और गरीबी को कम करना।",
"D_en": "To manage government spending and taxation.", "D_hi": "सरकार के खर्च और करों का प्रबंधन।",
"answer": "B",
"explanation_en": "The purpose of fiscal policy is to stimulate economic growth and employment.",
"explanation_hi": "आर्थिक नीति का प्रयोजन आर्थिक विकास और रोजगार को प्रोत्साहित करना है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the tool used by central banks to control inflation?",
"question_hi": "मुद्रास्फीति को नियंत्रित करने के लिए केंद्रीय बैंक द्वारा उपयोग किया जाने वाला औजार क्या है?",
"A_en": "Interest rates.", "A_hi": "ब्याज दरें।",
"B_en": "Money supply.", "B_hi": "मुद्रा आपूर्ति।",
"C_en": "Fiscal policy.", "C_hi": "आर्थिक नीति।",
"D_en": "Exchange rates.", "D_hi": "विनिमय दरें।",
"answer": "A",
"explanation_en": "The tool used by central banks to control inflation is interest rates.",
"explanation_hi": "मुद्रास्फीति को नियंत्रित करने के लिए केंद्रीय बैंक द्वारा उपयोग किया जाने वाला औजार ब्याज दरें हैं।"
},
{
"subject": "Economy",
"topic": "GDP",
"question_en": "What is the formula for calculating GDP?",
"question_hi": "जीडीपी की गणना करने का सूत्र क्या है?",
"A_en": "C + I + G + (X - M)", "A_hi": "सी + आई + जी + (एक्स - एम)",
"B_en": "C + I + G + NX", "B_hi": "सी + आई + जी + एनएक्स",
"C_en": "C + I + G + (X + M)", "C_hi": "सी + आई + जी + (एक्स + एम)",
"D_en": "C + I + G + (X - NX)", "D_hi": "सी + आई + जी + (एक्स - एनएक्स)",
"answer": "A",
"explanation_en": "The formula for calculating GDP is C + I + G + (X - M), where C is consumption, I is investment, G is government spending, X is exports, and M is imports.",
"explanation_hi": "जीडीपी की गणना करने का सूत्र सी + आई + जी + (एक्स - एम) है, जहां सी उपभोग है, आई निवेश है, जी सरकारी खर्च है, एक्स निर्यात है, और एम आयात है।"
}