[
{
"subject": "Economy",
"topic": "GDP at Current Price",
"question_en": "What is the Gross Domestic Product (GDP) at Current Price of India in 2020-21?",
"question_hi": "2020-21 सेवाएं के क्या वर्ष विभागीय आय और आयक्षण की जानकारी",
"A_en": "Rs. 21,52,904 crore",
"A_hi": "Rs. 21,52,904 करो॰",
"B_en": "Rs. 20,52,146 crore",
"B_hi": "Rs. 20,52,146 करो॰",
"C_en": "Rs. 19,95,904 crore",
"C_hi": "Rs. 19,95,904 करो॰",
"D_en": "Rs. 21,09,883 crore",
"D_hi": "Rs. 21,09,883 करो॰",
"answer": "C",
"explanation_en": "According to the National Accounts Statistics released by the Office of the Registrar General and Census Commissioner, India, the GDP of India at Current Price for the financial year 2020-21 was Rs. 19,95,904 crore.",
"explanation_hi": "भारत के National Accounts Statistics ने Office of the Registrar General and Census Commissioner, India द्वारा दी गई एक वर्षीय क्रमीकरण के वर्षीय मूल्यांक की जांचे को अनुमानियांक के वर्षीय मूल्यांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक को अनुमानियांक (संख्यांक)",
को अनुमानियांक (संख्यांक)",
को अनुमानियांक (संख्यांक) को अनुमानियांक (संख्यांक)",
को अनुमानियांक (संख्यांक)",
को अनुमानियांक (संख्यांक)",
को अनुमानियांक (संख्यांक)",
को अनुमानियांक (संख्यांक)",
को अनुमानियांक (संख्यांक)",
को अनुमानियांक (संख्यांक)",
को अनुमांक (संख्यांक)",
को अनुमांक (संख्यांक)",
को अनुमांक (संख्यांक)",
को अनुमांक (संख्यांक)",
को अनुमांक (संख्यांक)",
को अनुमांक (संख्यांक)",
को अनुमांक (संख्यांक)",
को अनुमांक (संख्यांक)",
को अनुमांक (संख्यांक)",
को अनुमांक (संख्यांक)",
को अनुमांक (संख्यांक)",
को अनुमांक (संख्यांक)",
को अनुमांक (संख्यांक)",
को अनुमांक (संख्यांक)",
को अन