[
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the term used to describe the overall level of prices for goods and services in an economy?",
"question_hi": "एक अर्थव्यवस्था में सामान और सेवाओं के लिए कुल स्तर के लिए क्या शब्द का प्रयोग किया जाता है?",
"A_en": "Inflation", "A_hi": " inflation",
"B_en": "Deflation", "B_hi": "deflation",
"C_en": "Unemployment", "C_hi": "बेरोजगारी",
"D_en": "GDP", "D_hi": "जीडीपी",
"answer": "A",
"explanation_en": "Inflation refers to a sustained increase in the general price level of goods and services in an economy over time.",
"explanation_hi": " inflation एक अर्थव्यवस्था में सामान और सेवाओं के लिए कुल स्तर में स्थायी वृद्धि को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the concept that describes the way in which the quantity of a good or service demanded depends on its price?",
"question_hi": "एक वस्तु या सेवा की मांग की मात्रा पर उसकी कीमत पर निर्भरता का सिद्धांत क्या है?",
"A_en": "Supply and Demand", "A_hi": "सupply और demand",
"B_en": "Law of Diminishing Marginal Utility", "B_hi": "सीमित माध्यमिक उपयोग का कानून",
"C_en": " Opportunity Cost", "C_hi": "Opportunity Cost",
"D_en": "Price Elasticity of Demand", "D_hi": "मांग की कीमत के लिए लचीलापन",
"answer": "D",
"explanation_en": "Price Elasticity of Demand is a concept in microeconomics that describes how the quantity of a good or service demanded changes in response to a change in its price.",
"explanation_hi": "Price Elasticity of Demand एक सूक्ष्म अर्थशास्त्र का सिद्धांत है जो एक वस्तु या सेवा की मांग की मात्रा को उसकी कीमत में बदलाव के जवाब में बदलने के बारे में बताता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the term used to describe the exchange of goods and services between two or more countries?",
"question_hi": "दो या अधिक देशों के बीच सामान और सेवाओं के आदान-प्रदान के लिए क्या शब्द का प्रयोग किया जाता है?",
"A_en": "Export", "A_hi": "अग्रेषण",
"B_en": "Import", "B_hi": "आनेषण",
"C_en": "Trade", "C_hi": "व्यापार",
"D_en": "Foreign Direct Investment", "D_hi": "विदेशी सीधा निवेश",
"answer": "C",
"explanation_en": "Trade refers to the exchange of goods and services between two or more countries, and is a key component of international economics.",
"explanation_hi": "व्यापार दो या अधिक देशों के बीच सामान और सेवाओं के आदान-प्रदान को संदर्भित करता है, जो अंतर्राष्ट्रीय अर्थशास्त्र का एक महत्वपूर्ण घटक है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the tool used by central banks to control inflation and stabilize the economy?",
"question_hi": "केंद्रीय बैंकों द्वारा महंगाई और अर्थव्यवस्था की स्थिरता को नियंत्रित करने के लिए किसका उपयोग किया जाता है?",
"A_en": "Fiscal Policy", "A_hi": "वित्तीय नीति",
"B_en": "Monetary Policy", "B_hi": "मौद्रिक नीति",
"C_en": "Supply Side Policy", "C_hi": "सप्लाई पक्ष नीति",
"D_en": "Demand Side Policy", "D_hi": "मांग पक्ष नीति",
"answer": "B",
"explanation_en": "Monetary Policy is a tool used by central banks to control inflation, stabilize the economy, and promote economic growth.",
"explanation_hi": "मौद्रिक नीति केंद्रीय बैंकों द्वारा महंगाई, अर्थव्यवस्था की स्थिरता, और आर्थिक वृद्धि को बढ़ावा देने के लिए उपयोग की जाने वाली एक उपकरण है।"
},
{
"subject": "Economy",
"topic": "GDP",
"question_en": "What is the formula for calculating Gross Domestic Product (GDP)?",
"question_hi": "जीडीपी (GDP) की गणना करने के लिए कौन सा सूत्र है?",
"A_en": "C + I + G + X", "A_hi": "सी + आई + जी + एक्स",
"B_en": "C + I + G + NX", "B_hi": "सी + आई + जी + एनएक्स",
"C_en": "Y + C + I + G", "C_hi": "ये + सी + आई + जी",
"D_en": "Y + C + I + NX", "D_hi": "ये + सी + आई + एनएक्स",
"answer": "A",
"explanation_en": "The formula for calculating GDP is C + I + G + X, where C is consumption, I is investment, G is government spending, and X is net exports.",
"explanation_hi": "जीडीपी की गणना करने का सूत्र है सी + आई + जी + एक्स, जहां सी उपभोग है, आई निवेश है, जी सरकारी व्यय है, और एक्स नेट एक्सपोर्ट्स है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the term used to describe a sustained decrease in the general price level of goods and services in an economy?",
"question_hi": "एक अर्थव्यवस्था में सामान और सेवाओं के लिए कुल स्तर में स्थायी कमी को दर्शाने के लिए क्या शब्द का प्रयोग किया जाता है?",
"A_en": "Deflation", "A_hi": "deflation",
"B_en": "Inflation", "B_hi": "inflation",
"C_en": "Stagflation", "C_hi": "स्टागफ्लेशन",
"D_en": "Hyperinflation", "D_hi": "हाइपरइन्फ्लेशन",
"answer": "A",
"explanation_en": "Deflation is a sustained decrease in the general price level of goods and services in an economy over time.",
"explanation_hi": "deflation एक अर्थव्यवस्था में सामान और सेवाओं के लिए कुल स्तर में स्थायी कमी को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Unemployment",
"question_en": "What is the term used to describe a situation where people are willing to work but cannot find employment?",
"question_hi": "वह स्थिति का वर्णन करने के लिए क्या शब्द का प्रयोग किया जाता है जहां लोग काम करने के इच्छुक हैं लेकिन नौकरी नहीं पा सकते हैं?",
"A_en": "Unemployment", "A_hi": "बेरोजगारी",
"B_en": "Underemployment", "B_hi": "अनदेखा रोजगार",
"C_en": "Overemployment", "C_hi": "अदिक रोजगार",
"D_en": "Full Employment", "D_hi": "पूर्ण रोजगार",
"answer": "A",
"explanation_en": "Unemployment refers to a situation where people are willing to work but cannot find employment, and is a key indicator of economic performance.",
"explanation_hi": "बेरोजगारी एक ऐसी स्थिति को संदर्भित करता है जहां लोग काम करने के इच्छुक हैं लेकिन नौकरी नहीं पा सकते हैं, जो आर्थिक प्रदर्शन का एक महत्वपूर्ण संकेतक है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the tool used by governments to control the economy through taxation and government spending?",
"question_hi": "सरकारों द्वारा करों और सरकारी व्यय के माध्यम से अर्थव्यवस्था को नियंत्रित करने के लिए किसका उपयोग किया जाता है?",
"A_en": "Monetary Policy", "A_hi": "मौद्रिक नीति",
"B_en": "Fiscal Policy", "B_hi": "वित्तीय नीति",
"C_en": "Supply Side Policy", "C_hi": "सप्लाई पक्ष नीति",
"D_en": "Demand Side Policy", "D_hi": "मांग पक्ष नीति",
"answer": "B",
"explanation_en": "Fiscal Policy is a tool used by governments to control the economy through taxation and government spending, and is often used in conjunction with monetary policy.",
"explanation_hi": "वित्तीय नीति एक उपकरण है जिसका उपयोग सरकारें करों और सरकारी व्यय के माध्यम से अर्थव्यवस्था को नियंत्रित करने के लिए करती हैं और अक्सर मौद्रिक नीति के साथ उपयोग किया जाता है।"
},
{
"subject": "Economy",
"topic": "GDP Growth Rate",
"question_en": "What is the term used to describe the rate at which the Gross Domestic Product (GDP) of a country is increasing?",
"question_hi": "एक देश के जीडीपी (GDP) की वृद्धि दर में स्थिरता को दर्शाने के लिए क्या शब्द का प्रयोग किया जाता है?",
"A_en": "GDP Growth Rate", "A_hi": "जीडीपी वृद्धि दर",
"B_en": "Inflation Rate", "B_hi": "महंगाई दर",
"C_en": "Unemployment Rate", "C_hi": "बेरोजगारी दर",
"D_en": "Interest Rate", "D_hi": "ब्याज दर",
"answer": "A",
"explanation_en": "The GDP Growth Rate is the rate at which the Gross Domestic Product (GDP) of a country is increasing, and is a key indicator of economic performance.",
"explanation_hi": "जीडीपी वृद्धि दर एक देश के जीडीपी (GDP) की वृद्धि दर को दर्शाता है, जो आर्थिक प्रदर्शन का एक महत्वपूर्ण संकेतक है।"
}
]