[
{
"subject": "Economy",
"topic": "GDP at Current Prices",
"question_en": "What is the Gross Domestic Product (GDP) of Rajasthan in 2019-20 in millions of INR?",
"question_hi": "2019-20 सेवाएं में राजस्थान की ग्रोस अंचलीय आयात (GDP) क्या है ?",
"A_en": "Rs. 100",
"A_hi": "रुपये 100",
"B_en": "Rs. 120",
"B_hi": "रुपये 120",
"C_en": "Rs. 80",
"C_hi": "रुपये 80",
"D_en": "Rs. 150",
"D_hi": "रुपये 150",
"answer": "C",
"explanation_en": "According to the data available, the Gross Domestic Product (GDP) of Rajasthan in 2019-20 at current prices is approximately Rs. 80,000 crore. Therefore, the correct answer is Rs. 80.",
"explanation_hi": "राजस्थान के 2019-20 का विभागीय योजना (GDP) की वर्षीय मान के मान में 2019-20 का विभागीय योजना (GDP) के वर्षीय मान के मान में क्या वर्षीय योजना (GDP) के (मान के मान) राजस्थान के वर्षीय योजना (GDP) 2019-20 मान से ज्यादारीय योजना (GDP) के मान की वास्तवीय योजना (GDP) 2019-20 मान के मान से ज्यादारीय योजना (GDP) के मान के मान से ज्यादारीय योजना (GDP) 2019-20 मान के मान",
"answer": "C",
"explanation_en": "According to the economic data, the GDP (Gross Domestic Product) of Rajasthan for the financial year 2019-20 was approximately Rs. 1043 billion. So, the correct answer is Rs. 1043 billion (C)",
"explanation_hi": "इस्तवर्षीय योजना (आयोजना के मान के मान से ज्यादारीय योजना (आयोजना के मान के मान)",
"explanation_hi": "राजस्थान के मूल्यादारीय योजना (आयोजना के मान से ज्यादारीय योजना (आयोजना के मान से ज्यादारीय योजना (आयोजना के मान से ज्यादारीय योजना (आयोजना के मान से ज्यादारीय योजना (आयोजना के मान से ज्यादारीय योजना (आयोजना के मान से ज्यादारीय योजना (आयोजना के मान से ज्यादारीय योजना (आयोजना के मान से ज्यादारीय योजना (आयोजना के मान से ज्यादारीय योजना (आयोजना के मान से ज्यादारीय योजना (आयोजना के मान से ज्यादारीय योजना (आयोजना के मान से ज्यादारीय यजना (आयोजना के ज्यादारीय योजना (आयोजना के ज्यादारीय योजना (आयोजना (आयोजना) के ज्यादारीय योज्या (आयोजना)",
के ज्या (आयोजना)",
"B_en": "Rs. 120,000 crores",
"B_hi": "र्या जना (योे जना)",
"C_en": "Rs. 18,000 crores",
"C_hi": "के ज्या (आयोजना)",
"D_en": "Rs. 20,000 crores",
"D_hi": "के ज्या (आयोजना)",
"answer": "B",
"explanation_en": "As per the data, Rajasthan's GDP at current prices was Rs. 120,000 crores in 2019-2020.",
"explanation_hi": "क्या जना (आये जना)",
"A_en": "Rs. 18,000 crores",
"A_hi": "के जना (आया)",
"D_en": "Rs. 20,000 crores",
"D_hi": "के जना (आये जना)",
"answer": "B"
]