[
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the primary function of the Central Bank in a country's economy?",
"question_hi": "एक देश की अर्थव्यवस्था में केंद्रीय बैंक की प्राथमिक कार्य क्या है?",
"A_en": "To regulate the money supply", "A_hi": "पैसे की आपूर्ति को नियंत्रित करना",
"B_en": "To control inflation", "B_hi": "वसूली को नियंत्रित करना",
"C_en": "To manage the government's debt", "C_hi": "सरकार के ऋण का प्रबंधन करना",
"D_en": "To fix interest rates", "D_hi": "ब्याज दरों को निर्धारित करना",
"answer": "A",
"explanation_en": "The Central Bank is responsible for regulating the money supply in the economy, which helps to maintain economic stability.",
"explanation_hi": "केंद्रीय बैंक अर्थव्यवस्था में पैसे की आपूर्ति को नियंत्रित करने के लिए जिम्मेदार है, जिससे आर्थिक स्थिरता बनी रहती है।"
},
{
"subject": "Economy",
"topic": "Microeconomics",
"question_en": "What is the law of diminishing marginal utility?",
"question_hi": "जटिल उत्पादकता के कानून क्या है?",
"A_en": "As the quantity of a good increases, its price also increases", "A_hi": "एक वस्तु की मात्रा बढ़ती है तो उसकी कीमत भी बढ़ती है",
"B_en": "The additional benefit of a good decreases as more of it is consumed", "B_hi": "एक वस्तु का अतिरिक्त लाभ उसे अधिक उपभोग करने पर कम होता है",
"C_en": "The price of a good is determined by its demand and supply", "C_hi": "एक वस्तु की कीमत उसकी मांग और आपूर्ति द्वारा निर्धारित की जाती है",
"D_en": "The supply of a good is determined by its demand", "D_hi": "एक वस्तु की आपूर्ति उसकी मांग द्वारा निर्धारित की जाती है",
"answer": "B",
"explanation_en": "The law of diminishing marginal utility states that as the quantity of a good increases, the additional benefit of the good decreases.",
"explanation_hi": "जटिल उत्पादकता के कानून के अनुसार, एक वस्तु की मात्रा बढ़ती है तो उसका अतिरिक्त लाभ कम होता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the main advantage of free trade?",
"question_hi": "मुक्त व्यापार का मुख्य लाभ क्या है?",
"A_en": "Increased government revenue", "A_hi": "सरकारी आय का वृद्धि",
"B_en": "Increased economic growth", "B_hi": "आर्थिक विकास की वृद्धि",
"C_en": "Reduced trade barriers", "C_hi": "व्यापार की रुकावटों की कमी",
"D_en": "Increased unemployment", "D_hi": "बेरोजगारी की वृद्धि",
"answer": "C",
"explanation_en": "Free trade allows countries to trade goods and services without restrictions, which leads to increased economic growth and efficiency.",
"explanation_hi": "मुक्त व्यापार देशों को वस्तुओं और सेवाओं के व्यापार की अनुमति देता है बिना किसी रुकावट के, जिससे आर्थिक विकास और कार्यक्षमता में वृद्धि होती है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the primary tool of monetary policy?",
"question_hi": "आर्थिक नीति का प्राथमिक साधन क्या है?",
"A_en": "Fiscal policy", "A_hi": "वित्तीय नीति",
"B_en": "Monetary policy", "B_hi": "आर्थिक नीति",
"C_en": "Supply-side policy", "C_hi": "आपूर्ति पक्ष की नीति",
"D_en": "Demand-side policy", "D_hi": "मांग पक्ष की नीति",
"answer": "B",
"explanation_en": "Monetary policy is the primary tool of economic policy, used to control inflation, interest rates, and money supply.",
"explanation_hi": "आर्थिक नीति का प्राथमिक साधन है आर्थिक नीति, जिसका उपयोग वसूली, ब्याज दरों और पैसे की आपूर्ति नियंत्रित करने के लिए किया जाता है।"
},
{
"subject": "Economy",
"topic": "Growth and Development",
"question_en": "What is the concept of sustainable development?",
"question_hi": "स्थायी विकास का सिद्धांत क्या है?",
"A_en": "Developing countries should focus on industrialization", "A_hi": "विकासशील देशों को औद्योगीकरण पर ध्यान केंद्रित करना चाहिए",
"B_en": "Growth should be focused on economic development", "B_hi": "विकास का ध्यान अर्थव्यवस्था पर केंद्रित करना चाहिए",
"C_en": "Development should be sustainable and inclusive", "C_hi": "विकास स्थायी और समावेशी होना चाहिए",
"D_en": "Growth should be focused on technological advancement", "D_hi": "विकास का ध्यान तकनीकी उन्नति पर केंद्रित करना चाहिए",
"answer": "C",
"explanation_en": "Sustainable development is a concept that emphasizes the need for development to be environmentally, socially, and economically sustainable.",
"explanation_hi": "स्थायी विकास एक सिद्धांत है जो विकास को पर्यावरण, सामाजिक और आर्थिक दृष्टि से स्थायी बनाने पर जोर देता है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the main objective of fiscal policy?",
"question_hi": "वित्तीय नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To control inflation", "A_hi": "वसूली नियंत्रित करना",
"B_en": "To reduce unemployment", "B_hi": "रोजगार की दर कम करना",
"C_en": "To increase economic growth", "C_hi": "आर्थिक विकास बढ़ाना",
"D_en": "To reduce government debt", "D_hi": "सरकार के ऋण को कम करना",
"answer": "C",
"explanation_en": "The main objective of fiscal policy is to increase economic growth and stability through government spending and taxation.",
"explanation_hi": "वित्तीय नीति का मुख्य उद्देश्य सरकारी खर्च और करों के माध्यम से आर्थिक विकास और स्थिरता बढ़ाना है।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "What is public expenditure?",
"question_hi": "सार्वजनिक व्यय क्या है?",
"A_en": "Government spending on private sector", "A_hi": "सरकार का निजी क्षेत्र पर व्यय",
"B_en": "Government spending on public goods and services", "B_hi": "सरकार का सार्वजनिक सामान और सेवाओं पर व्यय",
"C_en": "Government revenue from private sector", "C_hi": "सरकार का निजी क्षेत्र से आय",
"D_en": "Government revenue from taxes", "D_hi": "सरकार का कर से आय",
"answer": "B",
"explanation_en": "Public expenditure refers to government spending on public goods and services, such as infrastructure, education, and healthcare.",
"explanation_hi": "सार्वजनिक व्यय सरकार के सार्वजनिक सामान और सेवाओं पर व्यय को संदर्भित करता है, जैसे कि अवसंरचना, शिक्षा और स्वास्थ्य सेवाएं।"
},
{
"subject": "Economy",
"topic": "Economic Indicators",
"question_en": "What is the Gross Domestic Product (GDP) of a country?",
"question_hi": "एक देश का सकल घरेलू उत्पाद (जीडीपी) क्या है?",
"A_en": "The total value of goods and services produced within the country", "A_hi": "देश के भीतर उत्पादित वस्तुओं और सेवाओं का कुल मूल्य",
"B_en": "The total value of imports and exports", "B_hi": "आयात और निर्यात का कुल मूल्य",
"C_en": "The total value of government revenue", "C_hi": "सरकार की आय का कुल मूल्य",
"D_en": "The total value of private sector spending", "D_hi": "निजी क्षेत्र के व्यय का कुल मूल्य",
"answer": "A",
"explanation_en": "GDP is a measure of the total value of goods and services produced within a country's borders, excluding international trade.",
"explanation_hi": "जीडीपी देश के भीतर उत्पादित वस्तुओं और सेवाओं के कुल मूल्य को मापता है, बिना अंतर्राष्ट्रीय व्यापार को शामिल किए।"
},
{
"subject": "Economy",
"topic": "Economic Cycles",
"question_en": "What is the business cycle?",
"question_hi": "व्यापार चक्र क्या है?",
"A_en": "The regular fluctuations in economic activity", "A_hi": "आर्थिक गतिविधि में नियमित उतार-चढ़ाव",
"B_en": "The movement of prices in an economy", "B_hi": "एक अर्थव्यवस्था में मूल्यों का गतिविधि",
"C_en": "The movement of employment in an economy", "C_hi": "एक अर्थव्यवस्था में रोजगार का गतिविधि",
"D_en": "The regular changes in economic policy", "D_hi": "आर्थिक नीति में नियमित परिवर्तन",
"answer": "A",
"explanation_en": "The business cycle refers to the regular fluctuations in economic activity, including expansion, contraction, and stagnation.",
"explanation_hi": "व्यापार चक्र आर्थिक गतिविधि में नियमित उतार-चढ़ाव को संदर्भित करता है, जिसमें विस्तार, संकुचन और गतिहीनता शामिल है।"
},
{
"subject": "Economy",
"topic": "Development Economics",
"question_en": "What is the concept of trickle-down theory?",
"question_hi": "ट्रिकल-डाउन सिद्धांत क्या है?",
"A_en": "The idea that economic growth benefits the poor", "A_hi": "विचार कि आर्थिक विकास गरीबों को लाभ पहुंचाता है",
"B_en": "The idea that economic growth benefits the rich", "B_hi": "विचार कि आर्थिक विकास अमीरों को लाभ पहुंचाता है",
"C_en": "The idea that economic growth benefits everyone equally", "C_hi": "विचार कि आर्थिक विकास सभी को समान रूप से लाभ पहुंचाता है",
"D_en": "The idea that economic growth is not beneficial for anyone", "D_hi": "विचार कि आर्थिक विकास किसी के लिए भी लाभकारी नहीं है",
"answer": "B",
"explanation_en": "The trickle-down theory suggests that economic growth primarily benefits the wealthy, with benefits trickling down to the poor over time.",
"explanation_hi": "ट्रिकल-डाउन सिद्धांत के अनुसार, आर्थिक विकास मुख्य रूप से अमीरों को लाभ पहुंचाता है, जिसके बाद समय के साथ गरीबों को भी लाभ पहुंचता है।"
}