[
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the main objective of the Monetary Policy in India?",
"question_hi": "भारत में मौद्रिक नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To control inflation", "A_hi": "मुद्रास्फीति को नियंत्रित करने के लिए",
"B_en": "To promote economic growth", "B_hi": "आर्थिक वृद्धि को बढ़ावा देने के लिए",
"C_en": "To maintain financial stability", "C_hi": "वित्तीय स्थिरता बनाए रखने के लिए",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The main objective of the Monetary Policy in India is to control inflation, promote economic growth, and maintain financial stability.",
"explanation_hi": "भारत में मौद्रिक नीति का मुख्य उद्देश्य मुद्रास्फीति को नियंत्रित करना, आर्थिक वृद्धि को बढ़ावा देना और वित्तीय स्थिरता बनाए रखना है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the significance of the Gross Domestic Product (GDP) in measuring the economic performance of a country?",
"question_hi": "किसी देश के आर्थिक प्रदर्शन को मापने में सकल घरेलू उत्पाद (जीडीपी) का क्या महत्व है?",
"A_en": "It measures the total value of goods and services produced within a country", "A_hi": "यह एक देश के भीतर उत्पादित वस्तुओं और सेवाओं के कुल मूल्य को मापता है",
"B_en": "It measures the total value of goods and services imported by a country", "B_hi": "यह एक देश द्वारा आयातित वस्तुओं और सेवाओं के कुल मूल्य को मापता है",
"C_en": "It measures the total value of goods and services exported by a country", "C_hi": "यह एक देश द्वारा निर्यातित वस्तुओं और सेवाओं के कुल मूल्य को मापता है",
"D_en": "It measures the total value of goods and services consumed by a country", "D_hi": "यह एक देश द्वारा उपभोगित वस्तुओं और सेवाओं के कुल मूल्य को मापता है",
"answer": "A",
"explanation_en": "The Gross Domestic Product (GDP) measures the total value of goods and services produced within a country, which is a significant indicator of a country's economic performance.",
"explanation_hi": "सकल घरेलू उत्पाद (जीडीपी) एक देश के भीतर उत्पादित वस्तुओं और सेवाओं के कुल मूल्य को मापता है, जो एक देश के आर्थिक प्रदर्शन का एक महत्वपूर्ण संकेतक है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the role of the Reserve Bank of India (RBI) in regulating the money supply in the economy?",
"question_hi": "आर्थिक व्यवस्था में मुद्रा आपूर्ति को नियंत्रित करने में भारतीय रिज़र्व बैंक (आरबीआई) की भूमिका क्या है?",
"A_en": "To increase the money supply", "A_hi": "मुद्रा आपूर्ति बढ़ाने के लिए",
"B_en": "To decrease the money supply", "B_hi": "मुद्रा आपूर्ति घटाने के लिए",
"C_en": "To regulate the money supply", "C_hi": "मुद्रा आपूर्ति को नियंत्रित करने के लिए",
"D_en": "To stabilize the foreign exchange rate", "D_hi": "विदेशी मुद्रा विनिमय दर को स्थिर करने के लिए",
"answer": "C",
"explanation_en": "The Reserve Bank of India (RBI) plays a crucial role in regulating the money supply in the economy by using various monetary policy tools such as repo rate, reverse repo rate, and cash reserve ratio.",
"explanation_hi": "भारतीय रिज़र्व बैंक (आरबीआई) मुद्रा आपूर्ति को नियंत्रित करने के लिए विभिन्न मौद्रिक नीति उपकरणों जैसे कि रेपो दर, रिवर्स रेपो दर और नकद आरक्षित अनुपात का उपयोग करके आर्थिक व्यवस्था में मुद्रा आपूर्ति को नियंत्रित करने में एक महत्वपूर्ण भूमिका निभाता है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the concept of fiscal deficit, and how does it affect the economy?",
"question_hi": "राजकोषीय घाटा की अवधारणा क्या है, और यह अर्थव्यवस्था पर कैसे प्रभाव डालता है?",
"A_en": "It is the difference between the government's revenue and expenditure", "A_hi": "यह सरकार की आय और व्यय के बीच का अंतर है",
"B_en": "It is the total amount of government debt", "B_hi": "यह सरकार के कुल ऋण की राशि है",
"C_en": "It is the amount of money borrowed by the government from foreign countries", "C_hi": "यह विदेशी देशों से सरकार द्वारा उधार ली गई राशि है",
"D_en": "It is the amount of money invested by the government in infrastructure projects", "D_hi": "यह सरकार द्वारा बुनियादी ढांचे परियोजनाओं में निवेश की गई राशि है",
"answer": "A",
"explanation_en": "The fiscal deficit is the difference between the government's revenue and expenditure, and it can affect the economy by increasing the demand for loanable funds, leading to higher interest rates and reduced private investment.",
"explanation_hi": "राजकोषीय घाटा सरकार की आय और व्यय के बीच का अंतर है, और यह अर्थव्यवस्था पर उधार के लिए धन की मांग बढ़ाकर, ब्याज दरों में वृद्धि और निजी निवेश में कमी के कारण प्रभाव डाल सकता है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the purpose of the Union Budget, and how is it prepared?",
"question_hi": "केंद्रीय बजट का उद्देश्य क्या है, और यह कैसे तैयार किया जाता है?",
"A_en": "To allocate funds for various government schemes and programs", "A_hi": "विभिन्न सरकारी योजनाओं और कार्यक्रमों के लिए धन आवंटित करने के लिए",
"B_en": "To reduce the fiscal deficit", "B_hi": "राजकोषीय घाटा कम करने के लिए",
"C_en": "To increase the tax revenue", "C_hi": "कर राजस्व बढ़ाने के लिए",
"D_en": "To promote economic growth and development", "D_hi": "आर्थिक वृद्धि और विकास को बढ़ावा देने के लिए",
"answer": "A",
"explanation_en": "The Union Budget is prepared by the Ministry of Finance, and its purpose is to allocate funds for various government schemes and programs, as well as to promote economic growth and development.",
"explanation_hi": "केंद्रीय बजट वित्त मंत्रालय द्वारा तैयार किया जाता है, और इसका उद्देश्य विभिन्न सरकारी योजनाओं और कार्यक्रमों के लिए धन आवंटित करना है, साथ ही आर्थिक वृद्धि और विकास को बढ़ावा देना है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the concept of inflation, and how does it affect the economy?",
"question_hi": "मुद्रास्फीति की अवधारणा क्या है, और यह अर्थव्यवस्था पर कैसे प्रभाव डालती है?",
"A_en": "It is the rate at which prices of goods and services are increasing", "A_hi": "यह वस्तुओं और सेवाओं की कीमतों में वृद्धि की दर है",
"B_en": "It is the rate at which the value of money is decreasing", "B_hi": "यह पैसे के मूल्य में कमी की दर है",
"C_en": "It is the rate at which the economy is growing", "C_hi": "यह अर्थव्यवस्था की वृद्धि दर है",
"D_en": "It is the rate at which the unemployment rate is decreasing", "D_hi": "यह बेरोजगारी दर में कमी की दर है",
"answer": "A",
"explanation_en": "Inflation is the rate at which prices of goods and services are increasing, and it can affect the economy by reducing the purchasing power of consumers, increasing the cost of production, and leading to uncertainty and instability in the market.",
"explanation_hi": "मुद्रास्फीति वस्तुओं और सेवाओं की कीमतों में वृद्धि की दर है, और यह अर्थव्यवस्था पर उपभोक्ताओं की क्रय शक्ति को कम करके, उत्पादन की लागत बढ़ाकर, और बाजार में अनिश्चितता और अस्थिरता पैदा करके प्रभाव डाल सकती है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the role of the government in promoting economic growth and development?",
"question_hi": "आर्थिक वृद्धि और विकास को बढ़ावा देने में सरकार की भूमिका क्या है?",
"A_en": "To provide infrastructure and public services", "A_hi": "बुनियादी ढांचे और सार्वजनिक सेवाएं प्रदान करने के लिए",
"B_en": "To regulate the market and protect the environment", "B_hi": "बाजार को नियंत्रित करने और पर्यावरण की रक्षा करने के लिए",
"C_en": "To promote foreign investment and trade", "C_hi": "विदेशी निवेश और व्यापार को बढ़ावा देने के लिए",
"D_en": "To provide social welfare programs and subsidies", "D_hi": "सामाजिक कल्याण कार्यक्रम और सब्सिडी प्रदान करने के लिए",
"answer": "A",
"explanation_en": "The government plays a crucial role in promoting economic growth and development by providing infrastructure and public services, regulating the market, promoting foreign investment and trade, and providing social welfare programs and subsidies.",
"explanation_hi": "सरकार बुनियादी ढांचे और सार्वजनिक सेवाएं प्रदान करके, बाजार को नियंत्रित करके, विदेशी निवेश और व्यापार को बढ़ावा देकर, और सामाजिक कल्याण कार्यक्रम और सब्सिडी प्रदान करके आर्थिक वृद्धि और विकास को बढ़ावा देने में एक महत्वपूर्ण भूमिका निभाती है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the concept of poverty, and how is it measured in India?",
"question_hi": "गरीबी की अवधारणा क्या है, और यह भारत में कैसे मापी जाती है?",
"A_en": "It is the state of being unable to meet basic needs", "A_hi": "यह मूलभूत जरूरतों को पूरा करने में असमर्थ होने की स्थिति है",
"B_en": "It is the state of being unemployed", "B_hi": "यह बेरोजगार होने की स्थिति है",
"C_en": "It is the state of being illiterate", "C_hi": "यह निरक्षर होने की स्थिति है",
"D_en": "It is the state of being homeless", "D_hi": "यह बेघर होने की स्थिति है",
"answer": "A",
"explanation_en": "Poverty is the state of being unable to meet basic needs, and it is measured in India using the poverty line, which is the minimum level of income required to meet basic needs.",
"explanation_hi": "गरीबी मूलभूत जरूरतों को पूरा करने में असमर्थ होने की स्थिति है, और यह भारत में गरीबी रेखा का उपयोग करके मापी जाती है, जो मूलभूत जरूरतों को पूरा करने के लिए आवश्यक न्यूनतम आय स्तर है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the role of the private sector in the Indian economy?",
"question_hi": "भारतीय अर्थव्यवस्था में निजी क्षेत्र की भूमिका क्या है?",
"A_en": "To provide employment opportunities", "A_hi": "रोजगार के अवसर प्रदान करने के लिए",
"B_en": "To promote economic growth and development", "B_hi": "आर्थिक वृद्धि और विकास को बढ़ावा देने के लिए",
"C_en": "To provide infrastructure and public services", "C_hi": "बुनियादी ढांचे और सार्वजनिक सेवाएं प्रदान करने के लिए",
"D_en": "To regulate the market and protect the environment", "D_hi": "बाजार को नियंत्रित करने और पर्यावरण की रक्षा करने के लिए",
"answer": "B",
"explanation_en": "The private sector plays a crucial role in the Indian economy by promoting economic growth and development, providing employment opportunities, and contributing to the country's GDP.",
"explanation_hi": "निजी क्षेत्र भारतीय अर्थव्यवस्था में आर्थिक वृद्धि और विकास को बढ़ावा देने, रोजगार के अवसर प्रदान करने, और देश के जीडीपी में योगदान करके एक महत्वपूर्ण भूमिका निभाता है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the concept of economic liberalization, and how has it affected the Indian economy?",
"question_hi": "आर्थिक उदारीकरण की अवधारणा क्या है, और यह भारतीय अर्थव्यवस्था पर कैसे प्रभाव डाल रहा है?",
"A_en": "It is the process of removing trade barriers and opening up the economy to foreign investment", "A_hi": "यह व्यापार बाधाओं को हटाने और अर्थव्यवस्था को विदेशी निवेश के लिए खोलने की प्रक्रिया है",
"B_en": "It is the process of nationalizing key sectors of the economy", "B_hi": "यह अर्थव्यवस्था के महत्वपूर्ण क्षेत्रों को राष्ट्रीयकरण करने की प्रक्रिया है",
"C_en": "It is the process of increasing government control over the economy", "C_hi": "यह अर्थव्यवस्था पर सरकार के नियंत्रण को बढ़ाने की प्रक्रिया है",
"D_en": "It is the process of reducing government expenditure", "D_hi": "यह सरकारी व्यय को कम करने की प्रक्रिया है",
"answer": "A",
"explanation_en": "Economic liberalization is the process of removing trade barriers and opening up the economy to foreign investment, and it has affected the Indian economy by increasing foreign investment, promoting economic growth, and improving the country's competitiveness.",
"explanation_hi": "आर्थिक उदारीकरण व्यापार बाधाओं को हटाने और अर्थव्यवस्था को विदेशी निवेश के लिए खोलने की प्रक्रिया है, और यह भारतीय अर्थव्यवस्था पर विदेशी निवेश बढ़ाकर, आर्थिक वृद्धि को बढ़ावा देकर, और देश की प्रतिस्पर्धा को बेहतर बनाकर प्रभाव डाल रहा है।"
}
]