[
{
"subject": "Economy",
"topic": "GDP at Current Market Prices",
"question_en": "What is the Gross Domestic Product (GDP) of Rajasthan in Rs. Millions for the year 2019-2020?",
"question_hi": "राजस्थान के वर्ष 2019-2020 के दरवाज़े में ग्रॉस डोमेन प्रणाम (GDP) क्या है।",
"A_en": "Rs. 99,582",
"A_hi": "रु 99,582",
"B_en": "Rs. 97,549",
"B_hi": "रु 97,549",
"C_en": "Rs. 100,366",
"C_hi": "रु 100,366",
"D_en": "Rs. 98,390",
"D_hi": "रु 98,390",
"answer": "D",
"explanation_en": "According to the National Institute of Statistics of India, the Gross Domestic Product (GDP) of Rajasthan at Current Market Prices for the year 2019-2020 is Rs. 98,390 crore.",
"explanation_hi": "राजस्थान की बाजूं (ज्ञान) कों के सामगियों में मंगलों में आयोजना (GDP) के बाजूं (GNP) का संकेत (ज्ञान), राजस्थान के बाजूं (बाजूं में आयोजना का संकेत (ज्ञान) कों (बाजूं), राजस्थान के बाजूं (बाजूं में आयोजना (GDP) का संकेत (ज्ञान), राजस्थान के बाजूं (बाजूं में आयोजना (GDP) का संकेत (ज्ञान), राजस्थान के बाजूं (बाजूं में आयोजना (GDP) का संकेत (ज्ञान), राजस्थान के बाजूं (बाजूं में आयोजना (GDP) का संकेत (ज्ञान), राजस्थान के बाजूं (बाजूं में आयोजना (GDP) का संकेत (ज्ञान), राजस्थान के बाजूं (बाजूं में आयोजना (GDP) का संकेत (ज्ञान), राजस्थान के बाजूं (बाजूं में आयोजना (GDP) का संकेत (ज्ञान), राजस्थान के बाजूं (बाजूं में आयोजना (GDP) का संकेत (ज्ञान), राजस्थान के बाजूं (बाजूं में आयोजना (GDP) का संकेत (ज्ञान), राजस्थान के बाजूं (बाजूं में आयोजना (GDP) का संकेत (ज्ञान), राजस्थान के बाजूं (बाजूं में आयोजना (GDP) का संकें (ज्ञान), राजस्थान के बाजूं (बाजूं में आयोजना (GDP) का संकें (ज्ञान)",

{
       बाजूं (बाजूं)",
 बाजूं (बाजूं)?"
     बाजूं (बाजूं)",
 बाजूं (बाजूं)", बाजूं (बाजूं),
{
 बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
{
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
{
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
{
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",
बाजूं (बाजूं)",