[
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the term for the total value of all final goods and services produced within a country's borders over a specific time period?",
"question_hi": "किसी देश की सीमा के भीतर एक निश्चित समय अवधि में उत्पादित सभी अंतिम वस्तुओं और सेवाओं के कुल मूल्य के लिए शब्द क्या है?",
"A_en": "Gross Domestic Product (GDP)", "A_hi": "सकल घरेलू उत्पाद (जीडीपी)",
"B_en": "Net Domestic Product (NDP)", "B_hi": "शुद्ध घरेलू उत्पाद (एनडीपी)",
"C_en": "National Income", "C_hi": "राष्ट्रीय आय",
"D_en": "Per Capita Income", "D_hi": "प्रति व्यक्ति आय",
"answer": "A",
"explanation_en": "GDP is the total value of all final goods and services produced within a country's borders over a specific time period.",
"explanation_hi": "जीडीपी एक निश्चित समय अवधि में किसी देश की सीमा के भीतर उत्पादित सभी अंतिम वस्तुओं और सेवाओं का कुल मूल्य है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the term for a sustained increase in the general price level of goods and services in an economy over a period of time?",
"question_hi": "एक अर्थव्यवस्था में एक निश्चित समय अवधि में वस्तुओं और सेवाओं की सामान्य मूल्य स्तर में लगातार वृद्धि के लिए शब्द क्या है?",
"A_en": "Deflation", "A_hi": "मुद्रास्फीति की कमी",
"B_en": "Disinflation", "B_hi": "मुद्रास्फीति में कमी",
"C_en": "Inflation", "C_hi": "मुद्रास्फीति",
"D_en": "Stagflation", "D_hi": "मंदी के साथ मुद्रास्फीति",
"answer": "C",
"explanation_en": "Inflation is a sustained increase in the general price level of goods and services in an economy over a period of time.",
"explanation_hi": "मुद्रास्फीति एक अर्थव्यवस्था में एक निश्चित समय अवधि में वस्तुओं और सेवाओं की सामान्य मूल्य स्तर में लगातार वृद्धि है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the term for the use of government spending and taxation to influence the overall level of economic activity?",
"question_hi": "सरकारी खर्च और करों का उपयोग करके आर्थिक गतिविधि के समग्र स्तर को प्रभावित करने के लिए शब्द क्या है?",
"A_en": "Monetary Policy", "A_hi": "मौद्रिक नीति",
"B_en": "Fiscal Policy", "B_hi": "राजकोषीय नीति",
"C_en": "Supply-Side Policy", "C_hi": "आपूर्ति-पक्ष नीति",
"D_en": "Demand-Side Policy", "D_hi": "मांग-पक्ष नीति",
"answer": "B",
"explanation_en": "Fiscal policy is the use of government spending and taxation to influence the overall level of economic activity.",
"explanation_hi": "राजकोषीय नीति सरकारी खर्च और करों का उपयोग करके आर्थिक गतिविधि के समग्र स्तर को प्रभावित करने के लिए की जाती है।"
},
{
"subject": "Economy",
"topic": "Poverty",
"question_en": "What is the term for the state of being unable to meet basic needs such as food, shelter, and clothing?",
"question_hi": "भोजन, आश्रय और कपड़ों जैसी मूलभूत आवश्यकताओं को पूरा करने में असमर्थता की स्थिति के लिए शब्द क्या है?",
"A_en": "Absolute Poverty", "A_hi": "पूर्ण गरीबी",
"B_en": "Relative Poverty", "B_hi": "सापेक्ष गरीबी",
"C_en": "Income Inequality", "C_hi": "आय असमानता",
"D_en": "Unemployment", "D_hi": "बेरोजगारी",
"answer": "A",
"explanation_en": "Absolute poverty refers to the state of being unable to meet basic needs such as food, shelter, and clothing.",
"explanation_hi": "पूर्ण गरीबी भोजन, आश्रय और कपड़ों जैसी मूलभूत आवश्यकताओं को पूरा करने में असमर्थता की स्थिति को संदर्भित करती है।"
},
{
"subject": "Economy",
"topic": "Economic Growth",
"question_en": "What is the term for an increase in the production of goods and services in an economy over a period of time?",
"question_hi": "एक निश्चित समय अवधि में एक अर्थव्यवस्था में वस्तुओं और सेवाओं के उत्पादन में वृद्धि के लिए शब्द क्या है?",
"A_en": "Economic Decline", "A_hi": "आर्थिक पतन",
"B_en": "Economic Stagnation", "B_hi": "आर्थिक स्थिरता",
"C_en": "Economic Growth", "C_hi": "आर्थिक विकास",
"D_en": "Economic Fluctuation", "D_hi": "आर्थिक उतार-चढ़ाव",
"answer": "C",
"explanation_en": "Economic growth refers to an increase in the production of goods and services in an economy over a period of time.",
"explanation_hi": "आर्थिक विकास एक निश्चित समय अवधि में एक अर्थव्यवस्था में वस्तुओं और सेवाओं के उत्पादन में वृद्धि को संदर्भित करता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the term for the exchange of goods and services between countries?",
"question_hi": "देशों के बीच वस्तुओं और सेवाओं के आदान-प्रदान के लिए शब्द क्या है?",
"A_en": "International Finance", "A_hi": "अंतर्राष्ट्रीय वित्त",
"B_en": "International Trade", "B_hi": "अंतर्राष्ट्रीय व्यापार",
"C_en": "Globalization", "C_hi": "वैश्वीकरण",
"D_en": "Protectionism", "D_hi": "संरक्षणवाद",
"answer": "B",
"explanation_en": "International trade refers to the exchange of goods and services between countries.",
"explanation_hi": "अंतर्राष्ट्रीय व्यापार देशों के बीच वस्तुओं और सेवाओं के आदान-प्रदान को संदर्भित करता है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the term for the actions taken by a central bank to control the money supply and interest rates in an economy?",
"question_hi": "एक अर्थव्यवस्था में मुद्रा आपूर्ति और ब्याज दरों को नियंत्रित करने के लिए एक केंद्रीय बैंक द्वारा की गई कार्रवाइयों के लिए शब्द क्या है?",
"A_en": "Fiscal Policy", "A_hi": "राजकोषीय नीति",
"B_en": "Monetary Policy", "B_hi": "मौद्रिक नीति",
"C_en": "Supply-Side Policy", "C_hi": "आपूर्ति-पक्ष नीति",
"D_en": "Demand-Side Policy", "D_hi": "मांग-पक्ष नीति",
"answer": "B",
"explanation_en": "Monetary policy refers to the actions taken by a central bank to control the money supply and interest rates in an economy.",
"explanation_hi": "मौद्रिक नीति एक अर्थव्यवस्था में मुद्रा आपूर्ति और ब्याज दरों को नियंत्रित करने के लिए एक केंद्रीय बैंक द्वारा की गई कार्रवाइयों को संदर्भित करती है।"
},
{
"subject": "Economy",
"topic": "Human Development",
"question_en": "What is the term for the process of improving the well-being and quality of life of individuals and communities?",
"question_hi": "व्यक्तियों और समुदायों के कल्याण और जीवन की गुणवत्ता में सुधार की प्रक्रिया के लिए शब्द क्या है?",
"A_en": "Economic Growth", "A_hi": "आर्थिक विकास",
"B_en": "Human Development", "B_hi": "मानव विकास",
"C_en": "Poverty Reduction", "C_hi": "गरीबी कम करना",
"D_en": "Income Inequality", "D_hi": "आय असमानता",
"answer": "B",
"explanation_en": "Human development refers to the process of improving the well-being and quality of life of individuals and communities.",
"explanation_hi": "मानव विकास व्यक्तियों और समुदायों के कल्याण और जीवन की गुणवत्ता में सुधार की प्रक्रिया को संदर्भित करता है।"
},
{
"subject": "Economy",
"topic": "Economic Systems",
"question_en": "What is the term for the way in which a society organizes its economic activities, including the production, distribution, and exchange of goods and services?",
"question_hi": "एक समाज अपनी आर्थिक गतिविधियों को कैसे व्यवस्थित करता है, जिसमें वस्तुओं और सेवाओं का उत्पादन, वितरण और आदान-प्रदान शामिल है?",
"A_en": "Market Economy", "A_hi": "बाजार अर्थव्यवस्था",
"B_en": "Command Economy", "B_hi": "आदेश अर्थव्यवस्था",
"C_en": "Mixed Economy", "C_hi": "मिश्रित अर्थव्यवस्था",
"D_en": "Economic System", "D_hi": "आर्थिक प्रणाली",
"answer": "D",
"explanation_en": "An economic system refers to the way in which a society organizes its economic activities, including the production, distribution, and exchange of goods and services.",
"explanation_hi": "एक आर्थिक प्रणाली एक समाज द्वारा अपनी आर्थिक गतिविधियों को व्यवस्थित करने के तरीके को संदर्भित करती है, जिसमें वस्तुओं और सेवाओं का उत्पादन, वितरण और आदान-प्रदान शामिल है।"
},
{
"subject": "Economy",
"topic": "Globalization",
"question_en": "What is the term for the increasing integration of the world's economies, cultures, and societies through the free flow of goods, services, and ideas?",
"question_hi": "वस्तुओं, सेवाओं और विचारों के मुक्त प्रवाह के माध्यम से विश्व की अर्थव्यवस्थाओं, संस्कृतियों और समाजों के बढ़ते एकीकरण के लिए शब्द क्या है?",
"A_en": "Globalization", "A_hi": "वैश्वीकरण",
"B_en": "International Trade", "B_hi": "अंतर्राष्ट्रीय व्यापार",
"C_en": "Economic Integration", "C_hi": "आर्थिक एकीकरण",
"D_en": "Cultural Exchange", "D_hi": "सांस्कृतिक आदान-प्रदान",
"answer": "A",
"explanation_en": "Globalization refers to the increasing integration of the world's economies, cultures, and societies through the free flow of goods, services, and ideas.",
"explanation_hi": "वैश्वीकरण वस्तुओं, सेवाओं और विचारों के मुक्त प्रवाह के माध्यम से विश्व की अर्थव्यवस्थाओं, संस्कृतियों और समाजों के बढ़ते एकीकरण को संदर्भित करता है।"
}
]