[
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the term for the total value of all final goods and services produced within a country's borders in a given year?",
"question_hi": "किसी देश की सीमा के भीतर एक वर्ष में उत्पादित सभी अंतिम वस्तुओं और सेवाओं के कुल मूल्य को क्या कहा जाता है?",
"A_en": "GDP", "A_hi": "जीडीपी",
"B_en": "GNP", "B_hi": "जीएनपी",
"C_en": "NDP", "C_hi": "एनडीपी",
"D_en": "NNP", "D_hi": "एनएनपी",
"answer": "A",
"explanation_en": "GDP stands for Gross Domestic Product, which is the total value of all final goods and services produced within a country's borders in a given year.",
"explanation_hi": "जीडीपी का अर्थ है सकल घरेलू उत्पाद, जो किसी देश की सीमा के भीतर एक वर्ष में उत्पादित सभी अंतिम वस्तुओं और सेवाओं का कुल मूल्य है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the term for a sustained increase in the general price level of goods and services in an economy?",
"question_hi": "किसी अर्थव्यवस्था में वस्तुओं और सेवाओं की सामान्य कीमत स्तर में लगातार वृद्धि को क्या कहा जाता है?",
"A_en": "Deflation", "A_hi": "डिफ्लेशन",
"B_en": "Disinflation", "B_hi": "डिसइन्फ्लेशन",
"C_en": "Inflation", "C_hi": "इन्फ्लेशन",
"D_en": "Stagflation", "D_hi": "स्टैग्फ्लेशन",
"answer": "C",
"explanation_en": "Inflation is a sustained increase in the general price level of goods and services in an economy, resulting in a decrease in the purchasing power of money.",
"explanation_hi": "इन्फ्लेशन एक अर्थव्यवस्था में वस्तुओं और सेवाओं की सामान्य कीमत स्तर में लगातार वृद्धि है, जिसके परिणामस्वरूप धन की क्रय शक्ति में कमी आती है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the term for the use of government spending and taxation to influence the overall level of economic activity?",
"question_hi": "सरकारी व्यय और कराधान का उपयोग करके आर्थिक गतिविधि के समग्र स्तर को प्रभावित करने की प्रक्रिया क्या कहा जाता है?",
"A_en": "Monetary Policy", "A_hi": "मौद्रिक नीति",
"B_en": "Fiscal Policy", "B_hi": "राजकोषीय नीति",
"C_en": "Supply-Side Economics", "C_hi": "आपूर्ति-पक्ष अर्थशास्त्र",
"D_en": "Demand-Side Economics", "D_hi": "मांग-पक्ष अर्थशास्त्र",
"answer": "B",
"explanation_en": "Fiscal policy refers to the use of government spending and taxation to influence the overall level of economic activity, with the goal of promoting economic growth, stability, and full employment.",
"explanation_hi": "राजकोषीय नीति सरकारी व्यय और कराधान का उपयोग करके आर्थिक गतिविधि के समग्र स्तर को प्रभावित करने की प्रक्रिया है, जिसका उद्देश्य आर्थिक विकास, स्थिरता और पूर्ण रोजगार को बढ़ावा देना है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the term for a trade agreement in which a country reduces or eliminates tariffs and other trade barriers with another country?",
"question_hi": "किसी देश द्वारा किसी अन्य देश के साथ शुल्क और अन्य व्यापार बाधाओं को कम करने या समाप्त करने के लिए एक व्यापार समझौते को क्या कहा जाता है?",
"A_en": "Free Trade Agreement", "A_hi": "मुक्त व्यापार समझौता",
"B_en": "Preferential Trade Agreement", "B_hi": "वरीयता व्यापार समझौता",
"C_en": "Customs Union", "C_hi": "सीमा शुल्क संघ",
"D_en": "Common Market", "D_hi": "सामान्य बाजार",
"answer": "A",
"explanation_en": "A free trade agreement is a trade agreement in which a country reduces or eliminates tariffs and other trade barriers with another country, with the goal of increasing trade and economic cooperation between the two countries.",
"explanation_hi": "मुक्त व्यापार समझौता एक व्यापार समझौता है जिसमें एक देश किसी अन्य देश के साथ शुल्क और अन्य व्यापार बाधाओं को कम करता है या समाप्त करता है, जिसका उद्देश्य दोनों देशों के बीच व्यापार और आर्थिक सहयोग को बढ़ाना है।"
},
{
"subject": "Economy",
"topic": "Economic Systems",
"question_en": "What is the term for an economic system in which the means of production are owned and controlled by the state?",
"question_hi": "किसी आर्थिक प्रणाली में उत्पादन के साधन राज्य द्वारा स्वामित्व और नियंत्रित होते हैं, उसे क्या कहा जाता है?",
"A_en": "Capitalism", "A_hi": "पूंजीवाद",
"B_en": "Socialism", "B_hi": "साम्यवाद",
"C_en": "Communism", "C_hi": "साम्यवाद",
"D_en": "Mixed Economy", "D_hi": "मिश्रित अर्थव्यवस्था",
"answer": "B",
"explanation_en": "Socialism is an economic system in which the means of production are owned and controlled by the state, with the goal of promoting social welfare and reducing economic inequality.",
"explanation_hi": "साम्यवाद एक आर्थिक प्रणाली है जिसमें उत्पादन के साधन राज्य द्वारा स्वामित्व और नियंत्रित होते हैं, जिसका उद्देश्य सामाजिक कल्याण को बढ़ावा देना और आर्थिक असमानता को कम करना है।"
},
{
"subject": "Economy",
"topic": "Money and Banking",
"question_en": "What is the term for a financial institution that accepts deposits and makes loans to individuals and businesses?",
"question_hi": "किसी वित्तीय संस्थान को क्या कहा जाता है जो जमा स्वीकार करता है और व्यक्तियों और व्यवसायों को ऋण प्रदान करता है?",
"A_en": "Central Bank", "A_hi": "केंद्रीय बैंक",
"B_en": "Commercial Bank", "B_hi": "वाणिज्यिक बैंक",
"C_en": "Investment Bank", "C_hi": "निवेश बैंक",
"D_en": "Insurance Company", "D_hi": "बीमा कंपनी",
"answer": "B",
"explanation_en": "A commercial bank is a financial institution that accepts deposits and makes loans to individuals and businesses, providing a range of financial services to its customers.",
"explanation_hi": "वाणिज्यिक बैंक एक वित्तीय संस्थान है जो जमा स्वीकार करता है और व्यक्तियों और व्यवसायों को ऋण प्रदान करता है, जो अपने ग्राहकों को विभिन्न वित्तीय सेवाएं प्रदान करता है।"
},
{
"subject": "Economy",
"topic": "Economic Growth",
"question_en": "What is the term for a sustained increase in the production of goods and services in an economy over a long period of time?",
"question_hi": "एक लंबे समय तक एक अर्थव्यवस्था में वस्तुओं और सेवाओं के उत्पादन में लगातार वृद्धि को क्या कहा जाता है?",
"A_en": "Economic Stagnation", "A_hi": "आर्थिक स्थिरता",
"B_en": "Economic Decline", "B_hi": "आर्थिक पतन",
"C_en": "Economic Growth", "C_hi": "आर्थिक विकास",
"D_en": "Economic Fluctuation", "D_hi": "आर्थिक उतार-चढ़ाव",
"answer": "C",
"explanation_en": "Economic growth refers to a sustained increase in the production of goods and services in an economy over a long period of time, resulting in an increase in the standard of living and economic well-being of a country's citizens.",
"explanation_hi": "आर्थिक विकास एक लंबे समय तक एक अर्थव्यवस्था में वस्तुओं और सेवाओं के उत्पादन में लगातार वृद्धि को संदर्भित करता है, जिसके परिणामस्वरूप जीवन स्तर और आर्थिक कल्याण में वृद्धि होती है।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "What is the term for the study of the role of government in the economy, including taxation, public expenditure, and public debt?",
"question_hi": "किसी अर्थव्यवस्था में सरकार की भूमिका का अध्ययन, जिसमें कराधान, सार्वजनिक व्यय और सार्वजनिक ऋण शामिल है, उसे क्या कहा जाता है?",
"A_en": "Private Finance", "A_hi": "निजी वित्त",
"B_en": "Corporate Finance", "B_hi": "कॉर्पोरेट वित्त",
"C_en": "Public Finance", "C_hi": "सार्वजनिक वित्त",
"D_en": "International Finance", "D_hi": "अंतर्राष्ट्रीय वित्त",
"answer": "C",
"explanation_en": "Public finance is the study of the role of government in the economy, including taxation, public expenditure, and public debt, with the goal of understanding how government policies affect the economy and the well-being of citizens.",
"explanation_hi": "सार्वजनिक वित्त एक अर्थव्यवस्था में सरकार की भूमिका का अध्ययन है, जिसमें कराधान, सार्वजनिक व्यय और सार्वजनिक ऋण शामिल है, जिसका उद्देश्य यह समझना है कि सरकारी नीतियां अर्थव्यवस्था और नागरिकों के कल्याण को कैसे प्रभावित करती हैं।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the term for a trade agreement in which a country agrees to reduce or eliminate tariffs and other trade barriers with multiple countries?",
"question_hi": "किसी देश द्वारा कई देशों के साथ शुल्क और अन्य व्यापार बाधाओं को कम करने या समाप्त करने के लिए एक व्यापार समझौते को क्या कहा जाता है?",
"A_en": "Bilateral Trade Agreement", "A_hi": "द्विपक्षीय व्यापार समझौता",
"B_en": "Multilateral Trade Agreement", "B_hi": "बहुपक्षीय व्यापार समझौता",
"C_en": "Free Trade Area", "C_hi": "मुक्त व्यापार क्षेत्र",
"D_en": "Customs Union", "D_hi": "सीमा शुल्क संघ",
"answer": "B",
"explanation_en": "A multilateral trade agreement is a trade agreement in which a country agrees to reduce or eliminate tariffs and other trade barriers with multiple countries, with the goal of increasing trade and economic cooperation among the participating countries.",
"explanation_hi": "बहुपक्षीय व्यापार समझौता एक व्यापार समझौता है जिसमें एक देश कई देशों के साथ शुल्क और अन्य व्यापार बाधाओं को कम करने या समाप्त करने के लिए सहमत होता है, जिसका उद्देश्य भाग लेने वाले देशों के बीच व्यापार और आर्थिक सहयोग को बढ़ाना है।"
},
{
"subject": "Economy",
"topic": "Economic Systems",
"question_en": "What is the term for an economic system in which the means of production are owned and controlled by private individuals and businesses?",
"question_hi": "किसी आर्थिक प्रणाली में उत्पादन के साधन निजी व्यक्तियों और व्यवसायों द्वारा स्वामित्व और नियंत्रित होते हैं, उसे क्या कहा जाता है?",
"A_en": "Socialism", "A_hi": "साम्यवाद",
"B_en": "Communism", "B_hi": "साम्यवाद",
"C_en": "Capitalism", "C_hi": "पूंजीवाद",
"D_en": "Mixed Economy", "D_hi": "मिश्रित अर्थव्यवस्था",
"answer": "C",
"explanation_en": "Capitalism is an economic system in which the means of production are owned and controlled by private individuals and businesses, with the goal of maximizing profits and promoting economic growth.",
"explanation_hi": "पूंजीवाद एक आर्थिक प्रणाली है जिसमें उत्पादन के साधन निजी व्यक्तियों और व्यवसायों द्वारा स्वामित्व और नियंत्रित होते हैं, जिसका उद्देश्य लाभ को अधिकतम करना और आर्थिक विकास को बढ़ावा देना है।"
}
]