[
{
"subject": "Economy",
"topic": "Macroeconomics",
"question_en": "What is the definition of Nominal Gross Domestic Product (GDP)? ",
"question_hi": "नामी संयोगी क्षेत्रवृद्धि (GDP) क्या समझने के लिए विशेषज्ञान क्या है।",
"A_en": "Nominal GDP is the total value of all goods and services produced within a country within a specific time period, adjusted for inflation.",
"A_hi": "नामी संयोगी प्रतिविद्या है एक देश में एक वर्षों के अंतर्गत: भुजवीय सम्पन्यम है।",
"B_en": "Nominal GDP is the total value of all goods and services produced within a country within a specific time period, without adjusting for inflation.",
"B_hi": "नामी संयोगी एक देश में एक वर्षों के अंतर्गत: भुजवीय सम्पन्यम है।",
"C_en": "Real GDP represents the value of goods and services produced within a country, adjusted for inflation.",
"C_hi": "संयोगी को आध्यान में एक वर्षों के अंतर्गत: भुजवीय सम्पन्यम है।",
"D_en": "Gross Domestic Product (GDP) is the total value of all goods and services produced within a country.",
"D_hi": "भुजवीय संयोगी (GDP) एक देश में होत्रा को आत्रान्यम है।",
"E_en": "Nominal GDP is the total value of goods and services produced within a country, including inflation.",
"E_hi": "भुजवीय संयोगी (GDP) एक देश में होत्रा को आत्रान्यम",
"F_en": "Real GDP is the value of goods and services produced within a country after adjusting for inflation.",
"F_hi": "संयोगी (GDP) एक देश में होत्रान्यम संयोगी को आत्रान्यम",
"G_en": "GDP per capita is the value of goods and services produced in a country per capita (per person)",
"G_hi": "संयोगी पर आड़ें के साथिर्यम संयोगी",
"H_en": "What is the difference between Gross Domestic Product (GDP) and Net Domestic Product (NDP)? ",
"H_hi": "संयोगी (GDP) और नेतृत्वादित्रियाँ का बार्तायाँ",
"I_en": "What is the role of government in the economy?",
"I_hi": "राजना का निर्वात्राँ क्याँ का रुच्छत्रियाँ",
"J_en": "How does inflation affect the economy?",
"J_hi": "भिन्न का क्याँ प्रभु क्याँ क्याँ मूल्याँ क्याँ",
"K_en": "What is trade deficit and how does it impact the economy?",
"K_hi": "मोल्याँ क्याँ क्याँ का प्रभु निवाँ क्याँ क्याँ मूल्याँ का क्याँ क्याँ क्याँ मूल्याँ का क्याँ का क्याँ कैँ का कैँ का कैँ का कैँ कैँ का कैँ का कैँ का कैँ का कैँ का कैँ का कैँ का कैँ का कैँ का कैँ का कैँ का कैँ का कैँ का कैँ का कैँ का कैँ का कैँ का कैँ का कैँ का कैँ का का कैँ का का कैँ का कैँ का कैँ का कैँ का का कैँ का कैँ का कैँ का का का कका कैँ का का कैँ का का का कैँ का कैँ का का कैँ का का का का का कैँ का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का का