[
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the main objective of the Monetary Policy of India?",
"question_hi": "भारत की मौद्रिक नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To promote economic growth", "A_hi": "आर्थिक विकास को बढ़ावा देने के लिए",
"B_en": "To control inflation", "B_hi": "मुद्रास्फीति को नियंत्रित करने के लिए",
"C_en": "To stabilize the exchange rate", "C_hi": "विनिमय दर को स्थिर करने के लिए",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The main objective of the Monetary Policy of India is to promote economic growth, control inflation, and stabilize the exchange rate.",
"explanation_hi": "भारत की मौद्रिक नीति का मुख्य उद्देश्य आर्थिक विकास को बढ़ावा देना, मुद्रास्फीति को नियंत्रित करना और विनिमय दर को स्थिर करना है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the difference between fiscal policy and monetary policy?",
"question_hi": "राजकोषीय नीति और मौद्रिक नीति में क्या अंतर है?",
"A_en": "Fiscal policy is related to government spending, while monetary policy is related to interest rates", "A_hi": "राजकोषीय नीति सरकारी व्यय से संबंधित है, जबकि मौद्रिक नीति ब्याज दरों से संबंधित है",
"B_en": "Fiscal policy is related to taxation, while monetary policy is related to government spending", "B_hi": "राजकोषीय नीति कराधान से संबंधित है, जबकि मौद्रिक नीति सरकारी व्यय से संबंधित है",
"C_en": "Fiscal policy is related to exchange rates, while monetary policy is related to inflation", "C_hi": "राजकोषीय नीति विनिमय दरों से संबंधित है, जबकि मौद्रिक नीति मुद्रास्फीति से संबंधित है",
"D_en": "Fiscal policy is related to government debt, while monetary policy is related to private debt", "D_hi": "राजकोषीय नीति सरकारी ऋण से संबंधित है, जबकि मौद्रिक नीति निजी ऋण से संबंधित है",
"answer": "A",
"explanation_en": "Fiscal policy is related to government spending and taxation, while monetary policy is related to interest rates and money supply.",
"explanation_hi": "राजकोषीय नीति सरकारी व्यय और कराधान से संबंधित है, जबकि मौद्रिक नीति ब्याज दरों और मुद्रा आपूर्ति से संबंधित है।"
},
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the formula for calculating National Income?",
"question_hi": "राष्ट्रीय आय की गणना के लिए सूत्र क्या है?",
"A_en": "National Income = Consumption + Investment + Government Spending + (Exports - Imports)", "A_hi": "राष्ट्रीय आय = उपभोग + निवेश + सरकारी व्यय + (निर्यात - आयात)",
"B_en": "National Income = Consumption + Investment + Government Spending - (Exports - Imports)", "B_hi": "राष्ट्रीय आय = उपभोग + निवेश + सरकारी व्यय - (निर्यात - आयात)",
"C_en": "National Income = Consumption - Investment + Government Spending + (Exports - Imports)", "C_hi": "राष्ट्रीय आय = उपभोग - निवेश + सरकारी व्यय + (निर्यात - आयात)",
"D_en": "National Income = Consumption + Investment - Government Spending - (Exports - Imports)", "D_hi": "राष्ट्रीय आय = उपभोग + निवेश - सरकारी व्यय - (निर्यात - आयात)",
"answer": "A",
"explanation_en": "The formula for calculating National Income is National Income = Consumption + Investment + Government Spending + (Exports - Imports).",
"explanation_hi": "राष्ट्रीय आय की गणना के लिए सूत्र है राष्ट्रीय आय = उपभोग + निवेश + सरकारी व्यय + (निर्यात - आयात)."
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the main cause of inflation?",
"question_hi": "मुद्रास्फीति का मुख्य कारण क्या है?",
"A_en": "Increase in money supply", "A_hi": "मुद्रा आपूर्ति में वृद्धि",
"B_en": "Decrease in money supply", "B_hi": "मुद्रा आपूर्ति में कमी",
"C_en": "Increase in production", "C_hi": "उत्पादन में वृद्धि",
"D_en": "Decrease in production", "D_hi": "उत्पादन में कमी",
"answer": "A",
"explanation_en": "The main cause of inflation is an increase in money supply, which leads to a surge in demand and prices.",
"explanation_hi": "मुद्रास्फीति का मुख्य कारण मुद्रा आपूर्ति में वृद्धि है, जिससे मांग और कीमतों में वृद्धि होती है।"
},
{
"subject": "Economy",
"topic": "Banking",
"question_en": "What is the main function of a commercial bank?",
"question_hi": "वाणिज्यिक बैंक का मुख्य कार्य क्या है?",
"A_en": "To provide loans to businesses", "A_hi": "व्यवसायों को ऋण प्रदान करना",
"B_en": "To accept deposits from customers", "B_hi": "ग्राहकों से जमा स्वीकार करना",
"C_en": "To provide investment advice", "C_hi": "निवेश सलाह प्रदान करना",
"D_en": "To facilitate foreign exchange transactions", "D_hi": "विदेशी मुद्रा लेनदेन को सुविधाजनक बनाना",
"answer": "B",
"explanation_en": "The main function of a commercial bank is to accept deposits from customers and provide loans to businesses and individuals.",
"explanation_hi": "वाणिज्यिक बैंक का मुख्य कार्य ग्राहकों से जमा स्वीकार करना और व्यवसायों और व्यक्तियों को ऋण प्रदान करना है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the difference between a budget deficit and a budget surplus?",
"question_hi": "बजट घाटा और बजट अधिशेष में क्या अंतर है?",
"A_en": "A budget deficit occurs when government spending exceeds revenue, while a budget surplus occurs when revenue exceeds government spending", "A_hi": "बजट घाटा तब होता है जब सरकारी व्यय राजस्व से अधिक होता है, जबकि बजट अधिशेष तब होता है जब राजस्व सरकारी व्यय से अधिक होता है",
"B_en": "A budget deficit occurs when revenue exceeds government spending, while a budget surplus occurs when government spending exceeds revenue", "B_hi": "बजट घाटा तब होता है जब राजस्व सरकारी व्यय से अधिक होता है, जबकि बजट अधिशेष तब होता है जब सरकारी व्यय राजस्व से अधिक होता है",
"C_en": "A budget deficit occurs when government spending is equal to revenue, while a budget surplus occurs when government spending is less than revenue", "C_hi": "बजट घाटा तब होता है जब सरकारी व्यय राजस्व के बराबर होता है, जबकि बजट अधिशेष तब होता है जब सरकारी व्यय राजस्व से कम होता है",
"D_en": "A budget deficit occurs when government spending is less than revenue, while a budget surplus occurs when government spending is equal to revenue", "D_hi": "बजट घाटा तब होता है जब सरकारी व्यय राजस्व से कम होता है, जबकि बजट अधिशेष तब होता है जब सरकारी व्यय राजस्व के बराबर होता है",
"answer": "A",
"explanation_en": "A budget deficit occurs when government spending exceeds revenue, while a budget surplus occurs when revenue exceeds government spending.",
"explanation_hi": "बजट घाटा तब होता है जब सरकारी व्यय राजस्व से अधिक होता है, जबकि बजट अधिशेष तब होता है जब राजस्व सरकारी व्यय से अधिक होता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the main advantage of international trade?",
"question_hi": "अंतर्राष्ट्रीय व्यापार का मुख्य लाभ क्या है?",
"A_en": "Increased economic growth", "A_hi": "आर्थिक विकास में वृद्धि",
"B_en": "Improved balance of payments", "B_hi": "भुगतान संतुलन में सुधार",
"C_en": "Increased competition", "C_hi": "प्रतिस्पर्धा में वृद्धि",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The main advantages of international trade are increased economic growth, improved balance of payments, and increased competition.",
"explanation_hi": "अंतर्राष्ट्रीय व्यापार के मुख्य लाभ हैं आर्थिक विकास में वृद्धि, भुगतान संतुलन में सुधार, और प्रतिस्पर्धा में वृद्धि।"
},
{
"subject": "Economy",
"topic": "Economic Systems",
"question_en": "What is the main characteristic of a socialist economic system?",
"question_hi": "सामाजिक आर्थिक प्रणाली की मुख्य विशेषता क्या है?",
"A_en": "Private ownership of the means of production", "A_hi": "उत्पादन के साधनों का निजी स्वामित्व",
"B_en": "Government ownership of the means of production", "B_hi": "उत्पादन के साधनों का सरकारी स्वामित्व",
"C_en": "Mixed economy with both private and public sectors", "C_hi": "निजी और सार्वजनिक क्षेत्रों के साथ मिश्रित अर्थव्यवस्था",
"D_en": "Laissez-faire economy with minimal government intervention", "D_hi": "न्यूनतम सरकारी हस्तक्षेप के साथ लैसेज़-फ़ेयर अर्थव्यवस्था",
"answer": "B",
"explanation_en": "The main characteristic of a socialist economic system is government ownership of the means of production.",
"explanation_hi": "सामाजिक आर्थिक प्रणाली की मुख्य विशेषता उत्पादन के साधनों का सरकारी स्वामित्व है।"
},
{
"subject": "Economy",
"topic": "Poverty and Inequality",
"question_en": "What is the main cause of poverty in developing countries?",
"question_hi": "विकासशील देशों में गरीबी का मुख्य कारण क्या है?",
"A_en": "Lack of economic growth", "A_hi": "आर्थिक विकास की कमी",
"B_en": "Inequality in income distribution", "B_hi": "आय वितरण में असमानता",
"C_en": "Lack of access to education and healthcare", "C_hi": "शिक्षा और स्वास्थ्य सेवाओं तक पहुंच की कमी",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The main causes of poverty in developing countries are lack of economic growth, inequality in income distribution, and lack of access to education and healthcare.",
"explanation_hi": "विकासशील देशों में गरीबी के मुख्य कारण हैं आर्थिक विकास की कमी, आय वितरण में असमानता, और शिक्षा और स्वास्थ्य सेवाओं तक पहुंच की कमी।"
}
]