[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the official language of Rajasthan?",
"question_hi": "राजस्थान में मूल भाषा क्या है?",
"A_en": "Hindi", "A_hi": "हिंदी",
"B_en": "English", "B_hi": "अंग्रेज़",
"C_en": "Marathi", "C_hi": "मराठी",
"D_en": "Gujarati", "D_hi": "गुजराती",
"answer": "D",
"explanation_en": "Gujarati is the official language of Rajasthan.",
"explanation_hi": "राजस्थान में गुजराती मूल भाषा है।"
},
{
"subject": "Economy",
"topic": "",
"question_en": "What is the primary occupation of the people of Rajasthan?",
"question_hi": "राजस्थान के लोगों का प्रधान अभिप्रदर्शन क्या है?",
"A_en": "Agriculture",
"A_hi": "आजीविकरण",
"B_en": "Manufacturing",
"B_hi": "बंदूरी",
"C_en": "Services",
"C_hi": "सेवाओं",
"D_en": "Mining",
"D_hi": "वितीय संघ",
"answer": "C",
"explanation_en": "In Rajasthan, the primary occupation of the people is in the services sector, including industries like tourism, education, and healthcare.",
"explanation_hi": "राजस्थान में लोगों का प्रमोट सेवाओं के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लोगों का प्रमोट के विभाग में लों का प्रमोट के विभाग में लों का प्रमोट के विभाग में लों का प्रमोट के विभाग में लों का प्रमें लों का प्रमें लों का प्रमें लों का प्रमें लों का प्रमें का प्रमें लों का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमें का प्रमे