[
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is a characteristic of a developing economy?",
"question_hi": "निम्नलिखित में से कौन एक विकासशील अर्थव्यवस्था की विशेषता है?",
"A_en": "High per capita income", "A_hi": "उच्च प्रति व्यक्ति आय",
"B_en": "Low level of urbanization", "B_hi": "नगरीकरण का निम्न स्तर",
"C_en": "Dependence on primary sector", "C_hi": "प्राथमिक क्षेत्र पर निर्भरता",
"D_en": "High level of human development index", "D_hi": "मानव विकास सूचकांक का उच्च स्तर",
"answer": "C",
"explanation_en": "A developing economy is characterized by dependence on the primary sector, which includes agriculture, forestry, and fishing.",
"explanation_hi": "एक विकासशील अर्थव्यवस्था प्राथमिक क्षेत्र पर निर्भरता की विशेषता है, जिसमें कृषि, वनस्पति और मछली पकड़ना शामिल है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the main objective of the Monetary Policy of India?",
"question_hi": "भारत की मौद्रिक नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To control inflation", "A_hi": "मुद्रास्फीति को नियंत्रित करना",
"B_en": "To promote economic growth", "B_hi": "आर्थिक विकास को बढ़ावा देना",
"C_en": "To stabilize the exchange rate", "C_hi": "विनिमय दर को स्थिर करना",
"D_en": "To reduce unemployment", "D_hi": "बेरोजगारी को कम करना",
"answer": "A",
"explanation_en": "The main objective of the Monetary Policy of India is to control inflation, which is achieved through the use of monetary tools such as interest rates and money supply.",
"explanation_hi": "भारत की मौद्रिक नीति का मुख्य उद्देश्य मुद्रास्फीति को नियंत्रित करना है, जो ब्याज दरों और मुद्रा आपूर्ति जैसे मौद्रिक उपकरणों के उपयोग के माध्यम से प्राप्त किया जाता है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is a type of economic system?",
"question_hi": "निम्नलिखित में से कौन एक प्रकार की आर्थिक व्यवस्था है?",
"A_en": "Mixed economy", "A_hi": "मिश्रित अर्थव्यवस्था",
"B_en": "Planned economy", "B_hi": "योजनाबद्ध अर्थव्यवस्था",
"C_en": "Market economy", "C_hi": "बाजार अर्थव्यवस्था",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "There are several types of economic systems, including mixed economy, planned economy, and market economy. Each has its own characteristics and advantages.",
"explanation_hi": "आर्थिक व्यवस्था के कई प्रकार हैं, जिनमें मिश्रित अर्थव्यवस्था, योजनाबद्ध अर्थव्यवस्था और बाजार अर्थव्यवस्था शामिल हैं। प्रत्येक की अपनी विशेषताएं और लाभ हैं।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the role of the Reserve Bank of India in the Indian economy?",
"question_hi": "भारतीय अर्थव्यवस्था में भारतीय रिज़र्व बैंक की भूमिका क्या है?",
"A_en": "To regulate the money supply", "A_hi": "मुद्रा आपूर्ति को विनियमित करना",
"B_en": "To promote economic growth", "B_hi": "आर्थिक विकास को बढ़ावा देना",
"C_en": "To stabilize the exchange rate", "C_hi": "विनिमय दर को स्थिर करना",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The Reserve Bank of India plays a crucial role in the Indian economy, including regulating the money supply, promoting economic growth, and stabilizing the exchange rate.",
"explanation_hi": "भारतीय रिज़र्व बैंक भारतीय अर्थव्यवस्था में एक महत्वपूर्ण भूमिका निभाता है, जिसमें मुद्रा आपूर्ति को विनियमित करना, आर्थिक विकास को बढ़ावा देना और विनिमय दर को स्थिर करना शामिल है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the difference between GDP and GNP?",
"question_hi": "जीडीपी और जीएनपी में क्या अंतर है?",
"A_en": "GDP includes only domestic production, while GNP includes both domestic and foreign production", "A_hi": "जीडीपी में केवल घरेलू उत्पादन शामिल है, जबकि जीएनपी में घरेलू और विदेशी दोनों उत्पादन शामिल हैं",
"B_en": "GDP includes both domestic and foreign production, while GNP includes only domestic production", "B_hi": "जीडीपी में घरेलू और विदेशी दोनों उत्पादन शामिल हैं, जबकि जीएनपी में केवल घरेलू उत्पादन शामिल है",
"C_en": "GDP is calculated using the expenditure approach, while GNP is calculated using the income approach", "C_hi": "जीडीपी की गणना व्यय दृष्टिकोण का उपयोग करके की जाती है, जबकि जीएनपी की गणना आय दृष्टिकोण का उपयोग करके की जाती है",
"D_en": "GDP is calculated using the income approach, while GNP is calculated using the expenditure approach", "D_hi": "जीडीपी की गणना आय दृष्टिकोण का उपयोग करके की जाती है, जबकि जीएनपी की गणना व्यय दृष्टिकोण का उपयोग करके की जाती है",
"answer": "A",
"explanation_en": "GDP (Gross Domestic Product) includes only domestic production, while GNP (Gross National Product) includes both domestic and foreign production.",
"explanation_hi": "जीडीपी (सकल घरेलू उत्पाद) में केवल घरेलू उत्पादन शामिल है, जबकि जीएनपी (सकल राष्ट्रीय उत्पाद) में घरेलू और विदेशी दोनों उत्पादन शामिल हैं।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the concept of opportunity cost?",
"question_hi": "अवसर लागत की अवधारणा क्या है?",
"A_en": "The cost of choosing one option over another", "A_hi": "एक विकल्प को दूसरे के ऊपर चुनने की लागत",
"B_en": "The cost of producing a good or service", "B_hi": "एक अच्छा या सेवा का उत्पादन करने की लागत",
"C_en": "The cost of consuming a good or service", "C_hi": "एक अच्छा या सेवा की खपत करने की लागत",
"D_en": "The cost of investing in a project", "D_hi": "एक परियोजना में निवेश करने की लागत",
"answer": "A",
"explanation_en": "Opportunity cost refers to the cost of choosing one option over another, and is a fundamental concept in economics.",
"explanation_hi": "अवसर लागत एक विकल्प को दूसरे के ऊपर चुनने की लागत को संदर्भित करती है, और यह अर्थशास्त्र में एक मूलभूत अवधारणा है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the difference between a need and a want?",
"question_hi": "एक आवश्यकता और एक इच्छा में क्या अंतर है?",
"A_en": "A need is essential for survival, while a want is not essential", "A_hi": "एक आवश्यकता जीवन के लिए आवश्यक है, जबकि एक इच्छा आवश्यक नहीं है",
"B_en": "A need is not essential, while a want is essential", "B_hi": "एक आवश्यकता आवश्यक नहीं है, जबकि एक इच्छा आवश्यक है",
"C_en": "A need is a physical requirement, while a want is a psychological requirement", "C_hi": "एक आवश्यकता एक शारीरिक आवश्यकता है, जबकि एक इच्छा एक मानसिक आवश्यकता है",
"D_en": "A need is a psychological requirement, while a want is a physical requirement", "D_hi": "एक आवश्यकता एक मानसिक आवश्यकता है, जबकि एक इच्छा एक शारीरिक आवश्यकता है",
"answer": "A",
"explanation_en": "A need is essential for survival, such as food, water, and shelter, while a want is not essential, such as a luxury item.",
"explanation_hi": "एक आवश्यकता जीवन के लिए आवश्यक है, जैसे कि भोजन, पानी और आश्रय, जबकि एक इच्छा आवश्यक नहीं है, जैसे कि एक विलासिता की वस्तु।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the concept of scarcity?",
"question_hi": "अल्पता की अवधारणा क्या है?",
"A_en": "The idea that resources are unlimited", "A_hi": "यह विचार कि संसाधन असीमित हैं",
"B_en": "The idea that resources are limited", "B_hi": "यह विचार कि संसाधन सीमित हैं",
"C_en": "The idea that resources are always available", "C_hi": "यह विचार कि संसाधन हमेशा उपलब्ध हैं",
"D_en": "The idea that resources are never available", "D_hi": "यह विचार कि संसाधन कभी भी उपलब्ध नहीं हैं",
"answer": "B",
"explanation_en": "Scarcity refers to the idea that resources are limited, and that choices must be made about how to allocate them.",
"explanation_hi": "अल्पता से तात्पर्य यह है कि संसाधन सीमित हैं, और यह चुनना होगा कि उन्हें कैसे आवंटित किया जाए।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the role of government in a market economy?",
"question_hi": "एक बाजार अर्थव्यवस्था में सरकार की भूमिका क्या है?",
"A_en": "To provide public goods and services", "A_hi": "सार्वजनिक वस्तुओं और सेवाओं को प्रदान करना",
"B_en": "To regulate the market", "B_hi": "बाजार को विनियमित करना",
"C_en": "To redistribute income", "C_hi": "आय को पुनर्वितरित करना",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The government plays a crucial role in a market economy, including providing public goods and services, regulating the market, and redistributing income.",
"explanation_hi": "एक बाजार अर्थव्यवस्था में सरकार की एक महत्वपूर्ण भूमिका है, जिसमें सार्वजनिक वस्तुओं और सेवाओं को प्रदान करना, बाजार को विनियमित करना और आय को पुनर्वितरित करना शामिल है।"
}
]