[
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the primary cause of inflation in an economy?",
"question_hi": "किसी अर्थव्यवस्था में मुद्रास्फीति का मुख्य कारण क्या है?",
"A_en": "Increase in production", "A_hi": "उत्पादन में वृद्धि",
"B_en": "Increase in money supply", "B_hi": "मुद्रा आपूर्ति में वृद्धि",
"C_en": "Decrease in demand", "C_hi": "मांग में कमी",
"D_en": "Decrease in population", "D_hi": "जनसंख्या में कमी",
"answer": "B",
"explanation_en": "Inflation occurs when there is an increase in the money supply, leading to a surge in demand and prices.",
"explanation_hi": "मुद्रास्फीति तब होती है जब मुद्रा आपूर्ति में वृद्धि होती है, जिससे मांग और कीमतों में वृद्धि होती है।"
},
{
"subject": "Economy",
"topic": "GDP",
"question_en": "What does GDP stand for?",
"question_hi": "जीडीपी क्या है?",
"A_en": "Gross Domestic Product", "A_hi": "सकल घरेलू उत्पाद",
"B_en": "Gross National Product", "B_hi": "सकल राष्ट्रीय उत्पाद",
"C_en": "Gross International Product", "C_hi": "सकल अंतर्राष्ट्रीय उत्पाद",
"D_en": "Gross Local Product", "D_hi": "सकल स्थानीय उत्पाद",
"answer": "A",
"explanation_en": "GDP stands for Gross Domestic Product, which is the total value of goods and services produced within a country's borders.",
"explanation_hi": "जीडीपी का अर्थ है सकल घरेलू उत्पाद, जो किसी देश की सीमाओं के भीतर उत्पादित वस्तुओं और सेवाओं का कुल मूल्य है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the primary tool of fiscal policy?",
"question_hi": "राजकोषीय नीति का मुख्य उपकरण क्या है?",
"A_en": "Monetary policy", "A_hi": "मौद्रिक नीति",
"B_en": "Fiscal policy", "B_hi": "राजकोषीय नीति",
"C_en": "Government spending", "C_hi": "सरकारी व्यय",
"D_en": "Taxation", "D_hi": "कराधान",
"answer": "D",
"explanation_en": "The primary tool of fiscal policy is taxation, as it allows the government to influence the economy by adjusting tax rates and revenue.",
"explanation_hi": "राजकोषीय नीति का मुख्य उपकरण कराधान है, क्योंकि यह सरकार को कर दरों और राजस्व को समायोजित करके अर्थव्यवस्था पर प्रभाव डालने की अनुमति देता है।"
},
{
"subject": "Economy",
"topic": "Poverty",
"question_en": "What is the most common measure of poverty?",
"question_hi": "गरीबी का सबसे आम माप क्या है?",
"A_en": "Poverty line", "A_hi": "गरीबी रेखा",
"B_en": "Gini coefficient", "B_hi": "जिनी गुणांक",
"C_en": "Human Development Index", "C_hi": "मानव विकास सूचकांक",
"D_en": "Per capita income", "D_hi": "प्रति व्यक्ति आय",
"answer": "A",
"explanation_en": "The poverty line is the most common measure of poverty, as it represents the minimum level of income required to meet basic needs.",
"explanation_hi": "गरीबी रेखा गरीबी का सबसे आम माप है, क्योंकि यह बुनियादी जरूरतों को पूरा करने के लिए आवश्यक न्यूनतम आय का प्रतिनिधित्व करती है।"
},
{
"subject": "Economy",
"topic": "Unemployment",
"question_en": "What type of unemployment occurs when workers are unable to find jobs due to a lack of skills?",
"question_hi": "किस प्रकार की बेरोजगारी तब होती है जब श्रमिकों को कौशल की कमी के कारण नौकरी नहीं मिल पाती है?",
"A_en": "Frictional unemployment", "A_hi": "घर्षण बेरोजगारी",
"B_en": "Structural unemployment", "B_hi": "संरचनात्मक बेरोजगारी",
"C_en": "Cyclical unemployment", "C_hi": "चक्रीय बेरोजगारी",
"D_en": "Seasonal unemployment", "D_hi": "मौसमी बेरोजगारी",
"answer": "B",
"explanation_en": "Structural unemployment occurs when workers are unable to find jobs due to a lack of skills or a mismatch between the skills they have and the skills required by employers.",
"explanation_hi": "संरचनात्मक बेरोजगारी तब होती है जब श्रमिकों को कौशल की कमी या उनके पास मौजूद कौशल और नियोक्ताओं द्वारा आवश्यक कौशल के बीच असंगति के कारण नौकरी नहीं मिल पाती है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the effect of inflation on the purchasing power of money?",
"question_hi": "मुद्रास्फीति का धन की क्रय शक्ति पर क्या प्रभाव पड़ता है?",
"A_en": "Increases purchasing power", "A_hi": "क्रय शक्ति में वृद्धि",
"B_en": "Decreases purchasing power", "B_hi": "क्रय शक्ति में कमी",
"C_en": "No effect on purchasing power", "C_hi": "क्रय शक्ति पर कोई प्रभाव नहीं",
"D_en": "Increases savings", "D_hi": "बचत में वृद्धि",
"answer": "B",
"explanation_en": "Inflation decreases the purchasing power of money, as the same amount of money can buy fewer goods and services.",
"explanation_hi": "मुद्रास्फीति धन की क्रय शक्ति को कम करती है, क्योंकि धन की समान राशि कम वस्तुओं और सेवाओं को खरीद सकती है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the primary goal of fiscal policy?",
"question_hi": "राजकोषीय नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To reduce inflation", "A_hi": "मुद्रास्फीति को कम करने के लिए",
"B_en": "To increase economic growth", "B_hi": "आर्थिक विकास को बढ़ाने के लिए",
"C_en": "To reduce unemployment", "C_hi": "बेरोजगारी को कम करने के लिए",
"D_en": "To stabilize the economy", "D_hi": "अर्थव्यवस्था को स्थिर करने के लिए",
"answer": "D",
"explanation_en": "The primary goal of fiscal policy is to stabilize the economy, by using government spending and taxation to influence aggregate demand and output.",
"explanation_hi": "राजकोषीय नीति का मुख्य उद्देश्य अर्थव्यवस्था को स्थिर करना है, सरकारी व्यय और कराधान का उपयोग करके कुल मांग और उत्पादन को प्रभावित करना।"
},
{
"subject": "Economy",
"topic": "GDP",
"question_en": "What is included in the calculation of GDP?",
"question_hi": "जीडीपी की गणना में क्या शामिल है?",
"A_en": "Only consumption", "A_hi": "केवल उपभोग",
"B_en": "Only investment", "B_hi": "केवल निवेश",
"C_en": "Only government spending", "C_hi": "केवल सरकारी व्यय",
"D_en": "Consumption, investment, government spending, and net exports", "D_hi": "उपभोग, निवेश, सरकारी व्यय और शुद्ध निर्यात",
"answer": "D",
"explanation_en": "GDP includes the total value of consumption, investment, government spending, and net exports.",
"explanation_hi": "जीडीपी में उपभोग, निवेश, सरकारी व्यय और शुद्ध निर्यात का कुल मूल्य शामिल है।"
},
{
"subject": "Economy",
"topic": "Unemployment",
"question_en": "What is the difference between frictional and structural unemployment?",
"question_hi": "घर्षण और संरचनात्मक बेरोजगारी के बीच क्या अंतर है?",
"A_en": "Frictional unemployment is temporary, while structural unemployment is permanent", "A_hi": "घर्षण बेरोजगारी अस्थायी है, जबकि संरचनात्मक बेरोजगारी स्थायी है",
"B_en": "Frictional unemployment is caused by a lack of skills, while structural unemployment is caused by a mismatch between skills and job requirements", "B_hi": "घर्षण बेरोजगारी कौशल की कमी के कारण होती है, जबकि संरचनात्मक बेरोजगारी कौशल और नौकरी की आवश्यकताओं के बीच असंगति के कारण होती है",
"C_en": "Frictional unemployment is caused by a mismatch between skills and job requirements, while structural unemployment is caused by a lack of skills", "C_hi": "घर्षण बेरोजगारी कौशल और नौकरी की आवश्यकताओं के बीच असंगति के कारण होती है, जबकि संरचनात्मक बेरोजगारी कौशल की कमी के कारण होती है",
"D_en": "Frictional unemployment is permanent, while structural unemployment is temporary", "D_hi": "घर्षण बेरोजगारी स्थायी है, जबकि संरचनात्मक बेरोजगारी अस्थायी है",
"answer": "B",
"explanation_en": "Frictional unemployment is caused by a mismatch between skills and job requirements, while structural unemployment is caused by a lack of skills or a mismatch between the skills workers have and the skills required by employers.",
"explanation_hi": "घर्षण बेरोजगारी कौशल और नौकरी की आवश्यकताओं के बीच असंगति के कारण होती है, जबकि संरचनात्मक बेरोजगारी कौशल की कमी या श्रमिकों के पास मौजूद कौशल और नियोक्ताओं द्वारा आवश्यक कौशल के बीच असंगति के कारण होती है।"
},
{
"subject": "Economy",
"topic": "Poverty",
"question_en": "What is the most effective way to reduce poverty?",
"question_hi": "गरीबी को कम करने का सबसे प्रभावी तरीका क्या है?",
"A_en": "Increasing economic growth", "A_hi": "आर्थिक विकास में वृद्धि",
"B_en": "Improving education and healthcare", "B_hi": "शिक्षा और स्वास्थ्य सेवाओं में सुधार",
"C_en": "Providing financial assistance to the poor", "C_hi": "गरीबों को वित्तीय सहायता प्रदान करना",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The most effective way to reduce poverty is to combine increasing economic growth, improving education and healthcare, and providing financial assistance to the poor.",
"explanation_hi": "गरीबी को कम करने का सबसे प्रभावी तरीका आर्थिक विकास में वृद्धि, शिक्षा और स्वास्थ्य सेवाओं में सुधार और गरीबों को वित्तीय सहायता प्रदान करना है।"
}
]