[
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the primary objective of monetary policy in India?",
"question_hi": "भारत में मौद्रिक नीति का प्राथमिक उद्देश्य क्या है?",
"A_en": "Price Stability", "A_hi": "मूल्य स्थिरता",
"B_en": "Economic Growth", "B_hi": "आर्थिक विकास",
"C_en": "Full Employment", "C_hi": "पूर्ण रोजगार",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The primary objective of monetary policy in India is to maintain price stability, promote economic growth, and ensure full employment.",
"explanation_hi": "भारत में मौद्रिक नीति का प्राथमिक उद्देश्य मूल्य स्थिरता बनाए रखना, आर्थिक विकास को बढ़ावा देना और पूर्ण रोजगार सुनिश्चित करना है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the difference between fiscal policy and monetary policy?",
"question_hi": "राजकोषीय नीति और मौद्रिक नीति में क्या अंतर है?",
"A_en": "Fiscal policy is related to government spending, while monetary policy is related to interest rates", "A_hi": "राजकोषीय नीति सरकारी व्यय से संबंधित है, जबकि मौद्रिक नीति ब्याज दरों से संबंधित है",
"B_en": "Fiscal policy is related to interest rates, while monetary policy is related to government spending", "B_hi": "राजकोषीय नीति ब्याज दरों से संबंधित है, जबकि मौद्रिक नीति सरकारी व्यय से संबंधित है",
"C_en": "Fiscal policy is related to taxation, while monetary policy is related to government borrowing", "C_hi": "राजकोषीय नीति कराधान से संबंधित है, जबकि मौद्रिक नीति सरकारी उधार से संबंधित है",
"D_en": "Fiscal policy is related to government borrowing, while monetary policy is related to taxation", "D_hi": "राजकोषीय नीति सरकारी उधार से संबंधित है, जबकि मौद्रिक नीति कराधान से संबंधित है",
"answer": "A",
"explanation_en": "Fiscal policy is related to government spending and taxation, while monetary policy is related to interest rates and money supply.",
"explanation_hi": "राजकोषीय नीति सरकारी व्यय और कराधान से संबंधित है, जबकि मौद्रिक नीति ब्याज दरों और मुद्रा आपूर्ति से संबंधित है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the most common cause of inflation?",
"question_hi": "मुद्रास्फीति का सबसे सामान्य कारण क्या है?",
"A_en": "Increase in money supply", "A_hi": "मुद्रा आपूर्ति में वृद्धि",
"B_en": "Decrease in money supply", "B_hi": "मुद्रा आपूर्ति में कमी",
"C_en": "Increase in production costs", "C_hi": "उत्पादन लागत में वृद्धि",
"D_en": "Decrease in production costs", "D_hi": "उत्पादन लागत में कमी",
"answer": "A",
"explanation_en": "The most common cause of inflation is an increase in the money supply, which leads to an increase in aggregate demand and, subsequently, higher prices.",
"explanation_hi": "मुद्रास्फीति का सबसे सामान्य कारण मुद्रा आपूर्ति में वृद्धि है, जो कुल मांग में वृद्धि और, परिणामस्वरूप, उच्च कीमतों की ओर ले जाता है।"
},
{
"subject": "Economy",
"topic": "Poverty",
"question_en": "What is the most effective way to reduce poverty?",
"question_hi": "गरीबी को कम करने का सबसे प्रभावी तरीका क्या है?",
"A_en": "Increasing economic growth", "A_hi": "आर्थिक विकास बढ़ाना",
"B_en": "Implementing social welfare programs", "B_hi": "सामाजिक कल्याण कार्यक्रमों को लागू करना",
"C_en": "Improving education and healthcare", "C_hi": "शिक्षा और स्वास्थ्य में सुधार करना",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The most effective way to reduce poverty is a combination of increasing economic growth, implementing social welfare programs, and improving education and healthcare.",
"explanation_hi": "गरीबी को कम करने का सबसे प्रभावी तरीका आर्थिक विकास बढ़ाने, सामाजिक कल्याण कार्यक्रमों को लागू करने और शिक्षा और स्वास्थ्य में सुधार करने का संयोजन है।"
},
{
"subject": "Economy",
"topic": "Unemployment",
"question_en": "What is the most common type of unemployment?",
"question_hi": "बेरोजगारी का सबसे सामान्य प्रकार क्या है?",
"A_en": "Frictional unemployment", "A_hi": "घर्षण बेरोजगारी",
"B_en": "Structural unemployment", "B_hi": "संरचनात्मक बेरोजगारी",
"C_en": "Cyclical unemployment", "C_hi": "चक्रीय बेरोजगारी",
"D_en": "Seasonal unemployment", "D_hi": "मौसमी बेरोजगारी",
"answer": "A",
"explanation_en": "The most common type of unemployment is frictional unemployment, which occurs when workers are in between jobs or are searching for new employment opportunities.",
"explanation_hi": "बेरोजगारी का सबसे सामान्य प्रकार घर्षण बेरोजगारी है, जो तब होता है जब श्रमिक नौकरियों के बीच में होते हैं या नई रोजगार की तलाश में होते हैं।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the main advantage of international trade?",
"question_hi": "अंतरराष्ट्रीय व्यापार का मुख्य लाभ क्या है?",
"A_en": "Increased economic growth", "A_hi": "आर्थिक विकास में वृद्धि",
"B_en": "Improved balance of payments", "B_hi": "भुगतान संतुलन में सुधार",
"C_en": "Increased competition", "C_hi": "प्रतिस्पर्धा में वृद्धि",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The main advantage of international trade is a combination of increased economic growth, improved balance of payments, and increased competition.",
"explanation_hi": "अंतरराष्ट्रीय व्यापार का मुख्य लाभ आर्थिक विकास में वृद्धि, भुगतान संतुलन में सुधार और प्रतिस्पर्धा में वृद्धि का संयोजन है।"
},
{
"subject": "Economy",
"topic": "Economic Systems",
"question_en": "What is the main characteristic of a capitalist economic system?",
"question_hi": "पूंजीवादी आर्थिक प्रणाली की मुख्य विशेषता क्या है?",
"A_en": "Government ownership of the means of production", "A_hi": "उत्पादन के साधनों पर सरकारी स्वामित्व",
"B_en": "Private ownership of the means of production", "B_hi": "उत्पादन के साधनों पर निजी स्वामित्व",
"C_en": "Central planning", "C_hi": "केंद्रीय योजना",
"D_en": "Mixed economy", "D_hi": "मिश्रित अर्थव्यवस्था",
"answer": "B",
"explanation_en": "The main characteristic of a capitalist economic system is private ownership of the means of production, where individuals and businesses own and operate the factors of production.",
"explanation_hi": "पूंजीवादी आर्थिक प्रणाली की मुख्य विशेषता उत्पादन के साधनों पर निजी स्वामित्व है, जहां व्यक्ति और व्यवसाय उत्पादन के कारकों के मालिक और संचालक होते हैं।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the main tool of fiscal policy?",
"question_hi": "राजकोषीय नीति का मुख्य उपकरण क्या है?",
"A_en": "Monetary policy", "A_hi": "मौद्रिक नीति",
"B_en": "Government spending", "B_hi": "सरकारी व्यय",
"C_en": "Taxation", "C_hi": "कराधान",
"D_en": "Both B and C", "D_hi": "दोनों बी और सी",
"answer": "D",
"explanation_en": "The main tools of fiscal policy are government spending and taxation, which are used to influence the level of economic activity and stabilize the economy.",
"explanation_hi": "राजकोषीय नीति के मुख्य उपकरण सरकारी व्यय और कराधान हैं, जो आर्थिक गतिविधि के स्तर को प्रभावित करने और अर्थव्यवस्था को स्थिर करने के लिए उपयोग किए जाते हैं।"
},
{
"subject": "Economy",
"topic": "Economic Growth",
"question_en": "What is the main indicator of economic growth?",
"question_hi": "आर्थिक विकास का मुख्य संकेतक क्या है?",
"A_en": "Gross Domestic Product (GDP)", "A_hi": "सकल घरेलू उत्पाद (जीडीपी)",
"B_en": "Gross National Product (GNP)", "B_hi": "सकल राष्ट्रीय उत्पाद (जीएनपी)",
"C_en": "Per capita income", "C_hi": "प्रति व्यक्ति आय",
"D_en": "Inflation rate", "D_hi": "मुद्रास्फीति दर",
"answer": "A",
"explanation_en": "The main indicator of economic growth is Gross Domestic Product (GDP), which measures the total value of goods and services produced within a country's borders over a given period of time.",
"explanation_hi": "आर्थिक विकास का मुख्य संकेतक सकल घरेलू उत्पाद (जीडीपी) है, जो किसी देश की सीमाओं के भीतर एक निश्चित अवधि में उत्पादित वस्तुओं और सेवाओं के कुल मूल्य को मापता है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the main benefit of trade liberalization?",
"question_hi": "व्यापार उदारीकरण का मुख्य लाभ क्या है?",
"A_en": "Increased tariffs", "A_hi": "टैरिफ में वृद्धि",
"B_en": "Reduced tariffs", "B_hi": "टैरिफ में कमी",
"C_en": "Increased trade barriers", "C_hi": "व्यापार बाधाओं में वृद्धि",
"D_en": "Reduced trade barriers", "D_hi": "व्यापार बाधाओं में कमी",
"answer": "D",
"explanation_en": "The main benefit of trade liberalization is the reduction of trade barriers, such as tariffs and quotas, which increases trade and economic growth.",
"explanation_hi": "व्यापार उदारीकरण का मुख्य लाभ व्यापार बाधाओं, जैसे कि टैरिफ और कोटा, को कम करना है, जो व्यापार और आर्थिक विकास को बढ़ाता है।"
}
]