[
{
"subject": "Economy",
"topic": "",
"question_en": "What is the official language of Rajasthan?",
"question_hi": "राजस्थान की अधिकांक भाषा क्या है?",
"A_en": "Marathi", "A_hi": "मराठी",
"B_en": "Hindi", "B_hi": "हिंदी",
"C_en": "Tamil", "C_hi": "टामली",
"D_en": "Gujarati", "D_hi": "गुजराती",
"answer": "B",
"explanation_en": "Hindi is the official language of Rajasthan. Marathi, Tamil, and Gujarati are also spoken in the state but Hindi is the primary language.",
"explanation_hi": "राजस्थान की अधिकांक भाषा हिंदी है। राजस्थान में Marathi, Tamil, और Gujarati भी बातों को भूलें, लेकिन Hindi का में सबसे प्रधान भाषा है।",
"explanation_hi": "राजस्थान की अधिकांक भाषा हिंदी है। राजस्थान में Marathi, Tamil, और Gujarati भूलें, लेकिन Hindi का स्पंदित है।"
},
{
"subject": "Economy",
"topic": "Education",
"question_en": "What is the literacy rate in Rajasthan according to Census 2011?",
"question_hi": "2011 समाधिती में Rajasthan की प्रत्यामधर्मन्तित वर्षीय डायना में राजस्थान का भाषा मानन्तित आ़ार, एक प्रत्यामधर्मन्तित आ़ारे को बतायें।",
"question_hi": "2011 संविधि में Rajasthan का भाषा मानन्तित आ़ार मानन्तित आ़ारे को बतायें।",
"answer": "B",
"explanation_en": "According to the 2011 Census, the literacy rate in Rajasthan is 78.73%. The correct answer is B.",
"explanation_hi": "2011 संविधि में राजस्थान के बिल्ड्राउन में राजस्थान के बिल्ड्राउन में राजस्थान के बिल्ड्राउन में राजस्थान के बिल्ड्राउन में राजस्थान के बिल्ड्राउन में राजस्थान के बिल्ड्राउन में राजस्थान के बिल्ड्राउन में राजस्थान के बिल्ड्राउन में राजस्थान के बिल्ड्राउन में राजस्थान के बिल्ड्राउन में राजस्थान के बिल्ड्राउन में राजस्थान के बिल्ड्राउन में राजस्थान के बिल्ड्राउन में राजस्थान के बिल्ड्डन में राजस्थान के ब्ड्डन में राजस्थान के बिल्डन में राजस्थान के बिल्ड्डन में राजस्थान के बिल्ड्डन में राजस्थान के बिल्डन में राजस्थान के बिल्डन में राजस्थान के बिल्ड्डन में राजस्थान के बिल्डन में राजस्थान के बिल्डन में राजस्थान के बिल्डन में राजस्थान के बिल्डन में राजस्थान के बिल्डन में राजस्थान के बिल्डन में राजस्थान के बिल्डन में राजस्थान के बिल्डन में राजस्थान बिल्डन में राजस्थान के बिल्डन में राजस्थान बिल्डन में राजस्थान के बिल्डन में राजस्थान बिल्डन में राजस्थान बिल्डन में राज