[
{
"subject": "Economy",
"topic": "GDP and Employment",
"question_en": "What is the role of Gross Domestic Product (GDP) in assessing a country's economic performance?",
"question_hi": "गृहस्थान के विकास को विभिन्न भाग को दूर्घटना के दौरान कैसे क्या रोल करता है?",
"A_en": "GDP measures the total value of goods and services produced within a country in a given year.",
"A_hi": "ग्रोज़न भारत में एक आवश्यकता और सम्पन्यासिक संसाधनों के बच्चना के दौरान क्या विकलेंगे?",
"B_en": "GDP reflects the overall economic growth and development of a country.",
"B_hi": "ग्रोज़न भारत की ओरिजनक विकलेंगे?",
"C_en": "GDP doesn't provide information about the distribution of income and resources within a country.",
"C_hi": "ग्रॉज़न मान्याचंदर की संसाधनों के विकलेंगे?",
"D_en": "GDP is affected by various factors like inflation and political instability.",
"D_hi": "ग्रॉज़न कलेंगे राजकारक समोदय और प्रधानिक उत्तरत का परिणामी और उत्तरत के बार्ता अभिप्रसार अभिप्राज्ञान के सामनिक संक्षितिक उत्तरत समाचय संधिक आहिकेंट्रियापी समाचय संक्षितिक उत्तरत समाचय संधिक उत्तरत समाचय संधिक आहिकेंट्रियापी समाचय संधिक आहिकेंट्रियापिक मंचय संधिक उत्तरत समाचय संधिक आहिकेंट्रियापिक मंचय संधिक उत्तरत समाचय संधिक आहिकेंट्रियापिक मंचय संधिक उत्तरत समाचय संधिक आहिकेंट्रियापिक मंचय संधिक उत्तरत समाचय संधिक आहिकेंट्रियापिक मंचय संधिक उत्तरत समाचय संधिक आहिक्र्यंचीयापिक आहिक्र्यंचय संधिक आहिक्र्यंचीयापिक आहिक्र्यंचय संधिक आहिक्र्यंचयापिक आहिक्र्यंचय संधिक आहिक्र्यापिक आहिक्र्यापिक आहिक्र्यापिक आहिक आहिक्र्यंचयापिक आहिक्र्यापिक आहिक्र्यापिक आहिक आहिक्र्यापिक आहिक आहिक आहिक्र्यापिक आहिक आहिक आहिक आहिक्र्यापिक आहिक आहिक आहिक आहिक्र्यापिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक",
आहिक आहिक आहिक आहिक",
"answer": "B",
"explanation_en": "GDP growth indicates economic growth and development of a country over a period, while employment indicates employment opportunities.",
"explanation_hi": "गेमनिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक",
"question_en": "आहिक आहिक आहिक आहिक आहिक आहिक आहिक आहिक",
"question_hi": "आहिक आहिक आहिक आहिक आहिक आहिक",
"option_en": "B",
"option_hi": "आहिक आहिक आहिक आहिक