[
{
"subject": "Economy",
"topic": "Introduction to Economy",
"question_en": "What is the primary goal of economic activity?",
"question_hi": "आर्थिक गतिविधि का प्राथमिक उद्देश्य क्या है?",
"A_en": "To maximize profits", "A_hi": "लाभ को अधिकतम करना",
"B_en": "To satisfy human wants", "B_hi": "मानवीय आवश्यकताओं को पूरा करना",
"C_en": "To create employment", "C_hi": "रोजगार सृजन करना",
"D_en": "To reduce inequality", "D_hi": "असमानता को कम करना",
"answer": "B",
"explanation_en": "The primary goal of economic activity is to satisfy human wants, which is the fundamental driving force behind all economic activities.",
"explanation_hi": "आर्थिक गतिविधि का प्राथमिक उद्देश्य मानवीय आवश्यकताओं को पूरा करना है, जो सभी आर्थिक गतिविधियों के पीछे की मूलभूत शक्ति है।"
},
{
"subject": "Economy",
"topic": "Introduction to Economy",
"question_en": "Which of the following is a characteristic of a traditional economy?",
"question_hi": "निम्नलिखित में से कौन एक पारंपरिक अर्थव्यवस्था की विशेषता है?",
"A_en": "Use of advanced technology", "A_hi": "उन्नत प्रौद्योगिकी का उपयोग",
"B_en": "Specialization of labor", "B_hi": "श्रम का विशेषीकरण",
"C_en": "Self-sufficiency", "C_hi": "आत्मनिर्भरता",
"D_en": "Global trade", "D_hi": "वैश्विक व्यापार",
"answer": "C",
"explanation_en": "A traditional economy is characterized by self-sufficiency, where individuals or families produce most of what they need and rely on traditional methods and techniques.",
"explanation_hi": "एक पारंपरिक अर्थव्यवस्था आत्मनिर्भरता से विशेषता है, जहां व्यक्तियों या परिवार अपनी अधिकांश आवश्यकताओं को स्वयं उत्पादन करते हैं और पारंपरिक तरीकों और तकनीकों पर निर्भर रहते हैं।"
},
{
"subject": "Economy",
"topic": "Introduction to Economy",
"question_en": "What is the term for the study of the economy as a whole?",
"question_hi": "समग्र अर्थव्यवस्था के अध्ययन के लिए शब्द क्या है?",
"A_en": "Microeconomics", "A_hi": "सूक्ष्म अर्थशास्त्र",
"B_en": "Macroeconomics", "B_hi": "सामष्टिक अर्थशास्त्र",
"C_en": "International trade", "C_hi": "अंतर्राष्ट्रीय व्यापार",
"D_en": "Economic development", "D_hi": "आर्थिक विकास",
"answer": "B",
"explanation_en": "Macroeconomics is the study of the economy as a whole, including factors such as inflation, unemployment, and economic growth.",
"explanation_hi": "सामष्टिक अर्थशास्त्र समग्र अर्थव्यवस्था का अध्ययन है, जिसमें मुद्रास्फीति, बेरोजगारी और आर्थिक विकास जैसे कारक शामिल हैं।"
},
{
"subject": "Economy",
"topic": "Introduction to Economy",
"question_en": "Which of the following is an example of a public good?",
"question_hi": "निम्नलिखित में से कौन एक सार्वजनिक भला का उदाहरण है?",
"A_en": "Private school", "A_hi": "निजी स्कूल",
"B_en": "National park", "B_hi": "राष्ट्रीय उद्यान",
"C_en": "Private hospital", "C_hi": "निजी अस्पताल",
"D_en": "Private company", "D_hi": "निजी कंपनी",
"answer": "B",
"explanation_en": "A public good is a good or service that is provided by the government and is available to everyone, such as national parks, highways, and public education.",
"explanation_hi": "सार्वजनिक भला एक ऐसा उत्पाद या सेवा है जो सरकार द्वारा प्रदान की जाती है और सभी के लिए उपलब्ध है, जैसे कि राष्ट्रीय उद्यान, राजमार्ग और सार्वजनिक शिक्षा।"
},
{
"subject": "Economy",
"topic": "Introduction to Economy",
"question_en": "What is the term for the movement of people from rural areas to cities?",
"question_hi": "ग्रामीण क्षेत्रों से शहरों की ओर लोगों की आवाजाही के लिए शब्द क्या है?",
"A_en": "Urbanization", "A_hi": "नगरीकरण",
"B_en": "Ruralization", "B_hi": "ग्रामीणीकरण",
"C_en": "Migration", "C_hi": "प्रवासन",
"D_en": "Emigration", "D_hi": "अप्रवासन",
"answer": "A",
"explanation_en": "Urbanization is the process of people moving from rural areas to cities, often in search of better economic opportunities.",
"explanation_hi": "नगरीकरण ग्रामीण क्षेत्रों से शहरों की ओर लोगों की आवाजाही की प्रक्रिया है, जो अक्सर बेहतर आर्थिक अवसरों की तलाश में होती है।"
},
{
"subject": "Economy",
"topic": "Introduction to Economy",
"question_en": "Which of the following is a type of economic system?",
"question_hi": "निम्नलिखित में से कौन एक प्रकार की आर्थिक प्रणाली है?",
"A_en": "Capitalism", "A_hi": "पूंजीवाद",
"B_en": "Socialism", "B_hi": "समाजवाद",
"C_en": "Communism", "C_hi": "साम्यवाद",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "There are several types of economic systems, including capitalism, socialism, and communism, each with its own unique characteristics and advantages.",
"explanation_hi": "कई प्रकार की आर्थिक प्रणालियां हैं, जिनमें पूंजीवाद, समाजवाद और साम्यवाद शामिल हैं, जिनमें से प्रत्येक की अपनी विशिष्ट विशेषताएं और लाभ हैं।"
},
{
"subject": "Economy",
"topic": "Introduction to Economy",
"question_en": "What is the term for the amount of money that people are willing and able to spend on a particular good or service?",
"question_hi": "किसी विशिष्ट उत्पाद या सेवा पर लोगों द्वारा खर्च करने के लिए तैयार और सक्षम होने की राशि के लिए शब्द क्या है?",
"A_en": "Demand", "A_hi": "मांग",
"B_en": "Supply", "B_hi": "आपूर्ति",
"C_en": "Price", "C_hi": "मूल्य",
"D_en": "Cost", "D_hi": "लागत",
"answer": "A",
"explanation_en": "Demand refers to the amount of money that people are willing and able to spend on a particular good or service, and is a key concept in understanding market dynamics.",
"explanation_hi": "मांग से तात्पर्य किसी विशिष्ट उत्पाद या सेवा पर लोगों द्वारा खर्च करने के लिए तैयार और सक्षम होने की राशि से है, और बाजार गतिविधियों को समझने में यह एक महत्वपूर्ण अवधारणा है।"
},
{
"subject": "Economy",
"topic": "Introduction to Economy",
"question_en": "Which of the following is a factor of production?",
"question_hi": "निम्नलिखित में से कौन उत्पादन का एक कारक है?",
"A_en": "Land", "A_hi": "भूमि",
"B_en": "Labor", "B_hi": "श्रम",
"C_en": "Capital", "C_hi": "पूंजी",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The factors of production are the inputs used to produce goods and services, and include land, labor, capital, and entrepreneurship.",
"explanation_hi": "उत्पादन के कारक वे इनपुट हैं जो वस्तुओं और सेवाओं के उत्पादन के लिए उपयोग किए जाते हैं, और इसमें भूमि, श्रम, पूंजी और उद्यमिता शामिल हैं।"
},
{
"subject": "Economy",
"topic": "Introduction to Economy",
"question_en": "What is the term for the process of creating new goods and services?",
"question_hi": "नए उत्पादों और सेवाओं के निर्माण की प्रक्रिया के लिए शब्द क्या है?",
"A_en": "Production", "A_hi": "उत्पादन",
"B_en": "Consumption", "B_hi": "उपभोग",
"C_en": "Investment", "C_hi": "निवेश",
"D_en": "Innovation", "D_hi": "नवाचार",
"answer": "A",
"explanation_en": "Production refers to the process of creating new goods and services, and is a key concept in understanding economic activity.",
"explanation_hi": "उत्पादन नए उत्पादों और सेवाओं के निर्माण की प्रक्रिया को संदर्भित करता है, और आर्थिक गतिविधि को समझने में यह एक महत्वपूर्ण अवधारणा है।"
},
{
"subject": "Economy",
"topic": "Introduction to Economy",
"question_en": "Which of the following is a type of market structure?",
"question_hi": "निम्नलिखित में से कौन एक प्रकार की बाजार संरचना है?",
"A_en": "Monopoly", "A_hi": "एकाधिकार",
"B_en": "Oligopoly", "B_hi": "अल्पाधिकार",
"C_en": "Perfect competition", "C_hi": "पूर्ण प्रतिस्पर्धा",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "There are several types of market structures, including monopoly, oligopoly, and perfect competition, each with its own unique characteristics and implications for businesses and consumers.",
"explanation_hi": "बाजार संरचना के कई प्रकार हैं, जिनमें एकाधिकार, अल्पाधिकार और पूर्ण प्रतिस्पर्धा शामिल हैं, जिनमें से प्रत्येक की अपनी विशिष्ट विशेषताएं और व्यापारियों और उपभोक्ताओं के लिए परिणाम हैं।"
}
]