[
{
"subject": "Economy",
"topic": "National Income",
"question_en": "What is the term for the total value of all final goods and services produced within a country's borders in a given year?",
"question_hi": "किसी देश की सीमा के भीतर एक वर्ष में उत्पादित सभी अंतिम वस्तुओं और सेवाओं के कुल मूल्य के लिए शब्द क्या है?",
"A_en": "Gross Domestic Product (GDP)", "A_hi": "सकल घरेलू उत्पाद (जीडीपी)",
"B_en": "Net Domestic Product (NDP)", "B_hi": "शुद्ध घरेलू उत्पाद (एनडीपी)",
"C_en": "National Income", "C_hi": "राष्ट्रीय आय",
"D_en": "Per Capita Income", "D_hi": "प्रति व्यक्ति आय",
"answer": "A",
"explanation_en": "GDP is the total value of all final goods and services produced within a country's borders in a given year.",
"explanation_hi": "जीडीपी एक वर्ष में किसी देश की सीमा के भीतर उत्पादित सभी अंतिम वस्तुओं और सेवाओं का कुल मूल्य है।"
},
{
"subject": "Economy",
"topic": "Inflation",
"question_en": "What is the term for a sustained increase in the general price level of goods and services in an economy?",
"question_hi": "एक अर्थव्यवस्था में वस्तुओं और सेवाओं की सामान्य मूल्य स्तर में लगातार वृद्धि के लिए शब्द क्या है?",
"A_en": "Deflation", "A_hi": "मुद्रास्फीति की कमी",
"B_en": "Inflation", "B_hi": "मुद्रास्फीति",
"C_en": "Stagflation", "C_hi": "मुद्रास्फीति और मंदी",
"D_en": "Recession", "D_hi": "मंदी",
"answer": "B",
"explanation_en": "Inflation is a sustained increase in the general price level of goods and services in an economy.",
"explanation_hi": "मुद्रास्फीति एक अर्थव्यवस्था में वस्तुओं और सेवाओं की सामान्य मूल्य स्तर में लगातार वृद्धि है।"
},
{
"subject": "Economy",
"topic": "Fiscal Policy",
"question_en": "What is the term for the use of government spending and taxation to influence the overall level of economic activity?",
"question_hi": "सरकारी व्यय और कराधान का उपयोग समग्र आर्थिक गतिविधि के स्तर को प्रभावित करने के लिए शब्द क्या है?",
"A_en": "Monetary Policy", "A_hi": "मौद्रिक नीति",
"B_en": "Fiscal Policy", "B_hi": "राजकोषीय नीति",
"C_en": "Supply-Side Economics", "C_hi": "आपूर्ति-पक्ष अर्थशास्त्र",
"D_en": "Demand-Side Economics", "D_hi": "मांग-पक्ष अर्थशास्त्र",
"answer": "B",
"explanation_en": "Fiscal policy is the use of government spending and taxation to influence the overall level of economic activity.",
"explanation_hi": "राजकोषीय नीति सरकारी व्यय और कराधान का उपयोग समग्र आर्थिक गतिविधि के स्तर को प्रभावित करने के लिए है।"
},
{
"subject": "Economy",
"topic": "International Trade",
"question_en": "What is the term for the exchange of goods and services between countries?",
"question_hi": "देशों के बीच वस्तुओं और सेवाओं के आदान-प्रदान के लिए शब्द क्या है?",
"A_en": "International Finance", "A_hi": "अंतरराष्ट्रीय वित्त",
"B_en": "International Trade", "B_hi": "अंतरराष्ट्रीय व्यापार",
"C_en": "Globalization", "C_hi": "वैश्वीकरण",
"D_en": "Protectionism", "D_hi": "संरक्षणवाद",
"answer": "B",
"explanation_en": "International trade is the exchange of goods and services between countries.",
"explanation_hi": "अंतरराष्ट्रीय व्यापार देशों के बीच वस्तुओं और सेवाओं के आदान-प्रदान है।"
},
{
"subject": "Economy",
"topic": "Economic Growth",
"question_en": "What is the term for an increase in the production of goods and services in an economy over a period of time?",
"question_hi": "एक निश्चित अवधि में एक अर्थव्यवस्था में वस्तुओं और सेवाओं के उत्पादन में वृद्धि के लिए शब्द क्या है?",
"A_en": "Economic Decline", "A_hi": "आर्थिक पतन",
"B_en": "Economic Stability", "B_hi": "आर्थिक स्थिरता",
"C_en": "Economic Growth", "C_hi": "आर्थिक विकास",
"D_en": "Economic Fluctuation", "D_hi": "आर्थिक उतार-चढ़ाव",
"answer": "C",
"explanation_en": "Economic growth is an increase in the production of goods and services in an economy over a period of time.",
"explanation_hi": "आर्थिक विकास एक निश्चित अवधि में एक अर्थव्यवस्था में वस्तुओं और सेवाओं के उत्पादन में वृद्धि है।"
},
{
"subject": "Economy",
"topic": "Poverty",
"question_en": "What is the term for a state of being unable to meet basic needs such as food, shelter, and clothing?",
"question_hi": "भोजन, आश्रय और कपड़ों जैसी बुनियादी जरूरतों को पूरा करने में असमर्थता की स्थिति के लिए शब्द क्या है?",
"A_en": "Unemployment", "A_hi": "बेरोजगारी",
"B_en": "Poverty", "B_hi": "गरीबी",
"C_en": "Inequality", "C_hi": "असमानता",
"D_en": "Deprivation", "D_hi": "वंचना",
"answer": "B",
"explanation_en": "Poverty is a state of being unable to meet basic needs such as food, shelter, and clothing.",
"explanation_hi": "गरीबी भोजन, आश्रय और कपड़ों जैसी बुनियादी जरूरतों को पूरा करने में असमर्थता की स्थिति है।"
},
{
"subject": "Economy",
"topic": "Human Development",
"question_en": "What is the term for the process of improving the well-being of individuals and communities through education, healthcare, and other social services?",
"question_hi": "शिक्षा, स्वास्थ्य सेवा और अन्य सामाजिक सेवाओं के माध्यम से व्यक्तियों और समुदायों के कल्याण में सुधार की प्रक्रिया के लिए शब्द क्या है?",
"A_en": "Economic Development", "A_hi": "आर्थिक विकास",
"B_en": "Human Development", "B_hi": "मानव विकास",
"C_en": "Social Development", "C_hi": "सामाजिक विकास",
"D_en": "Sustainable Development", "D_hi": "स्थायी विकास",
"answer": "B",
"explanation_en": "Human development is the process of improving the well-being of individuals and communities through education, healthcare, and other social services.",
"explanation_hi": "मानव विकास शिक्षा, स्वास्थ्य सेवा और अन्य सामाजिक सेवाओं के माध्यम से व्यक्तियों और समुदायों के कल्याण में सुधार की प्रक्रिया है।"
},
{
"subject": "Economy",
"topic": "Monetary Policy",
"question_en": "What is the term for the actions taken by a central bank to control the money supply and interest rates in an economy?",
"question_hi": "एक अर्थव्यवस्था में मुद्रा आपूर्ति और ब्याज दरों को नियंत्रित करने के लिए एक केंद्रीय बैंक द्वारा की जाने वाली क्रियाओं के लिए शब्द क्या है?",
"A_en": "Fiscal Policy", "A_hi": "राजकोषीय नीति",
"B_en": "Monetary Policy", "B_hi": "मौद्रिक नीति",
"C_en": "Supply-Side Economics", "C_hi": "आपूर्ति-पक्ष अर्थशास्त्र",
"D_en": "Demand-Side Economics", "D_hi": "मांग-पक्ष अर्थशास्त्र",
"answer": "B",
"explanation_en": "Monetary policy is the actions taken by a central bank to control the money supply and interest rates in an economy.",
"explanation_hi": "मौद्रिक नीति एक अर्थव्यवस्था में मुद्रा आपूर्ति और ब्याज दरों को नियंत्रित करने के लिए एक केंद्रीय बैंक द्वारा की जाने वाली क्रियाएं है।"
},
{
"subject": "Economy",
"topic": "Public Finance",
"question_en": "What is the term for the study of the role of government in the economy, including taxation, public expenditure, and public debt?",
"question_hi": "अर्थव्यवस्था में सरकार की भूमिका का अध्ययन, जिसमें कराधान, सार्वजनिक व्यय और सार्वजनिक ऋण शामिल है, के लिए शब्द क्या है?",
"A_en": "Private Finance", "A_hi": "निजी वित्त",
"B_en": "Public Finance", "B_hi": "सार्वजनिक वित्त",
"C_en": "International Finance", "C_hi": "अंतरराष्ट्रीय वित्त",
"D_en": "Corporate Finance", "D_hi": "कॉर्पोरेट वित्त",
"answer": "B",
"explanation_en": "Public finance is the study of the role of government in the economy, including taxation, public expenditure, and public debt.",
"explanation_hi": "सार्वजनिक वित्त अर्थव्यवस्था में सरकार की भूमिका का अध्ययन है, जिसमें कराधान, सार्वजनिक व्यय और सार्वजनिक ऋण शामिल है।"
},
{
"subject": "Economy",
"topic": "Economic Systems",
"question_en": "What is the term for an economic system in which the means of production are owned and controlled by the state?",
"question_hi": "एक आर्थिक प्रणाली जिसमें उत्पादन के साधन राज्य द्वारा स्वामित्व और नियंत्रित होते हैं, के लिए शब्द क्या है?",
"A_en": "Capitalism", "A_hi": "पूंजीवाद",
"B_en": "Socialism", "B_hi": "साम्यवाद",
"C_en": "Communism", "C_hi": "साम्यवाद",
"D_en": "Mixed Economy", "D_hi": "मिश्रित अर्थव्यवस्था",
"answer": "B",
"explanation_en": "Socialism is an economic system in which the means of production are owned and controlled by the state.",
"explanation_hi": "साम्यवाद एक आर्थिक प्रणाली है जिसमें उत्पादन के साधन राज्य द्वारा स्वामित्व और नियंत्रित होते हैं।"
}
]