[
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the main objective of the Monetary Policy of India?",
"question_hi": "भारत की मौद्रिक नीति का मुख्य उद्देश्य क्या है?",
"A_en": "To control inflation", "A_hi": "मुद्रास्फीति को नियंत्रित करने के लिए",
"B_en": "To increase economic growth", "B_hi": "आर्थिक विकास को बढ़ाने के लिए",
"C_en": "To maintain financial stability", "C_hi": "वित्तीय स्थिरता को बनाए रखने के लिए",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The main objective of the Monetary Policy of India is to control inflation, increase economic growth, and maintain financial stability.",
"explanation_hi": "भारत की मौद्रिक नीति का मुख्य उद्देश्य मुद्रास्फीति को नियंत्रित करना, आर्थिक विकास को बढ़ाना और वित्तीय स्थिरता को बनाए रखना है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is a characteristic of a planned economy?",
"question_hi": "निम्नलिखित में से कौन एक योजनाबद्ध अर्थव्यवस्था की विशेषता है?",
"A_en": "Private ownership of means of production", "A_hi": "उत्पादन के साधनों का निजी स्वामित्व",
"B_en": "Government control over resources", "B_hi": "संसाधनों पर सरकार का नियंत्रण",
"C_en": "Free market mechanism", "C_hi": "मुक्त बाजार तंत्र",
"D_en": "Laissez-faire economy", "D_hi": "लैसेज़-फ़ेयर अर्थव्यवस्था",
"answer": "B",
"explanation_en": "A planned economy is characterized by government control over resources, whereas a market economy is characterized by private ownership of means of production and free market mechanism.",
"explanation_hi": "एक योजनाबद्ध अर्थव्यवस्था में संसाधनों पर सरकार का नियंत्रण होता है, जबकि एक बाजार अर्थव्यवस्था में उत्पादन के साधनों का निजी स्वामित्व और मुक्त बाजार तंत्र होता है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the name of the economic policy implemented by the Indian government in 1991?",
"question_hi": "भारत सरकार द्वारा 1991 में लागू की गई आर्थिक नीति का नाम क्या है?",
"A_en": "New Economic Policy", "A_hi": "नई आर्थिक नीति",
"B_en": "Liberalization Policy", "B_hi": "उदारीकरण नीति",
"C_en": "Globalization Policy", "C_hi": "वैश्वीकरण नीति",
"D_en": "Structural Adjustment Policy", "D_hi": "संरचनात्मक समायोजन नीति",
"answer": "A",
"explanation_en": "The New Economic Policy was implemented by the Indian government in 1991 to liberalize and open up the economy to foreign investment and trade.",
"explanation_hi": "भारत सरकार द्वारा 1991 में नई आर्थिक नीति लागू की गई थी ताकि अर्थव्यवस्था को विदेशी निवेश और व्यापार के लिए उदार और खोला जा सके।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is a type of unemployment that occurs when workers are unable to find jobs that match their skills?",
"question_hi": "निम्नलिखित में से कौन एक प्रकार की बेरोजगारी है जो तब होती है जब श्रमिक अपने कौशल के अनुसार नौकरियों को नहीं ढूंढ पाते हैं?",
"A_en": "Frictional unemployment", "A_hi": "घर्षण बेरोजगारी",
"B_en": "Structural unemployment", "B_hi": "संरचनात्मक बेरोजगारी",
"C_en": "Cyclical unemployment", "C_hi": "चक्रीय बेरोजगारी",
"D_en": "Seasonal unemployment", "D_hi": "मौसमी बेरोजगारी",
"answer": "B",
"explanation_en": "Structural unemployment occurs when workers are unable to find jobs that match their skills, often due to changes in the economy or industry.",
"explanation_hi": "संरचनात्मक बेरोजगारी तब होती है जब श्रमिक अपने कौशल के अनुसार नौकरियों को नहीं ढूंढ पाते हैं, अक्सर अर्थव्यवस्था या उद्योग में परिवर्तन के कारण।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the term for the difference between the value of a country's exports and imports?",
"question_hi": "किसी देश के निर्यात और आयात के मूल्य के बीच के अंतर को क्या कहते हैं?",
"A_en": "Balance of trade", "A_hi": "व्यापार संतुलन",
"B_en": "Balance of payments", "B_hi": "भुगतान संतुलन",
"C_en": "Current account deficit", "C_hi": "चालू खाता घाटा",
"D_en": "Capital account surplus", "D_hi": "पूंजी खाता अधिशेष",
"answer": "A",
"explanation_en": "The balance of trade is the difference between the value of a country's exports and imports, and is a key component of the balance of payments.",
"explanation_hi": "व्यापार संतुलन किसी देश के निर्यात और आयात के मूल्य के बीच का अंतर है, और यह भुगतान संतुलन का एक प्रमुख घटक है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is a type of economic system in which the government plays a significant role in the production and distribution of goods and services?",
"question_hi": "निम्नलिखित में से कौन एक प्रकार की आर्थिक व्यवस्था है जिसमें सरकार वस्तुओं और सेवाओं के उत्पादन और वितरण में एक महत्वपूर्ण भूमिका निभाती है?",
"A_en": "Capitalist economy", "A_hi": "पूंजीवादी अर्थव्यवस्था",
"B_en": "Socialist economy", "B_hi": "सामाजवादी अर्थव्यवस्था",
"C_en": "Mixed economy", "C_hi": "मिश्रित अर्थव्यवस्था",
"D_en": "Command economy", "D_hi": "आदेश अर्थव्यवस्था",
"answer": "B",
"explanation_en": "A socialist economy is a type of economic system in which the government plays a significant role in the production and distribution of goods and services, often with the goal of promoting social welfare and reducing economic inequality.",
"explanation_hi": "सामाजवादी अर्थव्यवस्था एक प्रकार की आर्थिक व्यवस्था है जिसमें सरकार वस्तुओं और सेवाओं के उत्पादन और वितरण में एक महत्वपूर्ण भूमिका निभाती है, अक्सर सामाजिक कल्याण को बढ़ावा देने और आर्थिक असमानता को कम करने के लक्ष्य के साथ।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the term for the process of increasing the production of goods and services in a country through the use of new technologies and management techniques?",
"question_hi": "किसी देश में नए प्रौद्योगिकियों और प्रबंधन तकनीकों के उपयोग के माध्यम से वस्तुओं और सेवाओं के उत्पादन को बढ़ाने की प्रक्रिया को क्या कहते हैं?",
"A_en": "Industrialization", "A_hi": "औद्योगीकरण",
"B_en": "Modernization", "B_hi": "आधुनिकीकरण",
"C_en": "Development", "C_hi": "विकास",
"D_en": "Growth", "D_hi": "वृद्धि",
"answer": "B",
"explanation_en": "Modernization is the process of increasing the production of goods and services in a country through the use of new technologies and management techniques, often with the goal of improving economic efficiency and competitiveness.",
"explanation_hi": "आधुनिकीकरण किसी देश में नए प्रौद्योगिकियों और प्रबंधन तकनीकों के उपयोग के माध्यम से वस्तुओं और सेवाओं के उत्पादन को बढ़ाने की प्रक्रिया है, अक्सर आर्थिक दक्षता और प्रतिस्पर्धा को बेहतर बनाने के लक्ष्य के साथ।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is a type of economic indicator that measures the total value of goods and services produced within a country's borders?",
"question_hi": "निम्नलिखित में से कौन एक प्रकार का आर्थिक संकेतक है जो किसी देश की सीमा के भीतर उत्पादित वस्तुओं और सेवाओं के कुल मूल्य को मापता है?",
"A_en": "Gross Domestic Product (GDP)", "A_hi": "सकल घरेलू उत्पाद (जीडीपी)",
"B_en": "Gross National Product (GNP)", "B_hi": "सकल राष्ट्रीय उत्पाद (जीएनपी)",
"C_en": "Net Domestic Product (NDP)", "C_hi": "शुद्ध घरेलू उत्पाद (एनडीपी)",
"D_en": "National Income", "D_hi": "राष्ट्रीय आय",
"answer": "A",
"explanation_en": "Gross Domestic Product (GDP) is a type of economic indicator that measures the total value of goods and services produced within a country's borders, and is often used as a measure of a country's economic activity and growth.",
"explanation_hi": "सकल घरेलू उत्पाद (जीडीपी) एक प्रकार का आर्थिक संकेतक है जो किसी देश की सीमा के भीतर उत्पादित वस्तुओं और सेवाओं के कुल मूल्य को मापता है, और अक्सर एक देश की आर्थिक गतिविधि और वृद्धि के माप के रूप में उपयोग किया जाता है।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "Which of the following is a type of economic system in which private individuals and businesses own and operate the majority of the means of production?",
"question_hi": "निम्नलिखित में से कौन एक प्रकार की आर्थिक व्यवस्था है जिसमें निजी व्यक्तियों और व्यवसायों के पास उत्पादन के साधनों का अधिकांश हिस्सा है?",
"A_en": "Capitalist economy", "A_hi": "पूंजीवादी अर्थव्यवस्था",
"B_en": "Socialist economy", "B_hi": "सामाजवादी अर्थव्यवस्था",
"C_en": "Mixed economy", "C_hi": "मिश्रित अर्थव्यवस्था",
"D_en": "Command economy", "D_hi": "आदेश अर्थव्यवस्था",
"answer": "A",
"explanation_en": "A capitalist economy is a type of economic system in which private individuals and businesses own and operate the majority of the means of production, with the goal of maximizing profits.",
"explanation_hi": "पूंजीवादी अर्थव्यवस्था एक प्रकार की आर्थिक व्यवस्था है जिसमें निजी व्यक्तियों और व्यवसायों के पास उत्पादन के साधनों का अधिकांश हिस्सा है, और लाभ को अधिकतम करने के लक्ष्य के साथ।"
},
{
"subject": "Economy",
"topic": "Indian Economy",
"question_en": "What is the term for the movement of people from rural areas to urban areas in search of better job opportunities?",
"question_hi": "ग्रामीण क्षेत्रों से शहरी क्षेत्रों में बेहतर नौकरी की तलाश में लोगों की आवाजाही को क्या कहते हैं?",
"A_en": "Urbanization", "A_hi": "शहरीकरण",
"B_en": "Ruralization", "B_hi": "ग्रामीणीकरण",
"C_en": "Migration", "C_hi": "प्रवास",
"D_en": "Emigration", "D_hi": "अप्रवास",
"answer": "A",
"explanation_en": "Urbanization is the term for the movement of people from rural areas to urban areas in search of better job opportunities, often leading to the growth and development of cities.",
"explanation_hi": "शहरीकरण ग्रामीण क्षेत्रों से शहरी क्षेत्रों में बेहतर नौकरी की तलाश में लोगों की आवाजाही को कहते हैं, अक्सर शहरों के विकास और वृद्धि की ओर ले जाता है।"
}
]