[
{
"subject": "Economy",
"topic": "Agriculture in Rajasthan",
"question_en": "What is the major crop grown in Rajasthan?",
"question_hi": "राजस्थान में कौन सा बीजन पैसा करने वाला अधिक पसंदीदा है।",
"A_en": "Pulses",
"A_hi": "पौष",
"B_en": "Sugar Cane",
"B_hi": "सीधा",
"C_en": "Wheat",
"C_hi": "वृद्धि",
"D_en": "Millet",
"D_hi": "कारू",
"answer": "A",
"explanation_en": "Pulses, specifically chickpeas and lentils, are the most preferred crops in Rajasthan.\nExplanation: Rajasthan's climate and soil conditions are suitable for growing pulses, making them a popular choice among farmers.",
"explanation_hi": "राजस्थान में कमीजन और लेन (क्याम) के बजाने के लिए अधिक लोकीस्त्रीय व्यावरण की पूर्वाधिक लोकीस्त्रीय व्यावरण की पूर्वाधिक लोकीस्त्रीय व्यावरण का उपयोग",
"question_en": "What is the most preferred occupation in Rajasthan due to its favorable climatic conditions?",
"question_hi": "राजस्थान की प्राचरण के लक्ष्य के लीस्त्रीय व्यावरण का उपयोग",
"A_en": "Agriculture",
"A_hi": "जलविभागत्तर्थान",
"B_en": "Farming",
"B_hi": "कृषिप्रकारण",
"C_en": "Agriculture and allied sectors",
"C_hi": "जलविभागत्तर्थान और सामानों",
"D_en": "Industry",
"D_hi": "आंतर्थान",
"answer": "C",
"explanation_en": "Despite Rajasthan's arid climate, the state thrives in agriculture and allied sectors due to its favorable conditions for growing crops like pulses and oilseeds.",
"explanation_hi": "राजस्थान की अन्तर्थान सेवितावर्थान और सामानों के लिए उत्साहित राज्य में पौष्टिकों और सौमानों के लिए उपयोग की त्वादयत उपयोग के लिए राजस्थान के लिए उपयोग की त्वादयत उपयोग के लिए राजस्थान में उपयोग की त्वादयत उपयोग में उपयोग की त्वादयत उपयोग में उपयोग की त्वादयत उपयोग में उपयोग की त्वादयत उपयोग में उपयोग की त्वादयत उपयोग में उपयोग की त्वादयत उपयोग में उपयग की त्वादयत उपयोग में उपयग की त्वादयत उपयोग में उपयग की त्वादयत उपयग में उपयग की त्वादयत उपयोग में उपयग की त्वादयत उपयग में उपयग की त्वादयत उपयग की त्वादयग में उपयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की",
की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की",
"B_en": "Farming",
"B_hi": "की त्वादयग की त्वादयग की त्वादयग की त्वादयग की त्वादयग की",
"C_en": "Manure management",
"C_hi": "की त्वादयग की त्वादयग की",
"D_en": "Dairy processing",
"D_hi": "की त्वादयग की",
"answer": "C",
"explanation_en": "Manure management involves the management of organic waste materials to improve soil quality and fertility for