[
{
"subject": "Economy",
"topic": "Bhartiya Arthvyavastha ka Swaroop aur Vikas",
"question_en": "What is the official language of India?",
"question_hi": "भारतीय क्षेत्र के अधिकार भाषा क्या है?",
"A_en": "Hindi", "A_hi": "हिंदी",
"B_en": "Marathi", "B_hi": "मराठी",
"C_en": "Tamil", "C_hi": "तंगीय",
"D_en": "English", "D_hi": "अंग्रेजी",
"answer": "D",
"explanation_en": "English is the official language of India as per the Eighth Schedule of the Indian Constitution. Although Hindi and Marathi are widely spoken languages, English plays a significant role in the country's administration and communication.",
"explanation_hi": "भारतीय संवत क्षेत्र के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भारतीय भाषा निर्द्वार्थ मुख्यां के विधि में भाषा निर्द्वार्थ मुख्यां के विधि में भाषा निर्दि में भाषा निर्द्वार्थ में भाषा निर्द्वार्थ में भाषा निर्द्वार्थ में भाषा निर्द्थ में भाषा निर्थ में भाषा निर्थ में भाषा निर्थ में भाषा निर्थ में भाषा निर्थ में भाषा निर्थ में भाषा निर्थ में भाषा निर्थ में भाषा निर्थ में भाषा निर्थ में भाषा निर्थ में भाषा निर्थ में भाषा निर्थ में भाषा निर्थ",
"explanation_en": "In India, the official language is Hindi. However, English is also widely spoken and used in various fields such as administration, education, and business. The Constitution of India recognizes both Hindi and English as official languages.",
"explanation_hi": "भाषा निर्थ में भाषा निर्थ में भाषा निर्थ में भाषा निर्थ भाषा निर्थ में भाषा निर्थ भाषा निर्थ भाषा निर्थ",
]
]