[
{
    "subject": "Economy",
    "topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
    "question_en": "What is the main objective of the Fiscal Policy?",
    "question_hi": "राजकोषीय नीति का मुख्य उद्देश्य क्या है?",
    "A_en": "Price stability", 
    "A_hi": "भाव स्थिरता",
    "B_en": "High economic growth", 
    "B_hi": "उच्च आर्थिक वृद्धि",
    "C_en": "Full employment", 
    "C_hi": "पूर्ण रोजगार",
    "D_en": "To control inflation", 
    "D_hi": "चालू खाता घाटा नियंत्रित करना",
    "answer": "C",
    "explanation_en": "Fiscal policy is used to achieve full employment, which is the main objective.",
    "explanation_hi": "राजकोषीय नीति का मुख्य उद्देश्य पूर्ण रोजगार प्राप्त करना है।"
},
{
    "subject": "Economy",
    "topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
    "question_en": "What is the difference between Current Account Deficit (CAD) and Fiscal Deficit?",
    "question_hi": "क्या है कURRENT अकाउंट डेफिसिट (CAD) और फ़िस्कल डेफिसिट में अंतर?",
    "A_en": "CAD is the difference between government spending and revenue, while Fiscal Deficit is the difference between government spending and revenue minus the central bank's net worth.", 
    "A_hi": "CAD सरकारी व्यय और आय के बीच का अंतर है, जबकि फ़िस्कल डेफिसिट सरकारी व्यय और आय से नेटवर्थ को घटाने के बाद का अंतर है",
    "B_en": "CAD is the difference between government spending and revenue, while Fiscal Deficit is the difference between government spending and revenue plus the central bank's net worth.", 
    "B_hi": "CAD सरकारी व्यय और आय के बीच का अंतर है, जबकि फ़िस्कल डेफिसिट सरकारी व्यय और आय से नेटवर्थ को जोड़ने के बाद का अंतर है",
    "C_en": "CAD is the difference between government spending and revenue plus the central bank's net worth, while Fiscal Deficit is the difference between government spending and revenue minus the central bank's net worth.", 
    "C_hi": "CAD सरकारी व्यय और आय से नेटवर्थ को जोड़ने के बाद का अंतर है, जबकि फ़िस्कल डेफिसिट सरकारी व्यय और आय से नेटवर्थ को घटाने के बाद का अंतर है",
    "D_en": "CAD and Fiscal Deficit are the same thing.", 
    "D_hi": "CAD और फ़िस्कल डेफिसिट एक ही चीज़ हैं",
    "answer": "C",
    "explanation_en": "CAD is the difference between government spending and revenue plus the central bank's net worth, while Fiscal Deficit is the difference between government spending and revenue minus the central bank's net worth.",
    "explanation_hi": "CAD सरकारी व्यय और आय से नेटवर्थ को जोड़ने के बाद का अंतर है, जबकि फ़िस्कल डेफिसिट सरकारी व्यय और आय से नेटवर्थ को घटाने के बाद का अंतर है।"
},
{
    "subject": "Economy",
    "topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
    "question_en": "What is the main function of the Reserve Bank of India (RBI)?",
    "question_hi": "भारतीय रिजर्व बैंक (RBI) का मुख्य कार्य क्या है?",
    "A_en": "To control inflation", 
    "A_hi": "भाव स्थिरता नियंत्रित करना",
    "B_en": "To maintain price stability", 
    "B_hi": "भाव स्थिरता बनाए रखना",
    "C_en": "To regulate money supply", 
    "C_hi": "सकल रिजर्व पूंजी का प्रबंधन करना",
    "D_en": "To maintain full employment", 
    "D_hi": "पूर्ण रोजगार बनाए रखना",
    "answer": "C",
    "explanation_en": "RBI's main function is to regulate money supply and maintain price stability.",
    "explanation_hi": "RBI का मुख्य कार्य सकल रिजर्व पूंजी का प्रबंधन करना और भाव स्थिरता बनाए रखना है।"
},
{
    "subject": "Economy",
    "topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
    "question_en": "What is the difference between Cash Budget and Revised Budget?",
    "question_hi": "क्या है कैश बजट और रिवाइज्ड बजट में अंतर?",
    "A_en": "Cash Budget is the budget prepared for the current financial year, while Revised Budget is the budget prepared for the next financial year.", 
    "A_hi": "कैश बजट वर्तमान वित्तीय वर्ष के लिए तैयार किया गया बजट है, जबकि रिवाइज्ड बजट अगले वित्तीय वर्ष के लिए तैयार किया गया बजट है",
    "B_en": "Cash Budget is the budget prepared for the next financial year, while Revised Budget is the budget prepared for the current financial year.", 
    "B_hi": "कैश बजट अगले वित्तीय वर्ष के लिए तैयार किया गया बजट है, जबकि रिवाइज्ड बजट वर्तमान वित्तीय वर्ष के लिए तैयार किया गया बजट है",
    "C_en": "Cash Budget is the budget prepared for the current financial year, while Revised Budget is the budget prepared for the same financial year but with some changes.", 
    "C_hi": "कैश बजट वर्तमान वित्तीय वर्ष के लिए तैयार किया गया बजट है, जबकि रिवाइज्ड बजट एक ही वित्तीय वर्ष के लिए तैयार किया गया बजट है लेकिन कुछ बदलाव के साथ",
    "D_en": "Cash Budget and Revised Budget are the same thing.", 
    "D_hi": "कैश बजट और रिवाइज्ड बजट एक ही चीज़ हैं",
    "answer": "C",
    "explanation_en": "Cash Budget is the budget prepared for the current financial year, while Revised Budget is the budget prepared for the same financial year but with some changes.",
    "explanation_hi": "कैश बजट वर्तमान वित्तीय वर्ष के लिए तैयार किया गया बजट है, जबकि रिवाइज्ड बजट एक ही वित्तीय वर्ष के लिए तैयार किया गया बजट है लेकिन कुछ बदलाव के साथ"
},
{
    "subject": "Economy",
    "topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
    "question_en": "What is the difference between Public Expenditure and Public Revenue?",
    "question_hi": "क्या है सार्वजनिक व्यय और सार्वजनिक आय में अंतर?",
    "A_en": "Public Expenditure is the amount spent by the government on various activities, while Public Revenue is the amount received by the government from various sources.", 
    "A_hi": "सार्वजनिक व्यय सरकार द्वारा विभिन्न गतिविधियों पर व्यय की गई राशि है, जबकि सार्वजनिक आय सरकार से विभिन्न स्रोतों से प्राप्त राशि है",
    "B_en": "Public Expenditure is the amount received by the government from various sources, while Public Revenue is the amount spent by the government on various activities.", 
    "B_hi": "सार्वजनिक व्यय सरकार से विभिन्न स्रोतों से प्राप्त राशि है, जबकि सार्वजनिक आय सरकार द्वारा विभिन्न गतिविधियों पर व्यय की गई राशि है",
    "C_en": "Public Expenditure and Public Revenue are the same thing.", 
    "C_hi": "सार्वजनिक व्यय और सार्वजनिक आय एक ही चीज़ हैं",
    "D_en": "Public Expenditure is the amount received by the government from various sources minus the amount spent by the government on various activities.", 
    "D_hi": "सार्वजनिक व्यय सरकार से विभिन्न स्रोतों से प्राप्त राशि से सरकार द्वारा विभिन्न गतिविधियों पर व्यय की गई राशि को घटाकर प्राप्त की जाती है",
    "answer": "A",
    "explanation_en": "Public Expenditure is the amount spent by the government on various activities, while Public Revenue is the amount received by the government from various sources.",
    "explanation_hi": "सार्वजनिक व्यय सरकार द्वारा विभिन्न गतिविधियों पर व्यय की गई राशि है, जबकि सार्वजनिक आय सरकार से विभिन्न स्रोतों से प्राप्त राशि है"
},
{
    "subject": "Economy",
    "topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
    "question_en": "What is the main objective of the Monetary Policy?",
    "question_hi": "राजमान्य नीति का मुख्य उद्देश्य क्या है?",
    "A_en": "To control inflation", 
    "A_hi": "भाव स्थिरता नियंत्रित करना",
    "B_en": "To maintain price stability", 
    "B_hi": "भाव स्थिरता बनाए रखना",
    "C_en": "To regulate money supply", 
    "C_hi": "सकल रिजर्व पूंजी का प्रबंधन करना",
    "D_en": "To maintain full employment", 
    "D_hi": "पूर्ण रोजगार बनाए रखना",
    "answer": "B",
    "explanation_en": "Monetary Policy's main objective is to maintain price stability.",
    "explanation_hi": "राजमान्य नीति का मुख्य उद्देश्य भाव स्थिरता बनाए रखना है।"
},
{
    "subject": "Economy",
    "topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
    "question_en": "What is the difference between Budget and Actual Expenditure?",
    "question_hi": "क्या है बजट और वास्तविक व्यय में अंतर?",
    "A_en": "Budget Expenditure is the amount allocated in the budget, while Actual Expenditure is the amount actually spent by the government.", 
    "A_hi": "बजट व्यय बजट में आवंटित राशि है, जबकि वास्तविक व्यय सरकार द्वारा वास्तव में व्यय की गई राशि है",
    "B_en": "Budget Expenditure is the amount actually spent by the government, while Actual Expenditure is the amount allocated in the budget.", 
    "B_hi": "बजट व्यय सरकार द्वारा वास्तव में व्यय की गई राशि है, जबकि वास्तविक व्यय बजट में आवंटित राशि है",
    "C_en": "Budget Expenditure and Actual Expenditure are the same thing.", 
    "C_hi": "बजट व्यय और वास्तविक व्यय एक ही चीज़ हैं",
    "D_en": "Budget Expenditure is the amount received by the government from various sources, while Actual Expenditure is the amount spent by the government on various activities.", 
    "D_hi": "बजट व्यय सरकार से विभिन्न स्रोतों से प्राप्त राशि है, जबकि वास्तविक व्यय सरकार द्वारा विभिन्न गतिविधियों पर व्यय की गई राशि है",
    "answer": "A",
    "explanation_en": "Budget Expenditure is the amount allocated in the budget, while Actual Expenditure is the amount actually spent by the government.",
    "explanation_hi": "बजट व्यय बजट में आवंटित राशि है, जबकि वास्तविक व्यय सरकार द्वारा वास्तव में व्यय की गई राशि है।"
},
{
    "subject": "Economy",
    "topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
    "question_en": "What is the difference between Fiscal Policy and Monetary Policy?",
    "question_hi": "क्या है राजकोषीय नीति और राजमान्य नीति में अंतर?",
    "A_en": "Fiscal Policy is used to control inflation, while Monetary Policy is used to regulate money supply.", 
    "A_hi": "राजकोषीय नीति भाव स्थिरता नियंत्रित करने के लिए उपयोग की जाती है, जबकि राजमान्य नीति सकल रिजर्व पूंजी का प्रबंधन करती है",
    "B_en": "Fiscal Policy is used to regulate money supply, while Monetary Policy is used to control inflation.", 
    "B_hi": "राजकोषीय नीति सकल रिजर्व पूंजी का प्रबंधन करती है, जबकि राजमान्य नीति भाव स्थिरता नियंत्रित करती है",
    "C_en": "Fiscal Policy and Monetary Policy are the same thing.", 
    "C_hi": "राजकोषीय नीति और राजमान्य नीति एक ही चीज़ हैं",
    "D_en": "Fiscal Policy is used to control inflation and regulate money supply, while Monetary Policy is used to control inflation only.", 
    "D_hi": "राजकोषीय नीति भाव स्थिरता नियंत्रित करने और सकल रिजर्व पूंजी का प्रबंधन करने के लिए उपयोग की जाती है, जबकि राजमान्य नीति भाव स्थिरता नियंत्रित करने के लिए उपयोग की जाती है",
    "answer": "A",
    "explanation_en": "Fiscal Policy is used to control inflation, while Monetary Policy is used to regulate money supply.",
    "explanation_hi": "राजकोषीय नीति भाव स्थिरता नियंत्रित करने के लिए उपयोग की जाती है, जबकि राजमान्य नीति सकल रिजर्व पूंजी का प्रबंधन करती है।"
},
{
    "subject": "Economy",
    "topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
    "question_en": "What is the difference between Central Budget and State Budget?",
    "question_hi": "क्या है केंद्रीय बजट और राज्य बजट में अंतर?",
    "A_en": "Central Budget is the budget prepared by the central government, while State Budget is the budget prepared by the state government.", 
    "A_hi": "केंद्रीय बजट केंद्र सरकार द्वारा तैयार किया गया बजट है, जबकि राज्य बजट राज्य सरकार द्वारा तैयार किया गया बजट है",
    "B_en": "Central Budget is the budget prepared by the state government, while State Budget is the budget prepared by the central government.", 
    "B_hi": "केंद्रीय बजट राज्य सरकार द्वारा तैयार किया गया बजट है, जबकि राज्य बजट केंद्र सरकार द्वारा तैयार किया गया बजट है",
    "C_en": "Central Budget and State Budget are the same thing.", 
    "C_hi": "केंद्रीय बजट और राज्य बजट एक ही चीज़ हैं",
    "D_en": "Central Budget is the budget prepared by the central and state governments together, while State Budget is the budget prepared by the central government alone.", 
    "D_hi": "केंद्रीय बजट केंद्र और राज्य सरकार के संयुक्त रूप से तैयार किया गया बजट है, जबकि राज्य बजट केवल केंद्र सरकार द्वारा तैयार किया गया बजट है",
    "answer": "A",
    "explanation_en": "Central Budget is the budget prepared by the central government, while State Budget is the budget prepared by the state government.",
    "explanation_hi": "केंद्रीय बजट केंद्र सरकार द्वारा तैयार किया गया बजट है, जबकि राज्य बजट राज्य सरकार द्वारा तैयार किया गया बजट है।