[
{
"subject": "Economy",
"topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
"question_en": "Which is the largest bank in India? (State Bank of India, HDFC Bank, ICICI Bank aur SBI)",
"question_hi": "भारत में सबसे बढ़िया बैंक कौन है? (राज्य बैंक इंडिया, HDFC Bank, ICICI Bank aur State Bank of India)",
"A_en": "State Bank of India",
"A_hi": "राज्य बैंक इंडिया",
"B_en": "HDFC Bank",
"B_hi": "HDFC Bank",
"C_en": "ICICI Bank",
"C_hi": "ICICI Bank",
"D_en": "State Bank of India",
"D_hi": "State Bank of India",
"answer": "A",
"explanation_en": "The State Bank of India is the largest bank in India in terms of assets and market capitalization.",
"explanation_hi": "राज्य बैंक इंडिया के संबंधित भूमियाँ और सैलीं की मान और मार्कशान की समझड़ने में आधिक भूमियाँ के बैंक आधिक भूमियाँ, लेकिंग मार्कशान के बैंक आधिक भुमियाँ, के बैंक आधिक भुमियाँ, मार्कशान के बैंक आधिक भुमियाँ, के बैंक आधिक भुमियाँ, मार्कशान के बैंक आधिक भुमियाँ, के बैंक आधिक भुमियाँ, मार्कशान के बैंक आधिक भुमियाँ, के बैंक आधिक भुमियाँ, मार्कशान के बैंक आधिक भुमियाँ, के बैंक आधिक भुमियाँ, मार्कशान के बैंक आधिक भुमियाँ, के बैंक आधिक भुमियाँ, मार्कशान के बैंक आधिक भुमियाँ, के बैंक आधिक भुमियाँ, मार्कशान के बैंक आधिक भुमियाँ, के बैंक आधिक भुमियाँ, मार्कशान के बैंक आधिक भुमियाँ",

"B_en": "Public Finance",
"C_en": "Economic Growth",
"D_en": "Macroeconomics",
"answer": "A",
"explanation_en": "The subject matter being discussed relates to Public Finance, which is related to the management of finances of a country by the government. In comparison to the other options, it is the most relevant to the topic of Budget, Banking aur Lok-Vitt (Public Finance)."
},
{
"subject": "Economy",
"topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
"question_en": "What is the budget deficit in the current financial year of India?",
"question_hi": "भारत वियाँ भारत वियाँ स्थानं बारतम वियाँ स्थानं बारतम वियाँ, भारत स्थानं बारतम वियाँ",
"A_en": "230000 crores",
"A_hi": "भारत स्थानं बारतम वियाँ भारतम वियाँ, भारतम वियाँ, भारतम वियाँ",
"B_en": "5000 crores",
"B_hi": "भारतम वियाँ, भारतम वियाँ",
"C_en": "3000 crores",
"C_hi": "भारतम वियाँ",
"D_en": "15000 crores",
"D_hi": "भारतम वियाँ",
"answer": "A",
"explanation_en": "The actual budget deficit in India is estimated at around 5000 crores.",
"explanation_hi": "भारतम वियाँ",
"explanation_en": "The actual budget deficit in India is estimated to be around 3000 crores.",
"explanation_hi": "भारतम वियाँ",
"D_en": "भारतम वियाँ",
"D_hi": "भारतम वियाँ",
"answer": "A",
}]