[
{
"subject": "Economy",
"topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
"question_en": "Kya Central Bank of India ki bhoomika ek aise bank ki hoti hai jiska nishkarsh vyaparik bankon kee tarah hota hai?",
"question_hi": "क्या भारत का केंद्रीय बैंक एक ऐसे बैंक की भूमिका निभाता है जिसका निष्कर्ष व्यापारिक बैंकों की तरह होता है?",
"A_en": "Ha", "A_hi": "हां",
"B_en": "Nahin", "B_hi": "नहीं",
"C_en": "Iska uttar nahi jaanta hai", "C_hi": "इसका उत्तर नहीं जानते हैं",
"D_en": "Iska nishkarsh vyaparik bankon kee tarah hota hai", "D_hi": "इसका निष्कर्ष व्यापारिक बैंकों की तरह होता है",
"answer": "D",
"explanation_en": "Central Bank of India ki bhoomika ek aise bank ki hoti hai jiska nishkarsh vyaparik bankon kee tarah hota hai, lekin use vyaparik bankon ke tarah nahin kaam karna chahiye.",
"explanation_hi": "भारत का केंद्रीय बैंक एक ऐसे बैंक की भूमिका निभाता है जिसका निष्कर्ष व्यापारिक बैंकों की तरह होता है, लेकिन इसे व्यापारिक बैंकों की तरह काम नहीं करना चाहिए।"
},
{
"subject": "Economy",
"topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
"question_en": "Kya Deficit Financing ek aisa tareeka hai jiska upyog karke sarkar apne anudan ko pura kar sakta hai?",
"question_hi": "क्या डिफिसिट फाइनेंसिंग एक ऐसा तरीका है जिसका उपयोग करके सरकार अपने अनुदान को पूरा कर सकती है?",
"A_en": "Ha", "A_hi": "हां",
"B_en": "Nahin", "B_hi": "नहीं",
"C_en": "Iska uttar nahi jaanta hai", "C_hi": "इसका उत्तर नहीं जानते हैं",
"D_en": "Yeh ek prakriya hai jismein sarkar apne anudan ko pura karne ke liye loan lete hain", "D_hi": "यह एक प्रक्रिया है जिसमें सरकार अपने अनुदान को पूरा करने के लिए कर्ज लेते हैं",
"answer": "B",
"explanation_en": "Deficit Financing ek aisa tareeka nahin hai jiska upyog karke sarkar apne anudan ko pura kar sakta hai. Yeh ek prakriya hai jismein sarkar apne anudan ko pura karne ke liye loan lete hain, jisse unke budget mein bhugtan ki kami hoti hai.",
"explanation_hi": "डिफिसिट फाइनेंसिंग एक ऐसा तरीका नहीं है जिसका उपयोग करके सरकार अपने अनुदान को पूरा कर सकती है। यह एक प्रक्रिया है जिसमें सरकार अपने अनुदान को पूरा करने के लिए कर्ज लेते हैं, जिससे उनके बजट में भुगतान की कमी होती है।"
},
{
"subject": "Economy",
"topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
"question_en": "Kya Laffer Curve ek aisa graph hai jiska upyog aap ke uplabdh income ko badhana ke liye karna chahiye?",
"question_hi": "क्या लाफर कर्व एक ऐसा ग्राफ है जिसका उपयोग आप अपने उपलब्ध आय को बढ़ाने के लिए करना चाहिए?",
"A_en": "Ha", "A_hi": "हां",
"B_en": "Nahin", "B_hi": "नहीं",
"C_en": "Iska uttar nahi jaanta hai", "C_hi": "इसका उत्तर नहीं जानते हैं",
"D_en": "Yeh ek graph hai jiska upyog aapke uplabdh income ko badhane ke liye karna chahiye, lekin iska upyog vyaparik kshetra mein bhi kiya ja sakta hai", "D_hi": "यह एक ग्राफ है जिसका उपयोग आप अपने उपलब्ध आय को बढ़ाने के लिए करना चाहिए, लेकिन इसका उपयोग व्यावसायिक क्षेत्र में भी किया जा सकता है",
"answer": "B",
"explanation_en": "Laffer Curve ek aisa graph nahin hai jiska upyog aap ke uplabdh income ko badhana ke liye karna chahiye. Yeh ek graph hai jiska upyog aapke uplabdh income ko badhane ke liye karna chahiye, lekin iska upyog vyaparik kshetra mein bhi kiya ja sakta hai.",
"explanation_hi": "लाफर कर्व एक ऐसा ग्राफ नहीं है जिसका उपयोग आप अपने उपलब्ध आय को बढ़ाने के लिए करना चाहिए। यह एक ग्राफ है जिसका उपयोग आप अपने उपलब्ध आय को बढ़ाने के लिए करना चाहिए, लेकिन इसका उपयोग व्यावसायिक क्षेत्र में भी किया जा सकता है।"
},
{
"subject": "Economy",
"topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
"question_en": "Kya Fiscal Policy ek aisa tareeka hai jiska upyog karke sarkar apne arthik vikas ko badhane ke liye karna chahiye?",
"question_hi": "क्या फिस्कल पॉलिसी एक ऐसा तरीका है जिसका उपयोग करके सरकार अपने आर्थिक विकास को बढ़ाने के लिए करना चाहिए?",
"A_en": "Ha", "A_hi": "हां",
"B_en": "Nahin", "B_hi": "नहीं",
"C_en": "Iska uttar nahi jaanta hai", "C_hi": "इसका उत्तर नहीं जानते हैं",
"D_en": "Yeh ek prakriya hai jismein sarkar apne arthik vikas ko badhane ke liye vyaya kar sakta hai", "D_hi": "यह एक प्रक्रिया है जिसमें सरकार अपने आर्थिक विकास को बढ़ाने के लिए व्यय कर सकती है",
"answer": "D",
"explanation_en": "Fiscal Policy ek aisa tareeka hai jiska upyog karke sarkar apne arthik vikas ko badhane ke liye karna chahiye. Yeh ek prakriya hai jismein sarkar apne arthik vikas ko badhane ke liye vyaya kar sakta hai.",
"explanation_hi": "फिस्कल पॉलिसी एक ऐसा तरीका है जिसका उपयोग करके सरकार अपने आर्थिक विकास को बढ़ाने के लिए करना चाहिए। यह एक प्रक्रिया है जिसमें सरकार अपने आर्थिक विकास को बढ़ाने के लिए व्यय कर सकती है।"
},
{
"subject": "Economy",
"topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
"question_en": "Kya Monetary Policy ek aisa tareeka hai jiska upyog karke sarkar apne arthik sthiti ko niyantrit kar sake?",
"question_hi": "क्या मोनेटरी पॉलिसी एक ऐसा तरीका है जिसका उपयोग करके सरकार अपने आर्थिक स्थिति को नियंत्रित कर सकती है?",
"A_en": "Ha", "A_hi": "हां",
"B_en": "Nahin", "B_hi": "नहीं",
"C_en": "Iska uttar nahi jaanta hai", "C_hi": "इसका उत्तर नहीं जानते हैं",
"D_en": "Yeh ek prakriya hai jismein sarkar apne arthik sthiti ko niyantrit karne ke liye kiye jaane wale nirnayon ka upyog hota hai", "D_hi": "यह एक प्रक्रिया है जिसमें सरकार अपने आर्थिक स्थिति को नियंत्रित करने के लिए लिए जाने वाले निर्णयों का उपयोग होता है",
"answer": "D",
"explanation_en": "Monetary Policy ek aisa tareeka hai jiska upyog karke sarkar apne arthik sthiti ko niyantrit kar sake. Yeh ek prakriya hai jismein sarkar apne arthik sthiti ko niyantrit karne ke liye kiye jaane wale nirnayon ka upyog hota hai.",
"explanation_hi": "मोनेटरी पॉलिसी एक ऐसा तरीका है जिसका उपयोग करके सरकार अपने आर्थिक स्थिति को नियंत्रित कर सकती है। यह एक प्रक्रिया है जिसमें सरकार अपने आर्थिक स्थिति को नियंत्रित करने के लिए लिए जाने वाले निर्णयों का उपयोग होता है।"
},
{
"subject": "Economy",
"topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
"question_en": "Kya Automatic Fiscal Balance ek aisa tareeka hai jiska upyog karke sarkar apne arthik sthiti ko niyantrit kar sake?",
"question_hi": "क्या ऑटोमेटिक फिस्कल बैलेंस एक ऐसा तरीका है जिसका उपयोग करके सरकार अपने आर्थिक स्थिति को नियंत्रित कर सकती है?",
"A_en": "Ha", "A_hi": "हां",
"B_en": "Nahin", "B_hi": "नहीं",
"C_en": "Iska uttar nahi jaanta hai", "C_hi": "इसका उत्तर नहीं जानते हैं",
"D_en": "Yeh ek prakriya hai jismein sarkar apne arthik sthiti ko niyantrit karne ke liye kiye jaane wale nirnayon ka upyog hota hai", "D_hi": "यह एक प्रक्रिया है जिसमें सरकार अपने आर्थिक स्थिति को नियंत्रित करने के लिए लिए जाने वाले निर्णयों का उपयोग होता है",
"answer": "B",
"explanation_en": "Automatic Fiscal Balance ek aisa tareeka nahin hai jiska upyog karke sarkar apne arthik sthiti ko niyantrit kar sake. Yeh ek prakriya hai jismein sarkar apne arthik sthiti ko niyantrit karne ke liye kiye jaane wale nirnayon ka upyog hota hai.",
"explanation_hi": "ऑटोमेटिक फिस्कल बैलेंस एक ऐसा तरीका नहीं है जिसका उपयोग करके सरकार अपने आर्थिक स्थिति को नियंत्रित कर सकती है। यह एक प्रक्रिया है जिसमें सरकार अपने आर्थिक स्थिति को नियंत्रित करने के लिए लिए जाने वाले निर्णयों का उपयोग होता है।"
},
{
"subject": "Economy",
"topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
"question_en": "Kya Fiscal Responsibility and Budget Management Act (FRBM) ek aisa act hai jiska upyog sarkar apne arthik sthiti ko niyantrit karne ke liye karna chahiye?",
"question_hi": "क्या फिस्कल रिस्पॉन्सिबिलिटी और बजट मैनेजमेंट एक्ट (FRBM) एक ऐसा अधिनियम है जिसका उपयोग सरकार अपने आर्थिक स्थिति को नियंत्रित करने के लिए करना चाहिए?",
"A_en": "Ha", "A_hi": "हां",
"B_en": "Nahin", "B_hi": "नहीं",
"C_en": "Iska uttar nahi jaanta hai", "C_hi": "इसका उत्तर नहीं जानते हैं",
"D_en": "Yeh ek prakriya hai jismein sarkar apne arthik sthiti ko niyantrit karne ke liye kiye jaane wale nirnayon ka upyog hota hai", "D_hi": "यह एक प्रक्रिया है जिसमें सरकार अपने आर्थिक स्थिति को नियंत्रित करने के लिए लिए जाने वाले निर्णयों का उपयोग होता है",
"answer": "A",
"explanation_en": "Fiscal Responsibility and Budget Management Act (FRBM) ek aisa act hai jiska upyog sarkar apne arthik sthiti ko niyantrit karne ke liye karna chahiye. Yeh ek prakriya hai jismein sarkar apne arthik sthiti ko niyantrit karne ke liye kiye jaane wale nirnayon ka upyog hota hai.",
"explanation_hi": "फिस्कल रिस्पॉन्सिबिलिटी और बजट मैनेजमेंट एक्ट (FRBM) एक ऐसा अधिनियम है जिसका उपयोग सरकार अपने आर्थिक स्थिति को नियंत्रित करने के लिए करना चाहिए। यह एक प्रक्रिया है जिसमें सरकार अपने आर्थिक स्थिति को नियंत्रित करने के लिए लिए जाने वाले निर्णयों का उपयोग होता है।"
},
{
"subject": "Economy",
"topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
"question_en": "Kya Public Sector Banking Reform (PSBR) ek aisa tareeka hai jiska upyog karke sarkar apne arthik sthiti ko niyantrit kar sake?",
"question_hi": "क्या पब्लिक सेक्टर बैंकिंग रिफॉर्म (PSBR) एक ऐसा तरीका है जिसका उपयोग करके सरकार अपने आर्थिक स्थिति को नियंत्रित कर सकती है?",
"A_en": "Ha", "A_hi": "हां",
"B_en": "Nahin", "B_hi": "नहीं",
"C_en": "Iska uttar nahi jaanta hai", "C_hi": "इसका उत्तर नहीं जानते हैं",
"D_en": "Yeh ek prakriya hai jismein sarkar apne arthik sthiti ko niyantrit karne ke liye kiye jaane wale nirnayon ka upyog hota hai", "D_hi": "यह एक प्रक्रिया है जिसमें सरकार अपने आर्थिक स्थिति को नियंत्रित करने के लिए लिए जाने वाले निर्णयों का उपयोग होता है",
"answer": "B",
"explanation_en": "Public Sector Banking Reform (PSBR) ek aisa tareeka nahin hai jiska upyog karke sarkar apne arthik sthiti ko niyantrit kar sake. Yeh ek prakriya hai jismein sarkar apne arthik sthiti ko niyantrit karne ke liye kiye jaane wale nirnayon ka upyog hota hai.",
"explanation_hi": "पब्लिक सेक्टर बैंकिंग रिफॉर्म (PSBR) एक ऐसा तरीका नहीं है जिसका उपयोग करके सरकार अपने आर्थिक स्थिति को नियंत्रित कर सकती है। यह एक प्रक्रिया है जिसमें सरकार अपने आर्थिक स्थिति को नियंत्रित करने के लिए लिए जाने वाले निर्णयों का उपयोग होता है।"
},
{
"subject": "Economy",
"topic": "Budget, Banking aur Lok-Vitt (Public Finance)",
"question_en": "Kya Fiscal Decentralization ek aisa tareeka hai jiska upyog karke sarkar apne arthik sthiti ko niyantrit kar sake?",
"question_hi": "क्या फिस्कल डिसेंट्रलाइ