[
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following committees recommended the calculation of poverty line based on ‘Monthly Per Capita Expenditure’ (MPCE) using Mixed Reference Period (MRP)?",
"question_hi": "निम्नलिखित में से किस समिति ने Mixed Reference Period (MRP) का उपयोग कर ‘मासिक प्रति व्यक्ति व्यय’ (MPCE) के आधार पर गरीबी रेखा की गणना की सिफारिश की?",
"A_en": "Rangarajan Committee", "A_hi": "रंगराजन समिति",
"B_en": "Tendulkar Committee", "B_hi": "तेन्दुलकर समिति",
"C_en": "Saxena Committee", "C_hi": "सक्सेना समिति",
"D_en": "Lakdawala Committee", "D_hi": "लकड़ावाला समिति",
"answer": "B",
"explanation_en": "The Tendulkar Committee (2009) recommended calculating the poverty line using MPCE with Mixed Reference Period (MRP) methodology.",
"explanation_hi": "तेन्दुलकर समिति (2009) ने MRP पद्धति के साथ MPCE उपयोग कर गरीबी रेखा गणना की सिफारिश की।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following schemes aims at providing subsidised food grains to the poorest of the poor through Antyodaya Anna Yojana (AAY)?",
"question_hi": "निम्नलिखित में से कौन-सी योजना अंत्योदय अन्न योजना (AAY) के माध्यम से अत्यंत गरीबों को सब्सिडी वाले खाद्यान्न उपलब्ध कराने का लक्ष्य रखती है?",
"A_en": "Pradhan Mantri Garib Kalyan Anna Yojana", "A_hi": "प्रधानमंत्री गरीब कल्याण अन्न योजना",
"B_en": "National Food Security Act, 2013", "B_hi": "राष्ट्रीय खाद्य सुरक्षा अधिनियम, 2013",
"C_en": "Sampoorna Grameen Rozgar Yojana", "C_hi": "संपूर्ण ग्रामीण रोजगार योजना",
"D_en": "PM-Poshan Scheme", "D_hi": "PM-पोषण योजना",
"answer": "B",
"explanation_en": "The National Food Security Act, 2013 legally entitles 35 kg of food grains per month to AAY households at highly subsidised prices.",
"explanation_hi": "राष्ट्रीय खाद्य सुरक्षा अधिनियम, 2013 AAY परिवारों को अत्यंत सब्सिडी वाले दरों पर 35 किग्रा खाद्यान्न प्रति माह का कानूनी अधिकार देता है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "The Standing Labour Committee (India) defines which unemployment rate that counts only those who had ‘no work’ for at least half of the reference year?",
"question_hi": "स्टैंडिंग लेबर कमेटी (भारत) किस बेरोजगारी दर को परिभाषित करती है जो केवल उन्हें गिनती है जिन्हें संदर्भ वर्ष के कम-से-कम आधे समय तक ‘कोई कार्य नहीं’ मिला?",
"A_en": "Usual Principal Status (UPS) Unemployment", "A_hi": "सामान्य मुख्य स्थिति (UPS) बेरोजगारी",
"B_en": "Current Weekly Status (CWS) Unemployment", "B_hi": "वर्तमान साप्ताहिक स्थिति (CWS) बेरोजगारी",
"C_en": "Current Daily Status (CDS) Unemployment", "C_hi": "वर्तमान दैनिक स्थिति (CDS) बेरोजगारी",
"D_en": "Long-Term Unemployment", "D_hi": "दीर्घकालीन बेरोजगारी",
"answer": "A",
"explanation_en": "UPS unemployment rate counts persons unemployed for a major part (≥ 183 days) of the preceding 365 days, reflecting chronic joblessness.",
"explanation_hi": "UPS बेरोजगारी दर पिछले 365 दिनों का अधिकांश (≥ 183 दिन) समय बेरोजगार रहने वालों को दर्शाती है, जिससे दीर्घकालीन बेरोजगारी स्पष्ट होती है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following best describes the concept of ‘inclusive growth’ as emphasised in India’s Eleventh Five-Year Plan?",
"question_hi": "भारत की ग्यारहवीं पंचवर्षीय योजना में जोर दिए गए ‘समावेशी विकास’ की अवधारणा को निम्नलिखित में से कौन-सा सर्वोत्तम वर्णित करता है?",
"A_en": "Growth that benefits only the organised sector", "A_hi": "विकास जो केवल संगठित क्षेत्र को लाभ पहुँचाए",
"B_en": "Growth accompanied by rapid capital accumulation", "B_hi": "विकास जो तेज पूँजी संचयन के साथ हो",
"C_en": "Growth that reduces poverty and creates productive employment", "C_hi": "विकास जो गरीबी घटाए और उत्पादक रोजगार सृजित करे",
"D_en": "Growth focused only on GDP increase", "D_hi": "विकास जो केवल GDP वृद्धि पर केंद्रित हो",
"answer": "C",
"explanation_en": "Inclusive growth ensures that economic expansion translates into poverty reduction and broad-based, productive employment opportunities.",
"explanation_hi": "समावेशी विकास सुनिश्चित करता है कि आर्थिक विस्तार से गरीबी में कमी आए और व्यापक, उत्पादक रोजगार के अवसर सृजित हों।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following is the correct ascending order of India’s unemployment rate by different measures according to recent Periodic Labour Force Survey (PLFS) data?",
"question_hi": "हाल के आवधिक श्रम बल सर्वेक्षण (PLFS) आँकड़ों के अनुसार निम्नलिखित में से कौन-सा भारत की विभिन्न मापदंडों से बेरोजगारी दर का सही आरोही क्रम है?",
"A_en": "CDS < CWS < UPS", "A_hi": "CDS < CWS < UPS",
"B_en": "UPS < CWS < CDS", "B_hi": "UPS < CWS < CDS",
"C_en": "CWS < CDS < UPS", "C_hi": "CWS < CDS < UPS",
"D_en": "CDS < UPS < CWS", "D_hi": "CDS < UPS < CWS",
"answer": "B",
"explanation_en": "CDS captures under-employment, hence it is highest; UPS is lowest because it ignores short spells, giving the sequence UPS < CWS < CDS.",
"explanation_hi": "CDS अर्ध-रोजगार को समेटता है, इसलिए सर्वाधिक; UPS अल्पकालिक बेरोजगारी अनदेखा करता है, अतः क्रम UPS < CWS < CDS होता है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following poverty alleviation programmes uses Self-Help Groups (SHGs) as its primary institutional vehicle for targeting rural poor?",
"question_hi": "निम्नलिखित में से किस गरीबी उन्मूलन कार्यक्रम में ग्रामीण गरीबों को लक्षित करने के लिए स्वयं सहायता समूहों (SHGs) को प्राथमिक संस्थागत वाहन बनाया गया है?",
"A_en": "Deen Dayal Upadhyaya Grameen Kaushalya Yojana", "A_hi": "दीन दयाल उपाध्याय ग्रामीण कौशल योजना",
"B_en": "National Rural Livelihoods Mission (NRLM) – Ajeevika", "B_hi": "राष्ट्रीय ग्रामीण आजीविका मिशन (NRLM) – अजीविका",
"C_en": "Pradhan Mantri Awaas Yojana – Gramin", "B_hi": "प्रधानमंत्री आवास योजना – ग्रामीण",
"D_en": "Mahatma Gandhi National Rural Employment Guarantee Scheme", "D_hi": "महात्मा गांधी राष्ट्रीय ग्रामीण रोजगार गारंटी योजना",
"answer": "B",
"explanation_en": "NRLM-Ajeevika mobilises rural poor into SHGs and their federations to enhance credit-linked livelihoods and social security.",
"explanation_hi": "NRLM-अजीविका ग्रामीण गरीबों को SHGs में संगठित कर ऋण-सहित आजीविका व सामाजिक सुरक्षा बढ़ाता है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following best reflects the ‘disguised unemployment’ situation in Indian agriculture?",
"question_hi": "निम्नलिखित में से कौन-सा भारतीय कृषि में ‘छद्म बेरोजगारी’ की स्थिति को सर्वोत्तम दर्शाता है?",
"A_en": "Open unemployment due to factory closure", "A_hi": "फैक्ट्री बंद होने से खुली बेरोजगारी",
"B_en": "More workers employed than actually needed; marginal product of labour is zero", "B_hi": "वास्तविक आवश्यकता से अधिक श्रमिक; श्रम का सीमांत उत्पाद शून्य",
"C_en": "Seasonal unemployment during sowing season", "C_hi": "बुवाई के मौसम में मौसमी बेरोजगारी",
"D_en": "Frictional unemployment due to skill mismatch", "D_hi": "कौशल असंगति से घर्षण बेरोजगारी",
"answer": "B",
"explanation_en": "Disguised unemployment exists when extra labour contributes nothing to total output; their marginal productivity is zero.",
"explanation_hi": "छद्म बेरोजगारी तब होती है जब अतिरिक्त श्रम कुल उत्पादन में कुछ नहीं जोड़ता; उनकी सीमांत उत्पादकता शून्य होती है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "The target of uplifting how many poor rural households out of poverty per year was set under Deendayal Antyodaya Yojana – National Rural Livelihoods Mission (DAY-NRLM)?",
"question_hi": "दीनदयाल अंत्योदय योजना – राष्ट्रीय ग्रामीण आजीविका मिशन (DAY-NRLM) के तहत प्रति वर्ष कितनी गरीब ग्रामीण परिवारों को गरीबी से बाहर निकालने का लक्ष्य निर्धारित किया गया था?",
"A_en": "50 lakh", "A_hi": "50 लाख",
"B_en": "1 crore", "B_hi": "1 करोड़",
"C_en": "10 lakh", "B_hi": "10 लाख",
"D_en": "2 crore", "D_hi": "2 करोड़",
"answer": "B",
"explanation_en": "DAY-NRLM aims to mobilise 1 crore rural poor households annually into SHGs and support them to cross the poverty line.",
"explanation_hi": "DAY-NRLM प्रति वर्ष 1 करोड़ ग्रामीण गरीब परिवारों को SHGs में संगठित कर गरीबी रेखा पार कराने का लक्ष्य रखता है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following is the most appropriate indicator to measure the ‘inclusiveness’ of India’s growth process?",
"question_hi": "भारत की विकास प्रक्रिया की ‘समावेशिता’ मापने के लिए निम्नलिखित में से कौन-सा सूचक सर्वाधिक उपयुक्त है?",
"A_en": "Rise in Foreign Exchange Reserves", "A_hi": "विदेशी मुद्रा भंडार में वृद्धि",
"B_en": "Decline in Gini coefficient of consumption", "B_hi": "उपभोग का जिनी गुणांक घटना",
"C_en": "Increase in Index of Industrial Production", "C_hi": "औद्योगिक उत्पादन सूचकांक में वृद्धि",
"D_en": "Rise in Sensex Index", "D_hi": "सेंसेक्स सूचकांक में वृद्धि",
"answer": "B",
"explanation_en": "A declining Gini coefficient indicates reduced inequality, reflecting that growth is being shared more broadly across population.",
"explanation_hi": "घटता जिनी गुणांक असमानता में कमी दर्शाता है, जिससे विकास की लाभ सबको मिल रहे हैं यह प्रकट होता है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following statements is NOT correct regarding the recently launched ‘PM-DevINE’ scheme for North-East India?",
"question_hi": "हाल ही में शुरू की गई ‘PM-DevINE’ योजना (पूर्वोत्तर भारत के लिए) के संदर्भ में निम्नलिखित में से कौन-सा कथन सही नहीं है?",
"A_en": "It is a Central Sector scheme fully funded by the Union Government", "A_hi": "यह एक केंद्रीय क्षेत्र की योजना है जिसे पूरी तरह केंद्र सरकार द्वारा वित्तपोषित किया जाता है",
"B_en": "Its objective is to fund infrastructure and social development projects based on ‘gap filling’", "B_hi": "इसका उद्देश्य ‘अंतराल भरने’ के आधार पर बुनियादी ढाँचे व सामाजिक विकास परियोजनाओं को वित्त देना है",
"C_en": "It is implemented under the Ministry of Development of North-Eastern Region (DoNER)", "C_hi": "इसे उत्तर-पूर्वी क्षेत्र विकास मंत्रालय (DoNER) के तहत लागू किया जाता है",
"D_en": "It provides direct cash transfers to individual unemployed youth", "D_hi": "यह व्यक्तिगत बेरोजगार युवाओं को प्रत्यक्ष नकद हस्तांतरण प्रदान करती है",
"answer": "D",
"explanation_en": "PM-DevINE funds infrastructure and social projects; it does NOT involve direct cash transfers to individuals.",
"explanation_hi": "PM-DevINE बुनियादी ढाँचे व सामाजिक परियोजनाओं को वित्त देती है; इसमें व्यक्तियों को प्रत्यक्ष नकद हस्तांतरण नहीं होता।"
}
]