[
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following committees first estimated the poverty line in India on the basis of nutritional requirements?",
"question_hi": "भारत में किस समिति ने पहली बार पोषण संबंधी आवश्यकताओं के आधार पर गरीबी रेखा का अनुमान लगाया?",
"A_en": "Rangarajan Committee", "A_hi": "रंगराजन समिति",
"B_en": "Tendulkar Committee", "B_hi": "तेन्दुलकर समिति",
"C_en": "Lakdawala Committee", "C_hi": "लकडावाला समिति",
"D_en": "Alagh Committee", "D_hi": "अलग समिति",
"answer": "D",
"explanation_en": "The Alagh Committee (1979) was the first to define the poverty line in India on the basis of minimum nutritional requirements.",
"explanation_hi": "अलग समिति (1979) ने भारत में न्यूनतम पोषण संबंधी आवश्यकताओं के आधार पर गरीबी रेखा को परिभाषित करने वाली पहली समिति थी।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "In India, which method is used to estimate unemployment on a weekly basis?",
"question_hi": "भारत में साप्ताहिक आधार पर बेरोजगारी का अनुमान किस विधि से लगाया जाता है?",
"A_en": "Usual Status", "A_hi": "सामान्य स्थिति",
"B_en": "Current Weekly Status", "B_hi": "वर्तमान साप्ताहिक स्थिति",
"C_en": "Current Daily Status", "C_hi": "वर्तमान दैनिक स्थिति",
"D_en": "Chronic Unemployment", "B_hi": "दीर्घकालिक बेरोजगारी",
"answer": "B",
"explanation_en": "Current Weekly Status (CWS) records a person unemployed if he/she did not find even one hour of work during the reference week.",
"explanation_hi": "वर्तमान साप्ताहिक स्थिति (CWS) में, यदि कोई व्यक्ति संदर्भ सप्ताह में एक भी घंटे का कार्य नहीं करता, तो उसे बेरोजगार माना जाता है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following best describes ‘inclusive growth’?",
"question_hi": "‘समावेशी विकास’ निम्नलिखित में से किस विकल्प द्वारा सर्वोत्तम रूप से वर्णित किया जाता है?",
"A_en": "High GDP growth without environmental concerns", "A_hi": "पर्यावरणीय चिंता के बिना उच्च जीडीपी विकास",
"B_en": "Growth that benefits all sections of society", "B_hi": "वह विकास जो समाज के सभी वर्गों को लाभ पहुंचाए",
"C_en": "Growth focused only on urban infrastructure", "C_hi": "केवल शहरी आधारभूत संरचना पर केंद्रित विकास",
"D_en": "Privatisation of all public sector units", "D_hi": "सभी सार्वजनिक क्षेत्र के उपक्रमों का निजीकरण",
"answer": "B",
"explanation_en": "Inclusive growth ensures that the benefits of economic growth reach every section of society, especially the poor and marginalised.",
"explanation_hi": "समावेशी विकास यह सुनिश्चित करता है कि आर्थिक विकास का लाभ समाज के प्रत्येक वर्ग, विशेष रूप से गरीबों और वंचितों तक पहुंचे।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following schemes replaced the earlier poverty alleviation programmes like IRDP and TRYSEM?",
"question_hi": "किस योजना ने IRDP और TRYSEM जैसी पूर्व गरीबी उन्मूलन योजनाओं का स्थान लिया?",
"A_en": "SGSY", "A_hi": "एसजीएसवाई",
"B_en": "PMGSY", "B_hi": "पीएमजीएसवाई",
"C_en": "NREGA", "C_hi": "एनआरईजीए",
"D_en": "DDUGJY", "D_hi": "डीडीयूजीजेवाई",
"answer": "A",
"explanation_en": "SGSY (Swarnjayanti Gram Swarozgar Yojana) subsumed IRDP and TRYSEM in 1999 to promote self-employment among rural poor.",
"explanation_hi": "एसजीएसवाई (स्वर्णजयंती ग्राम स्वरोजगार योजना) ने 1999 में IRDP और TRYSEM को समाहित किया ताकि ग्रामीण गरीबों को स्वरोजगार प्रोत्साहन दिया जा सके।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "What is the minimum calorie intake per day used by the Rangarajan Committee for defining the urban poverty line?",
"question_hi": "रंगराजन समिति द्वारा शहरी गरीबी रेखा परिभाषित करने के लिए प्रति दिन न्यूनतम कितनी कैलोरी का प्रयोग किया गया था?",
"A_en": "2100", "A_hi": "2100",
"B_en": "2400", "B_hi": "2400",
"C_en": "2155", "C_hi": "2155",
"D_en": "2700", "D_hi": "2700",
"answer": "A",
"explanation_en": "Rangarajan Committee kept the urban poverty line at 2100 calories per day, while it was 2400 calories for rural areas.",
"explanation_hi": "रंगराजन समिति ने शहरी क्षेत्र के लिए 2100 कैलोरी प्रति दिन और ग्रामीण क्षेत्र के लिए 2400 कैलोरी प्रति दिन निर्धारित की थी।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following is not a direct cause of structural unemployment in India?",
"question_hi": "भारत में संरचनात्मक बेरोजगारी का प्रत्यक्ष कारण निम्नलिखित में से कौन-सा नहीं है?",
"A_en": "Skill mismatch", "A_hi": "कौशल असंगति",
"B_en": "Seasonal demand", "B_hi": "मौसमी मांग",
"C_en": "Technological change", "C_hi": "प्रौद्योगिकी परिवर्तन",
"D_en": "Rigid labour laws", "D_hi": "कठोर श्रम कानून",
"answer": "B",
"explanation_en": "Seasonal demand leads to seasonal unemployment, whereas structural unemployment arises from skill mismatch, technology shifts and rigid labour laws.",
"explanation_hi": "मौसमी मांग से मौसमी बेरोजगारी उत्पन्न होती है, जबकि संरचनात्मक बेरोजजारी कौशल असंगति, प्रौद्योगिकी परिवर्तन और कठोर श्रम कानूनों से उत्पन्न होती है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which Sustainable Development Goal (SDG) is directly related to reducing poverty?",
"question_hi": "कौन-सा सतत विकास लक्ष्य (SDG) गरीबी को कम करने से सीधे संबंधित है?",
"A_en": "SDG-1", "A_hi": "SDG-1",
"B_en": "SDG-2", "B_hi": "SDG-2",
"C_en": "SDG-8", "B_hi": "SDG-8",
"D_en": "SDG-10", "D_hi": "SDG-10",
"answer": "A",
"explanation_en": "SDG-1 aims to end poverty in all its forms everywhere.",
"explanation_hi": "SDG-1 का उद्देश्य हर रूप में हर स्थान पर गरीबी को समाप्त करना है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which organisation publishes the ‘Consumer Pyramids Household Survey’ that is used to analyse unemployment in India?",
"question_hi": "भारत में बेरोजगारी विश्लेषण के लिए उपयोग किए जाने वाले ‘कंज्यूमर पिरैमिड्स हाउसहोल्ड सर्वे’ को किस संस्था द्वारा प्रकाशित किया जाता है?",
"A_en": "NITI Aayog", "A_hi": "निति आयोग",
"B_en": "CMIE", "B_hi": "सीएमआईई",
"C_en": "RBI", "C_hi": "आरबीआई",
"D_en": "Labour Bureau", "D_hi": "लेबर ब्यूरो",
"answer": "B",
"explanation_en": "CMIE (Centre for Monitoring Indian Economy) publishes the Consumer Pyramids Household Survey data.",
"explanation_hi": "CMIE (सेंटर फॉर मॉनिटरिंग इंडियन इकोनॉमी) द्वारा कंज्यूमर पिरैमिड्स हाउसहोल्ड सर्वे डेटा प्रकाशित किया जाता है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following best explains the concept of ‘disguised unemployment’?",
"question_hi": "‘प्रच्छन्न बेरोजगारी’ की अवधारणा को निम्नलिखित में से कौन-सा सर्वोत्तम रूप से स्पष्ट करता है?",
"A_en": "Open unemployment in urban areas", "A_hi": "शहरी क्षेत्रों में खुली बेरोजगारी",
"B_en": "More workers employed than actually needed", "B_hi": "वास्तविक आवश्यकता से अधिक श्रमिकों की नियुक्ति",
"C_en": "Temporary unemployment during recession", "C_hi": "मंदी के दौरान अस्थायी बेरोजगारी",
"D_en": "Frictional unemployment due to job search", "D_hi": "नौकरी खोज के कारण घर्षणजन्य बेरोजगारी",
"answer": "B",
"explanation_en": "Disguised unemployment exists when marginal productivity of extra workers is zero, i.e. more persons are engaged than required.",
"explanation_hi": "प्रच्छन्न बेरोजगारी तब होती है जब अतिरिक्त श्रमिकों की सीमांत उत्पादकता शून्य हो, अर्थात जरूरत से अधिक लोग कार्यरत हों।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "The ‘Stand-Up India’ scheme aims to promote entrepreneurship among which target groups?",
"question_hi": "‘स्टैंड-अप इंडिया’ योजना किन लक्षित समूहों में उद्यमिता को बढ़ावा देने का उद्देश्य रखती है?",
"A_en": "Women and SC/ST", "A_hi": "महिलाएं और अनुसूचित जाति/जनजाति",
"B_en": "MSME owners only", "B_hi": "केवल सूक्ष्म, लघु एवं मध्यम उद्यम स्वामी",
"C_en": "All BPL families", "C_hi": "सभी BPL परिवार",
"D_en": "Unemployed graduates", "D_hi": "बेरोजगार स्नातक",
"answer": "A",
"explanation_en": "Stand-Up India facilitates bank loans of ₹10 lakh to ₹1 crore to at least one Scheduled Caste/Scheduled Tribe borrower and one woman borrower per bank branch.",
"explanation_hi": "स्टैंड-अप इंडिया हर बैंक शाखा में कम से कम एक अनुसूचित जाति/जनजाति और एक महिला उधारकर्ता को ₹10 लाख से ₹1 करोड़ का ऋण सुविधा प्रदान करता है।"
}
]