[
  {
    "subject": "Economy",
    "topic": "Garibi, Berozgari aur Samaveshi Vikas",
    "question_en": "Which of the following schemes was launched by the Government of India to provide a minimum income support to the poor?",
    "question_hi": "कौन सी योजना भारत सरकार द्वारा गरीबों को न्यूनतम आय समर्थन देने के लिए शुरू की गई थी?",
    "A_en": "Pradhan Mantri Jan Arogya Yojana",
    "A_hi": "प्रधानमंत्री जन आरोग्य योजना",
    "B_en": "Pradhan Mantri Garib Kalyan Yojana",
    "B_hi": "प्रधानमंत्री गरीब कल्याण योजना",
    "C_en": "Pradhan Mantri Ujjwala Yojana",
    "C_hi": "प्रधानमंत्री उज्ज्वला योजना",
    "D_en": "Pradhan Mantri Awas Yojana",
    "D_hi": "प्रधानमंत्री आवास योजना",
    "answer": "B",
    "explanation_en": "Pradhan Mantri Garib Kalyan Yojana was introduced to provide financial assistance and minimum income support to the poor.",
    "explanation_hi": "प्रधानमंत्री गरीब कल्याण योजना गरीबों को वित्तीय सहायता और न्यूनतम आय समर्थन देने के लिए शुरू की गई थी।"
  },
  {
    "subject": "Economy",
    "topic": "Garibi, Berozgari aur Samaveshi Vikas",
    "question_en": "Which of the following is NOT a type of unemployment identified by the International Labour Organization?",
    "question_hi": "अंतरराष्ट्रीय श्रम संगठन द्वारा पहचाने गए बेरोजगारी के प्रकारों में से कौन सा प्रकार नहीं है?",
    "A_en": "Cyclical unemployment",
    "A_hi": "चक्रीय बेरोजगारी",
    "B_en": "Structural unemployment",
    "B_hi": "संरचनात्मक बेरोजगारी",
    "C_en": "Frictional unemployment",
    "C_hi": "घर्षणात्मक बेरोजगारी",
    "D_en": "Absolute unemployment",
    "D_hi": "पूर्ण बेरोजगारी",
    "answer": "D",
    "explanation_en": "Absolute unemployment is not a standard classification; the ILO recognizes cyclical, structural, and frictional unemployment.",
    "explanation_hi": "पूर्ण बेरोजगारी एक मानक वर्गीकरण नहीं है; ILO केवल चक्रीय, संरचनात्मक और घर्षणात्मक बेरोजगारी को मान्यता देता है।"
  },
  {
    "subject": "Economy",
    "topic": "Garibi, Berozgari aur Samaveshi Vikas",
    "question_en": "The poverty line in India is defined based on:",
    "question_hi": "भारत में गरीबी रेखा किसके आधार पर परिभाषित की गई है?",
    "A_en": "Average monthly expenditure of a household",
    "A_hi": "एक परिवार का औसत मासिक व्यय",
    "B_en": "Annual income of a household",
    "B_hi": "एक परिवार की वार्षिक आय",
    "C_en": "Minimum calorie intake per person per day",
    "C_hi": "प्रति व्यक्ति प्रतिदिन न्यूनतम कैलोरी सेवन",
    "D_en": "All of the above",
    "D_hi": "उपरोक्त सभी",
    "answer": "D",
    "explanation_en": "The poverty line is set considering per capita consumption, calorie requirements and income thresholds.",
    "explanation_hi": "गरीबी रेखा प्रति व्यक्ति उपभोग, कैलोरी आवश्यकताओं और आय सीमाओं को ध्यान में रखकर तय की जाती है।"
  },
  {
    "subject": "Economy",
    "topic": "Garibi, Berozgari aur Samaveshi Vikas",
    "question_en": "Inclusive growth primarily focuses on:",
    "question_hi": "समावेशी विकास का मुख्य ध्यान किस पर है?",
    "A_en": "Increasing GDP at the highest possible rate",
    "A_hi": "सबसे अधिक गति से जीडीपी बढ़ाना",
    "B_en": "Ensuring that economic benefits are shared across all sections of society",
    "B_hi": "यह सुनिश्चित करना कि आर्थिक लाभ समाज के सभी वर्गों में बाँटे जाएँ",
    "C_en": "Reducing government spending",
    "C_hi": "सरकारी खर्च को कम करना",
    "D_en": "Promoting foreign investment only",
    "D_hi": "केवल विदेशी निवेश को बढ़ावा देना",
    "answer": "B",
    "explanation_en": "Inclusive growth aims at equitable distribution of economic gains, reducing inequality and poverty.",
    "explanation_hi": "समावेशी विकास का उद्देश्य आर्थिक लाभ का समान वितरण, असमानता और गरीबी को कम करना है।"
  },
  {
    "subject": "Economy",
    "topic": "Garibi, Berozgari aur Samaveshi Vikas",
    "question_en": "Which indicator is commonly used to measure inequality in income distribution?",
    "question_hi": "आय वितरण में असमानता को मापने के लिए कौन सा सूचकांक आम तौर पर उपयोग किया जाता है?",
    "A_en": "Gini coefficient",
    "A_hi": "गिनी गुणांक",
    "B_en": "Human Development Index",
    "B_hi": "मानव विकास सूचकांक",
    "C_en": "Inflation rate",
    "C_hi": "मुद्रास्फीति दर",
    "D_en": "Unemployment rate",
    "D_hi": "बेरोजगारी दर",
    "answer": "A",
    "explanation_en": "The Gini coefficient quantifies income inequality on a scale from 0 (perfect equality) to 1 (maximum inequality).",
    "explanation_hi": "गिनी गुणांक 0 (समानता) से 1 (अधिकतम असमानता) के बीच आय असमानता को मापता है।"
  },
  {
    "subject": "Economy",
    "topic": "Garibi, Berozgari aur Samaveshi Vikas",
    "question_en": "The National Rural Employment Guarantee Act (NREGA) aims to provide:",
    "question_hi": "राष्ट्रीय ग्रामीण रोजगार गारंटी अधिनियम (NREGA) का उद्देश्य क्या है?",
    "A_en": "Cash transfers to urban workers",
    "A_hi": "शहरी कामगारों को नकद हस्तांतरण",
    "B_en": "Employment for 100 days in a financial year for rural households",
    "B_hi": "ग्रामीण परिवारों को वित्तीय वर्ष में 100 दिनों का रोजगार",
    "C_en": "Free education for all children",
    "C_hi": "सभी बच्चों को मुफ्त शिक्षा",
    "D_en": "Health insurance for senior citizens",
    "D_hi": "वरिष्ठ नागरिकों के लिए स्वास्थ्य बीमा",
    "answer": "B",
    "explanation_en": "NREGA guarantees 100 days of wage employment to rural households, aiming to reduce rural poverty and unemployment.",
    "explanation_hi": "NREGA ग्रामीण परिवारों को 100 दिन के वेतनभोगी रोजगार की गारंटी देता है, जिससे ग्रामीण गरीबी और बेरोजगारी कम होती है।"
  },
  {
    "subject": "Economy",
    "topic": "Garibi, Berozgari aur Samaveshi Vikas",
    "question_en": "Which of the following best describes 'debt‑trapped poverty'?",
    "question_hi": "'ऋण-फँसी गरीबी' का सबसे अच्छा वर्णन कौन सा है?",
    "A_en": "When people borrow only to meet basic consumption needs",
    "A_hi": "जब लोग केवल बुनियादी उपभोग आवश्यकताओं को पूरा करने के लिए ऋण लेते हैं",
    "B_en": "When debt repayment exceeds income, forcing households to consume below subsistence level",
    "B_hi": "जब ऋण चुकौती आय से अधिक हो जाती है, जिससे परिवारों को उपजीविका स्तर से नीचे उपभोग करना पड़ता है",
    "C_en": "When debt is used to invest in high‑yield ventures",
    "C_hi": "जब ऋण का उपयोग उच्च लाभ वाले उद्यमों में निवेश के लिए किया जाता है",
    "D_en": "When households have no debt at all",
    "D_hi": "जब परिवारों के पास कोई ऋण नहीं होता",
    "answer": "B",
    "explanation_en": "Debt‑trapped poverty occurs when debt servicing consumes a large share of income, limiting consumption and investment.",
    "explanation_hi": "ऋण-फँसी गरीबी तब होती है जब ऋण चुकौती आय का बड़ा हिस्सा लेती है, जिससे उपभोग और निवेश सीमित हो जाता है।"
  },
  {
    "subject": "Economy",
    "topic": "Garibi, Berozgari aur Samaveshi Vikas",
    "question_en": "Which policy tool is most effective in reducing cyclical unemployment during a recession?",
    "question_hi": "मंदी के दौरान चक्रीय बेरोजगारी को कम करने के लिए सबसे प्रभावी नीति उपकरण कौन सा है?",
    "A_en": "Increase in interest rates",
    "A_hi": "ब्याज दरों में वृद्धि",
    "B_en": "Fiscal stimulus through increased government spending",
    "B_hi": "सार्वजनिक खर्च में वृद्धि के माध्यम से राजकोषीय प्रोत्साहन",
    "C_en": "Reduction in import tariffs",
    "C_hi": "आयात शुल्क में कमी",
    "D_en": "Privatization of state-owned enterprises",
    "D_hi": "राज्य-स्वामित्व वाले उद्यमों का निजीकरण",
    "answer": "B",
    "explanation_en": "Fiscal stimulus boosts aggregate demand, creating jobs and mitigating cyclical unemployment.",
    "explanation_hi": "राजकोषीय प्रोत्साहन समग्र मांग को बढ़ाता है, जिससे नौकरियाँ पैदा होती हैं और चक्रीय बेरोजगारी कम होती है।"
  },
  {
    "subject": "Economy",
    "topic": "Garibi, Berozgari aur Samaveshi Vikas",
    "question_en": "The 'Rural Employment Generation Programme' (REGP) was launched to:",
    "question_hi": "ग्रामीण रोजगार सृजन कार्यक्रम (REGP) को किस उद्देश्य से शुरू किया गया था?",
    "A_en": "To provide skill development training to urban youth",
    "A_hi": "शहरी युवाओं को कौशल विकास प्रशिक्षण देने के लिए",
    "B_en": "To create employment opportunities in rural areas through public works",
    "B_hi": "सार्वजनिक कार्यों के माध्यम से ग्रामीण क्षेत्रों में रोजगार के अवसर पैदा करने के लिए",
    "C_en": "To offer free housing to migrant workers",
    "C_hi": "प्रवासी कामगारों को मुफ्त आवास देने के लिए",
    "D_en": "To subsidize agricultural machinery",
    "D_hi": "कृषि उपकरणों को सब्सिडी देने के लिए",
    "answer": "B",
    "explanation_en": "REGP focuses on generating rural employment by undertaking large public works projects.",
    "explanation_hi": "REGP सार्वजनिक कार्य परियोजनाओं के माध्यम से ग्रामीण रोजगार सृजन पर केंद्रित है।"
  },
  {
    "subject": "Economy",
    "topic": "Garibi, Berozgari aur Samaveshi Vikas",
    "question_en": "Which of the following is a characteristic of 'structural unemployment'?",
    "question_hi": "'संरचनात्मक बेरोजगारी' की कौन सी विशेषता है?",
    "A_en": "It arises due to seasonal demand fluctuations",
    "A_hi": "यह मौसमी मांग उतार-चढ़ाव के कारण उत्पन्न होती है",
    "B_en": "It results from a mismatch between skills and job requirements",
    "B_hi": "यह कौशल और नौकरी आवश्यकताओं के बीच असंगति के कारण होती है",
    "C_en": "It is caused by a decline in overall economic activity",
    "C_hi": "यह समग्र आर्थिक गतिविधि में गिरावट के कारण होती है",
    "D_en": "It is temporary and disappears with economic recovery",
    "D_hi": "यह अस्थायी है और आर्थिक सुधार के साथ गायब हो जाती है",
    "answer": "B",
    "explanation_en": "Structural unemployment occurs when workers lack the skills required for available jobs or when jobs move to different locations.",
    "explanation_hi": "संरचनात्मक बेरोजगारी तब होती है जब कामगारों के पास उपलब्ध नौकरियों के लिए आवश्यक कौशल नहीं होते या नौकरियाँ अलग स्थान पर चली जाती हैं।"
  },
  {
    "subject": "Economy",
    "topic": "Garibi, Berozgari aur Samaveshi Vikas",
    "question_en": "Which of the following best describes 'sustainable development' in the context of poverty reduction?",
    "question_hi": "गरीबी उन्मूलन के संदर्भ में 'सतत विकास' का सबसे अच्छा वर्णन कौन सा है?",
    "A_en": "Economic growth without regard to environmental impact",
    "A_hi": "पर्यावरणीय प्रभाव की परवाह किए बिना आर्थिक विकास",
    "B_en": "Balancing economic progress with social equity and environmental stewardship",
    "B_hi": "आर्थिक प्रगति को सामाजिक समानता और पर्यावरणीय संरक्षण के साथ संतुलित करना",
    "C_en": "Focusing solely on urban infrastructure development",
    "C_hi": "केवल शहरी बुनियादी ढांचे के विकास पर ध्यान केंद्रित करना",
    "D_en": "Prioritizing short‑term gains over long‑term benefits",
    "D_hi": "दीर्घकालिक लाभों की तुलना में अल्पकालिक लाभों को प्राथमिकता देना",
    "answer": "B",
    "explanation_en": "Sustainable development integrates economic, social, and environmental goals to ensure long‑term poverty alleviation.",
    "explanation_hi": "सतत विकास आर्थिक, सामाजिक और पर्यावरणीय लक्ष्यों को एकीकृत करता है ताकि दीर्घकालिक गरीबी उन्मूलन सुनिश्चित हो सके।"
  }
]