[
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following committees recommended the Multidimensional Poverty Index (MPI) for India?",
"question_hi": "भारत के लिए बहुआयामी गरीबी सूचकांक (MPI) की सिफारिश किस समिति ने की थी?",
"A_en": "Rangarajan Committee", "A_hi": "रंगराजन समिति",
"B_en": "Suresh Tendulkar Committee", "B_hi": "सुरेश तेंडुलकर समिति",
"C_en": "Arvind Panagariya Task Force", "B_hi": "अरविंद पनगढ़िया टास्क फोर्स",
"D_en": "NITI Aayog Expert Group", "D_hi": "निति आयोग विशेषज्ञ समूह",
"answer": "C",
"explanation_en": "The Arvind Panagariya Task Force recommended the adoption of MPI for India in 2015.",
"explanation_hi": "अरविंद पनगढ़िया टास्क फोर्स ने 2015 में भारत के लिए MPI को अपनाने की सिफारिश की थी।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "As per the 2011-12 Tendulkar methodology, what percentage of India’s rural population was below the poverty line?",
"question_hi": "2011-12 की तेंडुलकर विधि के अनुसार भारत की ग्रामीण आबादी का कितना प्रतिशत गरीबी रेखा से नीचे था?",
"A_en": "25.7 %", "A_hi": "25.7 %",
"B_en": "29.5 %", "B_hi": "29.5 %",
"C_en": "33.8 %", "C_hi": "33.8 %",
"D_en": "40.2 %", "D_hi": "40.2 %",
"answer": "A",
"explanation_en": "The Tendulkar Committee estimated 25.7 % of rural India as poor in 2011-12.",
"explanation_hi": "तेंडुलकर समिति ने 2011-12 में भारत के 25.7 % ग्रामीण भाग को गरीब आंका था।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following is NOT a component of the multidimensional poverty index used by NITI Aayog?",
"question_hi": "निम्नलिखित में से कौन-सा निति आयोग द्वारा प्रयुक्त बहुआयामी गरीबी सूचकांक का घटक नहीं है?",
"A_en": "Years of schooling", "A_hi": "विद्यालयी शिक्षा के वर्ष",
"B_en": "Child mortality", "B_hi": "शिशु मृत्यु दर",
"C_en": "Bank account access", "C_hi": "बैंक खाते की पहुंच",
"D_en": "Cooking fuel", "D_hi": "खाना पकाने का ईंधन",
"answer": "C",
"explanation_en": "MPI includes health, education & living-standard indicators; bank access is not one of them.",
"explanation_hi": "MPI में स्वास्थ्य, शिक्षा और जीवन-स्तरीय संकेतक होते हैं; बैंक खाते की पहुंच इसका हिस्सा नहीं है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "The Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA) guarantees minimum how many days of wage employment in a financial year?",
"question_hi": "महात्मा गांधी राष्ट्रीय ग्रामीण रोज़गार गारंटी अधिनियम (MGNREGA) एक वित्त वर्ष में कितने दिनों का न्यूनतम वेतन रोज़गार गारंटी देता है?",
"A_en": "50 days", "A_hi": "50 दिन",
"B_en": "100 days", "B_hi": "100 दिन",
"C_en": "150 days", "C_hi": "150 दिन",
"D_en": "200 days", "D_hi": "200 दिन",
"answer": "B",
"explanation_en": "MGNREGA legally guarantees 100 days of unskilled wage work to every rural household.",
"explanation_hi": "MGNREGA हर ग्रामीण परिवार को 100 दिनों का अकुशल वेतन कार्य कानूनी रूप से गारंटी देता है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which state recorded the highest rural unemployment rate (usual status) as per the Periodic Labour Force Survey 2020-21?",
"question_hi": "2020-21 की आवधिक श्रम बल सर्वेक्षण के अनुसार किस राज्य ने ग्रामीण बेरोज़गारी दर (सामान्य स्थिति) में सबसे ऊँची दर दर्ज की?",
"A_en": "Rajasthan", "A_hi": "राजस्थान",
"B_en": "Kerala", "B_hi": "केरल",
"C_en": "Bihar", "C_hi": "बिहार",
"D_en": "Haryana", "D_hi": "हरियाणा",
"answer": "B",
"explanation_en": "Kerala’s rural unemployment rate (usual status) was the highest at 7.2 % in PLFS 2020-21.",
"explanation_hi": "केरल की ग्रामीण बेरोज़गारी दर (सामान्य स्थिति) PLFS 2020-21 में 7.2 % के साथ सबसे ऊँची थी।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "The National Social Assistance Programme (NSAP) does NOT include which of the following?",
"question_hi": "राष्ट्रीय सामाजिक सहायता कार्यक्रम (NSAP) में निम्नलिखित में से कौन-सा सम्मिलित नहीं है?",
"A_en": "Indira Gandhi National Old Age Pension", "A_hi": "इंदिरा गांधी राष्ट्रीय वृद्धावस्था पेंशन",
"B_en": "Indira Gandhi National Widow Pension", "B_hi": "इंदिरा गांधी राष्ट्रीय विधवा पेंशन",
"C_en": "Indira Gandhi National Disability Pension", "C_hi": "इंदिरा गांधी राष्ट्रीय विकलांगता पेंशन",
"D_en": "Indira Gandhi Girl Child Scholarship", "D_hi": "इंदिरा गांधी बालिका छात्रवृत्ति",
"answer": "D",
"explanation_en": "NSAP provides pensions; the girl child scholarship is run by the Ministry of Education under a different scheme.",
"explanation_hi": "NSAP पेंशन देता है; बालिका छात्रवृत्ति शिक्षा मंत्रालय द्वारा दूसरी योजना के तहत चलाई जाती है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following best describes the concept of ‘inclusive growth’?",
"question_hi": "‘समावेशी विकास’ की अवधारणा को निम्नलिखित में से कौन-सा सर्वोत्तम वर्णित करता है?",
"A_en": "Growth that benefits only the manufacturing sector", "A_hi": "वृद्धि जो केवल विनिर्माण क्षेत्र को लाभ पहुँचाए",
"B_en": "Growth that excludes the financial sector", "B_hi": "वृद्धि जो वित्तीय क्षेत्र को बाहर रखे",
"C_en": "Growth that includes every section of society and reduces inequality", "C_hi": "वृद्धि जो समाज के हर वर्ग को सम्मिलित करे और असमानता घटाए",
"D_en": "Growth focused only on export promotion", "C_hi": "वृद्धि जो केवल निर्यात संवर्धन पर केंद्रित हो",
"answer": "C",
"explanation_en": "Inclusive growth ensures broad-based benefits across all social groups and regions, lowering inequality.",
"explanation_hi": "समावेशी विकास सुनिश्चित करता है कि सभी सामाजिक वर्गों व क्षेत्रों को व्यापक आधार पर लाभ मिले और असमानता घटे।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "The Standing Committee on Labour (2021) identified the largest share of unemployed in India belongs to which age cohort?",
"question_hi": "श्रम पर स्थायी समिति (2021) ने भारत में बेरोज़गारों का सबसे बड़ा हिस्सा किस आयु-समूह का पाया?",
"A_en": "15-19 years", "A_hi": "15-19 वर्ष",
"B_en": "20-24 years", "B_hi": "20-24 वर्ष",
"C_en": "25-29 years", "C_hi": "25-29 वर्ष",
"D_en": "30-34 years", "D_hi": "30-34 वर्ष",
"answer": "B",
"explanation_en": "About 42 % of the unemployed were youth in the 20-24 age group, pointing to a demographic challenge.",
"explanation_hi": "लगभग 42 % बेरोज़गार 20-24 आयु वर्ग के युवा थे, जनसांख्यिकीय चुनौती को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Deendayal Antyodaya Yojana - National Rural Livelihoods Mission (DAY-NRLM) primarily aims at:",
"question_hi": "दीनदयाल अंत्योदय योजना - राष्ट्रीय ग्रामीण जीविका मिशन (DAY-NRLM) मुख्यतः किस पर केंद्रित है?",
"A_en": "Providing free food grains to BPL families", "A_hi": "BPL परिवारों को निःशुल्क खाद्यान्न देना",
"B_en": "Organising rural poor into Self-Help Groups and enhancing livelihoods", "B_hi": "ग्रामीण गरीबों को स्वयं सहायता समूहों में संगठित करना और जीविका बढ़ाना",
"C_en": "Giving farm loan waivers", "C_hi": "कृषि ऋण माफी देना",
"D_en": "Universal basic income", "D_hi": "सार्वभौमिक आधारभूत आय",
"answer": "B",
"explanation_en": "DAY-NRLM mobilises women into SHGs, provides training, credit linkages and supports micro-enterprises.",
"explanation_hi": "DAY-NRLM महिलाओं को स्वयं सहायता समूहों में संगठित कर प्रशिक्षण, ऋण जोड़ व सूक्ष्म उद्यमों को सहारा देता है।"
},
{
"subject": "Economy",
"topic": "Garibi, Berozgari aur Samaveshi Vikas",
"question_en": "Which of the following statements about the ‘Eklavya Model Residential Schools’ is correct?",
"question_hi": "‘एकलव्य मॉडल आवासीय विद्यालयों’ के बारे में निम्नलिखित में से कौन-सा कथन सही है?",
"A_en": "They are meant for urban poor children only", "A_hi": "ये केवल शहरी गरीब बच्चों के लिए हैं",
"B_en": "They are targeted at Scheduled Tribe students to improve retention and quality", "B_hi": "ये अनुसूचित जनजाति के विद्यार्थियों को रोक-थाम व गुणवत्ता बेहतर बनाने के लिए हैं",
"C_en": "They are fully funded by the respective state governments", "C_hi": "इनका पूरा वित्त राज्य सरकारें करती हैं",
"D_en": "They come under the Ministry of Tribal Affairs only from 2030", "D_hi": "ये केवल 2030 से आदिवासी मामलों के मंत्रालय के अंतर्गत आते हैं",
"answer": "B",
"explanation_en": "EMRS, financed by the Centre, aim to enhance access and quality of education for ST children.",
"explanation_hi": "EMRS केंद्र द्वारा वित्तपोषित, आदिवासी बच्चों की शिक्षा तक पहुँच व गुणवत्ता बढ़ाने के लिए होते हैं।"
}
]