[
{
"subject": "Economy",
"topic": "GST (Goods and Services Tax): Avdharna aur Prabhav",
"question_en": "What is the primary objective of GST (Goods and Services Tax)?",
"question_hi": "GST (गुजरात और सेवा टैंक) का प्रमुख उद्देश्य क्या है?",
"A_en": "To replace multiple indirect taxes with a single tax",
"A_hi": "मुख्य उद्देश्य क्या है?",
"B_en": "To increase tax revenue for the central government",
"B_hi": "सम्मान का प्रमुख उद्देश्य क्या है?",
"C_en": "To simplify the taxation system",
"C_hi": "टैंक को समाधान का प्रमुख उद्देश्य क्या होता है?",
"D_en": "To revamp the direct tax system",
"D_hi": "पंचार्थ का प्रमुख उद्देश्य क्या होता है?",
"answer": "C",
"explanation_en": "The primary objective of GST (Goods and Services Tax) is to simplify the taxation system. It aims to replace the existing indirect taxes with a unified tax system, leading to reduced transaction costs and increased compliance. The GST Council, consisting of representatives from the central and state governments, decides the tax rates for various goods and services.",
"explanation_hi": "GST (ग्रुपद और सेवाओं का प्रमुख उद्देश्य क्या होता है?",
"answer": "C",
"explanation_en": "The primary objective of GST (Goods and Services Tax) in India is to simplify the taxation system. By integrating various indirect taxes into a unified tax structure, it aims to reduce compliance costs and errors, improve taxpayer base, and increase revenue collection. The GST Council, consisting of representatives from the central and state governments, decides on the tax rates for goods and services.",
"explanation_hi": "इस्तमार्थ और सेवाओं का प्रमुख उद्देश्य क्या होता है?",
"answer": "C",
"explanation_en": "The primary objective of GST (Goods and Services Tax) in India is to simplify the taxation system. By integrating various indirect taxes into a unified tax structure, it aims to reduce compliance costs, eliminate cascading effect (अभिवर्थ या प्रमुख उद्देश्य क्या होता है?",
"answer": "A",
"explanation_en": "The primary objective of GST (Goods and Services Tax) in India is to simplify the taxation system. It aims to eliminate the cascading effect (या प्रमुख उद्देश्य क्या होता है?",
"answer": "A",
"explanation_hi": "इस्तमार्थ या प्रमुख उद्देश्य क्या होता है?",
"answer": "B"
}
]