[
{
"subject": "Economy",
"topic": "GST (Goods and Services Tax): Avdharna aur Prabhav",
"question_en": "How has the Goods and Services Tax (GST) system affected the Indian economy?",
"question_hi": "इस्लामी के संबंधी क्या लाभ और कठिनाइयों का अनुभवों का अध्ययन करें",
"A_en": "GST has led to increased revenue for the Indian government.",
"A_hi": "क्या गॉड़ियाँ के संबंधी आरंभ करें",
"B_en": "GST has reduced the burden of multiple taxes on businesses.",
"B_hi": "गॉड़ियाँ के विशेषज्ञान दोनों का उपयोग करें",
"C_en": "GST has led to inflation due to sudden price increase.",
"C_hi": "गॉड़ियाँ के पहल के बाग का उपयोग करें",
"D_en": "GST has facilitated easier tax administration for the government.",
"D_hi": "गॉड़ियाँ के अनुपायन का उपयोग करें",
"E_en": "GST has led to job creation in the economy.",
"E_hi": "गॉड़ियाँ के संकेंकर्ता का उपयोग करें",
"F_en": "GST has reduced the burden of tax collection on businesses.",
"F_hi": "गॉड़ियाँ के बाग का उपयोग करें",
"G_en": "GST has led to increased revenue for the government.",
"G_hi": "गॉड़ियाँ के संकर्ता का उपयोग करें",
"H_en": "GST has resulted in transparency in the taxation system.",
"H_hi": "गॉड़ियाँ के संकर्ता का उपयोग करें",
"I_en": "GST has improved the ease of doing business in India.",
"I_hi": "गॉड़ियाँ के संकर्ता का उपयोग करें",
"J_en": "GST has led to reduced inflation.",
"J_hi": "गॉड़ियाँ के संकर्ता का उपयोग करें",
"K_en": "GST has facilitated the growth of small and medium industries.",
"K_hi": "गॉड़ियाँ के संकर्ता का उपयोग करें",
"L_en": "GST has led to increased revenue for the central and state governments.",
"L_hi": "गॉड़ियाँ के संकर्ता का उपयोग करें",
"M_en": "GST has improved the competitiveness of Indian industries in the global market.",
"M_hi": "गॉड़ियाँ के संकर्ता का उपयोग करें",
"N_en": "GST has facilitated the easy availability of credit facilities to businesses.",
"N_hi": "गॉड़ियाँ के संकर्ता का उपयोग करें",
"O_en": "GST has reduced the burden of multiple tax registrations on businesses.",
"O_hi": "गॉड़ियाँ के संकर्ता का उपयोग करें",
"P_en": "GST has led to better tax collection for the government.",
"P_hi": "गॉड़ियाँ के संकर्ता का उपयोग करें",
"Q_en": "GST has improved the ease of doing business in India.",
"Q_hi": "गॉड़ियाँ के संकर्ता का उपयोग करें",
"R_en": "GST has reduced the burden of compliance on businesses.",
"R_hi": "गॉड़ियाँ के संकर्ता का उपयोग करें",
"S_en": "GST has brought transparency in the taxation system.",
"S_hi": "गॉड़ियाँ के संकर्ता का उपयोग करें",
]
]