<think>
Okay, I need to create 10 high-quality MCQs on GST (Goods and Services Tax): Concepts and Impact for Rajasthan State Exams, SSC, and Railway exams like NTPC. The questions should be in both Hindi and English, following the testbook style with options labeled A to D. The answer and explanations should also be in both languages. Let me start by recalling key points about GST in India.

First, GST is a destination-based tax system that replaced multiple indirect taxes. It was implemented on July 1, 2017. The tax is levied at different rates: 5%, 12%, 18%, and 28%. There are also exemptions and a compensation cess for certain goods. The impact includes simplification of the tax structure, reduced tax evasion, and increased government revenue. However, some challenges include the complexity of tax slabs and the burden on small businesses. 

Now, I need to structure each question with the subject and topic as specified. Let me think of different angles. Maybe start with the implementation date, key features like tax rates, the role of CGST and SGST, the impact on inflation, and compare it with previous tax systems. Also, some questions can be about the structure of GST (central and state components), the role of the GST Council, and the benefits like reducing cascading effect.

For each question, I need to ensure that the options are distinct and cover common misconceptions. For example, a question on the implementation date might have other dates as options. For tax rates, the options could include common percentages and incorrect ones. The explanations should clarify why the correct answer is right and why others are wrong.

Let me draft the first question: What is the main objective of GST? Options could be reducing tax burden, simplifying tax structure, increasing government revenue, etc. The correct answer is simplifying the tax structure by replacing multiple taxes.

Next, when explaining the tax slabs, maybe ask about the highest tax rate. The answer is 28%, so options could include 25%, 28%, 30%, etc.

For the impact on businesses, a question could be about reducing tax compliance costs, leading to increased efficiency. The explanation would mention that GST reduces the need for multiple tax filings and streamlines processes.

I also need to ensure that the Hindi translations are accurate and maintain the same meaning as the English versions. Terms like "cascading effect" should be translated appropriately. For example, "कैसकेडिंग प्रभाव" for cascading effect.

I should check for any recent updates or amendments to GST that might be relevant for exams, but since the topic is about concepts and impact, the core information should remain consistent. Also, considering Rajasthan's context, maybe include a question about GST's impact on the state's economy, but since the topic is general GST, it's better to keep it country-wide unless specified.

Let me verify each question for clarity and accuracy. Ensure that the answers are correct and the explanations support the correct answer. For example, if a question is about the tax structure, the explanation should detail how CGST and SGST are collected and distributed between the center and states.

I'll proceed to create each of the 10 questions following these considerations, making sure they cover various aspects of GST concepts and their economic impact.
</think>

[
{
  "subject": "Economy",
  "topic": "GST (Goods and Services Tax): Avdharna aur Prabhav",
  "question_en": "GST के मुख्य उद्देश्य क्या हैं?",
  "question_hi": "जीएसटी के मुख्य उद्देश्य क्या हैं?",
  "A_en": "कर चोरी को कम करना",
  "A_hi": "कर चोरी को कम करना",
  "B_en": "एकल बाजार में एकीकरण प्राप्त करना",
  "B_hi": "एकल बाजार में एकीकरण प्राप्त करना",
  "C_en": "कई प्रत्यक्ष करों को एकीकृत करना",
  "C_hi": "कई प्रत्यक्ष करों को एकीकृत करना",
  "D_en": "ऊपर के सभी",
  "D_hi": "ऊपर के सभी",
  "answer": "D",
  "explanation_en": "जीएसटी के मुख्य उद्देश्य कर चोरी कम करना, एकल बाजार में एकीकरण प्राप्त करना और कई प्रत्यक्ष करों को एकीकृत करना हैं।",
  "explanation_hi": "जीएसटी के मुख्य उद्देश्य कर चोरी कम करना, एकल बाजार में एकीकरण प्राप्त करना और कई प्रत्यक्ष करों को एकीकृत करना हैं।"
},
{
  "subject": "Economy",
  "topic": "GST (Goods and Services Tax): Avdharna aur Prabhav",
  "question_en": "जीएसटी के अधिकारियों के अनुसार, भारत में जीएसटी कब से लागू किया गया?",
  "question_hi": "जीएसटी के अधिकारियों के अनुसार, भारत में जीएसटी कब से लागू किया गया?",
  "A_en": "2017 में 1 जुलाई",
  "A_hi": "2017 में 1 जुलाई",
  "B_en": "2017 में 15 जुलाई",
  "B_hi": "2017 में 15 जुलाई",
  "C_en": "2016 में 1 अप्रैल",
  "C_hi": "2016 में 1 अप्रैल",
  "D_en": "2018 में 1 जनवरी",
  "D_hi": "2018 में 1 जनवरी",
  "answer": "A",
  "explanation_en": "भारत में जीएसटी को 2017 में 1 जुलाई को लागू किया गया।",
  "explanation_hi": "भारत में जीएसटी को 2017 में 1 जुलाई को लागू किया गया।"
},
{
  "subject": "Economy",
  "topic": "GST (Goods and Services Tax): Avdharna aur Prabhav",
  "question_en": "जीएसटी में कितने प्रतिशत के तहत अधिकतम कर दर क्या है?",
  "question_hi": "जीएसटी में कितने प्रतिशत के तहत अधिकतम कर दर क्या है?",
  "A_en": "28%",
  "A_hi": "28%",
  "B_en": "30%",
  "B_hi": "30%",
  "C_en": "25%",
  "C_hi": "25%",
  "D_en": "35%",
  "D_hi": "35%",
  "answer": "A",
  "explanation_en": "जीएसटी में अधिकतम कर दर 28% है, जो अक्सर लग्जरी या अनावश्यक वस्तुओं पर लगाया जाता है।",
  "explanation_hi": "जीएसटी में अधिकतम कर दर 28% है, जो अक्सर लग्जरी या अनावश्यक वस्तुओं पर लगाया जाता है।"
},
{
  "subject": "Economy",
  "topic": "GST (Goods and Services Tax): Avdharna aur Prabhav",
  "question_en": "जीएसटी में राज्य और केंद्र द्वारा वसूल किए जाने वाले कर के नाम क्या हैं?",
  "question_hi": "जीएसटी में राज्य और केंद्र द्वारा वसूल किए जाने वाले कर के नाम क्या हैं?",
  "A_en": "CGST और SGST",
  "A_hi": "सीजीएसटी और एसजीएसटी",
  "B_en": "UGST और CGST",
  "B_hi": "यूजीएसटी और सीजीएसटी",
  "C_en": "SGST और IGST",
  "C_hi": "एसजीएसटी और आईजीएसटी",
  "D_en": "IGST और CGST",
  "D_hi": "आईजीएसटी और सीजीएसटी",
  "answer": "A",
  "explanation_en": "जीएसटी में केंद्र द्वारा वसूल किया जाने वाला कर CGST (Central Goods and Services Tax) और राज्य द्वारा वसूल किया जाने वाला कर SGST (State Goods and Services Tax) होता है।",
  "explanation_hi": "जीएसटी में केंद्र द्वारा वसूल किया जाने वाला कर सीजीएसटी होता है और राज्य द्वारा वसूल किया जाने वाला कर एसजीएसटी होता है।"
},
{
  "subject": "Economy",
  "topic": "GST (Goods and Services Tax): Avdharna aur Prabhav",
  "question_en": "जीएसटी के लागू होने से क्या असर नहीं हुआ?",
  "question_hi": "जीएसटी के लागू होने से क्या असर नहीं हुआ?",
  "A_en": "कर चोरी कम हुई",
  "A_hi": "कर चोरी कम हुई",
  "B_en": "कर अनुपालन की लागत बढ़ गई",
  "B_hi": "कर अनुपालन की लागत बढ़ गई",
  "C_en": "कैस्केडिंग इफेक्ट कम हुआ",
  "C_hi": "कैस्केडिंग प्रभाव कम हुआ",
  "D_en": "उपरोक्त में से कोई भी नहीं",
  "D_hi": "उपरोक्त में से कोई भी नहीं",
  "answer": "B",
  "explanation_en": "जीएसटी के लागू होने से कर अनुपालन की लागत घट गई, न कि बढ़ी।",
  "explanation_hi": "जीएसटी के लागू होने से कर अनुपालन की लागत घट गई, न कि बढ़ी।"
},
{
  "subject": "Economy",
  "topic": "GST (Goods and Services Tax): Avdharna aur Prabhav",
  "question_en": "जीएसटी प्रणाली में आईजीएसटी का उपयोग किस तरह के लेनदेन के लिए किया जाता है?",
  "question_hi": "जीएसटी प्रणाली में आईजीएसटी का उपयोग किस तरह के लेनदेन के लिए किया जाता है?",
  "A_en": "राज्यों के भीतरके लेनदेन के लिए",
  "A_hi": "राज्यों के भीतरके लेनदेन के लिए",
  "B_en": "राज्यों के बीचके लेनदेन के लिए",
  "B_hi": "राज्यों के बीचके लेनदेन के लिए",
  "C_en": "अंतरराष्ट्रीय लेनदेन के लिए",
  "C_hi": "अंतरराष्ट्रीय लेनदेन के लिए",
  "D_en": "व्यक्ति से कंपनी के लेनदेन के लिए",
  "D_hi": "व्यक्ति से कंपनी के लेनदेन के लिए",
  "answer": "B",
  "explanation_en": "आईजीएसटी (IGST) राज्यों के बीचके लेनदेन पर लगाया जाता है। यह केंद्र द्वारा वसूल किया जाता है और बाद में राज्यों के बीच वितरित किया जाता है।",
  "explanation_hi": "आईजीएसटी (IGST) राज्यों के बीचके लेनदेन पर लगाया जाता है। यह केंद्र द्वारा वसूल किया जाता है और बाद में राज्यों के बीच वितरित किया जाता है।"
},
{
  "subject": "Economy",
  "topic": "GST (Goods and Services Tax): Avdharna aur Prabhav",
  "question_en": "जीएसटी के लागू होने से पहले कितनी संख्या में प्रत्यक्ष कर लागू थे?",
  "question_hi": "जीएसटी के लागू होने से पहले कितनी संख्या में प्रत्यक्ष कर लागू थे?",
  "A_en": "14",
  "A_hi": "14",
  "B_en": "17",
  "B_hi": "17",
  "C_en": "19",
  "C_hi": "1