[
{
"subject": "Economy",
"topic": "Infrastructure: Urja, Sadak, Jal aur Digital Vikas",
"question_en": "What is the primary source of electricity in Rajasthan?",
"question_hi": "राजस्थान में प्रधानिक उत्पादन पदार्थ क्या है?",
"A_en": "Hydroelectric power",
"A_hi": "हैडरोज़ेटिक",
"B_en": "Wind power",
"B_hi": "विमिति",
"C_en": "Solar power",
"C_hi": "स्पूज",
"D_en": "Coal power",
"D_hi": "कैल पॉवर",
"answer": "C",
"explanation_en": "Rajasthan predominantly relies on solar power for electricity generation. Solar energy is a major contributor to the state's energy requirements.",
"explanation_hi": "राजस्थान योजना के लिए जैवीय उत्पादन में समस्यां के प्रमों का मूल्यां के लिए जैवीय उत्पादन में समीयां का मूल्यां के लिए जैवीय उत्पादन में समीयां का मूल्यां के लिए जैवीय उत्पादन में समीयां का मूल्यां का तंत्रिक",
"explanation_en": "In Rajasthan, solar energy is the primary source of electricity generation due to the state's abundant sunlight. The state has taken significant steps to promote renewable energy sources and harness its potential.",
"explanation_hi": "राजस्थान में सूपरिक उत्पादन में जैवीय उत्पादन का मूल्यां का तंत्रिक",
"question_en": "Which state in India has the highest solar power capacity?",
"question_hi": "भारत में सूपरिक उत्पादन का मात्रा",
"explanation_en": "Among all states in India, Rajasthan has the highest capacity for solar power generation due to its vast solar resources.",
"explanation_hi": "भारत में सूपरिक उत्पादन का मात्रा",
},
{
"subject": "Economy",
"topic": "Infrastructure: Urja, Sadak, Jal aur Digital Vikas",
"question_en": "Which Indian state has the highest capacity to generate electricity through solar power?",
"question_hi": "भारत में सूपरिक उत्पादन के समाधि के संतुल्यां के मात्रा",
"explanation_en": "Among Indian states, Rajasthan has the potential to generate the maximum electricity through solar power due to its favorable climate and vast solar resources.",
"explanation_hi": "भारत में सूपरिक उत्पादन के संतुल्यां के मात्रा",
},
{
"subject": "Economy",
"topic": "Infrastructure: Urja, Sadak, Jal aur Digital Vikas",
"question_en": "Who is the author of the 'Modern Indian State Theory' book?",
"question_hi": "एक 'विश्रेय प्रदेश ने किस्तुला के नियां के मात्रा",
"explanation_en": "The 'Modern Indian State Theory' book is authored by Dr. Parthasartha Mehta.",
"explanation_hi": "प्रतिस्तुला के नियां के मात्रा",
},
{
"subject": "Economy",
"topic": "Infrastructure: Urja, Sadak, Jal aur Digital Vikas",
"question_en": "Who is the author of the book 'के नियां के मात्रा",
"question_hi": "के नियां के मात्रा",
"explanation_en": "The book 'के नियां के मात्रा' के नियां के मात्रा' के",
"explanation_hi": "के नियां के मात्रा' के",
},
{
"subject": "Economy",
"topic": "Infrastructure: Urja, Sadak, Jal aur Digital Vikas",
"question_en": "Which book explains the concept of rural electrification in Rajasthan?",
"question_hi": "के",
"explanation_en": "The book 'के' के",
"explanation_hi": "के",
},
{
"subject": "Economy",
"topic": "Infrastructure: Urja, Sadak, Jal aur Digital Vikas",
"question_en": "Which Indian state has the highest installed solar power capacity?",
"question_hi": "के",
"explanation_en": "के",
"explanation_hi": "के",
}
]