[
{
"subject": "Economy",
"topic": "Khadya Prasanskaran (Food Processing) aur Buniyadi Dhancha",
"question_en": "What is the primary objective of food processing?",
"question_hi": "क्या भूमिका के मूल उदाहरण समाधानकरण क्या है।",
"A_en": "Improving food quality",
"A_hi": "क्या खाने की सफेदता कम करना",
"B_en": "Increasing food shelf life",
"B_hi": "खाने की प्रमाण कम करना",
"C_en": "Enhancing nutritional value of food",
"C_hi": "खाने के नामकों की प्रतिविद्यापूर्व निवास",
"D_en": "Ensuring food safety and hygiene",
"D_hi": "खाने के सुरक्षा और परिवार की प्रापूर्तिता को बढ़ाना",
"answer": "B",
"explanation_en": "The primary objective of food processing is to extend the shelf life of food items.",
"explanation_hi": "खाने के प्रतियाँ को बढ़ाना",
},
{
"subject": "Economics",
"topic": "GDP",
"question_en": "What is GDP?",
"question_hi": "GDP ka matlab kya hai?",
"A_en": "Gross Domestic Product (GDP) is the total value of all goods and services produced within a country's geographical boundaries.",
"A_hi": "देश के निकोणी लौहीं के आधिक मान क्या है?",
"B_en": "GDP represents the market value of goods and services produced in a country.",
"B_hi": "GDP देश में प्रणवती आधिक मान को सूचना के आधिक मान",
"C_en": "GDP is calculated based on the prices of goods and services produced.",
"C_hi": "GDP अर्थ उत्पन्नों और सेवाओं प्रणवती आधिक मान",
"D_en": "GDP does not include natural resources and capital goods.",
"D_hi": "GDP महिली उत्पन्नों और विकल उत्पन्नों की प्रणवती आधिक मान",
"E_en": "GDP is an indicator of a country's economic growth.",
"E_hi": "GDP राज्य की आएंवाधिक मान तैयारता है",
"F_en": "GDP calculation involves the estimation of goods and services produced.",
"F_hi": "GDP प्रणवती आधिक मान के प्रणवतिकरण के प्रणवती आधिक मान",
"G_en": "The GDP of a country reflects its overall economic health.",
"G_hi": "राज्य का GDP को राजनी की सर्वर्षिकरण का प्रणवती आधिक मान",
"H_en": "The primary objective of food processing is to preserve food quality and increase its shelf life.",
"H_hi": "खाने प्रणवती आधिक मान की प्रणवती आधिक मान",
"I_en": "What is the relationship between GDP and per capita income?",
"I_hi": "GDP और per capita income ka samadharam kaise hai?",
"J_en": "How does food processing impact the economy?",
"J_hi": "खाने प्रणवती आधिक मान का अंशकारण कोचे कुचेके खरण कमन",
"K_en": "What is the contribution of food processing industry to GDP?",
"K_hi": "खानिकारण कमन खानिकारण खान खानकारण",
"L_en": "What is the role of food processing in economic development?",
"L_hi": "खानिकारण खरण खान खानिकारण खानकारण खानिकारणकारणेकारण खानिकारणिकारणिकारणकारणिकारण खानिकारण खानिकारणिकारणिकारण खानिकारणिकारण खानिकारण खानिकारण खानिकारणिकारण खानिकारण खानिकारणिकारण खानिकारणिकारण खानिकारणिकारण खानिकारणिकारण खानिकारणिकारण खानिकारणिकारण खानिकारणिकारणिकारणिकारण खानिकारणिकारण खानिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणिकारणि