[
{
"subject": "Economy",
"topic": "Khaneej Aadharit Arthvyavastha Rajasthan ki",
"question_en": "Which mineral earns the highest revenue for Rajasthan?",
"question_hi": "राजस्थान को सर्वाधिक राजस्व किस खनिज से प्राप्त होता है?",
"A_en": "Copper", "A_hi": "तांबा",
"B_en": "Lead-Zinc", "B_hi": "सीसा-जिंक",
"C_en": "Rock Phosphate", "C_hi": "रॉक फॉस्फेट",
"D_en": "Limestone", "D_hi": "चूना पत्थर",
"answer": "B",
"explanation_en": "Lead-Zinc mining in the Zawar and Rampura-Agucha belts contributes the largest share of royalty and revenue to the state exchequer.",
"explanation_hi": "जावर और रामपुरा-अगूचा बेल्ट में सीसा-जिंक खनन राज्य खजाने को सबसे अधिक रॉयल्टी और राजस्व देता है।"
},
{
"subject": "Economy",
"topic": "Khaneej Aadharit Arthvyavastha Rajasthan ki",
"question_en": "The state-owned Rajasthan State Mines and Minerals Limited (RSMML) primarily operates in which district for rock-phosphate?",
"question_hi": "राज्य की राजस्थान स्टेट माइंस एंड मिनरल्स लिमिटेड (RSMML) मुख्य रूप से रॉक-फॉस्फेट के लिए किस जिले में संचालित होती है?",
"A_en": "Jaisalmer", "A_hi": "जैसलमेर",
"B_en": "Barmer", "B_hi": "बाड़मेर",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Jhunjhunu", "D_hi": "झुंझुनूं",
"answer": "C",
"explanation_en": "RSMML’s Phosphate mine at Jhamarkotra near Udaipur is the largest open-cast phosphate mine in India.",
"explanation_hi": "उदयपुर के निकट झमरकोटra में RSMML का फॉस्फेट खान भारत का सबसे बड़ा खुला-फॉस्फेट खान है।"
},
{
"subject": "Economy",
"topic": "Khaneej Aadharit Arthvyavastha Rajasthan ki",
"question_en": "Approximately what percentage of India’s total potash reserve is found in Rajasthan’s Sallopat-Bharusari belt?",
"question_hi": "भारत के कुल पोटाश भंडार का लगभग कितना प्रतिशत राजस्थान के सलोपाट-भरुसरी बेल्ट में पाया जाता है?",
"A_en": "40 %", "A_hi": "40 %",
"B_en": "60 %", "B_hi": "60 %",
"C_en": "80 %", "C_hi": "80 %",
"D_en": "95 %", "D_hi": "95 %",
"answer": "D",
"explanation_en": "The Sallopat-Bharusari belt in Barmer district holds about 95 % of the country’s potash resources, mainly as polyhalite.",
"explanation_hi": "बाड़मेर जिले का सलोपाट-भरुसरी बेल्ट देश के पोटाश संसाधनों का लगभग 95 % हिस्सा रखता है, मुख्य रूप से पोलीहैलाइट के रूप में।"
},
{
"subject": "Economy",
"topic": "Khaneej Aadharit Arthvyavastha Rajasthan ki",
"question_en": "Which of the following is NOT a major copper mining belt of Rajasthan?",
"question_hi": "निम्नलिखित में से कौन-सा राजस्थान का प्रमुख तांबा खनन बेल्ट नहीं है?",
"A_en": "Khetri-Singhana", "A_hi": "खेतड़ी-सिंघाना",
"B_en": "Mosabani", "B_hi": "मोसाबानी",
"C_en": "Delwara-Kalyanpur", "D_hi": "डेलवाड़ा-कल्याणपुर",
"D_en": "Rakha-Chapri", "D_hi": "राखा-चापरी",
"answer": "B",
"explanation_en": "Mosabani is a copper belt of Jharkhand (Singhbhum), not Rajasthan.",
"explanation_hi": "मोसाबानी झारखंड (सिंहभूम) का तांबा बेल्ट है, राजस्थान का नहीं।"
},
{
"subject": "Economy",
"topic": "Khaneej Aadharit Arthvyavastha Rajasthan ki",
"question_en": "The zinc smelter at Chanderiya is located in which district?",
"question_hi": "चंदेरीया में स्थित जिंक स्मेल्टर किस जिले में है?",
"A_en": "Bhilwara", "A_hi": "भीलवाड़ा",
"B_en": "Chittorgarh", "B_hi": "चित्तौड़गढ़",
"C_en": "Udaipur", "C_hi": "उदयपुर",
"D_en": "Pali", "D_hi": "पाली",
"answer": "A",
"explanation_en": "Hindustan Zinc’s Chanderiya smelter complex, one of the world’s largest, is situated in Bhilwara district.",
"explanation_hi": "हिंदुस्तान जिंक का चंदेरीया स्मेल्टर परिसर, जो दुनिया के सबसे बड़े में से एक है, भीलवाड़ा जिले में स्थित है।"
},
{
"subject": "Economy",
"topic": "Khaneej Aadharit Arthvyavastha Rajasthan ki",
"question_en": "Which limestone belt of Rajasthan supplies maximum clinker grade limestone to northern India cement plants?",
"question_hi": "राजस्थान का कौन-सा चूना पत्थर बेल्ट उत्तर भारत के सीमेंट संयंत्रों को अधिकतम क्लिंकर ग्रेड चूना पत्थर आपूर्ति करता है?",
"A_en": "Nimbahera-Bassi", "A_hi": "निम्बाहेड़ा-बास्सी",
"B_en": "Jaisalmer", "A_hi": "जैसलमेर",
"C_en": "Sirohi", "C_hi": "सिरोही",
"D_en": "Karauli-Dholpur", "D_hi": "करौली-धौलपुर",
"answer": "A",
"explanation_en": "The Nimbahera-Bassi belt (Chittorgarh) has high-grade limestone suitable for clinker, feeding plants across north and central India.",
"explanation_hi": "निम्बाहेड़ा-बास्सी बेल्ट (चित्तौड़गढ़) में उच्च-ग्रेड क्लिंकर योग्य चूना पत्थर है जो उत्तर एवं मध्य भारत के संयंत्रों को आपूर्ति करता है।"
},
{
"subject": "Economy",
"topic": "Khaneej Aadharit Arthvyavastha Rajasthan ki",
"question_en": "Rajasthan is the sole producer of which of the following minerals in India?",
"question_hi": "भारत में निम्नलिखित खनिजों में से किसका एकमात्र उत्पादक राजस्थान है?",
"A_en": "Tungsten", "A_hi": "टंगस्टन",
"B_en": "Gold", "B_hi": "सोना",
"C_en": "Manganese", "B_hi": "मैंगनीज",
"D_en": "Bauxite", "D_hi": "बॉक्साइट",
"answer": "A",
"explanation_en": "The Degana mine (Nagaur) is India’s only active source of tungsten ore (wolframite).",
"explanation_hi": "डेगाना खान (नागौर) भारत का एकमात्र सक्रिय टंगस्टन अयस्क (वोल्फ्रामाइट) स्रोत है।"
},
{
"subject": "Economy",
"topic": "Khaneej Aadharit Arthvyavastha Rajasthan ki",
"question_en": "The lead-zinc mines of Rampura-Agucha are operated by which company?",
"question_hi": "रामपुरा-अगूचा के सीसा-जिंक खानों का संचालन किस कंपनी द्वारा होता है?",
"A_en": "Hindustan Copper Ltd.", "A_hi": "हिंदुस्तान कॉपर लिमिटेड",
"B_en": "Rajasthan State Mines & Minerals Ltd.", "B_hi": "राजस्थान स्टेट माइंस एंड मिनरल्स लिमिटेड",
"C_en": "Hindustan Zinc Ltd.", "C_hi": "हिंदुस्तान जिंक लिमिटेड",
"D_en": "Gujarat Mineral Development Corp.", "D_hi": "गुजरात मिनरल डेवलपमेंट कॉर्पोरेशन",
"answer": "C",
"explanation_en": "Rampura-Agucha, the world’s largest open-cast zinc-lead mine, is operated by Hindustan Zinc Ltd. (Vedanta group).",
"explanation_hi": "रामपुरा-अगूचा, दुनिया का सबसे बड़ा खुला सीसा-जिंक खान, हिंदुस्तान जिंक लिमिटेड (वेदांता समूह) द्वारा संचालित है।"
},
{
"subject": "Economy",
"topic": "Khaneej Aadharit Arthvyavastha Rajasthan ki",
"question_en": "Which district hosts the majority of Rajasthan’s garnet abrasive mines?",
"question_hi": "राजस्थान के गार्नेट अब्रेसिव खानों का बड़ा भाग किस जिले में है?",
"A_en": "Tonk", "A_hi": "टोंक",
"B_en": "Ajmer", "B_hi": "अजमेर",
"C_en": "Bhilwara", "C_hi": "भीलवाड़ा",
"D_en": "Alwar", "D_hi": "अलवर",
"answer": "A",
"explanation_en": "The Tonk district (mainly around the Jahaz and Deoli blocks) has the largest concentration of garnet abrasive deposits in the state.",
"explanation_hi": "टोंक जिले (मुख्य रूप से जहाज और देपुर ब्लॉक) में राज्य के सबसे बड़े गार्नेट अब्रेसिव भंडार हैं।"
},
{
"subject": "Economy",
"topic": "Khaneej Aadharit Arthvyavastha Rajasthan ki",
"question_en": "The contribution of mining and quarrying to Rajasthan’s GSDP (at current prices) is roughly:",
"question_hi": "खनन और खदान उद्योग का राजस्थान के कुल राज्य सकल उत्पाद (वर्तमान कीमतों पर) में लगभग योगदान कितना है?",
"A_en": "2 %", "A_hi": "2 %",
"B_en": "5 %", "B_hi": "5 %",
"C_en": "8 %", "C_hi": "8 %",
"D_en": "12 %", "D_hi": "12 %",
"answer": "C",
"explanation_en": "As per recent Economic Survey data, mining & quarrying contributes around 8 % to Rajasthan’s GSDP, making it a key non-farm sector.",
"explanation_hi": "हाल की आर्थिक सर्वे रिपोर्ट के अनुसार खनन एवं खदान उद्योग राजस्थान के कुल राज्य सकल उत्पाद में लगभग 8 % योगदान देता है, जो एक प्रमुख गैर-कृषि क्षेत्र है।"
}
]