<think>
Okay, I need to create 10 high-quality multiple-choice questions (MCQs) on the topic of "Krishi Arthvyavastha aur Green Revolution" (Agricultural Economy and Green Revolution) for Rajasthan State Exams like LDC, CET, RAS, as well as SSC and Railway exams like NTPC. Each question must have both Hindi and English versions, and the answers with explanations in both languages.

First, I should recall key points about the agricultural economy and the Green Revolution in India, especially in Rajasthan. The Green Revolution started in the 1960s, focusing on high-yield variety (HYV) seeds, fertilizers, pesticides, and irrigation. In Rajasthan, areas like western Rajasthan might have faced challenges due to aridity, so the impact there might have been different. Key figures, years, effects, and specific states involved in the Green Revolution are important. Also, the role of technology, changes in farming practices, and the socio-economic impacts like farmer indebtedness or food security.

I need to ensure that the questions cover these aspects. Let me brainstorm possible topics:

1. Definition and main objectives of the Green Revolution.
2. When was the Green Revolution initiated in India?
3. Key states that were most affected (like Punjab, Haryana, Western UP) and how Rajasthan fits in.
4. High-yield varieties of crops introduced.
5. Technology and inputs used (irrigation, fertilizers, etc.).
6. Impact on food production and self-sufficiency.
7. Challenges faced during the Green Revolution.
8. Environmental effects (soil degradation, water usage).
9. Socio-economic effects on farmers.
10. Current agricultural policies or initiatives in Rajasthan related to agriculture.

Now, for each question, I need to frame it in both languages, provide four options in both, and have the correct answer with explanations in both Hindi and English. The difficulty level should be moderate to high, suitable for competitive exams.

Let me start drafting:

Question 1: When was the Green Revolution initiated in India? (Options: 1950s, 1960s, 1970s, 1980s) Answer: B (1960s)

Question 2: Which crop was the focus of the Green Revolution in India? (Wheat, Rice, Jowar, Bajra) Answer: A (Wheat)

Question 3: Which state was not a major beneficiary of the Green Revolution? (Punjab, Haryana, Gujarat, Rajasthan) Answer: D (Rajasthan) because Rajasthan's arid conditions made it less suitable.

Question 4: What is High Yield Variety (HYV) seeds? (Options about higher productivity under optimal conditions, etc.)

Question 5: Which technology was crucial for the Green Revolution? (Tractors, Fertilizers, Solar Pumps, Drones) Answer: B (Fertilizers)

Question 6: What was a major challenge due to the Green Revolution? (Soil degradation, Increased crop diversity, Reduced food prices, Lower income) Answer: A (Soil degradation)

Question 7: Who is known as the father of the Green Revolution in India? (M.S. Swaminathan, Norman Borlaug, Manmohan Singh, Amartya Sen) Answer: A (M.S. Swaminathan)

Question 8: How did the Green Revolution affect food grain production? (Increased, Decreased, No effect, Stagnated) Answer: A (Increased)

Question 9: What was the impact on small farmers? (Increased income, Debt due to high costs, No change, Migration) Answer: B (Debt due to high costs)

Question 10: Which initiative is related to sustainable agriculture in Rajasthan? (Raj Rabi Yojana, Krishi Sinchayi Kosh, Green Revolution Phase II, Operation Flood) Answer: A (Raj Rabi Yojana)

Now, I need to structure each question into the JSON format as per the example. Each question should have the subject, topic, question in both languages, options in both, answer (A/B/C/D), and explanations in both languages. Need to ensure accuracy and clarity. Also, check that the options are plausible and the correct answer is unambiguous. Avoid any overlap or ambiguity in options. The explanations should succinctly justify the correct answer.
</think>

[
  {
    "subject": "Economy",
    "topic": "Krashi Arthvyavastha aur Green Revolution",
    "question_en": "When was the Green Revolution initiated in India?",
    "question_hi": "भारत में हरित क्रांति कब शुरू हुई थी?",
    "A_en": "1950s",
    "A_hi": "1950",
    "B_en": "1960s",
    "B_hi": "1960",
    "C_en": "1970s",
    "C_hi": "1970",
    "D_en": "1980s",
    "D_hi": "1980",
    "answer": "B",
    "explanation_en": "The Green Revolution began in the 1960s to increase food production using High Yield Variety (HYV) seeds.",
    "explanation_hi": "हरित क्रांति 1960 में उच्च उपज वाले बीजों के उपयोग द्वारा खाद्य उत्पादन बढ़ाने के लिए शुरू हुई।"
  },
  {
    "subject": "Economy",
    "topic": "Krashi Arthvyavastha aur Green Revolution",
    "question_en": "Which crop was the focus of the Green Revolution in India?",
    "question_hi": "भारत में हरित क्रांति के कौन से फसल पर केंद्रित थी?",
    "A_en": "Wheat",
    "A_hi": "गेहूं",
    "B_en": "Rice",
    "B_hi": "चावल",
    "C_en": "Jowar",
    "C_hi": "ज्वार",
    "D_en": "Bajra",
    "D_hi": "बाजरा",
    "answer": "A",
    "explanation_en": "The Green Revolution primarily focused on increasing wheat production in India.",
    "explanation_hi": "हरित क्रांति भारत में गेहूं के उत्पादन बढ़ाने पर प्रमुख रूप से केंद्रित थी।"
  },
  {
    "subject": "Economy",
    "topic": "Krashi Arthvyavastha aur Green Revolution",
    "question_en": "Which state was not a major beneficiary of the Green Revolution?",
    "question_hi": "हरित क्रांति का एक महत्वपूर्ण लाभार्थी राज्य नहीं रहा?",
    "A_en": "Punjab",
    "A_hi": "पंजाब",
    "B_en": "Haryana",
    "B_hi": "हरियाणा",
    "C_en": "Gujarat",
    "C_hi": "गुजरात",
    "D_en": "Rajasthan",
    "D_hi": "राजस्थान",
    "answer": "D",
    "explanation_en": "Rajasthan's arid conditions made it less suitable for the Green Revolution's initial focus.",
    "explanation_hi": "राजस्थान की शुष्क जलवायु हरित क्रांति के प्रारंभिक लक्ष्यों के लिए उपयुक्त नहीं थी।"
  },
  {
    "subject": "Economy",
    "topic": "Krashi Arthvyavastha aur Green Revolution",
    "question_en": "What does High Yield Variety (HYV) seeds refer to?",
    "question_hi": "उच्च उपज वाले (HYV) बीजों का क्या अर्थ है?",
    "A_en": "Seeds requiring low inputs",
    "A_hi": "निम्न निवेश वाले बीज",
    "B_en": "Seeds producing high yields under optimal conditions",
    "B_hi": "अनुकूल परिस्थितियों में उच्च उपज देने वाले बीज",
    "C_en": "Seeds resistant to all diseases",
    "C_hi": "सभी बीमारियों के प्रति प्रतिरोधी बीज",
    "D_en": "Seeds suitable for all climates",
    "D_hi": "सभी जलवायु के लिए उपयुक्त बीज",
    "answer": "B",
    "explanation_en": "HYV seeds are designed to produce higher yields when given adequate irrigation, fertilizers, and pesticides.",
    "explanation_hi": "HYV बीजों को अधिक उपज उत्पन्न करने के लिए पर्याप्त सिंचाई, उर्वरक और कीटनाशकों के साथ डिज़ाइन किया गया है।"
  },
  {
    "subject": "Economy",
    "topic": "Krashi Arthvyavastha aur Green Revolution",
    "question_en": "Which technology was crucial for the Green Revolution?",
    "question_hi": "हरित क्रांति के लिए कौन सी तकनीक प्रमुख थी?",
    "A_en": "Tractors",
    "A_hi": "ट्रैक्टर",
    "B_en": "Fertilizers",
    "B_hi": "उर्वरक",
    "C_en": "Solar Pumps",
    "C_hi": "सौर पंप",
    "D_en": "Drones",
    "D_hi": "ड्रोन",
    "answer": "B",
    "explanation_en": "Fertilizers were essential for boosting soil nutrients and achieving high crop yields.",
    "explanation_hi": "उर्वरक मिट्टी के पोषक तत्वों को बढ़ाने और अधिक फसल उपज प्राप्त करने के लिए आवश्यक थे।"
  },
  {
    "subject": "Economy",
    "topic": "Krashi Arthvyavastha aur Green Revolution",
    "question_en": "What was a major challenge due to the Green Revolution?",
    "question_hi": "हरित क्रांति के कारण एक प्रमुख चुनौती क्या रही?",
    "A_en": "Soil degradation",
    "A_hi": "मिट्टी का क्षरण",
    "B_en": "Increased crop diversity",
    "B_hi": "फसल विविधता में वृद्धि",
    "C_en": "Reduced food prices",
    "C_hi": "खाद्य उत्पादों की कीमतों में कमी",
    "D_en": "Lower income",
    "D_hi": "कम आय",
    "answer": "A",
    "explanation_en": "Intensive use of chemical fertilizers and pesticides led to soil degradation in many regions.",
    "explanation_hi": "रसायनिक उर्वरकों और कीटनाशकों का अत्यधिक उपयोग कई क्षेत्रों में मिट्टी के क्षरण का कारण बना।"
  },
  {
    "subject": "Economy",
    "topic": "Krashi Arthvyavastha aur Green Revolution",
    "question_en": "Who is known as the father of the Green Revolution in India?",
    "question_hi": "भारत में हरित क्रांति के पिता के रूप में किसे जाना जाता है?",
    "A_en": "M.S. Swaminathan",
    "A_hi": "एम.एस. स्वामीनाथन",
    "B_en": "Norman Borlaug",
    "B_hi": "नॉर्मन बोरलौग",
    "C_en": "Manmohan Singh",
    "C_hi": "मनमोहन सिंह",
    "D_en": "Amartya Sen",
    "D_hi": "अमर्त्य सेन",
    "answer": "A",
    "explanation_en": "M.S. Swaminathan played a pivotal role in introducing HYV seeds and modern agricultural practices in India.",
    "explanation_hi": "एम.एस. स्वामीनाथन भारत में HYV बीजों और आधुनिक कृषि अभ्यासों के प्रचलन में महत्वपूर्ण भूमिका निभाई।"
  },
  {
    "subject": "Economy",
    "topic": "Krashi Arthvyavastha aur Green Revolution",
    "question_en": "How did the Green Revolution affect food grain production?",
    "question_hi": "हरित क्रांति खाद्य अनाज उत्पादन पर किस तरह प्रभाव डाली?",
    "A_en": "Increased",
    "A_hi": "वृद्धि",
    "B_en": "Decreased",
    "B_hi": "कमी",
    "C_en": "No effect",
    "C_hi": "कोई प्रभाव नहीं",
    "D_en": "Stagnated",
    "D_hi": "स्थिर रहा",
    "answer": "A",
    "explanation_en": "The Green Revolution significantly boosted food grain production, ensuring national self-sufficiency.",
    "explanation_hi": "हरित क्रांति ने खाद्य अनाज उत्पादन में विशेष रूप से वृद्धि की, राष्ट्रीय स्वावलंबन सुनिश्चित करके।"
  },
  {
    "subject": "Economy",
    "topic": "Krashi Arthvyavastha aur Green Revolution",
    "question_en": "What was the impact of the Green Revolution on small farmers?",
    "question_hi": "हरित क्रांति ने छोटे किसानों पर किस तरह प्रभाव डाला?",
    "A_en": "Increased income",
    "A_hi": "आय में वृद्धि",
    "B_en": "Debt due to high costs",
    "B_hi": "उच्च लागत के कारण ऋण",
    "C_en": "No change",
    "C_hi": "कोई परिवर्तन नहीं",
    "D_en": "Migration",
    "D_hi": "माइग्रेशन",
    "answer": "B",
    "explanation_en": "Small farmers often faced debt due to the high costs of HYV seeds and modern inputs.",
    "explanation_hi": "छोटे किसानों को HYV बीजों और आधुनिक निवेश की उच्च लागत के कारण ऋण का सामना करना पड़ा।"
  },
  {
    "subject": "Economy",
    "topic": "Krashi Arthvyavastha aur Green Revolution",
    "question_en": "Which initiative is related to sustainable agriculture in Rajasthan?",
    "question_hi": "राजस्थान में सतत कृषि से संबंधित कौन सी पहल है?",
    "A_en": "Raj Rabi Yojana",
    "A_hi": "राज रबि योजना",
    "B_en": "Krishi Sinchayi Kosh",
    "B_hi": "कृषि सिंचाई कोष",
    "