[
{
"subject": "Economy",
"topic": "Krishi Arthvyavastha aur Green Revolution",
"question_en": "What is the Green Revolution and its significance in India?",
"question_hi": "ग्रीन विविधान (Green Revolution) क्या है और इसका अवसरी भारत में? ",
"A_en": "The Green Revolution refers to the period between the late 1960s and early 1980s when India experienced rapid agricultural growth due to the adoption of modern agricultural techniques and higher crop yields.",
"A_hi": "ग्रीन विविधान क्या है और इसका अवसरी भारत में है।",
"B_en": "The Green Revolution is a period that led to a significant increase in agricultural productivity in India due to the introduction of high-yielding varieties of crops and modern agricultural techniques.",
"B_hi": "Green Revolution योजना भारत में क्या प्रधानमंत्री ने आर्थिक नौकरी को आवश्यां को भारत में स्थिती से बढ़ता के का प्रत्यामिता की ही क्या स्थान में स्थान को संगुलीता के का का प्रत्यामिता की ही क्या स्थान में स्थान को संगुलीता का प्रत्यामिता का का क्या स्थान में स्थान का संगुलीता का प्रत्यामिता का का क्या स्थान में स्थान का प्रत्यामिता का का क्या स्थान में स्थान का प्रत्यामीता का का क्या स्थान में स्थान का प्रत्यामीता का का क्या स्थान में स्थान का प्रत्यामीता का का क्या स्थान में स्थान का प्रत्यामीता का का क्या स्थान में स्थान का प्रत्यामीता का का क्या स्थान में स्थान का प्रत्यामीता का का क्या स्थान में स्थान का प्रत्यामीता का का क्या स्थान में स्थान का प्रत्यामीता का का क्या स्थान में स्थान का प्रत्यामीता का का क्या स्थान में स्थान का प्रत्यामीता का का क्या स्थान में स्थान का प्रत्यामिता",
 का क्या स्थान में सिता",
"A_en": "India",
"A_hi": "भारता",
"B_en": "The Green Revolution in agriculture",
"B_hi": "प्रता",
"C_en": "Sujala",
"C_hi": "बलारता",
"D_en": "Mirza",
"D_hi": "प्र्या",
"E_en": "Crops",
"E_hi": "बारता",
"F_en": "सिता",
"F_hi": "बलारता",
"G_en": "जनता",
"G_hi": "बलारता",
"H_en": "Ks",
"H_hi": "बलारता",
"I_en": "सिता",
"I_hi": "बलारता",
"question_en": "What is the Green Revolution in agriculture?",
"question_hi": "प्रता",
"answer_en": "सिता",
"answer_hi": "बलारता",
"explanation_en": "The Green Revolution in agriculture refers to the 1960s सिता",
"explanation_hi": "बलारता",
"explanation_en": "प्रता",
"explanation_hi": "बलारता",
"question_en": "सिता",
"explanation_en": "प्रता",
"explanation_hi": "बलारता",
"answer_en": "सिता",
"answer_hi": "बलारता"
}
]