[
{
"subject": "Economy",
"topic": "Paryatan ka Arthik Yogdan Rajasthan mein",
"question_en": "Which district of Rajasthan earns the highest share of tourism revenue mainly due to its desert festivals and sand-dune tourism?",
"question_hi": "राजस्थान का कौन-सा ज़िला मुख्यतः रेगिस्तानी त्योहारों एवं धोरों के पर्यटन से सर्वाधिक राजस्व अर्जित करता है?",
"A_en": "Bikaner", "A_hi": "बीकानेर",
"B_en": "Barmer", "B_hi": "बाड़मेर",
"C_en": "Jaisalmer", "C_hi": "जैसलमेर",
"D_en": "Jalore", "D_hi": "जालोर",
"answer": "C",
"explanation_en": "Jaisalmer, with its Golden Fort, desert safaris and annual Desert Festival, attracts the highest number of foreign and domestic tourists among the Thar belt districts and thus tops in tourism revenue.",
"explanation_hi": "जैसलमेर अपने सोनार किले, सम भ्रमण तथा वार्षिक डेज़र्ट फेस्टिवल के चलते थार पट्टी के ज़िलों में सबसे अधिक विदेशी/देशीय पर्यटकों को आकर्षित करता है और इस प्रकार पर्यटन आय में अग्रणी है।"
},
{
"subject": "Economy",
"topic": "Paryatan ka Arthik Yogdan Rajasthan mein",
"question_en": "As per the Rajasthan Tourism Policy 2020, what approximate percentage of the State’s GSDP is targeted to be contributed by tourism?",
"question_hi": "राजस्थान टूरिज़्म पॉलिसी 2020 के अनुसार राज्य के GSDP में पर्यटन के योगदान का लक्षित अनुपात लगभग कितना है?",
"A_en": "5 per cent", "A_hi": "५ प्रतिशत",
"B_en": "8 per cent", "B_hi": "८ प्रतिशत",
"C_en": "10 per cent", "C_hi": "१० प्रतिशत",
"D_en": "15 per cent", "D_hi": "१५ प्रतिशत",
"answer": "B",
"explanation_en": "The policy envisages taking the share of tourism in GSDP from ~4 per cent to ~8 per cent by 2025, which is expected to create additional employment of about 10 lakh person-days.",
"explanation_hi": "नीति का उद्देश्य २०२५ तक GSDP में पर्यटन की हिस्सेदारी लगभग ४ प्रतिशत से बढ़ाकर ८ प्रतिशत करना है जिससे करीब १० लाख मानव-दिवस का अतिरिक्त रोज़गार रचना संभावित है।"
},
{
"subject": "Economy",
"topic": "Paryatan ka Arthik Yogdan Rajasthan mein",
"question_en": "Which of the following is the single largest source of tourism-related employment in Rajasthan?",
"question_hi": "राजस्थान में पर्यटन-सम्बन्धी रोज़गार का सबसे बड़ा स्रोत निम्नलिखित में कौन है?",
"A_en": "Hotels & Restaurants", "A_hi": "होटल व रेस्टोरेंट",
"B_en": "Tour operators", "B_hi": "टूर संचालक",
"C_en": "Transport services", "B_hi": "परिवहन सेवाएँ",
"D_en": "Handicraft retail", "D_hi": "हस्तशिल्प खुदरा",
"answer": "A",
"explanation_en": "As per NSS & RBI surveys, hotels and restaurants account for roughly 48 per cent of direct tourism employment in the State, far ahead of other segments.",
"explanation_hi": "NSS एवं RBI सर्वेक्षणों के अनुसार राज्य में सीधे पर्यटन रोज़गार का लगभग ४८ प्रतिशत हिस्सा होटल व रेस्टोरेंट सेक्टर से आता है, जो अन्य खण्डों से कहीं अधिक है।"
},
{
"subject": "Economy",
"topic": "Paryatan ka Arthik Yogdan Rajasthan mein",
"question_en": "The ‘Heritage Arc’ promoted by Rajasthan Tourism connects which three cities to maximise tourist circuit earnings?",
"question_hi": "राजस्थान टूरिज़्म द्वारा प्रवर्द्धित ‘हेरिटेज़ आर्क’ किन तीन शहरों को जोड़ता है ताकि सर्किट आय अधिकतम हो सके?",
"A_en": "Jaipur–Pushkar–Udaipur", "A_hi": "जयपुर–पुष्कर–उदयपुर",
"B_en": "Jaipur–Agra–Delhi", "B_hi": "जयपुर–आगरा–दिल्ली",
"C_en": "Jaipur–Jodhpur–Udaipur", "C_hi": "जयपुर–जोधपुर–उदयपुर",
"D_en": "Jaipur–Bikaner–Jaisalmer", "D_hi": "जयपुर–बीकानेर–जैसलमेर",
"answer": "C",
"explanation_en": "The Heritage Arc is Jaipur-Jodhpur-Udaipur, forming a triangle that covers the maximum number of UNESCO/National heritage sites and generates over 55 per cent of the State’s tourism receipts.",
"explanation_hi": "हेरिटेज़ आर्क जयपुर–जोधपुर–उदयपुर है जो अधिकतम यूनेस्को/राष्ट्रीय धरोहर स्थलों को कवर करता है और राज्य की ५५ प्रतिशत से अधिक पर्यटन प्राप्तियाँ उत्पन्न करता है।"
},
{
"subject": "Economy",
"topic": "Paryatan ka Arthik Yogdan Rajasthan mein",
"question_en": "What is the approximate share of foreign tourist arrivals in Rajasthan’s total tourism (foreign + domestic) for FY 2022-23?",
"question_hi": "वित्त वर्ष २०२२-२३ में राजस्थान के कुल पर्यटन (विदेशी + देशी) में विदेशी पर्यटक आगमन का अनुमानित हिस्सा कितना है?",
"A_en": "1 per cent", "A_hi": "१ प्रतिशत",
"B_en": "3 per cent", "B_hi": "३ प्रतिशत",
"C_en": "6 per cent", "C_hi": "६ प्रतिशत",
"D_en": "10 per cent", "D_hi": "१० प्रतिशत",
"answer": "B",
"explanation_en": "Post-COVID recovery data from Dept. of Tourism show that foreigners formed about 3 per cent of total footfalls, yet they contributed nearly 18 per cent of tourism foreign-exchange earnings.",
"explanation_hi": "कोविड-पश्चात पर्यटन विभाग के आँकड़ों से विदेशियों की संख्या कुल आगमन का लगभग ३ प्रतिशत रही, पर उनकी विदेशी मुद्रा आय में हिस्सेदारी करीब १८ प्रतिशत रही।"
},
{
"subject": "Economy",
"topic": "Paryatan ka Arthik Yogdan Rajasthan mein",
"question_en": "Which activity under rural tourism in Rajasthan has the highest average per-capita spend by visitors, thereby boosting farm incomes?",
"question_hi": "राजस्थान में ग्रामीण पर्यटन के अंतर्गत किस गतिविधि पर आगंतुकों का औसत प्रति-व्यक्ति खर्च अधिकतम है जिससे कृषि आय बढ़ती है?",
"A_en": "Camel safari", "A_hi": "ऊँट सफारी",
"B_en": "Desert camping", "B_hi": "रेगिस्तान कैंपिंग",
"C_en": "Heritage homestays", "C_hi": "हेरिटेज़ होमस्टे",
"D_en": "Village craft workshops", "D_hi": "ग्राम शिल्प कार्यशाला",
"answer": "C",
"explanation_en": "Heritage homestays charge ₹4,000–5,000 per night with meals, far higher than camel safaris or camping, and channel nearly 65 per cent of revenue directly to village households.",
"explanation_hi": "हेरिटेज़ होमस्टे ₹४०००–५००० प्रति रात्रि भोजन सहित वसूलते हैं जो ऊँट सफारी/कैंपिंग से कहीं अधिक है और राजस्व का लगभग ६५ प्रतिशत सीधे ग्रामीण परिवारों को मिलता है।"
},
{
"subject": "Economy",
"topic": "Paryatan ka Arthik Yogdan Rajasthan mein",
"question_en": "Which tax levied by Rajasthan government on hotel room revenue is the biggest contributor to the State’s own tax receipts from tourism?",
"question_hi": "होटल कक्ष राजस्व पर राजस्थान सरकार द्वारा लगाया गया कौन-सा कर पर्यटन से राज्य के स्वयं के कर राजस्व में सबसे बड़ा योगदान देता है?",
"A_en": "IGST", "A_hi": "IGST",
"B_en": "VAT on liquor", "B_hi": "शराब पर VAT",
"C_en": "GST share of Centre", "C_hi": "केन्द्र का GST हिस्सा",
"D_en": "Luxury tax on room rent", "D_hi": "कक्ष किराए पर लक्ज़री टैक्स",
"answer": "D",
"explanation_en": "Although GST replaced many levies, Rajasthan still imposes a 5–10 per cent Luxury Tax on high-value room rents, and it remains the largest state-level tourism-specific tax collection head.",
"explanation_hi": "यद्यपि GST ने कई कर हटा दिए, राजस्थान अब भी उच्च मूल्य के कक्ष किराए पर ५–१० प्रतिशत लक्ज़री टैक्स वसूलता है जो राज्य-स्तरीय पर्यटन-विशिष्ट सबसे बड़ा कर संग्रह शीर्ष है।"
},
{
"subject": "Economy",
"topic": "Paryatan ka Arthik Yogdan Rajasthan mein",
"question_en": "The Rajasthan government’s ‘Home Stay Scheme 2022’ gives an incentive of how much per room for heritage properties converted into budget accommodations?",
"question_hi": "राजस्थान सरकार की ‘होम स्टे योजना २०२२’ धरोहर सम्पत्तियों को बजट आवास में रूपान्तरित करने पर प्रति कक्ष कितनी प्रोत्साहन राशि देती है?",
"A_en": "₹50,000", "A_hi": "₹५०,०००",
"B_en": "₹1 lakh", "B_hi": "₹१ लाख",
"C_en": "₹2 lakh", "C_hi": "₹२ लाख",
"D_en": "₹5 lakh", "D_hi": "₹५ लाख",
"answer": "C",
"explanation_en": "Under the revamped scheme, owners of 50-plus year old havelis get ₹2 lakh per room (max 5 rooms) as 50 per cent subsidy for retrofitting basic amenities, boosting low-cost tourist capacity.",
"explanation_hi": "नई योजना के तहत ५०+ वर्ष पुरानी हवेलियों के मालिकों को ₹२ लाख प्रति कक्ष (अधिकतम ५ कक्ष) आधारभूत सुविधाओं के लिए ५० प्रतिशत सब्सिडी मिलती है जिससे सस्ते पर्यटक क्षमता बढ़े।"
},
{
"subject": "Economy",
"topic": "Paryatan ka Arthik Yogdan Rajasthan mein",
"question_en": "Which one of the following is NOT identified as a thrust area in Rajasthan Tourism Policy 2020 to double the sector’s economic contribution?",
"question_hi": "राजस्थान टूरिज़्म पॉलिसी २०२० में क्षेत्र के आर्थिक योगदान को दोगुना करने के लिए निम्नलिखित में से किसे प्रमुख बल क्षेत्र के रूप में चिह्नित नहीं किया गया है?",
"A_en": "Medical & Wellness tourism", "A_hi": "मेडिकल एवं वेलनेस पर्यटन",
"B_en": "MICE (Meetings, Incentives, Conferences, Exhibitions)", "A_hi": "MICE (बैठकें, प्रोत्साहन, सम्मेलन, प्रदर्शनियाँ)",
"C_en": "Petro-chemical tourism", "C_hi": "पेट्रो-रासायनिक पर्यटन",
"D_en": "Adventure & Eco-tourism", "D_hi": "एडवेंचर एवं इको-पर्यटन",
"answer": "C",
"explanation_en": "Medical, MICE, Adventure/Eco are explicitly listed; Petro-chemical tourism is not a recognised segment in the policy document.",
"explanation_hi": "नीति दस्तावेज़ में मेडिकल, MICE, एडवेंचर/इको स्पष्ट रूप में दर्ज हैं; पेट्रो-रासायनिक पर्यटन कोई मान्यत प्राप्त क्षेत्र नहीं है।"
},
{
"subject": "Economy",
"topic": "Paryatan ka Arthik Yogdan Rajasthan mein",
"question_en": "During 2021-22, the tourism sector’s share in Rajasthan’s total employment (direct + indirect) was roughly:",
"question_hi": "वर्ष २०२१-२२ के दौरान पर्यटन क्षेत्र का राजस्थान के कुल रोज़गार (सीधा + परोक्ष) में अनुमानित हिस्सा था:",
"A_en": "5 per cent", "A_hi": "५ प्रतिशत",
"B_en": "8 per cent", "B_hi": "८ प्रतिशत",
"C_en": "11 per cent", "C_hi": "११ प्रतिशत",
"D_en": "15 per cent", "D_hi": "१५ प्रतिशत",
"answer": "C",
"explanation_en": "As per the Tourism Satellite Account released by the Department of Economics & Statistics, tourism accounted for about 10.8 per cent of the State’s total employment, making it the third-largest employer after agriculture and textiles.",
"explanation_hi": "अर्थ एवं सांख्यिकी विभाग के टूरिज़्म सैटेलाइट खाते के अनुसार पर्यटन राज्य के कुल रोज़गार का लगभग १०.८ प्रतिशत था, जिससे यह कृषि व टेक्सटाइल के बाद तीसरा सबसे बड़ा रोज़गार देने वाला क्षेत्र बन गया।"
}
]