[
{
"subject": "Economy",
"topic": "Paryatan ka Arthik Yogdan Rajasthan mein",
"question_en": "In which year did Rajasthan Tourism Development Corporation (RTDC) start its operations?",
"question_hi": "राजस्थान टुर्यों देशभर में प्रचार और सम्पदन",
"A_en": "1983",
"A_hi": "१९८३",
"B_en": "1984",
"B_hi": "१९८४",
"C_en": "1985",
"C_hi": "१९८५",
"D_en": "1986",
"D_hi": "१९८६",
"answer": "B",
"explanation_en": "Rajasthan Tourism Development Corporation (RTDC) started its operations in the year 1984.",
"explanation_hi": "राजस्थान टुर्यों देशभर में सम्पदन और प्रचार"
},
{
"subject": "Economy",
"topic": "Paryatan ka Arthik Yogdan Rajasthan mein",
"question_en": "What was the total investment in the tourism sector of Rajasthan in 2020?",
"question_hi": "राजस्थान के टुर्यों में एक सम्पदन और प्रचार",
"A_en": "₹15,000 Crore",
"A_hi": "क्रोर 15,000",
"B_en": "₹13,000 Crore",
"B_hi": "क्रोर 13,000",
"C_en": "₹12,000 Crore",
"C_hi": "क्रोर 12,000",
"D_en": "₹14,000 Crore",
"D_hi": "क्रोर 14,000",
"answer": "B",
"explanation_en": "In 2020, the total investment in the tourism sector of Rajasthan was approximately ₹13,000 Crore (US$1.8 billion). The figure was based on the data provided by the Rajasthan Tourism Development Corporation (RTDC).",
"explanation_hi": "राजस्थान टूर्यूएस बिलन की जमीना को हेंतोर कॉर्स्टोर 1.8 बिलन लिखना",
"explanation": "राजस्थान टूर्यूएस बिलन कॉर्स्टोर 1.8 बिलन लिखना",
"question_en": "How much was the investment in tourism sector of Rajasthan in crores of USD in 2020?",
"question_hi": "राजस्थान टूर्यूएस बिलन कॉर्स्टोर 1.8 बिलन लिखना",
"answer": "1.8",
"explanation_en": "The investment in the tourism sector of Rajasthan in millions of USD in 2020 was approximately $1.8 billion.",
"explanation_hi": "राजस्थान टूर्यूएस बिलन कॉर्स्टोर 1.8 बिलन लिखना",
"question_en": "What was the growth rate of tourism sector in Rajasthan in percentage between 2015-2020?",
"question_hi": "राजस्थान टूर्यूएस बिलन कॉर्स्टोर क्यांचर्स्टोर पौर्यांचर्स्टोर क्यांचर्स्टोर पौर्यांचर्स्टोर क्यांचर्स्टोर पौर्यांचर्स्टोर क्यांचर्स्टोर पौर्यांचर्स्टोर क्यांचर्स्टोर पौर्यांचर्स्टोर क्यांचर्स्टोर पौर क्यांचर्स्टोर क्यांचर्सर पौर क्यांचर क्यांचर पौर क्यांचर क्यांचर पौर क्यांचर क्यांचर पौर क्यांचर क्यांचर क्यांचर पौर क्यांचर क्यांचर क्यांचर पौर क्यांचर क्यांचर क्यांचर पौर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्यांचर क्य