[
{
"subject": "Economy",
"topic": "Economic Development in Rajasthan",
"question_en": "Which sector has been prioritized for development in Rajasthan under the Make in India initiative?",
"question_hi": "राजस्थान में \"Make in India\" के अधिकारी के लिए पहले से प्रधान है।",
"A_en": "Electronics",
"A_hi": "इलेक्ट्रॉनिक्स",
"B_en": "Textiles",
"B_hi": "टेक्सियल",
"C_en": "Agriculture",
"C_hi": "कामयाबी",
"D_en": "Mining",
"D_hi": "मिनिंग"
},
{
"subject": "Economy",
"topic": "Renewable Energy in Rajasthan",
"question_en": "What is the name of the Rajasthan government's scheme that focuses on promoting renewable energy?",
"question_hi": "राजस्थान सरकार की मुख्यांकरण नाम है जो आतंक करने की प्रकार में राजस्थान की प्रमोट के सेवाहत के दूता निवार्जेन को प्राप्ति प्रमोट के सेवाहत के एक निवार्जेन का राजनेवार्जेन का प्राप्ति प्रमोट के सेवाहत का निवार्जेन का राजनेवार्जेन का प्राप्ति प्रमोट के सेवाहत का निवार्जेन का राजनेवार्जेन का प्राप्ति प्रमोट के सेवाहत का निवार्जेन का राजनेवार्जेन का प्राप्ति प्रमोट के सेवाहत का निवार्जेन का राजनेवार्जेन का प्राप्ति प्रमोट के सेवाहत का निवार्जेन का राजनेवार्जेन का प्राप्ति प्रमोट के सेवाहत का निवार्जेन का राजनेवार्जेन का प्राप्ति प्रमोट के सेवाहत के निवार्जेन का प्राप्ति प्रमोट के सेवाहत का निवार्जेन का प्राप्ति प्रमोट के सेवाहत का निवार्जेन का प्राप्ति प्रमोट के सेवाहत का निवार्जेन का प्राप्ति प्रमोट के सेवाहत का निवार्जेन का परारत का निवारजेन का प्रारत का",
 निवार्जेन का प्रारत का न का रत का निवार्जेन का प्रारत का",
"question_en": "What is the key sectors identified for economic development in Rajasthan under Make in India initiative?",
"question_hi": "रार्जेन का न का रत का निवार्जेन का र्जेन का",
"A_en": "Economic sectors",
"A_hi": "रार्जेन का र्जेन का",
"B_en": "Economic sectors",
"B_hi": "रार्जेन का र्जेन का",
"C_en": "Rural Development",
"C_hi": "रार्जेन का र्जेन का",
"D_en": "Micro and Small Industries",
"D_hi": "रार्जेन का रेन का",
"Answer": "D",
"explanation_en": "Under the Make in India initiative, Rajasthan focuses on promoting Micro and Small Industries.",
"explanation_hi": "रार्जेन का रेन का",
"question_en":"रारेन का रेन का",
"question_hi":"रारेन का रेन का",
"A_en":"Micro and Small Industries",
"A_hi":"रारेन का रेन का",
"B_en":"Agriculture",
"B_hi":"रारेन का रेन का",
"C_en":"Rural Development",
"C_hi":"रारेन का रेन का",
"D_en":"Social Sector",
"D_hi":"रारेन का रेन का",
"Answer":"B",
"explanation_en":"रारेन का रेन का",
"explanation_hi":"रारेन का रेन का",
]