[
{
"subject": "Economy",
"topic": "Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs",
"question_en": "Pradhan Mantri Kaushal Vikas Yojana (PMKVY) ke liye Rajasthan mein kai yojnaayein chal rahi hain, lekin kya yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi mahatvapoorn hai?",
"question_hi": "प्रधान मंत्री कौशल विकास योजना (पीएमकेवाय) के लिए राजस्थान में कई योजनाएं चल रही हैं, लेकिन यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी महत्वपूर्ण है?",
"A_en": "Ha", "A_hi": "हाँ",
"B_en": "Nahin", "B_hi": "नहीं",
"C_en": "Iska uttar nahi jaankaari mein hai", "C_hi": "इसका उत्तर जानकारी में नहीं है",
"D_en": "Iska uttar yehaamkam hai", "D_hi": "इसका उत्तर यहांकम है",
"answer": "A",
"explanation_en": "Pradhan Mantri Kaushal Vikas Yojana (PMKVY) Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi mahatvapoorn hai, kyunki yeh yojnaa yuvaon ko kushalta ka prashikshan pradaan karta hai.",
"explanation_hi": "प्रधान मंत्री कौशल विकास योजना (पीएमकेवाय) राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी महत्वपूर्ण है, क्योंकि यह योजना युवाओं को कुशलता का प्रशिक्षण प्रदान करती है।"
},
{
"subject": "Economy",
"topic": "Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs",
"question_en": "Rajasthan Uchch Shiksha Abhiyan (RUSA) Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se kaisa sammanit hai?",
"question_hi": "राजस्थान उच्च शिक्षा अभियान (आरयूसीए) राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से कैसा सामनीत है?",
"A_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi sammanit hai", "A_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी सम्मानित है",
"B_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi hinaamit hai", "B_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी हीनमित है",
"C_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi samanvit hai", "C_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी समान्वित है",
"D_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi anupastit hai", "D_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी अनुपस्थित है",
"answer": "A",
"explanation_en": "Rajasthan Uchch Shiksha Abhiyan (RUSA) Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi sammanit hai, kyunki yeh yojnaa Rajasthan ki vyavsayik shiksha ko sudhaarne ke liye pradarshit hai.",
"explanation_hi": "राजस्थान उच्च शिक्षा अभियान (आरयूसीए) राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी सम्मानित है, क्योंकि यह योजना राजस्थान की व्यावसायिक शिक्षा को सुधारने के लिए प्रदर्शित है।"
},
{
"subject": "Economy",
"topic": "Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs",
"question_en": "Rajasthan Government ki Pradhan Mantri Jan-Dhan Yojana (PMJDY) ki aayogatmaktaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se kaisi hai?",
"question_hi": "राजस्थान सरकार की प्रधान मंत्री जन-धन योजना (पीएमजेडीवाई) की औद्योगिकता राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से कैसी है?",
"A_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi sammanit hai", "A_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी सम्मानित है",
"B_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi hinaamit hai", "B_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी हीनमित है",
"C_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi samanvit hai", "C_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी समान्वित है",
"D_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi anupastit hai", "D_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी अनुपस्थित है",
"answer": "A",
"explanation_en": "Pradhan Mantri Jan-Dhan Yojana (PMJDY) Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi sammanit hai, kyunki yeh yojnaa Rajasthan ke garib logon ko bank khate kholne aur unhein finacial sevaen pradaan karne ke liye pradarshit hai.",
"explanation_hi": "प्रधान मंत्री जन-धन योजना (पीएमजेडीवाई) राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी सम्मानित है, क्योंकि यह योजना राजस्थान के गरीब लोगों को बैंक खाता खोलने और उन्हें वित्तीय सेवाएं प्रदान करने के लिए प्रदर्शित है।"
},
{
"subject": "Economy",
"topic": "Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs",
"question_en": "Rajasthan ki Pradhan Mantri Awas Yojana (PMAY) Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se kaisi hai?",
"question_hi": "राजस्थान की प्रधान मंत्री आवास योजना (पीएमएवाई) राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से कैसी है?",
"A_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi sammanit hai", "A_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी सम्मानित है",
"B_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi hinaamit hai", "B_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी हीनमित है",
"C_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi samanvit hai", "C_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी समान्वित है",
"D_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi anupastit hai", "D_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी अनुपस्थित है",
"answer": "A",
"explanation_en": "Pradhan Mantri Awas Yojana (PMAY) Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi sammanit hai, kyunki yeh yojnaa Rajasthan ke mahilaon aur anath logon ko ghar pradaan karne ke liye pradarshit hai.",
"explanation_hi": "प्रधान मंत्री आवास योजना (पीएमएवाई) राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी सम्मानित है, क्योंकि यह योजना राजस्थान की महिलाओं और अनाथ लोगों को घर प्रदान करने के लिए प्रदर्शित है।"
},
{
"subject": "Economy",
"topic": "Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs",
"question_en": "Rajasthan ki Pradhan Mantri Krishi Sinchayee Yojana (PMKSY) Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se kaisi hai?",
"question_hi": "राजस्थान की प्रधान मंत्री कृषि सिंचाई योजना (पीएमकेएसवाई) राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से कैसी है?",
"A_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi sammanit hai", "A_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी सम्मानित है",
"B_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi hinaamit hai", "B_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी हीनमित है",
"C_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi samanvit hai", "C_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी समान्वित है",
"D_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi anupastit hai", "D_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी अनुपस्थित है",
"answer": "A",
"explanation_en": "Pradhan Mantri Krishi Sinchayee Yojana (PMKSY) Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi sammanit hai, kyunki yeh yojnaa Rajasthan ki kheti aur pashupalna ki swaasthya ko sudhaarne ke liye pradarshit hai.",
"explanation_hi": "प्रधान मंत्री कृषि सिंचाई योजना (पीएमकेएसवाई) राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी सम्मानित है, क्योंकि यह योजना राजस्थान की खेती और पशुपालन की स्वास्थ्य को सुधारने के लिए प्रदर्शित है।"
},
{
"subject": "Economy",
"topic": "Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs",
"question_en": "Rajasthan ki Pradhan Mantri Swasthya Suraksha Yojana (PMSSY) Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se kaisi hai?",
"question_hi": "राजस्थान की प्रधान मंत्री स्वास्थ्य सुरक्षा योजना (पीएमएसएसवाई) राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से कैसी है?",
"A_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi sammanit hai", "A_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी सम्मानित है",
"B_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi hinaamit hai", "B_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी हीनमित है",
"C_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs ke hisaab se bhi samanvit hai", "C_hi": "यह योजना राजस्थान की प्रमुख कार्यकर्ता योजनाओं और फ्लैगशिप प्रोग्राम्स के हिसाब से भी समान्वित है",
"D_en": "Yeh yojnaa Rajasthan ki Pramukh Kalyankari Yojnayein