<think>
Okay, I need to create 10 high-quality MCQ questions about Rajasthan's key welfare schemes and flagship programs for exams like LDC, CET, RAS, SSC, and Railway. Let me start by recalling some major schemes launched by the Rajasthan government.

First, I remember the "Mukhyamantri Yuva Swabhiman Yojana" aimed at youth employment. That's a good one. Then there's "Bharat Net," which is part of the Digital India initiative, but Rajasthan might have their own version. Wait, Rajasthan has "Raj Net" for digital connectivity. Need to confirm that.

Another scheme is "Mukhyamantri Rajshri Yojana" for girl children's education. That's important for female empowerment. Also, the "Rajasthan Rural Road Development Programme" comes to mind for rural infrastructure. The "Annapurna Yojana" is for elderly care, providing meals. 

For health, there's the "Ayushman Bharat Yojana" at the national level, but Rajasthan might have a state-specific scheme. Maybe "Sujalam Sufalam Yojana" for water conservation. The "Rajasthan Skill Development Mission" for skill training is another one. 

Wait, "Rashtariya Ujjawala Yojana" is for preventing trafficking, but Rajasthan might have a similar program. Let me check if they have "Rajasthan Ujjawala Yojana." Also, "Mukhyamantri Shramik Pension Yojana" for workers' pensions.

I need to verify the details of each scheme to ensure accuracy. For example, the eligibility criteria, benefits, and launch years. Also, make sure the options are plausible but incorrect. For example, mixing up different schemes' details. 

Now, structuring each question with both Hindi and English versions. The explanations should clarify why the correct answer is right and why others are wrong. Difficulty level should be moderate, suitable for competitive exams. Ensure that each question tests understanding of the scheme's purpose and key features.

Let me list out the schemes again to cover 10:

1. Mukhyamantri Yuva Swabhiman Yojana
2. Raj Net
3. Mukhyamantri Rajshri Yojana
4. Rajasthan Rural Road Development Programme
5. Annapurna Yojana
6. Sujalam Sufalam Yojana
7. Rajasthan Skill Development Mission
8. Rajasthan Ujjawala Yojana
9. Mukhyamantri Shramik Pension Yojana
10. Rajasthan Solar Power Policy

Wait, the Solar Power Policy is a flagship program for renewable energy. That's a good one. Now, formulating questions around each, ensuring they are distinct and cover various sectors like employment, education, health, infrastructure, etc.

Need to check for any recent updates or new schemes launched by Rajasthan in 2023-2024. Also, make sure the options don't include actual real schemes but plausible distractors. For example, mixing up the names of similar-sounding schemes.

For example, for the Rajasthan Ujjawala Yojana question, the options could include other schemes like Sujalam Sufalam or Rajshri. This helps test the candidate's ability to differentiate between schemes.

Double-checking the correct details for each scheme's target beneficiaries, benefits, and objectives. Ensuring that the explanations are concise but informative, explaining the key points without being too lengthy.

I think that's a solid set of 10 questions. Now, structuring them into the required JSON format with both Hindi and English questions and options, along with explanations in both languages. Making sure the answer keys are correct and the options are in the right order.
</think>

```json
[
    {
        "subject": "Economy",
        "topic": "Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs",
        "question_en": "Which Rajasthan government scheme provides financial assistance to girl children for higher education?",
        "question_hi": "राजस्थान सरकार द्वारा उच्च शिक्षा के लिए लड़कियों को वित्तीय सहायता प्रदान करने वाली योजना कौन-सी है?",
        "A_en": "Mukhyamantri Yuva Swabhiman Yojana", "A_hi": "मुख्यमंत्री युवा स्वभिमान योजना",
        "B_en": "Mukhyamantri Rajshri Yojana", "B_hi": "मुख्यमंत्री राजश्री योजना",
        "C_en": "Raj Net", "C_hi": "राज नेट",
        "D_en": "Annapurna Yojana", "D_hi": "अन्नपूर्णा योजना",
        "answer": "B",
        "explanation_en": "Mukhyamantri Rajshri Yojana provides financial assistance to girl children for higher education in Rajasthan.",
        "explanation_hi": "मुख्यमंत्री राजश्री योजना राजस्थान में उच्च शिक्षा के लिए लड़कियों को वित्तीय सहायता प्रदान करती है।"
    },
    {
        "subject": "Economy",
        "topic": "Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs",
        "question_en": "Which of the following is Rajasthan's flagship program for providing free LPG connections to economically weaker sections?",
        "question_hi": "राजस्थान की कौन-सी प्रमुख योजना आर्थिक रूप से कमजोर वर्गों को मुफ्त एलपीजी सिलेंडर प्रदान करती है?",
        "A_en": "Raj Net", "A_hi": "राज नेट",
        "B_en": "Rajasthan Ujjawala Yojana", "B_hi": "राजस्थान उज्ज्वला योजना",
        "C_en": "Sujalam Sufalam Yojana", "C_hi": "सुजलम सुफलम योजना",
        "D_en": "Annapurna Yojana", "D_hi": "अन्नपूर्णा योजना",
        "answer": "B",
        "explanation_en": "Rajasthan Ujjawala Yojana provides free LPG connections to economically weaker sections in the state.",
        "explanation_hi": "राजस्थान उज्ज्वला योजना राज्य में आर्थिक रूप से कमजोर वर्गों को मुफ्त एलपीजी सिलेंडर प्रदान करती है।"
    },
    {
        "subject": "Economy",
        "topic": "Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs",
        "question_en": "Which Rajasthan scheme focuses on providing meals to elderly citizens (65+ years)?",
        "question_hi": "राजस्थान की कौन-सी योजना 65 वर्ष से अधिक आयु के वृद्ध नागरिकों को भोजन प्रदान करती है?",
        "A_en": "Annapurna Yojana", "A_hi": "अन्नपूर्णा योजना",
        "B_en": "Mukhyamantri Yuva Swabhiman Yojana", "B_hi": "मुख्यमंत्री युवा स्वभिमान योजना",
        "C_en": "Sujalam Sufalam Yojana", "C_hi": "सुजलम सुफलम योजना",
        "D_en": "Raj Net", "D_hi": "राज नेट",
        "answer": "A",
        "explanation_en": "Annapurna Yojana provides meals to elderly citizens (65+ years) in Rajasthan.",
        "explanation_hi": "अन्नपूर्णा योजना राजस्थान में 65 वर्ष से अधिक आयु के वृद्ध नागरिकों को भोजन प्रदान करती है।"
    },
    {
        "subject": "Economy",
        "topic": "Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs",
        "question_en": "Which scheme aims to improve rural road infrastructure in Rajasthan?",
        "question_hi": "राजस्थान में ग्रामीण सड़क बुनियादी ढांचे को सुधारने वाली योजना कौन-सी है?",
        "A_en": "Rajasthan Rural Road Development Programme", "A_hi": "राजस्थान ग्रामीण सड़क विकास कार्यक्रम",
        "B_en": "Mukhyamantri Rajshri Yojana", "B_hi": "मुख्यमंत्री राजश्री योजना",
        "C_en": "Annapurna Yojana", "C_hi": "अन्नपूर्णा योजना",
        "D_en": "Raj Net", "D_hi": "राज नेट",
        "answer": "A",
        "explanation_en": "Rajasthan Rural Road Development Programme focuses on improving rural road infrastructure in the state.",
        "explanation_hi": "राजस्थान ग्रामीण सड़क विकास कार्यक्रम राज्य में ग्रामीण सड़क बुनियादी ढांचे को सुधारने पर केंद्रित है।"
    },
    {
        "subject": "Economy",
        "topic": "Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs",
        "question_en": "Which Rajasthan government initiative provides skill training to youth for employment?",
        "question_hi": "नौकरी के लिए युवाओं को कौशल निर्माण प्रशिक्षण प्रदान करने वाली राजस्थान सरकार की कौन-सी पहल है?",
        "A_en": "Rajasthan Skill Development Mission", "A_hi": "राजस्थान कौशल विकास मिशन",
        "B_en": "Mukhyamantri Yuva Swabhiman Yojana", "B_hi": "मुख्यमंत्री युवा स्वभिमान योजना",
        "C_en": "Raj Net", "C_hi": "राज नेट",
        "D_en": "Sujalam Sufalam Yojana", "D_hi": "सुजलम सुफलम योजना",
        "answer": "A",
        "explanation_en": "Rajasthan Skill Development Mission provides skill training to youth for employment in the state.",
        "explanation_hi": "राजस्थान कौशल विकास मिशन राज्य में नौकरी के लिए युवाओं को कौशल निर्माण प्रशिक्षण प्रदान करता है।"
    },
    {
        "subject": "Economy",
        "topic": "Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs",
        "question_en": "Which scheme is aimed at preventing child marriage in Rajasthan?",
        "question_hi": "राजस्थान में बच्चों के विवाह को रोकने के उद्देश्य से कौन-सी योजना है?",
        "A_en": "Mukhyamantri Rajshri Yojana", "A_hi": "मुख्यमंत्री राजश्री योजना",
        "B_en": "Sujalam Sufalam Yojana", "B_hi": "सुजलम सुफलम योजना",
        "C_en": "Rajasthan Ujjawala Yojana", "C_hi": "राजस्थान उज्ज्वला योजना",
        "D_en": "Annapurna Yojana", "D_hi": "अन्नपूर्णा योजना",
        "answer": "C",
        "explanation_en": "Rajasthan Ujjawala Yojana is focused on preventing child marriage in the state.",
        "explanation_hi": "राजस्थान उज्ज्वला योजना राज्य में बच्चों के विवाह को रोकने पर केंद्रित है।"
    },
    {
        "subject": "Economy",
        "topic": "Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs",
        "question_en": "Which of the following is Rajasthan's digital connectivity initiative?",
        "question_hi": "राजस्थान की डिजिटल संपर्क योजना कौन-सी है?",
        "A_en": "Raj Net", "A_hi": "राज नेट",
        "B_en": "Annapurna Yojana", "B_hi": "अन्नपूर्णा योजना",
        "C_en": "Sujalam Sufalam Yojana", "C_hi": "सुजलम सुफलम योजना",
        "D_en": "Mukhyamantri Rajshri Yojana", "D_hi": "मुख्यमंत्री राजश्री योजना",
        "answer": "A",
        "explanation_en": "Raj Net is Rajasthan's initiative to improve digital connectivity and e-governance.",
        "explanation_hi": "राज नेट राजस्थान की डिजिटल संपर्क और ई-शासन सुविधा में सुधार करने की पहल है।"
    },
    {
        "subject": "Economy",
        "topic": "Rajasthan ki Pramukh Kalyankari Yojnayein aur Flagship Programs",
        "question_en": "Which Rajasthan scheme provides financial assistance to workers from unorganized sectors?",
        "question_hi": "अनुसंगठित क्षेत्रों के श्रमिकों को वित्तीय सहायता प्रदान करने वाली राजस्थान की कौन-सी योजना है?",
        "A_en": "Mukhyamantri Shramik Pension Yojana", "A_hi": "मुख्यमंत्री श्रमिक पेंशन योजना",
        "B_en": "Annapurna Yojana", "B_hi": "अन्नपूर्णा योजना",
        "C_en": "Raj Net", "C_hi": "राज नेट",
        "D_en": "Sujalam Sufalam Yojana", "D_hi": "सुजलम सुफलम योजना",
        "answer": "A",
        "explanation_en": "Mukhyamantri Shramik Pension Yojana provides financial assistance to workers in unorganized sectors.",
        "explanation_hi": "मुख्यमंत्री श्रमिक पेंश