[
{
"subject": "Economy",
"topic": "Rajasthan ki Arthvyavastha: Krishi, Udyog aur Seva Kshetra",
"question_en": "Kya Rajasthan ki arthvyavastha mein krishi ka yogdan mahatvapurn hai?",
"question_hi": "राजस्थान की अर्थव्यवस्था में कृषि का योगदान महत्वपूर्ण है?",
"A_en": "Haan, krishi Rajasthan ki arthvyavastha ki prasiddh aadharshila hai.",
"A_hi": "हाँ, कृषि राजस्थान की अर्थव्यवस्था की प्रसिद्ध आधारशिला है।",
"B_en": "Nahin, Udyog aur Seva Kshetra Rajasthan ki arthvyavastha ko badhava dene wale hain.",
"B_hi": "नहीं, उद्योग और सेवा क्षेत्र राजस्थान की अर्थव्यवस्था को बढ़ावा देने वाले हैं।",
"C_en": "Kuchh nahin, Rajasthan ki arthvyavastha mein udyog aur seva kshetra hamesha kriya mein hain.",
"C_hi": "कुछ नहीं, राजस्थान की अर्थव्यवस्था में उद्योग और सेवा क्षेत्र हमेशा क्रिया में हैं।",
"D_en": "Nahin, Rajasthan ki arthvyastha mein krishi ki bhoomika bahut kam hai.",
"D_hi": "नहीं, राजस्थान की अर्थव्यवस्था में कृषि की भूमिका बहुत कम है।",
"answer": "A",
"explanation_en": "Krishi Rajasthan ki arthvyavastha ka ek mahatvapurn ang hai, jisekriya mein bhi dikhaya gaya hai.",
"explanation_hi": "कृषि राजस्थान की अर्थव्यवस्था का एक महत्वपूर्ण अंग है, जिसे क्रिया में भी दिखाया गया है।"
},
{
"subject": "Economy",
"topic": "Rajasthan ki Arthvyavastha: Krishi, Udyog aur Seva Kshetra",
"question_en": "Kya Rajasthan mein udyogik krishi ko badhava milta hai?",
"question_hi": "राजस्थान में उद्योगिक कृषि को बढ़ावा मिलता है?",
"A_en": "Haan, Rajasthan mein udyogik krishi ko badhava diya jaata hai.",
"A_hi": "हाँ, राजस्थान में उद्योगिक कृषि को बढ़ावा दिया जाता है।",
"B_en": "Nahin, Rajasthan mein udyogik krishi ki bhoomika kam hai.",
"B_hi": "नहीं, राजस्थान में उद्योगिक कृषि की भूमिका कम है।",
"C_en": "Kuchh nahin, Rajasthan mein udyogik krishi ki koi bhoomika nahin hai.",
"C_hi": "कुछ नहीं, राजस्थान में उद्योगिक कृषि की कोई भूमिका नहीं है।",
"D_en": "Nahin, Rajasthan mein udyogik krishi ki bhoomika bahut mahatvapurn hai.",
"D_hi": "नहीं, राजस्थान में उद्योगिक कृषि की भूमिका बहुत महत्वपूर्ण है।",
"answer": "A",
"explanation_en": "Rajasthan mein udyogik krishi ko badhava diya jaata hai, iska uddeshya kisanon ko behtar faayda pradaan karna hai.",
"explanation_hi": "राजस्थान में उद्योगिक कृषि को बढ़ावा दिया जाता है, इसका उद्देश्य किसानों को बेहतर फायदा प्रदान करना है।"
},
{
"subject": "Economy",
"topic": "Rajasthan ki Arthvyavastha: Krishi, Udyog aur Seva Kshetra",
"question_en": "Kya Rajasthan ki seva kshetra mein IT aur software ki bhoomika mahatvapurn hai?",
"question_hi": "राजस्थान के सेवा क्षेत्र में IT और सॉफ्टवेयर की भूमिका महत्वपूर्ण है?",
"A_en": "Haan, Rajasthan ki seva kshetra mein IT aur software ki bhoomika mahatvapurn hai.",
"A_hi": "हाँ, राजस्थान के सेवा क्षेत्र में IT और सॉफ्टवेयर की भूमिका महत्वपूर्ण है।",
"B_en": "Nahin, Udyog aur krishi Rajasthan ki seva kshetra ko badhava dene wale hain.",
"B_hi": "नहीं, उद्योग और कृषि राजस्थान के सेवा क्षेत्र को बढ़ावा देने वाले हैं।",
"C_en": "Kuchh nahin, Rajasthan ki seva kshetra mein IT aur software ki koi bhoomika nahin hai.",
"C_hi": "कुछ नहीं, राजस्थान के सेवा क्षेत्र में IT और सॉफ्टवेयर की कोई भूमिका नहीं है।",
"D_en": "Nahin, Rajasthan ki seva kshetra mein IT aur software ki bhoomika kam hai.",
"D_hi": "नहीं, राजस्थान के सेवा क्षेत्र में IT और सॉफ्टवेयर की भूमिका कम है।",
"answer": "A",
"explanation_en": "Rajasthan ki seva kshetra mein IT aur software ki bhoomika mahatvapurn hai, iska uddeshya IT aayojanon ko badhava dene ka hai.",
"explanation_hi": "राजस्थान के सेवा क्षेत्र में IT और सॉफ्टवेयर की भूमिका महत्वपूर्ण है, इसका उद्देश्य IT आयोजनों को बढ़ावा देने का है।"
},
{
"subject": "Economy",
"topic": "Rajasthan ki Arthvyavastha: Krishi, Udyog aur Seva Kshetra",
"question_en": "Kya Rajasthan ki arthvyavastha mein tourism ka yogdan mahatvapurn hai?",
"question_hi": "राजस्थान की अर्थव्यवस्था में पर्यटन का योगदान महत्वपूर्ण है?",
"A_en": "Haan, Rajasthan ki arthvyavastha mein tourism ka yogdan mahatvapurn hai.",
"A_hi": "हाँ, राजस्थान की अर्थव्यवस्था में पर्यटन का योगदान महत्वपूर्ण है।",
"B_en": "Nahin, Udyog aur krishi Rajasthan ki arthvyavastha ko badhava dene wale hain.",
"B_hi": "नहीं, उद्योग और कृषि राजस्थान की अर्थव्यवस्था को बढ़ावा देने वाले हैं।",
"C_en": "Kuchh nahin, Rajasthan ki arthvyavastha mein tourism ki koi bhoomika nahin hai.",
"C_hi": "कुछ नहीं, राजस्थान की अर्थव्यवस्था में पर्यटन की कोई भूमिका नहीं है।",
"D_en": "Nahin, Rajasthan ki arthvyastha mein tourism ka yogdan kam hai.",
"D_hi": "नहीं, राजस्थान की अर्थव्यवस्था में पर्यटन का योगदान कम है।",
"answer": "A",
"explanation_en": "Rajasthan ki arthvyavastha mein tourism ka yogdan mahatvapurn hai, iska uddeshya Rajasthani sanskriti aur bhandaron ka vikas karna hai.",
"explanation_hi": "राजस्थान की अर्थव्यवस्था में पर्यटन का योगदान महत्वपूर्ण है, इसका उद्देश्य राजस्थानी संस्कृति और बाजारों का विकास करना है।"
},
{
"subject": "Economy",
"topic": "Rajasthan ki Arthvyavastha: Krishi, Udyog aur Seva Kshetra",
"question_en": "Kya Rajasthan mein MSME ki bhoomika mahatvapurn hai?",
"question_hi": "राजस्थान में MSME की भूमिका महत्वपूर्ण है?",
"A_en": "Haan, Rajasthan mein MSME ki bhoomika mahatvapurn hai.",
"A_hi": "हाँ, राजस्थान में MSME की भूमिका महत्वपूर्ण है।",
"B_en": "Nahin, Udyog aur krishi Rajasthan mein MSME ko badhava dene wale hain.",
"B_hi": "नहीं, उद्योग और कृषि राजस्थान में MSME को बढ़ावा देने वाले हैं।",
"C_en": "Kuchh nahin, Rajasthan mein MSME ki koi bhoomika nahin hai.",
"C_hi": "कुछ नहीं, राजस्थान में MSME की कोई भूमिका नहीं है।",
"D_en": "Nahin, Rajasthan mein MSME ki bhoomika kam hai.",
"D_hi": "नहीं, राजस्थान में MSME की भूमिका कम है।",
"answer": "A",
"explanation_en": "Rajasthan mein MSME ki bhoomika mahatvapurn hai, iska uddeshya chhoti utpadon aur sevaon ko badhava dene ka hai.",
"explanation_hi": "राजस्थान में MSME की भूमिका महत्वपूर्ण है, इसका उद्देश्य छोटी उत्पादों और सेवाओं को बढ़ावा देने का है।"
},
{
"subject": "Economy",
"topic": "Rajasthan ki Arthvyavastha: Krishi, Udyog aur Seva Kshetra",
"question_en": "Kya Rajasthan ki arthvyavastha mein swachchhta ki bhoomika mahatvapurn hai?",
"question_hi": "राजस्थान की अर्थव्यवस्था में स्वच्छता की भूमिका महत्वपूर्ण है?",
"A_en": "Haan, Rajasthan ki arthvyavastha mein swachchhta ki bhoomika mahatvapurn hai.",
"A_hi": "हाँ, राजस्थान की अर्थव्यवस्था में स्वच्छता की भूमिका महत्वपूर्ण है।",
"B_en": "Nahin, Udyog aur krishi Rajasthan ki arthvyastha ko badhava dene wale hain.",
"B_hi": "नहीं, उद्योग और कृषि राजस्थान की अर्थव्यवस्था को बढ़ावा देने वाले हैं।",
"C_en": "Kuchh nahin, Rajasthan ki arthvyastha mein swachchhta ki koi bhoomika nahin hai.",
"C_hi": "कुछ नहीं, राजस्थान की अर्थव्यवस्था में स्वच्छता की कोई भूमिका नहीं है।",
"D_en": "Nahin, Rajasthan ki arthvyastha mein swachchhta ki bhoomika kam hai.",
"D_hi": "नहीं, राजस्थान की अर्थव्यवस्था में स्वच्छता की भूमिका कम है।",
"answer": "A",
"explanation_en": "Rajasthan ki arthvyavastha mein swachchhta ki bhoomika mahatvapurn hai, iska uddeshya arthvyavastha ko badhava dene aur swachchh vikaas ko prashikshit karna hai.",
"explanation_hi": "राजस्थान की अर्थव्यवस्था में स्वच्छता की भूमिका महत्वपूर्ण है, इसका उद्देश्य अर्थव्यवस्था को बढ़ावा देने और स्वच्छ विकास को प्रशिक्षित करना है।"
},
{
"subject": "Economy",
"topic": "Rajasthan ki Arthvyavastha: Krishi, Udyog aur Seva Kshetra",
"question_en": "Kya Rajasthan ki arthvyavastha mein shiksha aur prashikshan ki bhoomika mahatvapurn hai?",
"question_hi": "राजस्थान की अर्थव्यवस्था में शिक्षा और प्रशिक्षण की भूमिका महत्वपूर्ण है?",
"A_en": "Haan, Rajasthan ki arthvyavastha mein shiksha aur prashikshan ki bhoomika mahatvapurn hai.",
"A_hi": "हाँ, राजस्थान की अर्थव्यवस्था में शिक्षा और प्रशिक्षण की भूमिका महत्वपूर्ण है।",
"B_en": "Nahin, Udyog aur krishi Rajasthan ki arthvyastha ko badhava dene wale hain.",
"B_hi": "नहीं, उद्योग और कृषि राजस्थान की अर्थव्यवस्था को बढ़ावा देने वाले हैं।",
"C_en": "Kuchh nahin, Rajasthan ki arthvyastha mein shiksha aur prashikshan ki koi bhoomika nahin hai.",
"C_hi": "कुछ नहीं, राजस्थान की अर्थव्यवस्था में शिक्षा और प्रशिक्षण की कोई भूमिका नहीं है।",
"D_en": "Nahin, Rajasthan ki arthvyastha mein shiksha aur prashikshan ki bhoomika kam hai.",
"D_hi": "नहीं, राजस्थान की अर्थव्यवस्था में शिक्षा और प्रशिक्षण की भूमिका कम है।",
"answer": "A",
"explanation_en": "Rajasthan ki arthvyavastha mein shiksha aur prashikshan ki bhoomika mahatvapurn hai, iska uddeshya karmachariyon ko prashikshit karna aur unke kshamataon ko badhava dene ka hai.",
"explanation_hi": "राजस्थान की अर्थव्यवस्था में शिक्षा और प्रशिक्षण की भूमिका महत्वपूर्ण है, इसका उद्देश्य कर्मचारियों को प्रशिक्षित करना और उनकी क्षमताओं को बढ़ावा देने का है।"
},
{
"subject": "Economy",
"topic": "Rajasthan ki Arthvyavastha: Krishi, Udyog aur Seva Kshetra",
"question_en": "Kya Rajasthan ki arthvyavastha mein mahilaon ki bhoomika mahatvapurn hai?",
"question_hi": "राजस्थान की अर्थव्यवस्था में महिलाओं की भूमिका महत्वपूर्ण है?",
"A_en": "Haan, Rajasthan ki arthvyavastha mein mahilaon ki bhoomika mahatvapurn hai.",
"A_hi": "हाँ, राजस्थान की अर्थव्यवस्था में महिलाओं की भूमिका महत्वपूर्ण है।",
"B_en": "Nahin, Udyog aur krishi Rajasthan ki arthvyastha ko badhava dene wale hain.",
"B_hi": "नहीं, उद्योग और कृषि राजस्थान की अर्थव्यवस्था को बढ़ावा देने वाले हैं।",
"C_en": "Kuchh nahin, Rajasthan ki arthvyastha mein mahilaon ki koi bhoomika nahin hai.",
"C_hi": "कुछ नहीं, राजस्थान की अर्थव्यवस्था में महिलाओं की कोई भूमिका नहीं है।",
"D_en": "Nahin, Rajasthan ki arthvyastha mein mahilaon ki bhoomika kam hai.",
"D_hi": "नहीं, राजस्थान की अर्थव्यवस्था में महिलाओं की भूमिका कम है।",
"answer": "A",
"explanation_en": "Rajasthan ki arthvyavastha mein mahilaon ki bhoomika mahatvapurn hai, iska uddeshya mahilaon ki shiksha aur rojgar ko badhava dene ka hai.",
"explanation_hi": "राजस्थान की अर्थव्यवस्था में महिलाओं की भूमिका महत्वपूर्ण है, इसका उद्देश्य महिलाओं की शिक्षा और रोजगार को बढ़ावा देने का है।"
},
{
"subject": "Economy",
"topic": "Rajasthan ki Arthvyavastha: Krishi, Udyog aur Seva Kshetra",
"question_en": "Kya Rajasthan ki arthvyavastha mein jal sanrakshan ki bhoomika mahatvapurn hai?",
"question_hi": "राजस्थान की अर्थव्यवस्था में जल संरक्षण की भूमिका महत्वपूर्ण है?",
"A_en": "Haan, Rajasthan ki arthvyavastha mein jal sanrakshan ki bhoomika mahatvapurn hai.",
"A_hi": "हाँ, राजस्थान की अर्थव्यवस्था में