[
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the concept of Net National Product (NNP)?",
"question_hi": "नेट नेशनल प्रोडक्ट (एनएनपी) का विचार क्या है?",
"A_en": "NNP is the total value of goods and services produced within a country during a year.", "A_hi": "एनएनपी एक साल में एक देश में उत्पादित किए गए सामान और सेवाओं का कुल मान है।",
"B_en": "NNP is the sum of Gross National Product (GNP) and depreciation.", "B_hi": "एनएनपी जीपीएन और वित्तीय हानि का योग है।",
"C_en": "NNP is the total value of goods and services produced by a country's citizens abroad.", "C_hi": "एनएनपी एक देश के नागरिकों द्वारा विदेशों में उत्पादित सामान और सेवाओं का कुल मान है।",
"D_en": "NNP is the sum of Gross Domestic Product (GDP) and depreciation.", "D_hi": "एनएनपी जीडीपी और वित्तीय हानि का योग है।",
"answer": "D",
"explanation_en": "NNP is the total value of goods and services produced within a country during a year, minus depreciation.",
"explanation_hi": "एनएनपी एक साल में एक देश में उत्पादित किए गए सामान और सेवाओं का कुल मान है, वित्तीय हानि से घटाया जाता है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the difference between Gross National Product (GNP) and Net National Product (NNP)?",
"question_hi": "जीपीएन और एनएनपी में क्या अंतर है?",
"A_en": "GNP is the total value of goods and services produced within a country during a year, while NNP excludes depreciation.", "A_hi": "जीपीएन एक साल में एक देश में उत्पादित किए गए सामान और सेवाओं का कुल मान है, जबकि एनएनपी वित्तीय हानि को शामिल नहीं करता है।",
"B_en": "GNP is the sum of NNP and depreciation.", "B_hi": "जीपीएन एनएनपी और वित्तीय हानि का योग है।",
"C_en": "GNP is the total value of goods and services produced by a country's citizens abroad.", "C_hi": "जीपीएन एक देश के नागरिकों द्वारा विदेशों में उत्पादित सामान और सेवाओं का कुल मान है।",
"D_en": "GNP is the sum of GDP and NNP.", "D_hi": "जीपीएन जीडीपी और एनएनपी का योग है।",
"answer": "D",
"explanation_en": "GNP is the sum of GDP and NNP, while NNP excludes depreciation.",
"explanation_hi": "जीपीएन जीडीपी और एनएनपी का योग है, जबकि एनएनपी वित्तीय हानि को शामिल नहीं करता है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the concept of Gross Domestic Product (GDP)?",
"question_hi": "जीढीपी का विचार क्या है?",
"A_en": "GDP is the total value of goods and services produced within a country during a year.", "A_hi": "जीढीपी एक साल में एक देश में उत्पादित किए गए सामान और सेवाओं का कुल मान है।",
"B_en": "GDP is the sum of NNP and depreciation.", "B_hi": "जीढीपी एनएनपी और वित्तीय हानि का योग है।",
"C_en": "GDP is the total value of goods and services produced by a country's citizens abroad.", "C_hi": "जीढीपी एक देश के नागरिकों द्वारा विदेशों में उत्पादित सामान और सेवाओं का कुल मान है।",
"D_en": "GDP is the sum of GNP and NNP.", "D_hi": "जीढीपी जीपीएन और एनएनपी का योग है।",
"answer": "A",
"explanation_en": "GDP is the total value of goods and services produced within a country during a year.",
"explanation_hi": "जीढीपी एक साल में एक देश में उत्पादित किए गए सामान और सेवाओं का कुल मान है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the relationship between GDP and NNP?",
"question_hi": "जीडीपी और एनएनपी के बीच संबंध क्या है?",
"A_en": "GDP is equal to NNP.", "A_hi": "जीडीपी एनएनपी के बराबर है।",
"B_en": "GDP is greater than NNP.", "B_hi": "जीडीपी एनएनपी से अधिक है।",
"C_en": "GDP is less than NNP.", "C_hi": "जीडीपी एनएनपी से कम है।",
"D_en": "GDP and NNP are unrelated.", "D_hi": "जीडीपी और एनएनपी के बीच कोई संबंध नहीं है।",
"answer": "C",
"explanation_en": "GDP is less than NNP because NNP excludes depreciation.",
"explanation_hi": "जीडीपी एनएनपी से कम है क्योंकि एनएनपी वित्तीय हानि को शामिल नहीं करता है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the concept of Net Domestic Product (NDP)?",
"question_hi": "एनडीपी का विचार क्या है?",
"A_en": "NDP is the total value of goods and services produced within a country during a year.", "A_hi": "एनडीपी एक साल में एक देश में उत्पादित किए गए सामान और सेवाओं का कुल मान है।",
"B_en": "NDP is the sum of GDP and depreciation.", "B_hi": "एनडीपी जीडीपी और वित्तीय हानि का योग है।",
"C_en": "NDP is the total value of goods and services produced by a country's citizens abroad.", "C_hi": "एनडीपी एक देश के नागरिकों द्वारा विदेशों में उत्पादित सामान और सेवाओं का कुल मान है।",
"D_en": "NDP is the total value of goods and services produced within a country during a year, minus depreciation.", "D_hi": "एनडीपी एक साल में एक देश में उत्पादित किए गए सामान और सेवाओं का कुल मान है, वित्तीय हानि से घटाया जाता है।",
"answer": "D",
"explanation_en": "NDP is the total value of goods and services produced within a country during a year, minus depreciation.",
"explanation_hi": "एनडीपी एक साल में एक देश में उत्पादित किए गए सामान और सेवाओं का कुल मान है, वित्तीय हानि से घटाया जाता है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the difference between GDP and NDP?",
"question_hi": "जीडीपी और एनडीपी में क्या अंतर है?",
"A_en": "GDP is the sum of NDP and depreciation.", "A_hi": "जीडीपी एनडीपी और वित्तीय हानि का योग है।",
"B_en": "GDP is greater than NDP.", "B_hi": "जीडीपी एनडीपी से अधिक है।",
"C_en": "GDP is less than NDP.", "C_hi": "जीडीपी एनडीपी से कम है।",
"D_en": "GDP and NDP are unrelated.", "D_hi": "जीडीपी और एनडीपी के बीच कोई संबंध नहीं है।",
"answer": "B",
"explanation_en": "GDP is greater than NDP because GDP includes depreciation.",
"explanation_hi": "जीडीपी एनडीपी से अधिक है क्योंकि जीडीपी वित्तीय हानि को शामिल करता है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the relationship between NNP and NDP?",
"question_hi": "एनएनपी और एनडीपी के बीच संबंध क्या है?",
"A_en": "NNP is equal to NDP.", "A_hi": "एनएनपी एनडीपी के बराबर है।",
"B_en": "NNP is greater than NDP.", "B_hi": "एनएनपी एनडीपी से अधिक है।",
"C_en": "NNP is less than NDP.", "C_hi": "एनएनपी एनडीपी से कम है।",
"D_en": "NNP and NDP are unrelated.", "D_hi": "एनएनपी और एनडीपी के बीच कोई संबंध नहीं है।",
"answer": "B",
"explanation_en": "NNP is greater than NDP because NNP excludes depreciation.",
"explanation_hi": "एनएनपी एनडीपी से अधिक है क्योंकि एनएनपी वित्तीय हानि को शामिल नहीं करता है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the concept of Per Capita Income?",
"question_hi": "पेर कैपिटा आय का विचार क्या है?",
"A_en": "Per Capita Income is the total income of a country's citizens divided by the total population.", "A_hi": "पेर कैपिटा आय एक देश के नागरिकों की कुल आय को उनकी कुल आबादी से विभाजित किया जाता है।",
"B_en": "Per Capita Income is the average income of a country's citizens.", "B_hi": "पेर कैपिटा आय एक देश के नागरिकों की औसत आय है।",
"C_en": "Per Capita Income is the total income of a country's citizens multiplied by the total population.", "C_hi": "पेर कैपिटा आय एक देश के नागरिकों की कुल आय को उनकी कुल आबादी से गुणा किया जाता है।",
"D_en": "Per Capita Income is not a measure of a country's economic performance.", "D_hi": "पेर कैपिटा आय एक देश के आर्थिक प्रदर्शन का माप नहीं है।",
"answer": "A",
"explanation_en": "Per Capita Income is the total income of a country's citizens divided by the total population.",
"explanation_hi": "पेर कैपिटा आय एक देश के नागरिकों की कुल आय को उनकी कुल आबादी से विभाजित किया जाता है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the relationship between Per Capita Income and GDP?",
"question_hi": "पेर कैपिटा आय और जीडीपी के बीच संबंध क्या है?",
"A_en": "Per Capita Income is equal to GDP.", "A_hi": "पेर कैपिटा आय जीडीपी के बराबर है।",
"B_en": "Per Capita Income is greater than GDP.", "B_hi": "पेर कैपिटा आय जीडीपी से अधिक है।",
"C_en": "Per Capita Income is less than GDP.", "C_hi": "पेर कैपिटा आय जीडीपी से कम है।",
"D_en": "Per Capita Income and GDP are unrelated.", "D_hi": "पेर कैपिटा आय और जीडीपी के बीच कोई संबंध नहीं है।",
"answer": "C",
"explanation_en": "Per Capita Income is less than GDP because GDP includes income from non-residents.",
"explanation_hi": "पेर कैपिटा आय जीडीपी से कम है क्योंकि जीडीपी गैर-निवासियों से आय को शामिल करता है।"
}