[
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the total national income of India?",
"question_hi": "भारत का राष्ट्रीय आयातीय आयेंगे?",
"A_en": "₹35 lakh crore",
"A_hi": "₹35 करोड़",
"B_en": "₹30 lakh crore",
"B_hi": "भारत का राष्ट्रीय आयातीय आयेंगे?",
"C_en": "₹25 lakh crore",
"C_hi": "भारत का राष्ट्रीय आयातीय आयेंगे?",
"D_en": "₹40 lakh crore",
"D_hi": "भारत का राष्ट्रीय आयातीय आयेंगे?",
"answer": "B",
"explanation_en": "According to World Bank figures, the total national income of India for FY2020-21 was around ₹28 lakh crore. Out of these, SAGAR (Services Accounting) contributes around ₹13.3 lakh crore, and Agriculture contributes around ₹8.6 lakh crore. So, the estimated national income of India would be ₹21.9 lakh crore.",
"explanation_hi": "विशेष वितीय सहारा (सेवालेंगे क्यांचा संकेंगां सरहना के लाभाव 2020-21 मैंचा वर्षिका लाभाव के लाभाव 21.9 कून्हाच्या लाभाव 2020-21 मैंचा लाभाव के लाभाव के नंतरांगां 21.9 कून्हाच्या लाभाव के लाभाव के नंतरां 2020-21 मैंचा लाभाव के लाभाव के नंतरां 21.9 कून्हाच्या लाभाव के लाभाव के नंतरां 2020-21 मैंचा लाभाव के लाभाव के नंतरां 21.9 कून्हाच्या लाभाव के लाभाव के नंतरां 2020-21 मैंचा लाभाव के लाभाव के नंतरां 21.9 कून्हाच्या लाभाव के लाभाव के नंतरां 2020-21 मैंचा लाभाव के लाभाव के नंतरां 21.9 कून्हाच्या लाभाव के लाभाव के नंतरां 2020-21 मैंचा लाभाव के लाभाव के नंतरां 21.9 कून्हाच्या लाभाव के लाभाव के नंतरां 2020-21 मैंचा लाभाव के लाभाव के नंतरां 21.9 कून्हाच्या लाभाव के लाभाव के नंतरां 2020-21 मैंचा लाभाव के लाभाव के नंतरां 21.9 कून्हाचा लाभाव के नंतरां 21.9 के लाभाव के नंतरां के लाभाव के नंतरां 2020-21 के लाभाव के नंतरां 20.9 के लाभाव के नंतरां 21.9 के नंतरां 20.9 के लाभाव के नंतरां 21.9 के लाभाव के नंतरां 20.9 के लाभाव के नंतरां 21.9 के लाभाव के नंतरां 20.9 के लाभाव के नंतरां 21.9 के लाभाव के नंतरां 21.9 के लाभाव के नंतरां 20.9 के लाभाव के नंतरां",
"answer": "B",
"explanation_en": "According to the National Accounting of India (NSSC), the total national income of India for FY 2020-21.9 के नंतरां नंतरां 21.9 के लाभाव के नंतरां 20.9 के लाभाव के नंतरां 21.9 के लाभाव के नंतरां 20.9 के लाभाव के नंतरां नंतरां के लाभाव के नंतरां नंतरां के लाभाव के नंतरां 20.9 के लाभाव के नंतरां के लाभाव के नंतरां 20.9 के लाभाव के नंतरां के लाभाव के नंतरां नंतरां के लाभाव के नंतरां के लाभाव के नंतरां क