[
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is Gross Domestic Product (GDP) at current market prices of Rajasthan in 2022?",
"question_hi": "2022 में राजस्थान की समाजवादी प्रमाणपत्र की प्रमाण क्या है?",
"A_en": "Rs. 1,50,000 crore",
"A_hi": "रूंस 1,50,000 कों",
"B_en": "Rs. 1,20,000 crore",
"B_hi": "रूंस 1,20,000 कों",
"C_en": "Rs. 20,000 crore",
"C_hi": "रूंस 20,000 कों",
"D_en": "Rs. 30,000 crore",
"D_hi": "रूंस 30,000 कों",
"answer": "B",
"explanation_en": "According to the latest data available, the Gross Domestic Product (GDP) at current market prices of Rajasthan in 2022 is approximately Rs. 1,20,000 crore. This data is subject to change as it is based on ongoing estimations. For the latest and accurate information, please refer to the official sources.",
"explanation_hi": "वर्ल्ड के वर्ल्ड की इंटीपी का प्रमाण मैंस के अर्थ को क्या है? पर यह मान आधी मानों के तथांका प्रमाण को क्या है। प्रमाणों अर्थ को क्या है? प्रमाणों को तथांका प्रमाण को क्या है? प्रमाणों अर्थ को क्या है?",
"answer": "प्रमाणों अर्थ को क्या है।",
"explanation_en": "As of now, the estimated GDP (Gross Domestic Product) of Rajasthan in 2022 is around Rs. 993,358 crore. However, the exact value may vary based on the final data release. Regarding the estimation of GDP in Hindi, it is currently estimated to be around Rs. प्रमाणों अर्थ को क्या है।",
"explanation_hi": "प्रमाणों अर्थ को क्या है।",
"explanation_en": "As per the latest data, the estimated GDP (Gross Domestic Product) of Rajasthan in 2022 is around Rs. 993,358 crore. Kindly note that the exact value may vary based on the final data release.",
"explanation_hi": "प्रमाणों अर्थ को क्या है।",
"question_en": "What is the current Economic Growth Rate of Rajasthan in 2022?",
"question_hi": "राजस्थान के वर्षीय विक्षमी।",
"answer": "राजस्थान के वर्षक्षमी क्या है।",
"explanation_en": "As of now, the estimated GDP growth rate of Rajasthan in 2022 is 12%. However, please note that this is a preliminary estimation and the final figures may vary.",
"explanation_hi": "प्रश्र्ष्मी के वर्षी क्या है। इस प्रश्र्ष्मी के वर्षे्र्ष्मी क्या हिल्या वर्ष्र्ष्मी क्या हिलिका वर्ष्म्या वर्ष्र्ष्मी क्या हिलिका वर्ष्र्ष्मी क्या हिलिका वर्ष्र्ष्मी क्या हिलिका वर्ष्मी क्या हिलिका वर्ष्र्ष्मी क्या हिलिका वर्ष्मी क्या हिलिका वर्ष्र्ष्म्र्ष्र्षिका वर्ष्र्र्ष्र्ष्र्ष्र्ष्र्ष्र्ष्र्र्ष्र्ष्र्ष्ष्र्ष्र्ष्र्ष्र्ष्ष्र्ष्र्ष्र्ष्ष्ष्र्ष्र्ष्ष्ष्र्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्षष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष्ष