[
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the Gross Domestic Product (GDP) of India?",
"question_hi": "भारत का ग्रॉस ग्राउंड डोमिटर (GDP) क्या है?",
"A_en": "Rs. 300,000 crore",
"A_hi": "रुति 300,000 कौर्र",
"B_en": "Rs. 250,000 crore",
"B_hi": "रुति 250,000 कौर्र",
"C_en": "Rs. 400,000 crore",
"C_hi": "रुति 400,000 कौर्र",
"D_en": "Rs. 280,000 crore",
"D_hi": "रुति 280,000 कौर्र",
"answer": "D",
"explanation_en": "As of 2021, the Gross Domestic Product (GDP) of India is approximately Rs. 280,000 crore. It's important to note that the provided options are not accurate for the current year's GDP.",
"explanation_hi": "उत्तरण में, India ka Gross Domestic Product (GDP) approx. Rs. 280,000 crore है। दूसरे बीजेपी की यूल्डों की जानकारित, एन का GDP approx. Rs. 280,000 crore है। दूसरे बीजेपी के यूल्डों की जानकारित, एन का GDP approx. Rs. 280,000 crore है।",
"answer": "D",
"explanation_en": "As of 2021, the approximate GDP (Gross Domestic Product) of India is Rs. 280,000 crore. Please note that the provided options may not reflect the current year's GDP.",
"explanation_hi": "2021 में, भारत का प्रमाण कोणत, एन का एनई एनई कोणत, एन का एनई कोणत, एन का एनई कोणत, एन का एनई कोणत, एन का एनई कोणत एनई कोणत, एनई का एनई कोणत, एनई का एनई कोणत",
"answer": "D",
"explanation_en": "As of 2021, the estimated GDP (Gross Domestic Product) of India is approximately Rs. 280,000 crore. Please note that the provided options may not accurately represent the current year's GDP.",
"explanation_hi": "2021 में, भारत के प्रतिरोध कोणत, एनई कोणत, एनई कोणत, एनई कोणत, एनई कोणत एनई कोणत",
},
{
"subject": "Economy",
"topic": "Rashtriya Niyamit (Fiscal Policies)",
"question_en": "What is the fiscal year in India?",
"question_hi": "भारत में क्यामंगनी कोणत आवश्यामंगनी कोणत",
"A_en": "March-December",
"A_hi": "मास-जून",
"B_en": "January-February",
"B_hi": "जून-माष",
"C_en": "April-May",
"C_hi": "बेवार-जुल",
"answer": "A",
"explanation_en": "In India, the fiscal year starts from April and ends in March. The correct answer is 'April-March'.",
"explanation_hi": "भारत में क्यामंगनी कोणत, भारत माष मंगनी कोणत भारत मेंगनी कोणत भारत माष मंगनी कोणत भारत मेंगनी कोणत भारत माष मंगनी कोणत भारत माष मंगनी कोणत भारत माष मंगनी कोणत भारत माष मंगनी कोणत भारत माष मंगनी कोणत भारत माष मंगनी कोणत भारत माष मंगनी कोणत भारत माष मंगी कोणत भारत माष मंगनी कोणत भारत माष मंगी कोणत भारत माष मंगी कोणत भारत माष मंगी कोणत भारत भारत माष मंगी कोणत भारत भारत माष मंगी कोणत भारत भारत भारत माष भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत भारत",
"
"answer": "A",
"explanation_en": "In India, the fiscal year typically starts from April and ends in March. The correct answer is 'April', but in Hindi, it should be mentioned as 'भारत भारत भारत भारत भारत",
"explanation_hi": "भारत भारत भारत भारत भारत",
]