[
  {
    "subject": "Economy",
    "topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
    "question_en": "Which of the following is NOT included in the expenditure approach for calculating GDP?",
    "question_hi": "निम्नलिखित में से कौन-सा घटक GDP की व्यय पद्धति में शामिल नहीं है?",
    "A_en": "Consumption (C)",
    "A_hi": "उपभोग (C)",
    "B_en": "Investment (I)",
    "B_hi": "निवेश (I)",
    "C_en": "Government Purchases (G)",
    "C_hi": "सार्वजनिक खरीद (G)",
    "D_en": "Imports (M)",
    "D_hi": "आयात (M)",
    "answer": "D",
    "explanation_en": "Imports are subtracted as part of net exports (X - M) and not a direct component of the expenditure approach.",
    "explanation_hi": "आयात को शुद्ध निर्यात (X - M) के हिस्से के रूप में घटाया जाता है और व्यय पद्धति का सीधा घटक नहीं है।"
  },
  {
    "subject": "Economy",
    "topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
    "question_en": "Real GDP is calculated by adjusting nominal GDP for:",
    "question_hi": "वास्तविक GDP को नाममात्र GDP को समायोजित करके गणना किया जाता है:",
    "A_en": "Inflation using a price index",
    "A_hi": "मुद्रास्फीति को एक मूल्य सूचकांक से समायोजित करना",
    "B_en": "Population growth",
    "B_hi": "जनसंख्या वृद्धि",
    "C_en": "Exchange rate fluctuations",
    "C_hi": "विनिमय दर में उतार-चढ़ाव",
    "D_en": "Government spending changes",
    "D_hi": "सार्वजनिक खर्च में बदलाव",
    "answer": "A",
    "explanation_en": "Real GDP uses a price index (like CPI or GDP deflator) to remove the effect of price changes.",
    "explanation_hi": "वास्तविक GDP मूल्य सूचकांक (जैसे CPI या GDP डिफ्लेटर) का उपयोग करके मूल्य परिवर्तनों के प्रभाव को हटाता है।"
  },
  {
    "subject": "Economy",
    "topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
    "question_en": "What is the main difference between GDP and GNP?",
    "question_hi": "GDP और GNP के बीच मुख्य अंतर क्या है?",
    "A_en": "GDP includes only domestic production, while GNP includes income earned by residents abroad.",
    "A_hi": "GDP केवल घरेलू उत्पादन को शामिल करता है, जबकि GNP विदेश में निवासियों द्वारा अर्जित आय को शामिल करता है।",
    "B_en": "GDP is measured in current prices, GNP in constant prices.",
    "B_hi": "GDP वर्तमान मूल्यों में मापा जाता है, GNP स्थिर मूल्यों में।",
    "C_en": "GDP is a fiscal metric, GNP is a monetary metric.",
    "C_hi": "GDP एक वित्तीय माप है, GNP एक मौद्रिक माप है।",
    "D_en": "GDP is calculated by the expenditure approach, GNP by the income approach.",
    "D_hi": "GDP व्यय पद्धति से गणना किया जाता है, GNP आय पद्धति से।",
    "answer": "A",
    "explanation_en": "GDP measures value of goods and services produced within a country’s borders; GNP adds income earned by its residents abroad and subtracts income earned by foreigners domestically.",
    "explanation_hi": "GDP किसी देश की सीमाओं के भीतर उत्पादित वस्तुओं और सेवाओं का मूल्य मापता है; GNP विदेश में उसके निवासियों द्वारा अर्जित आय जोड़ता है और विदेशियों द्वारा घरेलू रूप से अर्जित आय घटाता है।"
  },
  {
    "subject": "Economy",
    "topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
    "question_en": "Which method of national income estimation is based on the income earned by factors of production?",
    "question_hi": "किसी राष्ट्रीय आय अनुमान पद्धति का आधार उत्पादन के कारकों द्वारा अर्जित आय पर होता है?",
    "A_en": "Production (Output) approach",
    "A_hi": "उत्पादन (आउटपुट) पद्धति",
    "B_en": "Expenditure approach",
    "B_hi": "व्यय पद्धति",
    "C_en": "Income approach",
    "C_hi": "आय पद्धति",
    "D_en": "Consumption approach",
    "D_hi": "उपभोग पद्धति",
    "answer": "C",
    "explanation_en": "The income approach totals wages, profits, rents and taxes minus subsidies to estimate national income.",
    "explanation_hi": "आय पद्धति मजदूरी, मुनाफा, किराया और सब्सिडी घटा कर राष्ट्रीय आय का अनुमान लगाती है।"
  },
  {
    "subject": "Economy",
    "topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
    "question_en": "Which of the following best represents a measure of prosperity in an economy?",
    "question_hi": "निम्नलिखित में से कौन-सा आर्थिक समृद्धि का सबसे अच्छा मापदंड है?",
    "A_en": "GDP per capita",
    "A_hi": "प्रति व्यक्ति GDP",
    "B_en": "Total GDP",
    "B_hi": "कुल GDP",
    "C_en": "Inflation rate",
    "C_hi": "मुद्रास्फीति दर",
    "D_en": "Unemployment rate",
    "D_hi": "बेरोजगारी दर",
    "answer": "A",
    "explanation_en": "GDP per capita provides an average economic output per person, indicating general welfare and prosperity.",
    "explanation_hi": "प्रति व्यक्ति GDP प्रति व्यक्ति औसत आर्थिक उत्पादन को दर्शाता है, जो सामान्य कल्याण और समृद्धि का संकेत देता है।"
  },
  {
    "subject": "Economy",
    "topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
    "question_en": "Which of the following is a limitation of using GDP as a measure of welfare?",
    "question_hi": "GDP को कल्याण के माप के रूप में उपयोग करने की कौन-सी सीमा है?",
    "A_en": "It ignores income distribution among the population.",
    "A_hi": "यह जनसंख्या के बीच आय वितरण को अनदेखा करता है।",
    "B_en": "It is calculated using market prices only.",
    "B_hi": "यह केवल बाजार मूल्यों का उपयोग करके गणना की जाती है।",
    "C_en": "It includes non‑market activities like housework.",
    "C_hi": "यह गैर-बाजार गतिविधियों जैसे घरेलू कार्य को शामिल करता है।",
    "D_en": "It accounts for environmental degradation.",
    "D_hi": "यह पर्यावरणीय क्षय को ध्यान में रखता है।",
    "answer": "A",
    "explanation_en": "GDP aggregates total output but does not reflect how that income is distributed among people.",
    "explanation_hi": "GDP कुल उत्पादन को जोड़ता है परंतु यह नहीं बताता कि वह आय लोगों में कैसे वितरित है।"
  },
  {
    "subject": "Economy",
    "topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
    "question_en": "In national income accounts, the value of intermediate consumption is excluded to avoid:",
    "question_hi": "राष्ट्रीय आय खातों में मध्यवर्ती उपभोग का मूल्य क्यों बाहर रखा जाता है?",
    "A_en": "Double counting of output.",
    "A_hi": "उत्पादन का दोहरा गिनती।",
    "B_en": "Inflation distortion.",
    "B_hi": "मुद्रास्फीति विकृति।",
    "C_en": "Currency fluctuation effects.",
    "C_hi": "मुद्रा उतार-चढ़ाव के प्रभाव।",
    "D_en": "Tax revenue loss.",
    "D_hi": "कर राजस्व हानि।",
    "answer": "A",
    "explanation_en": "Subtracting intermediate consumption ensures only final goods and services are counted, preventing double counting.",
    "explanation_hi": "मध्यवर्ती उपभोग को घटाने से केवल अंतिम वस्तुएँ और सेवाएँ गिनी जाती हैं, जिससे दोहरी गिनती से बचा जाता है।"
  },
  {
    "subject": "Economy",
    "topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
    "question_en": "The current price method of measuring national income is also known as:",
    "question_hi": "राष्ट्रीय आय को वर्तमान मूल्यों पर मापने की पद्धति को क्या कहा जाता है?",
    "A_en": "Nominal GDP",
    "A_hi": "नाममात्र GDP",
    "B_en": "Real GDP",
    "B_hi": "वास्तविक GDP",
    "C_en": "Purchasing Power Parity GDP",
    "C_hi": "क्रय शक्ति समता GDP",
    "D_en": "Adjusted Gross Domestic Product",
    "D_hi": "समायोजित सकल घरेलू उत्पाद",
    "answer": "A",
    "explanation_en": "Nominal GDP uses current market prices without adjusting for inflation.",
    "explanation_hi": "नाममात्र GDP वर्तमान बाजार मूल्यों का उपयोग करता है और मुद्रास्फीति के लिए समायोजित नहीं करता।"
  },
  {
    "subject": "Economy",
    "topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
    "question_en": "Which of the following non‑market activities is typically excluded from GDP calculations?",
    "question_hi": "निम्नलिखित में से कौन-सी गैर‑बाजार गतिविधि आम तौर पर GDP गणना से बाहर रखी जाती है?",
    "A_en": "Volunteer work in community service",
    "A_hi": "समुदाय सेवा में स्वयंसेवी कार्य",
    "B_en": "Household production of food",
    "B_hi": "घरेलू खाद्य उत्पादन",
    "C_en": "Private consumption of goods",
    "C_hi": "निजी वस्तुओं का उपभोग",
    "D_en": "Government expenditure on infrastructure",
    "D_hi": "इन्फ्रास्ट्रक्चर पर सरकारी व्यय",
    "answer": "B",
    "explanation_en": "Household production of food is a non‑market activity and is not captured in GDP, whereas volunteer work is also excluded but is not a monetary transaction.",
    "explanation_hi": "घरेलू खाद्य उत्पादन एक गैर‑बाजार गतिविधि है जिसे GDP में नहीं गिना जाता; स्वयंसेवी कार्य भी बाहर रहता है परंतु यह मौद्रिक लेन‑देन नहीं है।"
  },
  {
    "subject": "Economy",
    "topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
    "question_en": "The growth rate of GDP is calculated by comparing GDP of:",
    "question_hi": "GDP की वृद्धि दर की गणना किसकी तुलना करके की जाती है?",
    "A_en": "Two consecutive years",
    "A_hi": "दो लगातार वर्ष",
    "B_en": "Same quarter of two different years",
    "B_hi": "दो अलग-अलग वर्षों के एक ही तिमाही",
    "C_en": "GDP and GNP of the same year",
    "C_hi": "एक ही वर्ष के GDP और GNP",
    "D_en": "GDP and inflation rate of the same year",
    "D_hi": "एक ही वर्ष के GDP और मुद्रास्फीति दर",
    "answer": "A",
    "explanation_en": "Annual GDP growth is typically measured by comparing the current year's GDP with the previous year's GDP.",
    "explanation_hi": "वार्षिक GDP वृद्धि को आम तौर पर वर्तमान वर्ष के GDP की तुलना पिछले वर्ष के GDP से करके मापा जाता है।"
  }
]