[
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "Which of the following is the correct definition of National Income?",
"question_hi": "निम्नलिखित में से कौन राष्ट्रीय आय की सही परिभाषा है?",
"A_en": "Total value of all goods and services produced in a country",
"A_hi": "किसी देश में उत्पादित सभी वस्तुओं और सेवाओं की कुल मूल्य",
"B_en": "Total income received by residents of a country from all sources",
"B_hi": "किसी देश के निवासियों द्वारा सभी स्रोतों से प्राप्त कुल आय",
"C_en": "Total expenditure on goods and services by government",
"C_hi": "सरकार द्वारा वस्तुओं और सेवाओं पर कुल व्यय",
"D_en": "Total value of exports minus imports",
"D_hi": "निर्यात का कुल मूल्य घटाया आयात",
"answer": "B",
"explanation_en": "National Income is defined as the total income received by residents of a country from all productive activities during a given period.",
"explanation_hi": "राष्ट्रीय आय को किसी देश के निवासियों द्वारा एक निश्चित अवधि के दौरान सभी उत्पादक गतिविधियों से प्राप्त कुल आय के रूप में परिभाषित किया गया है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "Which method is used to calculate National Income by summing up all factor incomes?",
"question_hi": "सभी कारक आयों को जोड़कर राष्ट्रीय आय की गणना करने के लिए किस विधि का उपयोग किया जाता है?",
"A_en": "Production Method",
"A_hi": "उत्पादन विधि",
"B_en": "Expenditure Method",
"B_hi": "व्यय विधि",
"C_en": "Income Method",
"C_hi": "आय विधि",
"D_en": "Value Added Method",
"D_hi": "मूल्य वर्धित विधि",
"answer": "C",
"explanation_en": "The Income Method calculates National Income by summing up all factor incomes like wages, rent, interest, and profits.",
"explanation_hi": "आय विधि वेतन, किराया, ब्याज और लाभ जैसी सभी कारक आयों को जोड़कर राष्ट्रीय आय की गणना करती है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What does GDP at factor cost include?",
"question_hi": "कारक लागत पर सकल घरेलू उत्पाद में क्या शामिल होता है?",
"A_en": "Indirect taxes but not subsidies",
"A_hi": "अप्रत्यक्ष कर लेकिन सब्सिडी नहीं",
"B_en": "Subsidies but not indirect taxes",
"B_hi": "सब्सिडी लेकिन अप्रत्यक्ष कर नहीं",
"C_en": "Both indirect taxes and subsidies",
"C_hi": "अप्रत्यक्ष कर और सब्सिडी दोनों",
"D_en": "Neither indirect taxes nor subsidies",
"D_hi": "न तो अप्रत्यक्ष कर और न सब्सिडी",
"answer": "B",
"explanation_en": "GDP at factor cost includes subsidies but excludes indirect taxes, as it represents the cost of factors of production.",
"explanation_hi": "कारक लागत पर सकल घरेलू उत्पाद सब्सिडी को शामिल करता है लेकिन अप्रत्यक्ष करों को बाहर रखता है, क्योंकि यह उत्पादन के कारकों की लागत को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "Which organization in India is responsible for estimating National Income?",
"question_hi": "भारत में राष्ट्रीय आय के अनुमान के लिए कौन सा संगठन उत्तरदायी है?",
"A_en": "RBI",
"A_hi": "भारतीय रिजर्व बैंक",
"B_en": "CSO",
"B_hi": "केंद्रीय सांख्यिकी संगठन",
"C_en": "Finance Commission",
"C_hi": "वित्त आयोग",
"D_en": "NITI Aayog",
"D_hi": "निति आयोग",
"answer": "B",
"explanation_en": "The Central Statistics Office (CSO) under the Ministry of Statistics and Programme Implementation is responsible for estimating National Income in India.",
"explanation_hi": "केंद्रीय सांख्यिकी संगठन (सीएसओ) जो सांख्यिकी और कार्यक्रम कार्यान्वयन मंत्रालय के अंतर्गत आता है, भारत में राष्ट्रीय आय के अनुमान के लिए उत्तरदायी है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the difference between GDP and GNP?",
"question_hi": "सकल घरेलू उत्पाद और सकल राष्ट्रीय उत्पाद के बीच क्या अंतर है?",
"A_en": "GDP includes income from abroad while GNP does not",
"A_hi": "सकल घरेलू उत्पाद में विदेश से आय शामिल होती है जबकि सकल राष्ट्रीय उत्पाद में नहीं",
"B_en": "GNP includes net income from abroad while GDP does not",
"B_hi": "सकल राष्ट्रीय उत्पाद में विदेश से शुद्ध आय शामिल होती है जबकि सकल घरेलू उत्पाद में नहीं",
"C_en": "Both are always equal",
"C_hi": "दोनों हमेशा बराबर होते हैं",
"D_en": "GDP is calculated at current prices only",
"D_hi": "सकल घरेलू उत्पाद केवल वर्तमान कीमतों पर गणना किया जाता है",
"answer": "B",
"explanation_en": "GNP includes net income from abroad (income earned by residents from abroad minus income paid to non-residents), while GDP measures production within the country's borders.",
"explanation_hi": "सकल राष्ट्रीय उत्पाद में विदेश से शुद्ध आय शामिल होती है (विदेश से निवासियों द्वारा अर्जित आय घटाया गैर-निवासियों को भुगतान की गई आय), जबकि सकल घरेलू उत्पाद देश की सीमाओं के भीतर उत्पादन को मापता है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "Which of the following is NOT included while calculating National Income by income method?",
"question_hi": "आय विधि द्वारा राष्ट्रीय आय की गणना करते समय निम्नलिखित में से क्या शामिल नहीं किया जाता है?",
"A_en": "Wages and salaries",
"A_hi": "वेतन और तनख्वाह",
"B_en": "Rent",
"B_hi": "किराया",
"C_en": "Transfer payments",
"C_hi": "स्थानांतरण भुगतान",
"D_en": "Interest income",
"D_hi": "ब्याज आय",
"answer": "C",
"explanation_en": "Transfer payments like pensions, unemployment benefits are not included in National Income as they are not payments for any productive service.",
"explanation_hi": "स्थानांतरण भुगतान जैसे पेंशन, बेरोजगारी भत्ता राष्ट्रीय आय में शामिल नहीं किए जाते क्योंकि ये किसी उत्पादक सेवा के लिए भुगतान नहीं होते।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What does real GDP measure?",
"question_hi": "वास्तविक सकल घरेलू उत्पाद क्या मापता है?",
"A_en": "GDP at current market prices",
"A_hi": "वर्तमान बाजार कीमतों पर सकल घरेलू उत्पाद",
"B_en": "GDP adjusted for inflation",
"B_hi": "मुद्रास्फीति के लिए समायोजित सकल घरेलू उत्पाद",
"C_en": "GDP minus depreciation",
"C_hi": "सकल घरेलू उत्पाद घटाया मूल्यह्रास",
"D_en": "GDP plus net exports",
"D_hi": "सकल घरेलू उत्पाद जोड़ा शुद्ध निर्यात",
"answer": "B",
"explanation_en": "Real GDP is GDP adjusted for inflation, which shows the actual growth in the economy by removing the effect of price changes.",
"explanation_hi": "वास्तविक सकल घरेलू उत्पाद मुद्रास्फीति के लिए समायोजित सकल घरेलू उत्पाद है, जो मूल्य परिवर्तनों के प्रभाव को हटाकर अर्थव्यवस्था में वास्तविक वृद्धि को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "Which sector contributes the most to India's National Income?",
"question_hi": "भारत की राष्ट्रीय आय में सबसे अधिक योगदान किस क्षेत्र का है?",
"A_en": "Primary sector",
"A_hi": "प्राथमिक क्षेत्र",
"B_en": "Secondary sector",
"B_hi": "द्वितीयक क्षेत्र",
"C_en": "Tertiary sector",
"C_hi": "तृतीयक क्षेत्र",
"D_en": "All sectors equally",
"D_hi": "सभी क्षेत्र समान रूप से",
"answer": "C",
"explanation_en": "The tertiary or service sector contributes the most to India's National Income, accounting for more than 50% of GDP.",
"explanation_hi": "तृतीयक या सेवा क्षेत्र भारत की राष्ट्रीय आय में सबसे अधिक योगदान देता है, जो सकल घरेलू उत्पाद के 50% से अधिक का हिस्सा है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the base year for calculating National Income in India currently?",
"question_hi": "भारत में वर्तमान में राष्ट्रीय आय की गणना के लिए आधार वर्ष क्या है?",
"A_en": "2004-05",
"A_hi": "2004-05",
"B_en": "2011-12",
"B_hi": "2011-12",
"C_en": "2014-15",
"C_hi": "2014-15",
"D_en": "2020-21",
"D_hi": "2020-21",
"answer": "B",
"explanation_en": "India currently uses 2011-12 as the base year for calculating National Income and GDP statistics.",
"explanation_hi": "भारत वर्तमान में राष्ट्रीय आय और सकल घरेलू उत्पाद सांख्यिकी की गणना के लिए 2011-12 को आधार वर्ष के रूप में उपयोग करता है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "Per capita income is calculated by dividing National Income by:",
"question_hi": "प्रति व्यक्ति आय की गणना राष्ट्रीय आय को किससे विभाजित करके की जाती है:",
"A_en": "Total area of the country",
"A_hi": "देश के कुल क्षेत्रफल से",
"B_en": "Total population",
"B_hi": "कुल जनसंख्या से",
"C_en": "Total working population",
"C_hi": "कुल कार्यरत जनसंख्या से",
"D_en": "Number of households",
"D_hi": "घरों की संख्या से",
"answer": "B",
"explanation_en": "Per capita income is calculated by dividing the National Income by the total population of the country.",
"explanation_hi": "प्रति व्यक्ति आय की गणना राष्ट्रीय आय को देश की कुल जनसंख्या से विभाजित करके की जाती है।"
}
]