[
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the formula for calculating National Income?",
"question_hi": "राष्ट्रीय आय की गणना करने के लिए कौन सा सूत्र है?",
"A_en": "GDP (Gross Domestic Product) + Net Factor Income from Abroad", 
"A_hi": "ग्रॉस डोमेस्टिक प्रोडक्ट (जीडीपी) + नेट फैक्टर आय फ्रॉम अब्रोड",
"B_en": "GDP (Gross Domestic Product) - Net Factor Income from Abroad",
"B_hi": "ग्रॉस डोमेस्टिक प्रोडक्ट (जीडीपी) - नेट फैक्टर आय फ्रॉम अब्रोड",
"C_en": "GNP (Gross National Product)",
"C_hi": "जीएनपी (ग्रॉस नेशनल प्रोडक्ट)",
"D_en": "CNP (Consumer Non-Profit)",
"D_hi": "सीएनपी (कंज्यूमर नॉन-प्रॉफिट)",
"answer": "A",
"explanation_en": "National Income = GDP + Net Factor Income from Abroad",
"explanation_hi": "राष्ट्रीय आय = जीडीपी + नेट फैक्टर आय फ्रॉम अब्रोड"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the difference between Nominal GDP and Real GDP?",
"question_hi": "नॉमिनल जीडीपी और रियल जीडीपी में क्या अंतर है?",
"A_en": "Nominal GDP is calculated at current prices and Real GDP is calculated at constant prices.",
"A_hi": "नोमिनल जीडीपी को वर्तमान मूल्यों पर और रियल जीडीपी को निरंतर मूल्यों पर गणना की जाती है",
"B_en": "Nominal GDP is calculated at constant prices and Real GDP is calculated at current prices.",
"B_hi": "नोमिनल जीडीपी को निरंतर मूल्यों पर और रियल जीडीपी को वर्तमान मूल्यों पर गणना की जाती है",
"C_en": "Real GDP is the value of goods and services produced in a year.",
"C_hi": "रियल जीडीपी एक साल में उत्पादित वस्तुओं और सेवाओं का मूल्य है।",
"D_en": "Nominal GDP is the value of goods and services produced in a year.",
"D_hi": "नोमिनल जीडीपी एक साल में उत्पादित वस्तुओं और सेवाओं का मूल्य है।",
"answer": "A",
"explanation_en": "Nominal GDP is calculated at current prices and Real GDP is calculated at constant prices.",
"explanation_hi": "नोमिनल जीडीपी को वर्तमान मूल्यों पर और रियल जीडीपी को निरंतर मूल्यों पर गणना की जाती है"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the concept of Gross National Disposable Income (GNDI)?",
"question_hi": "ग्रॉस नेशनल डिस्पोजेबल आय (जीएनडीआई) का सिद्धांत क्या है?",
"A_en": "It includes all the income earned by a country and its citizens, minus depreciation and capital consumption allowances.",
"A_hi": "यह देश और उसके नागरिकों द्वारा अर्जित सभी आय को शामिल करता है, जिसमें विभेदीकरण और राजकोषीय उपभोग अधिकारों को कम करता है।",
"B_en": "It includes all the income earned by a country, minus depreciation and capital consumption allowances.",
"B_hi": "यह देश द्वारा अर्जित सभी आय को शामिल करता है, जिसमें विभेदीकरण और राजकोषीय उपभोग अधिकारों को कम करता है।",
"C_en": "It excludes all the income earned by a country and its citizens.",
"C_hi": "यह देश और उसके नागरिकों द्वारा अर्जित सभी आय को शामिल करता है।",
"D_en": "It is the same as Gross National Product (GNP).",
"D_hi": "यह ग्रॉस नेशनल प्रोडक्ट (जीएनपी) के समान है।",
"answer": "A",
"explanation_en": "GNDI includes all the income earned by a country and its citizens, minus depreciation and capital consumption allowances.",
"explanation_hi": "जीएनडीआई देश और उसके नागरिकों द्वारा अर्जित सभी आय को शामिल करता है, जिसमें विभेदीकरण और राजकोषीय उपभोग अधिकारों को कम करता है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the difference between Gross Domestic Product (GDP) and Net Domestic Product (NDP)?",
"question_hi": "ग्रॉस डोमेस्टिक प्रोडक्ट (जीडीपी) और नेट डोमेस्टिक प्रोडक्ट (एनडीपी) में क्या अंतर है?",
"A_en": "GDP includes depreciation and capital consumption allowances, while NDP excludes them.",
"A_hi": "जीडीपी में विभेदीकरण और राजकोषीय उपभोग अधिकार शामिल होते हैं, जबकि एनडीपी उन्हें शामिल नहीं करता है।",
"B_en": "GDP excludes depreciation and capital consumption allowances, while NDP includes them.",
"B_hi": "जीडीपी में विभेदीकरण और राजकोषीय उपभोग अधिकारों को शामिल नहीं किया जाता है, जबकि एनडीपी उन्हें शामिल करता है।",
"C_en": "NDP is higher than GDP.",
"C_hi": "एनडीपी जीडीपी से अधिक है।",
"D_en": "GDP is higher than NDP.",
"D_hi": "जीडीपी एनडीपी से अधिक है।",
"answer": "A",
"explanation_en": "GDP includes depreciation and capital consumption allowances, while NDP excludes them.",
"explanation_hi": "जीडीपी में विभेदीकरण और राजकोषीय उपभोग अधिकार शामिल होते हैं, जबकि एनडीपी उन्हें शामिल नहीं करता है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the concept of Gross National Expenditure (GNE)?",
"question_hi": "ग्रॉस नेशनल एक्सपेंडिचर (जीएनई) का सिद्धांत क्या है?",
"A_en": "It includes all the expenditure incurred by a country and its citizens, including government expenditure, investment, and consumption.",
"A_hi": "यह देश और उसके नागरिकों द्वारा किए गए सभी व्यय को शामिल करता है, जिसमें सरकारी व्यय, निवेश और उपभोग शामिल हैं।",
"B_en": "It includes only government expenditure and investment.",
"B_hi": "यह केवल सरकारी व्यय और निवेश को शामिल करता है।",
"C_en": "It excludes government expenditure and investment.",
"C_hi": "यह सरकारी व्यय और निवेश को शामिल नहीं करता है।",
"D_en": "It is the same as Gross National Product (GNP).",
"D_hi": "यह ग्रॉस नेशनल प्रोडक्ट (जीएनपी) के समान है।",
"answer": "A",
"explanation_en": "GNE includes all the expenditure incurred by a country and its citizens, including government expenditure, investment, and consumption.",
"explanation_hi": "जीएनई देश और उसके नागरिकों द्वारा किए गए सभी व्यय को शामिल करता है, जिसमें सरकारी व्यय, निवेश और उपभोग शामिल हैं।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the relationship between Gross National Product (GNP) and Gross Domestic Product (GDP)?",
"question_hi": "ग्रॉस नेशनल प्रोडक्ट (जीएनपी) और ग्रॉस डोमेस्टिक प्रोडक्ट (जीडीपी) के बीच संबंध क्या है?",
"A_en": "GNP is equal to GDP minus net factor income from abroad.",
"A_hi": "जीएनपी जीडीपी से नेट फैक्टर आय फ्रॉम अब्रोड को घटाकर बनता है।",
"B_en": "GNP is equal to GDP plus net factor income from abroad.",
"B_hi": "जीएनपी जीडीपी को नेट फैक्टर आय फ्रॉम अब्रोड से जोड़कर बनता है।",
"C_en": "GNP is higher than GDP.",
"C_hi": "जीएनपी जीडीपी से अधिक है।",
"D_en": "GNP is equal to GDP.",
"D_hi": "जीएनपी जीडीपी के समान है।",
"answer": "B",
"explanation_en": "GNP is equal to GDP plus net factor income from abroad.",
"explanation_hi": "जीएनपी जीडीपी को नेट फैक्टर आय फ्रॉम अब्रोड से जोड़कर बनता है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the concept of Net Domestic Product (NDP) at factor cost?",
"question_hi": "नेट डोमेस्टिक प्रोडक्ट (एनडीपी) फैक्टर कॉस्ट पर क्या है?",
"A_en": "It is the value of all goods and services produced in a year, minus depreciation and capital consumption allowances.",
"A_hi": "यह एक साल में उत्पादित सभी वस्तुओं और सेवाओं का मूल्य है, जिसमें विभेदीकरण और राजकोषीय उपभोग अधिकारों को घटाया जाता है।",
"B_en": "It is the value of all goods and services produced in a year, plus depreciation and capital consumption allowances.",
"B_hi": "यह एक साल में उत्पादित सभी वस्तुओं और सेवाओं का मूल्य है, जिसमें विभेदीकरण और राजकोषीय उपभोग अधिकारों को जोड़ा जाता है।",
"C_en": "It is the same as Gross Domestic Product (GDP).",
"C_hi": "यह ग्रॉस डोमेस्टिक प्रोडक्ट (जीडीपी) के समान है।",
"D_en": "It excludes government expenditure and investment.",
"D_hi": "यह सरकारी व्यय और निवेश को शामिल नहीं करता है।",
"answer": "A",
"explanation_en": "NDP at factor cost is the value of all goods and services produced in a year, minus depreciation and capital consumption allowances.",
"explanation_hi": "एनडीपी फैक्टर कॉस्ट पर एक साल में उत्पादित सभी वस्तुओं और सेवाओं का मूल्य है, जिसमें विभेदीकरण और राजकोषीय उपभोग अधिकारों को घटाया जाता है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the concept of Gross Domestic Product (GDP) deflator?",
"question_hi": "ग्रॉस डोमेस्टिक प्रोडक्ट (जीडीपी) डेफ्लेटर का सिद्धांत क्या है?",
"A_en": "It is a price index that measures the change in the general price level of goods and services in an economy.",
"A_hi": "यह एक मूल्य सूचकांक है जो अर्थव्यवस्था में वस्तुओं और सेवाओं के आम मूल्य स्तर में परिवर्तन को मापता है।",
"B_en": "It is a measure of the value of goods and services produced in a year.",
"B_hi": "यह एक साल में उत्पादित वस्तुओं और सेवाओं के मूल्य का माप है।",
"C_en": "It is the same as Consumer Price Index (CPI).",
"C_hi": "यह उपभोक्ता मूल्य सूचकांक (सीपीआई) के समान है।",
"D_en": "It is a measure of the value of imports and exports.",
"D_hi": "यह आयात और निर्यात के मूल्य का माप है।",
"answer": "A",
"explanation_en": "GDP deflator is a price index that measures the change in the general price level of goods and services in an economy.",
"explanation_hi": "जीडीपी डेफ्लेटर अर्थव्यवस्था में वस्तुओं और सेवाओं के आम मूल्य स्तर में परिवर्तन को मापने के लिए एक मूल्य सूचकांक है।"
},
{
"subject": "Economy",
"topic": "Rashtriya Aay (National Income) aur Samriddhi ki Avdharna",
"question_en": "What is the relationship between Gross National Product (GNP) and Net National Product (NNP)?",
"question_hi": "ग्रॉस नेशनल प्रोडक्ट (जीएनपी) और नेट नेशनल प्रोडक्ट (एनएनपी) के बीच संबंध क्या है?",
"A_en": "GNP is equal to NNP minus depreciation and capital consumption allowances.",
"A_hi": "जीएनपी एनएनपी से विभेदीकरण और राजकोषीय उपभोग अधिकारों को घटाकर बनता है।",
"B_en": "GNP is equal to NNP plus depreciation and capital consumption allowances.",
"B_hi": "जीएनपी एनएनपी को विभेदीकरण और राजकोषीय उपभोग अधिकारों से जोड़कर बनता है।",
"C_en": "NNP is higher than GNP.",
"C_hi": "एनएनपी जीएनपी से अधिक है।",
"D_en": "GNP is equal to NNP.",
"D_hi": "जीएनपी एनएनपी के समान है।",
"answer": "B",
"explanation_en": "GNP is equal to NNP plus depreciation and capital consumption allowances.",
"explanation_hi": "जीएनपी एनएनपी को विभेदीकरण और राजकोषीय उपभोग अधिकारों से जोड़कर बनता है।"
}
]