[
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Which of the following rates is NOT directly set by the RBI under its monetary policy?",
"question_hi": "निम्नलिखित में से कौन-सी दर RBI द्वारा मौद्रिक नीति के तहत सीधे निर्धारित नहीं की जाती?",
"A_en": "Repo Rate", "A_hi": "रिपो दर",
"B_en": "Reverse Repo Rate", "B_hi": "रिवर्स रिपो दर",
"C_en": "Bank Rate", "C_hi": "बैंक दर",
"D_en": "Prime Lending Rate", "D_hi": "प्राइम लैंडिंग दर",
"answer": "D",
"explanation_en": "Prime Lending Rate (PLR) is internally determined by individual banks; RBI only sets policy rates like Repo, Reverse Repo and Bank Rate.",
"explanation_hi": "प्राइम लैंडिंग दर (PLR) को व्यक्तिगत बैंक स्वयं निर्धारित करते हैं; RBI केवल नीति दरें जैसे रिपो, रिवर्स रिपो और बैंक दर तय करती है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "The Reserve Bank of India uses which of the following as the primary policy rate to control inflation?",
"question_hi": "भारतीय रिज़र्व बैंक मुद्रास्फीति को नियंत्रित करने के लिए निम्नलिखित में से किसे प्राथमिक नीति दर के रूप में प्रयोग करता है?",
"A_en": "Cash Reserve Ratio", "A_hi": "कैश रिज़र्व अनुपात",
"B_en": "Repo Rate", "B_hi": "रिपो दर",
"C_en": "Statutory Liquidity Ratio", "C_hi": "वैधानिक तरलता अनुपात",
"D_en": "Marginal Standing Facility Rate", "D_hi": "मार्जिनल स्टैंडिंग फैसिलिटी दर",
"answer": "B",
"explanation_en": "Repo Rate is the key anchor rate under the liquidity adjustment facility (LAF) used by RBI to signal its monetary policy stance and control inflation.",
"explanation_hi": "रिपो दर तरलता समायोजन सुविधा (LAF) के तहत प्रमुख आंकड़ा दर है जिसे RBI अपनी मौद्रिक नीति की स्थिति और मुद्रास्फीति नियंत्रण के लिए संकेत के रूप में उपयोग करती है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Under the Monetary Policy Framework, the RBI is mandated to maintain retail inflation within the target range of:",
"question_hi": "मौद्रिक नीति ढांचे के तहत RBI को खुदरा मुद्रास्फीति किस लक्षित सीमा के भीतर बनाए रखने का दायित्व है?",
"A_en": "2% with a tolerance band of ±1%", "A_hi": "2% ±1% सहनशीलता बैंड के साथ",
"B_en": "4% with a tolerance band of ±2%", "B_hi": "4% ±2% सहनशीलता बैंड के साथ",
"C_en": "5% with a tolerance band of ±1.5%", "C_hi": "5% ±1.5% सहनशीलता बैंड के साथ",
"D_en": "6% with a tolerance band of ±2%", "D_hi": "6% ±2% सहनशीलता बैंड के साथ",
"answer": "B",
"explanation_en": "The Government of India has set the inflation target at 4% with a tolerance band of ±2% for the period 2016-2021, continued thereafter.",
"explanation_hi": "भारत सरकार ने 2016-2021 की अवधि के लिए मुद्रास्फीति लक्ष्य 4% ±2% सहनशीलता बैंड के साथ निर्धारित किया था, जिसे आगे भी जारी रखा गया है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Which of the following tools is considered a 'quantitative' measure of monetary policy?",
"question_hi": "निम्नलिखित में से कौन-सा उपकरण मौद्रिक नीति का 'मात्रात्मक' उपाय माना जाता है?",
"A_en": "Moral Suasion", "A_hi": "नैतिक प्रभाव",
"B_en": "Margin Requirements", "B_hi": "मार्जिन आवश्यकताएँ",
"C_en": "Open Market Operations", "C_hi": "खुले बाज़ार परिचालन",
"D_en": "Credit Rationing", "C_hi": "ऋण परिमाण नियंत्रण",
"answer": "C",
"explanation_en": "Open Market Operations (OMO) involve buying/selling of government securities and directly influence the quantum of money supply, hence a quantitative tool.",
"explanation_hi": "खुले बाज़ार परिचालन (OMO) में सरकारी प्रतिभूतियों की खरीद-बिक्री होती है जो मुद्रा आपूर्ति की मात्रा को प्रभावित करती है, इसलिए यह मात्रात्मक उपकरण है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "The rate at which the RBI lends to commercial banks against government securities under the Liquidity Adjustment Facility (LAF) is called:",
"question_hi": "तरलता समायोजन सुविधा (LAF) के तहत RBI द्वारा वाणिज्यिक बैंकों को सरकारी प्रतिभूतियों के बदले दी जाने वाली दर को क्या कहा जाता है?",
"A_en": "Bank Rate", "A_hi": "बैंक दर",
"B_en": "Repo Rate", "B_hi": "रिपो दर",
"C_en": "MSF Rate", "B_hi": "MSF दर",
"D_en": "Base Rate", "C_hi": "बेस दर",
"answer": "B",
"explanation_en": "Repo (Repurchase Option) Rate is the rate at which RBI lends short-term money to banks against the collateral of government securities.",
"explanation_hi": "रिपो (रीपर्चेस ऑप्शन) दर वह दर है जिस पर RBI सरकारी प्रतिभूतियों की गारंटी पर बैंकों को अल्पकालिक ऋण देती है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "If the RBI wants to reduce the money supply in the economy, it would most likely:",
"question_hi": "यदि RBI अर्थव्यवस्था में मुद्रा आपूर्ति घटाना चाहती है, तो वह सबसे अधिक सम्भवतः क्या करेगी?",
"A_en": "Lower the Cash Reserve Ratio", "A_hi": "कैश रिज़र्व अनुपात घटाएगी",
"B_en": "Increase the Repo Rate", "B_hi": "रिपो दर बढ़ाएगी",
"C_en": "Buy government securities under OMO", "B_hi": "OMO के तहत सरकारी प्रतिभूतियाँ खरीदेगी",
"D_en": "Decrease the Statutory Liquidity Ratio", "C_hi": "वैधानिक तरलता अनुपात घटाएगी",
"answer": "B",
"explanation_en": "An increase in Repo Rate makes borrowing costlier for banks, prompting them to borrow less and lend less, thereby reducing money supply.",
"explanation_hi": "रिपो दर बढ़ने से बैंकों के लिए उधार लेना महँगा हो जाता है, जिससे वे कम उधार लेते हैं और कम उधार देते हैं, जिससे मुद्रा आपूर्ति घटती है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "The minimum percentage of Net Demand & Time Liabilities (NDTL) that banks must keep in cash with the RBI is called:",
"question_hi": "नेट डिमांड व टाइम देनदारियों (NDTL) का न्यूनतम कितना प्रतिशत भाग बैंकों को RBI के पास नकद रखना होता है, उसे क्या कहा जाता है?",
"A_en": "SLR", "A_hi": "SLR",
"B_en": "CRR", "B_hi": "CRR",
"C_en": "Bank Rate", "C_hi": "बैंक दर",
"D_en": "Repo Rate", "C_hi": "रिपो दर",
"answer": "B",
"explanation_en": "Cash Reserve Ratio (CRR) is the mandatory cash percentage of NDTL that banks must maintain with the RBI on a daily basis.",
"explanation_hi": "कैश रिज़र्व अनुपात (CRR) NDTL का वह अनिवार्य नकद प्रतिशत है जिसे बैंकों को प्रतिदिन RBI के पास रखना होता है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Which of the following statements about the Monetary Policy Committee (MPC) is correct?",
"question_hi": "मौद्रिक नीति समिति (MPC) के बारे में निम्नलिखित में से कौन-सा कथन सत्य है?",
"A_en": "It is headed by the Union Finance Minister", "A_hi": "इसकी अध्यक्षता केंद्रीय वित्त मंत्री करते हैं",
"B_en": "It has 3 RBI officials and 3 external members", "B_hi": "इसमें 3 RBI अधिकारी और 3 बाहरी सदस्य होते हैं",
"C_en": "It meets once every two years", "C_hi": "यह हर दो वर्ष में एक बार मिलती है",
"D_en": "It can set fiscal deficit targets", "C_hi": "यह राजकोषीय घाटा लक्ष्य निर्धारित कर सकती है",
"answer": "B",
"explanation_en": "The statutory six-member MPC comprises three officials from RBI and three external experts appointed by the Government to fix the policy repo rate.",
"explanation_hi": "वैधानिक छह-सदस्यीय MPC में RBI के तीन अधिकारी और भारत सरकार द्वारा नियुक्त तीन बाहरी विशेषज्ञ होते हैं जो नीति रिपो दर निर्धारित करते हैं।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "When the RBI sells government securities through Open Market Operations, the immediate impact on banks is:",
"question_hi": "जब RBI खुले बाज़ार परिचालन के माध्यम से सरकारी प्रतिभूतियाँ बेचती है तो बैंकों पर तत्काल प्रभाव क्या होता है?",
"A_en": "Their lending capacity increases", "A_hi": "उनकी उधार क्षमता बढ़ती है",
"B_en": "Their cash reserves with RBI decrease", "B_hi": "RBI के पास उनके नकद भंडार घटते हैं",
"C_en": "Interest rates tend to fall", "C_hi": "ब्याज दरें गिरने की प्रवृत्ति रखती हैं",
"D_en": "Money supply in economy rises", "C_hi": "अर्थव्यवस्था में मुद्रा आपूर्ति बढ़ती है",
"answer": "B",
"explanation_en": "Sale of securities by RBI absorbs surplus liquidity from banks, reducing their cash reserves and ability to lend, thus contracting money supply.",
"explanation_hi": "RBI द्वारा प्रतिभूतियों की बिक्री से बैंकों की अतिरिक्त तरलता अवशोषित होती है, जिससे उनके नकद भंडार और उधार देने की क्षमता घटती है, जिससे मुद्रा आपूर्ति संकुचित होती है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Which of the following is the apex body in India that regulates monetary policy and the banking system?",
"question_hi": "भारत में मौद्रिक नीति और बैंकिंग प्रणाली को नियंत्रित करने वाला सर्वोच्च निकाय कौन-सा है?",
"A_en": "NITI Aayog", "A_hi": "निति आयोग",
"B_en": "Securities and Exchange Board of India", "B_hi": "भारतीय प्रतिभूति और विनिमय बोर्ड",
"C_en": "Reserve Bank of India", "C_hi": "भारतीय रिज़र्व बैंक",
"D_en": "Ministry of Finance", "C_hi": "वित्त मंत्रालय",
"answer": "C",
"explanation_en": "The Reserve Bank of India (RBI) is the country’s central bank and the supreme authority for formulating and implementing monetary policy.",
"explanation_hi": "भारतीय रिज़र्व बैंक (RBI) देश का केंद्रीय बैंक है और मौद्रिक नीति बनाने तथा लागू करने का सर्वोच्च निकाय है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "An increase in the Statutory Liquidity Ratio (SLR) forces banks to:",
"question_hi": "वैधानिक तरलता अनुपात (SLR) में वृद्धि बैंकों को बाध्य करती है:",
"A_en": "Reduce deposit rates", "A_hi": "जमा दरें घटाने के लिए",
"B_en": "Invest more in government securities", "B_hi": "सरकारी प्रतिभूतियों में अधिक निवेश करने के लिए",
"C_en": "Increase lending to retail customers", "C_hi": "खुदरा ग्राहकों को उधार ब