[
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Which of the following rates is NOT decided by the RBI under monetary policy?",
"question_hi": "मौद्रिक नीति के अंतर्गत निम्नलिखित में से कौन-सी दर आरबीआई द्वारा निर्धारित नहीं की जाती?",
"A_en": "Repo Rate", "A_hi": "रिपो दर",
"B_en": "Reverse Repo Rate", "B_hi": "रिवर्स रिपो दर",
"C_en": "Prime Lending Rate", "C_hi": "प्राइम लेंडिंग दर",
"D_en": "Marginal Standing Facility Rate", "C_hi": "मार्जिनल स्टैंडिंग सुविधा दर",
"answer": "C",
"explanation_en": "Prime Lending Rate (PLR) is decided by individual commercial banks, not by RBI.",
"explanation_hi": "प्राइम लेंडिंग दर (PLR) व्यक्तिगत वाणिज्यिक बैंकों द्वारा निर्धारित की जाती है, आरबीआई द्वारा नहीं।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "The Reserve Bank of India uses which of the following as the key policy rate to regulate liquidity in the economy?",
"question_hi": "आरबीआई अर्थव्यवस्था में तरलता को नियंत्रित करने के लिए निम्नलिखित में से किस दर को प्रमुख नीति दर के रूप में उपयोग करता है?",
"A_en": "Bank Rate", "A_hi": "बैंक दर",
"B_en": "Repo Rate", "B_hi": "रिपो दर",
"C_en": "Cash Reserve Ratio", "C_hi": "कैश रिज़र्व अनुपात",
"D_en": "Statutory Liquidity Ratio", "D_hi": "स्टैच्यूटरी लिक्विडिटी अनुपात",
"answer": "B",
"explanation_en": "Repo Rate is the key policy rate at which RBI lends short-term funds to banks and is used to signal the monetary policy stance.",
"explanation_hi": "रिपो दर वह प्रमुख नीति दर है जिस पर आरबीआई बैंकों को अल्पकालिक निधि उधार देता है और यह मौद्रिक नीति की स्थिति संकेतित करती है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "If RBI wants to reduce the money supply in the economy, which action will it most likely take?",
"question_hi": "यदि आरबीआई अर्थव्यवस्था में मुद्रा आपूर्ति को घटाना चाहता है, तो वह सबसे अधिक संभावित रूप से कौन-सा कदम उठाएगा?",
"A_en": "Decrease Repo Rate", "A_hi": "रिपो दर घटाएगा",
"B_en": "Increase Cash Reserve Ratio", "B_hi": "कैश रिज़र्व अनुपात बढ़ाएगा",
"C_en": "Decrease Reverse Repo Rate", "C_hi": "रिवर्स रिपो दर घटाएगा",
"D_en": "Decrease Bank Rate", "D_hi": "बैंक दर घटाएगा",
"answer": "B",
"explanation_en": "Increasing CRR forces banks to keep more deposits with RBI, reducing lendable resources and thus money supply.",
"explanation_hi": "CRR बढ़ने से बैंकों को अधिक जमा आरबीआई के पास रखनी पड़ती है, जिससे उधार देने योग्य धन घटता है और मुद्रा आपूर्ति कम होती है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Which monetary policy tool did RBI replace the earlier Benchmark Prime Lending Rate (BPLR) system with in 2010?",
"question_hi": "2010 में आरबीआई ने पूर्व बेंचमार्क प्राइम लेंडिंग दर (BPLR) प्रणाली को किस मौद्रिक नीति उपकरण से प्रतिस्थापित किया?",
"A_en": "Base Rate", "A_hi": "बेस दर",
"B_en": "MCLR", "A_hi": "MCLR",
"C_en": "Repo Linked Lending Rate", "C_hi": "रिपो से जुड़ी उधार दर",
"D_en": "Bank Rate", "D_hi": "बैंक दर",
"answer": "A",
"explanation_en": "Base Rate was introduced in July 2010 to replace the opaque BPLR system and ensure better transmission of policy rates.",
"explanation_hi": "जुलाई 2010 में अस्पष्ट BPLR प्रणाली को प्रतिस्थापित करने और नीति दरों के प्रभावी संचरण सुनिश्चित करने के लिए बेस दर लागू की गई।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "The first-ever Monetary Policy Committee (MPC) in India was constituted in which year?",
"question_hi": "भारत की पहली मौद्रिक नीति समिति (MPC) का गठन किस वर्ष किया गया?",
"A_en": "2014", "A_hi": "2014",
"B_en": "2015", "B_hi": "2015",
"C_en": "2016", "C_hi": "2016",
"D_en": "2017", "D_hi": "2017",
"answer": "C",
"explanation_en": "The MPC was set up in 2016 under the amended RBI Act to decide on policy repo rate with a mandate to keep inflation at 4±2%.",
"explanation_hi": "2016 में संशोधित आरबीआई अधिनियम के तहत MPC की स्थापना की गई ताकि नीति रिपो दर तय की जा सके और मुद्रास्फीति को 4±2% पर रखने का लक्ष्य दिया गया।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Which of the following is an example of a qualitative monetary policy tool used by RBI?",
"question_hi": "निम्नलिखित में से कौन आरबीआई द्वारा उपयोग किए जाने वाले गुणात्मक मौद्रिक नीति उपकरण का उदाहरण है?",
"A_en": "Open Market Operations", "A_hi": "खुले बाजार संचालन",
"B_en": "Consumer Credit Regulation", "B_hi": "उपभोक्ता ऋण विनियमन",
"C_en": "Cash Reserve Ratio", "C_hi": "कैश रिज़र्व अनुपात",
"D_en": "Statutory Liquidity Ratio", "D_hi": "स्टैच्यूटरी लिक्विडिटी अनुपात",
"answer": "B",
"explanation_en": "Consumer Credit Regulation (selective credit control) is a qualitative tool that influences specific sectors rather than overall money supply.",
"explanation_hi": "उपभोक्ता ऋण विनियमन (चयनात्मक ऋण नियंत्रण) एक गुणात्मक उपकरण है जो समग्र मुद्रा आपूर्ति के बजाय विशिष्ट क्षेत्रों को प्रभावित करता है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Under the current inflation targeting framework, who determines the inflation target for RBI?",
"question_hi": "वर्तमान मुद्रास्फीति लक्ष्यीकरण ढांचे के तहत आरबीआई के लिए मुद्रास्फीति लक्ष्य कौन तय करता है?",
"A_en": "RBI Governor", "A_hi": "आरबीआई गवर्नर",
"B_en": "Union Finance Minister", "B_hi": "केंद्रीय वित्त मंत्री",
"C_en": "Government of India", "C_hi": "भारत सरकार",
"D_en": "Monetary Policy Committee", "D_hi": "मौद्रिक नीति समिति",
"answer": "C",
"explanation_en": "The Central Government sets the inflation target (currently 4% with 2% band) in consultation with RBI once every five years.",
"explanation_hi": "केंद्र सरकार आरबीआई के साथ परामर्श से हर पाँच वर्ष में एक बार मुद्रास्फीति लक्ष्य (वर्तमान में 4% ±2%) निर्धारित करती है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "As of 2024, which of the following is the upper tolerance band for CPI inflation target set for RBI?",
"question_hi": "2024 तक, आरबीआई के लिए निर्धारित CPI मुद्रास्फीति लक्ष्य की उच्च सहनशीलता सीमा क्या है?",
"A_en": "5%", "A_hi": "5%",
"B_en": "5.5%", "B_hi": "5.5%",
"C_en": "6%", "C_hi": "6%",
"D_en": "7%", "D_hi": "7%",
"answer": "C",
"explanation_en": "The flexible inflation targeting framework allows CPI inflation in the 2-6% range, with 4% as the mid-point target.",
"explanation_hi": "लचीला मुद्रास्फीति लक्ष्यीकरण ढांचा CPI मुद्रास्फीति को 2-6% सीमा में अनुमति देता है, जिसमें 4% मध्य बिंदु लक्ष्य है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Which section of the RBI Act empowers the Central Government to give directions to RBI in public interest?",
"question_hi": "आरबीआई अधिनियम की कौन-सी धारा केंद्र सरकार को जनहित में आरबीआई को निर्देश देने का अधिकार देती है?",
"A_en": "Section 7", "A_hi": "धारा 7",
"B_en": "Section 21", "B_hi": "धारा 21",
"C_en": "Section 45", "B_hi": "धारा 45",
"D_en": "Section 58", "D_hi": "धारा 58",
"answer": "A",
"explanation_en": "Section 7 of the RBI Act, 1934 provides for the Central Government to issue directions to RBI after consultation with the Governor, if necessary.",
"explanation_hi": "आरबीआई अधिनियम, 1934 की धारा 7 केंद्र सरकार को आवश्यकता पड़ने पर गवर्नर से परामर्श के बाद आरबीआई को निर्देश जारी करने की अनुमति देती है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "The Standing Deposit Facility (SDF) was introduced by RBI in which year to absorb surplus liquidity without providing collateral?",
"question_hi": "स्टैंडिंग डिपॉजिट सुविधा (SDF) आरबीआई द्वारा बिना collateral के अतिरिक्त तरलता को अवशोषित करने के लिए किस वर्ष प्रारंभ की गई?",
"A_en": "2019", "A_hi": "2019",
"B_en": "2020", "B_hi": "2020",
"C_en": "2021", "C_hi": "2021",
"D_en": "2022", "D_hi": "2022",
"answer": "D",
"explanation_en": "RBI introduced SDF in April 2022 as an additional tool to absorb excess liquidity without collateral, replacing the fixed-rate reverse repo as the floor of LAF corridor.",
"explanation_hi": "आरबीआई ने अप्रैल 2022 में बिना collateral के अतिरिक्त तरलता को अवशोषित करने के लिए SDF को एक अतिरिक्त उपकरण के रूप में शुरू किया, जो LAF गलियारे के फ्लोर के रूप में निश्चित दर वाले रिवर्स रिपो को प्रतिस्थापित करता है।"
}
]