[
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Which of the following rates is also known as the policy rate of the Reserve Bank of India?",
"question_hi": "निम्नलिखित में से कौन-सी दर भारतीय रिज़र्व बैंक की नीति दर के रूप में भी जानी जाती है?",
"A_en": "Bank Rate", "A_hi": "बैंक दर",
"B_en": "Repo Rate", "B_hi": "रिपो दर",
"C_en": "Cash Reserve Ratio", "B_hi": "कैश रिज़र्व अनुपात",
"D_en": "Statutory Liquidity Ratio", "D_hi": "वैधानिक तरलता अनुपात",
"answer": "B",
"explanation_en": "Repo Rate is the key policy rate as it signals the RBI’s monetary policy stance.",
"explanation_hi": "रिपो दर प्रमुख नीति दर है क्योंकि यह आरबीआई की मौद्रिक नीति की दिशा दर्शाती है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "If RBI wants to reduce liquidity in the economy, which of the following actions will it most likely take?",
"question_hi": "यदि आरबीआई अर्थव्यवस्था में तरलता घटाना चाहता है, तो वह सबसे संभावित रूप से निम्नलिखित में से कौन-सा कदम उठाएगा?",
"A_en": "Decrease Repo Rate", "A_hi": "रिपो दर घटाएगा",
"B_en": "Decrease CRR", "B_hi": "सीआरआर घटाएगा",
"C_en": "Increase Reverse Repo Rate", "C_hi": "रिवर्स रिपो दर बढ़ाएगा",
"D_en": "Decrease Bank Rate", "D_hi": "बैंक दर घटाएगा",
"answer": "C",
"explanation_en": "Hiking Reverse Repo Rate encourages banks to park surplus funds with RBI, thus sucking out liquidity.",
"explanation_hi": "रिवर्स रिपो दर बढ़ाने से बैंक आरबीआई में अतिरिक्त निधि रखना पसंद करते हैं, जिससे तरलता सिकुड़ती है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Under which monetary policy framework does the RBI currently target inflation?",
"question_hi": "वर्तमान में आरबीआई किस मौद्रिक नीति ढांचे के तहत मुद्रास्फीति को लक्षित करता है?",
"A_en": "Multiple Indicator Approach", "A_hi": "बहु-सूचक उपागम",
"B_en": "Inflation Targeting Framework", "B_hi": "मुद्रास्फीति लक्ष्यीकरण ढांचा",
"C_en": "Monetary Aggregate Targeting", "C_hi": "मौद्रिक समष्टि लक्ष्यीकरण",
"D_en": "Exchange Rate Targeting", "D_hi": "विनिमय दर लक्ष्यीकरण",
"answer": "B",
"explanation_en": "Since 2016, RBI has formally adopted flexible inflation-targeting framework with 4% CPI target.",
"explanation_hi": "2016 से आरबीआई ने औपचारिक रूप से 4% सीपीआई लक्ष्य के साथ लचीला मुद्रास्फीति-लक्ष्यीकरण ढांचा अपनाया है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "The rate at which RBI lends long-term funds to banks against government securities is called:",
"question_hi": "वह दर जिस पर आरबीआई बैंकों को सरकारी प्रतिभूतियों के बदले दीर्घकालिक निधि देता है, कहलाती है:",
"A_en": "Repo Rate", "A_hi": "रिपो दर",
"B_en": "Marginal Standing Facility Rate", "B_hi": "मार्जिनल स्टैंडिंग सुविधा दर",
"C_en": "Bank Rate", "C_hi": "बैंक दर",
"D_en": "Base Rate", "D_hi": "आधार दर",
"answer": "C",
"explanation_en": "Bank Rate is charged for long-term accommodation without repo-style repurchase agreement.",
"explanation_hi": "बैंक दर पुनर्खरीद समझौते के बिना दीर्घकालिक सहायता के लिए ली जाती है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Which of the following is NOT a qualitative tool used by RBI under monetary policy?",
"question_hi": "निम्नलिखित में से कौन-सा आरबीआई द्वारा मौद्रिक नीति के तहत प्रयुक्त गुणात्मक उपकरण नहीं है?",
"A_en": "Margin Requirements", "A_hi": "मार्जिन आवश्यकताएँ",
"B_en": "Moral Suasion", "B_hi": "नैतिक प्रेरणा",
"C_en": "Selective Credit Control", "C_hi": "चयनात्मक ऋण नियंत्रण",
"D_en": "Open Market Operations", "D_hi": "खुले बाज़ार संचालन",
"answer": "D",
"explanation_en": "Open Market Operations are quantitative tools; the rest are qualitative measures.",
"explanation_hi": "ओपन मार्केट ऑपरेशन मात्रात्मक उपकरण हैं; शेष गुणात्मक उपाय हैं।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "The minimum daily maintenance of CRR since 2002 is what percentage of net demand and time liabilities?",
"question_hi": "2002 से सीआरआर की न्यूनतम दैनिक निर्वाह सीमा शुद्ध मांग और समय देनदारियों के कितने प्रतिशत है?",
"A_en": "90%", "A_hi": "90%",
"B_en": "85%", "B_hi": "85%",
"C_en": "80%", "C_hi": "80%",
"D_en": "70%", "D_hi": "70%",
"answer": "C",
"explanation_en": "RBI mandates an average daily CRR of 4% with a minimum of 80% on any day.",
"explanation_hi": "आरबीआई 4% औसत दैनिक सीआरआर अनिवार्य करता है, किसी भी दिन न्यूनतम 80% होना चाहिए।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Who heads the Monetary Policy Committee (MPC) that decides the policy repo rate in India?",
"question_hi": "भारत में नीति रिपो दर निर्धारित करने वाली मौद्रिक नीति समिति (एमपीसी) का नेतृत्व कौन करता है?",
"A_en": "Finance Minister", "A_hi": "वित्त मंत्री",
"B_en": "RBI Governor", "B_hi": "आरबीआई गवर्नर",
"C_en": "RBI Deputy Governor", "C_hi": "आरबीआई उप-गवर्नर",
"D_en": "Finance Secretary", "D_hi": "वित्त सचिव",
"answer": "B",
"explanation_en": "The RBI Governor is the ex-officio chairperson of the six-member MPC.",
"explanation_hi": "आरबीआई गवर्नर छह-सदस्यीय एमपीसी के पदेन अध्यक्ष होते हैं।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Under the Liquidity Adjustment Facility, the rate at which banks can borrow overnight from RBI against SLR securities is:",
"question_hi": "तरलता समायोजन सुविधा के तहत बैंक आरबीआई से एसएलआर प्रतिभूतियों के बदले रात्रिकालीन ऋण जिस दर पर ले सकते हैं, वह है:",
"A_en": "Repo Rate", "A_hi": "रिपो दर",
"B_en": "Reverse Repo Rate", "B_hi": "रिवर्स रिपो दर",
"C_en": "Marginal Standing Facility Rate", "C_hi": "मार्जिनल स्टैंडिंग सुविधा दर",
"D_en": "Bank Rate", "D_hi": "बैंक दर",
"answer": "C",
"explanation_en": "MSF allows banks to borrow up to 0.25% of NDTL at a penal rate above repo for overnight needs.",
"explanation_hi": "एमएसएफ बैंकों को रिपो दर से ऊपर दंड दर पर 0.25% तक एनडीटीएल के लिए रात्रिकालीन जरूरतों के लिए ऋण देता है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "Which statement is correct regarding the Cash Reserve Ratio?",
"question_hi": "कैश रिज़र्व अनुपात के संबंध में कौन-सा कथन सही है?",
"A_en": "Banks earn no interest on CRR balances", "A_hi": "बैंक सीआरआर शेष पर कोई ब्याज नहीं पाते",
"B_en": "CRR is maintained only in cash with RBI", "B_hi": "सीआरआर केवल आरबीआई के पास नकद रूप में रखा जाता है",
"C_en": "CRR can be maintained in gold form", "C_hi": "सीआरआर सोने के रूप में रखा जा सकता है",
"D_en": "CRR is decided by the Finance Ministry", "D_hi": "सीआरआर वित्त मंत्रालय द्वारा निर्धारित होता है",
"answer": "A",
"explanation_en": "CRR balances with RBI are interest-free; this is a key monetary control feature.",
"explanation_hi": "आरबीआई के पास रखा सीआरआर शेष ब्याज-रहित होता है; यह मौद्रिक नियंत्रण की एक प्रमुख विशेषता है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "As of 2024, the upper tolerance band for CPI inflation target set for RBI is:",
"question_hi": "2024 तक आरबीआई के लिए निर्धारित सीपीआई मुद्रास्फीति लक्ष्य की ऊपरी सहिष्णुता सीमा है:",
"A_en": "5%", "A_hi": "5%",
"B_en": "5.5%", "B_hi": "5.5%",
"C_en": "6%", "C_hi": "6%",
"D_en": "4.5%", "D_hi": "4.5%",
"answer": "C",
"explanation_en": "RBI has a flexible inflation target of 4% ±2%, making the upper limit 6%.",
"explanation_hi": "आरबीआई का 4% ±2% का लचीला मुद्रास्फीति लक्ष्य है, जिससे ऊपरी सीमा 6% होती है।"
}
]