[
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "What is the primary function of the Reserve Bank of India (RBI) under the Monetary Policy framework?",
"question_hi": "भारतीय रिज़र्व बैंक (आरबीआई) के तहत मौद्रिक नीति ढांचे के तहत आरबीआई का प्राथमिक कार्य क्या है?",
"A_en": "To regulate interest rates", "A_hi": "ब्याज दरों को नियंत्रित करना",
"B_en": "To control inflation", "B_hi": "विनियोग को नियंत्रित करना",
"C_en": "To manage the money supply", "C_hi": "रazor की आपूर्ति को प्रबंधित करना",
"D_en": "To stabilize the foreign exchange market", "D_hi": "विदेशी मुद्रा बाजार को स्थिर बनाना",
"answer": "C",
"explanation_en": "The RBI manages the money supply through various monetary policy tools such as open market operations, bank rate, and liquidity adjustment facility.",
"explanation_hi": "आरबीआई विभिन्न मौद्रिक नीति औजारों के माध्यम से पैसे आपूर्ति को प्रबंधित करता है, जैसे कि खुले बाजार कारोबार, बैंक दर, और तरलता समायोजन सुविधा।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "What is the Monetary Policy Committee (MPC) and what is its role in the RBI?",
"question_hi": "भारतीय रिज़र्व बैंक (आरबीआई) में मौद्रिक नीति समिति (एमपीसी) क्या है और इसकी भूमिका क्या है?",
"A_en": "A committee to advise the RBI Governor on monetary policy decisions", "A_hi": "आरबीआई गवर्नर को मौद्रिक नीति निर्णयों पर सलाह देने के लिए एक समिति",
"B_en": "A committee to implement monetary policy decisions", "B_hi": "मौद्रिक नीति निर्णयों को लागू करने के लिए एक समिति",
"C_en": "A committee to oversee the RBI's monetary policy framework", "C_hi": "आरबीआई के मौद्रिक नीति ढांचे को देखने के लिए एक समिति",
"D_en": "A committee to regulate interest rates", "D_hi": "ब्याज दरों को नियंत्रित करने के लिए एक समिति",
"answer": "C",
"explanation_en": "The MPC is responsible for overseeing the RBI's monetary policy framework and making decisions on key policy rates.",
"explanation_hi": "एमपीसी आरबीआई के मौद्रिक नीति ढांचे को देखने और मुख्य नीति दरों पर निर्णय लेने के लिए जिम्मेदार है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "What is the Liquidity Adjustment Facility (LAF) and how does it work?",
"question_hi": "तरलता समायोजन सुविधा (एलएफ) क्या है और यह कैसे काम करती है?",
"A_en": "A facility to provide liquidity to banks", "A_hi": "बैंकों को तरलता प्रदान करने की सुविधा",
"B_en": "A facility to absorb liquidity from banks", "B_hi": "बैंकों से तरलता अवशोषित करने की सुविधा",
"C_en": "A facility to regulate interest rates", "C_hi": "ब्याज दरों को नियंत्रित करने की सुविधा",
"D_en": "A facility to manage the money supply", "D_hi": "रazor की आपूर्ति को प्रबंधित करने की सुविधा",
"answer": "A",
"explanation_en": "The LAF is a facility provided by the RBI to banks to manage their liquidity needs, by providing or absorbing liquidity as required.",
"explanation_hi": "एलएफ आरबीआई द्वारा बैंकों को उनकी तरलता की आवश्यकताओं को प्रबंधित करने के लिए प्रदान की जाने वाली एक सुविधा है, जिसमें आवश्यकतानुसार तरलता प्रदान करना या अवशोषित करना शामिल है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "What is the repo rate and how does it affect the economy?",
"question_hi": "रेपो दर क्या है और यह अर्थव्यवस्था पर कैसे प्रभाव डालती है?",
"A_en": "The rate at which commercial banks borrow money from the RBI", "A_hi": "व्यावसायिक बैंक आरबीआई से पैसा उधार लेने की दर",
"B_en": "The rate at which commercial banks lend money to customers", "B_hi": "व्यावसायिक बैंक ग्राहकों को पैसा उधार देने की दर",
"C_en": "The rate at which the RBI borrows money from commercial banks", "C_hi": "आरबीआई व्यावसायिक बैंकों से पैसा उधार लेने की दर",
"D_en": "The rate at which the RBI lends money to commercial banks", "D_hi": "आरबीआई व्यावसायिक बैंकों को पैसा उधार देने की दर",
"answer": "A",
"explanation_en": "The repo rate is the rate at which commercial banks borrow money from the RBI, and it affects the economy by influencing interest rates and credit availability.",
"explanation_hi": "रेपो दर व्यावसायिक बैंक आरबीआई से पैसा उधार लेने की दर है, और यह अर्थव्यवस्था पर प्रभाव डालती है क्योंकि यह ब्याज दरों और ऋण उपलब्धता को प्रभावित करती है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "What is the Cash Reserve Ratio (CRR) and how does it affect the money supply?",
"question_hi": "कैश रिज़र्व रेश्यो (सीसीआर) क्या है और यह पैसे आपूर्ति पर कैसे प्रभाव डालती है?",
"A_en": "The ratio of cash reserves to total deposits held by commercial banks", "A_hi": "व्यावसायिक बैंकों द्वारा कैश रिज़र्व का अनुपात कुल जमा के साथ",
"B_en": "The ratio of cash reserves to total loans made by commercial banks", "B_hi": "व्यावसायिक बैंकों द्वारा कैश रिज़र्व का अनुपात कुल ऋण के साथ",
"C_en": "The rate at which commercial banks borrow money from the RBI", "C_hi": "व्यावसायिक बैंक आरबीआई से पैसा उधार लेने की दर",
"D_en": "The rate at which the RBI lends money to commercial banks", "D_hi": "आरबीआई व्यावसायिक बैंकों को पैसा उधार देने की दर",
"answer": "A",
"explanation_en": "The CRR is the ratio of cash reserves to total deposits held by commercial banks, and it affects the money supply by reducing the amount of money available for lending.",
"explanation_hi": "सीसीआर व्यावसायिक बैंकों द्वारा कैश रिज़र्व का अनुपात कुल जमा के साथ है, और यह पैसे आपूर्ति को प्रभावित करती है क्योंकि यह ऋण देने के लिए उपलब्ध पैसे की मात्रा को कम करती है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "What is the Statutory Liquidity Ratio (SLR) and how does it affect the economy?",
"question_hi": "स्टेट्यूटरी तरलता अनुपात (एसएलआर) क्या है और यह अर्थव्यवस्था पर कैसे प्रभाव डालती है?",
"A_en": "The ratio of liquid assets to total deposits held by commercial banks", "A_hi": "व्यावसायिक बैंकों द्वारा तरल संपत्ति का अनुपात कुल जमा के साथ",
"B_en": "The ratio of cash reserves to total loans made by commercial banks", "B_hi": "व्यावसायिक बैंकों द्वारा कैश रिज़र्व का अनुपात कुल ऋण के साथ",
"C_en": "The rate at which commercial banks borrow money from the RBI", "C_hi": "व्यावसायिक बैंक आरबीआई से पैसा उधार लेने की दर",
"D_en": "The rate at which the RBI lends money to commercial banks", "D_hi": "आरबीआई व्यावसायिक बैंकों को पैसा उधार देने की दर",
"answer": "A",
"explanation_en": "The SLR is the ratio of liquid assets to total deposits held by commercial banks, and it affects the economy by reducing the amount of money available for lending.",
"explanation_hi": "एसएलआर व्यावसायिक बैंकों द्वारा तरल संपत्ति का अनुपात कुल जमा के साथ है, और यह अर्थव्यवस्था पर प्रभाव डालती है क्योंकि यह ऋण देने के लिए उपलब्ध पैसे की मात्रा को कम करती है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "What is the Open Market Operations (OMO) and how does it affect the economy?",
"question_hi": "खुले बाजार कारोबार (ओएमओ) क्या है और यह अर्थव्यवस्था पर कैसे प्रभाव डालती है?",
"A_en": "A facility to provide liquidity to banks", "A_hi": "बैंकों को तरलता प्रदान करने की सुविधा",
"B_en": "A facility to absorb liquidity from banks", "B_hi": "बैंकों से तरलता अवशोषित करने की सुविधा",
"C_en": "A facility to regulate interest rates", "C_hi": "ब्याज दरों को नियंत्रित करने की सुविधा",
"D_en": "A facility to manage the money supply", "D_hi": "रazor की आपूर्ति को प्रबंधित करने की सुविधा",
"answer": "D",
"explanation_en": "The OMO is a facility provided by the RBI to manage the money supply by buying or selling government securities in the open market.",
"explanation_hi": "ओएमओ आरबीआई द्वारा सरकारी सुरक्षाओं को खुले बाजार में खरीदने या बेचने के माध्यम से पैसे आपूर्ति को प्रबंधित करने के लिए एक सुविधा है।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "What is the repo rate and reverse repo rate, and how do they affect the economy?",
"question_hi": "रेपो दर और रिवर्स रेपो दर क्या हैं और वे अर्थव्यवस्था पर कैसे प्रभाव डालती हैं?",
"A_en": "The rate at which commercial banks borrow money from the RBI and the rate at which the RBI borrows money from commercial banks", "A_hi": "व्यावसायिक बैंक आरबीआई से पैसा उधार लेने की दर और आरबीआई व्यावसायिक बैंकों से पैसा उधार लेने की दर",
"B_en": "The rate at which commercial banks lend money to customers and the rate at which customers lend money to commercial banks", "B_hi": "व्यावसायिक बैंक ग्राहकों को पैसा उधार देने की दर और ग्राहक व्यावसायिक बैंकों को पैसा उधार देने की दर",
"C_en": "The rate at which the RBI regulates interest rates and the rate at which the RBI absorbs liquidity from commercial banks", "C_hi": "आरबीआई ब्याज दरों को नियंत्रित करने की दर और आरबीआई व्यावसायिक बैंकों से तरलता अवशोषित करने की दर",
"D_en": "The rate at which the RBI lends money to commercial banks and the rate at which commercial banks lend money to the RBI", "D_hi": "आरबीआई व्यावसायिक बैंकों को पैसा उधार देने की दर और व्यावसायिक बैंक आरबीआई को पैसा उधार देने की दर",
"answer": "A",
"explanation_en": "The repo rate and reverse repo rate are the rates at which commercial banks borrow money from the RBI and the rate at which the RBI borrows money from commercial banks, respectively.",
"explanation_hi": "रेपो दर और रिवर्स रेपो दर व्यावसायिक बैंक आरबीआई से पैसा उधार लेने की दर और आरबीआई व्यावसायिक बैंकों से पैसा उधार लेने की दर हैं, क्रमशः।"
},
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "What is the Inflation Targeting (IT) framework and how does it work?",
"question_hi": "विनियोग लक्ष्यीकरण (आईटी) ढांचा क्या है और यह कैसे काम करता है?",
"A_en": "A framework to regulate inflation by setting a target inflation rate", "A_hi": "विनियोग को नियंत्रित करने के लिए एक ढांचा जिसमें एक विनियोग दर का लक्ष्य निर्धारित किया जाता है",
"B_en": "A framework to manage the money supply by regulating the money multiplier", "B_hi": "रazor की आपूर्ति को प्रबंधित करने के लिए एक ढांचा जिसमें पैसे का गुणक नियंत्रित किया जाता है",
"C_en": "A framework to regulate interest rates by setting a target interest rate", "C_hi": "ब्याज दरों को नियंत्रित करने के लिए एक ढांचा जिसमें एक व्याज दर का लक्ष्य निर्धारित किया जाता है",
"D_en": "A framework to absorb liquidity from commercial banks", "D_hi": "बैंकों से तरलता अवशोषित करने के लिए एक ढांचा",
"answer": "A",
"explanation_en": "The IT framework is a monetary policy framework that sets a target inflation rate and uses various tools to achieve it.",
"explanation_hi": "आईटी ढांचा एक मौद्रिक नीति ढांचा है जिसमें एक विनियोग दर का लक्ष्य निर्धारित किया जाता है और विभिन्न औजारों का उपयोग करके उसे प्राप्त किया जाता है।"
}