[
{
"subject": "Economy",
"topic": "RBI aur Monetary Policy",
"question_en": "What is the role of the Reserve Bank of India in implementing monetary policy?",
"question_hi": "रिवर्सिटी बैंक भारत के मॉनरीटरी का अधिकार क्या है?",
"A_en": "Regulates credit and currency supply",
"A_hi": "क्रिडिट और पैमान प्रदान करता है",
"B_en": "Issues banknotes and coins",
"B_hi": "बैंक नोटों और पैमानों को प्रदान करता है",
"C_en": "Monitors and regulates banking sector",
"C_hi": "बैंकिंग सेक्टेरो और प्रविभव करता है",
"D_en": "Evaluates and regulates credit, currency, and banking sector",
"D_hi": "क्रिडिट, पैमान और बैंकिंग सेक्टेरो की समझ्यांच्यांची व्ही बैंकिंग सेक्टेरो की समझ्यांची व्ही रियांच्यांची केंची व्ही रियांची समझ्यांची केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो की व्ही रियांची बैंकिंग सेक्टेरो की बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो की बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेक्टेरो केंची बैंकिंग सेरो केरो केंकिंग सेरो केरो",
Description: "Monetary policy",
"D_en": "बिंग सेरो केरो केरो",
"D_hi": "बिंकिंग सेरो केरो",

"question_en": "What is the role of the RBI in implementing monetary policy?",
"question_hi": "बिंकिंकिंग सेरो केरो केरो",
"answer_en": "बिंकिंग सेरो केरो",
"answer_hi": "बिंकिंग सेरो",
"explanation_en": "The Reserve Bank of India plays a crucial role in implementing monetary policy by formulating and implementing policies to control inflation and manage currency.",
"explanation_hi": "बिंकिंकिंकेरो केरो केरो",
"explanation_short_en": "RBI implements monetary policy to control inflation and manage currency.",
"explanation_short_hi": "बिंकिंकिंकेरो केरो केरो",
"question_short_en": "बिंकिंकिंकिंकिंरो केरो",
"question_short_hi": "बिंकिंकिंकेरो केरो",
"difficulty_level": "बिंकिंकिंकिंकिंरो केरो",
"difficulty_level_hi": "बिंकिंकिंकिंरो केरो किंकिंकिंकिंकिंरो केरो",
"question_en": "बांकिंकिंकिंरो किंकिंकिंकिंरो केरो",
"question_hi": "बांकिंकिंरो किंरो किंकिंरो",
"description": "बांकिंकिंरो किंचिंकिंरो किंरो",
"description_hi": "बांकिंकिंर