[
{
"subject": "Economy",
"topic": "Seva Kshetra ka Vikas",
"question_en": "What is the primary objective of the Self Employment Scheme launched by the Rajasthan government for the rural areas?",
"question_hi": "राजस्थान सरकारने राजमार्ग के लिए राज्य क्षेत्रों को प्रतिविकी का मूल उद्देश्य है।",
"A_en": "To provide employment opportunities to the unemployed youth.",
"A_hi": "यूरोजन के लिए अंकित संभवतियां प्रदान करने की मूल उद्देश्य है।",
"B_en": "To improve the quality of life in rural areas.",
"B_hi": "भूमियों में आधिकारी सेवा की करने की मूल उद्देश्य है।",
"C_en": "To promote entrepreneurship in rural areas.",
"C_hi": "भूमियों में आधिकारी सेवा की करने की मूल उद्देश्य है।",
"D_en": "To increase the production of agricultural products.",
"D_hi": "बौद्रिक उत्पदों को विकलाने की मूल उद्देश्य है।",
"question_en": "Which among the following measures is NOT implemented in Rajasthan for the development of rural areas?",
"question_hi": "राजस्थान में राजगार भूमिक प्रश्यामीन के लिए की मूल उद्देश्य है।",
"options_hi": [
{
"option_text": "राजस्थान में राजगार भूमिक प्रश्यामीन के लिए की मूल उद्देश्य है।",
"option_en": "The primary goal of providing employment opportunities in rural areas is not an initiative of the Rajasthan government.",
"correct": "क्षैमीन के लिए की मूल उद्देश्य है।",
"option_en": "The primary objective of the Krishi Kalyan mission is to provide employment opportunities in rural areas.",
"answer": "क्षैमीन के लिए की मूल उद्देश्य है।",
"option_hi": "Krishi Kalyan Mandal ka primary objective rural areas mein क्षैमिन ke liye कोणी के मूल उद्देश्य है।",
"answer": "क्षैमिन ke liye कोणी के मूल उद्देश्य है।",
"option_en": "The primary objective of the Self Employment Scheme is to provide self-employment opportunities in rural areas.",
"option_hi": "सीनी के मूल उद्देश्य है।",
"option_en": "The primary objective of the Rajasthan Urban Development Department (RDU) is to develop urban areas.",
"option_hi": "राजस्थान के मूल उद्देश्य है।",
"answer": "क्षतिके मूल उद्देश्य है।",
"option_en": "The primary objective of the Agriculture Department is to promote agro industries.",
"option_hi": "आगनी के मूल उद्देश्य है।",
"answer": "क्षतिके मूल उद्देश्य है।",
"option_en": "The primary goal of the Rajasthan Government is to develop the tourism sector.",
"option_hi": "राजसती के मूल उद्देश्य ही।",
"answer": "क्षी के मूल उद्दे्य ही।"]
}
]