[
{
"subject": "Economy",
"topic": "Seva Kshetra ka Vikas",
"question_en": "Which of the following sectors is the largest contributor to India's Gross Value Added (GVA) at current prices?",
"question_hi": "निम्नलिखित में से कौन-सा क्षेत्र वर्तमान कीमतों पर भारत के सकल मूल्य वर्धन (GVA) में सबसे बड़ा योगदानकर्ता है?",
"A_en": "Agriculture", "A_hi": "कृषि",
"B_en": "Industry", "B_hi": "उद्योग",
"C_en": "Services", "C_hi": "सेवा",
"D_en": "Mining", "D_hi": "खनन",
"answer": "C",
"explanation_en": "The Services sector consistently accounts for more than 50% of India’s GVA, making it the largest contributor.",
"explanation_hi": "सेवा क्षेत्र लगातार भारत के GVA का 50% से अधिक हिस्सा देता है, जिससे यह सबसे बड़ा योगदानकर्ता बनता है।"
},
{
"subject": "Economy",
"topic": "Seva Kshetra ka Vikas",
"question_en": "The term ‘tertiary sector’ is another name for which economic sector?",
"question_hi": "'तृतीयक क्षेत्र' शब्द किस आर्थिक क्षेत्र का दूसरा नाम है?",
"A_en": "Primary sector", "A_hi": "प्राथमिक क्षेत्र",
"B_en": "Secondary sector", "B_hi": "द्वितीयक क्षेत्र",
"C_en": "Services sector", "C_hi": "सेवा क्षेत्र",
"D_en": "Manufacturing sector", "D_hi": "विनिर्माण क्षेत्र",
"answer": "C",
"explanation_en": "The tertiary sector, also called the services sector, deals with intangible goods like banking, education, and tourism.",
"explanation_hi": "तृतीयक क्षेत्र, जिसे सेवा क्षेत्र भी कहा जाता है, बैंकिंग, शिक्षा और पर्यटन जैसी अमूर्त वस्तुओं से संबंधित होता है।"
},
{
"subject": "Economy",
"topic": "Seva Kshetra ka Vikas",
"question_en": "Which service industry in India has the highest share in the services export basket?",
"question_hi": "भारत में कौन-सी सेवा उद्योग सेवा निर्यात टोकरी में सबसे अधिक हिस्सेदारी रखती है?",
"A_en": "Travel & Hospitality", "A_hi": "यात्रा और आतिथ्य",
"B_en": "Software & IT services", "B_hi": "सॉफ्टवेयर और आईटी सेवाएँ",
"C_en": "Financial services", "B_hi": "वित्तीय सेवाएँ",
"D_en": "Health services", "D_hi": "स्वास्थ्य सेवाएँ",
"answer": "B",
"explanation_en": "Software and IT services dominate India’s services exports, contributing about 45-50% of the total.",
"explanation_hi": "सॉफ्टवेयर और आईटी सेवाएँ भारत के सेवा निर्यात पर हावी हैं, कुल का लगभग 45-50% योगदान देती हैं।"
},
{
"subject": "Economy",
"topic": "Seeva Kshetra ka Vikas",
"question_en": "What percentage of India’s total workforce was employed in the services sector as per the Periodic Labour Force Survey (PLFS) 2022-23?",
"question_hi": "आवधिक श्रम बल सर्वेक्षण (PLFS) 2022-23 के अनुसार भारत की कुल श्रमशक्ति का कितना प्रतिशत सेवा क्षेत्र में रोज़गारित था?",
"A_en": "About 20%", "A_hi": "लगभग 20%",
"B_en": "About 32%", "B_hi": "लगभग 32%",
"C_en": "About 45%", "B_hi": "लगभग 45%",
"D_en": "About 55%", "D_hi": "लगभग 55%",
"answer": "B",
"explanation_en": "PLFS 2022-23 estimates place services-sector employment at roughly 32% of India’s workforce.",
"explanation_hi": "PLFS 2022-23 के अनुमान के अनुसार सेवा क्षेत्र में रोज़गार भारत की श्रमशक्ति का लगभग 32% है।"
},
{
"subject": "Economy",
"topic": "Seva Kshetra ka Vikas",
"question_en": "Which initiative was launched to promote services exports from India with a focused export strategy?",
"question_hi": "भारत से सेवा निर्यात को एक केंद्रित निर्यात रणनीति के साथ बढ़ावा देने के लिए कौन-सी पहल शुरू की गई थी?",
"A_en": "Make in India", "A_hi": "मेक इन इंडिया",
"B_en": "Services Exports from India Scheme (SEIS)", "B_hi": "सेवा निर्यात से भारत योजना (SEIS)",
"C_en": "Stand-Up India", "D_hi": "स्टैंड-अप इंडिया",
"D_en": "Digital India", "D_hi": "डिजिटल इंडिया",
"answer": "B",
"explanation_en": "SEIS, under the Foreign Trade Policy, incentivizes services exports through duty credit scrips.",
"explanation_hi": "विदेशी व्यापार नीति के तहत SEIS ड्यूटी क्रेडिट स्क्रिप्स के माध्यम से सेवा निर्यात को प्रोत्साहन देती है।"
},
{
"subject": "Economy",
"topic": "Seva Kshetra ka Vikas",
"question_en": "Which city is recognized as India’s leading financial services hub in terms of market capitalization of listed companies?",
"question_hi": "किस शहर को सूचीबद्ध कंपनियों के बाजार पूँजीकरण के मामले में भारत का प्रमुख वित्तीय सेवा केंद्र माना जाता है?",
"A_en": "New Delhi", "A_hi": "नई दिल्ली",
"B_en": "Mumbai", "B_hi": "मुंबई",
"C_en": "Bengaluru", "B_hi": "बेंगलुरु",
"D_en": "Chennai", "D_hi": "चेन्नई",
"answer": "B",
"explanation_en": "Mumbai houses the Bombay Stock Exchange and the Reserve Bank of India, making it the country’s financial capital.",
"explanation_hi": "मुंबई में बॉम्बे स्टॉक एक्सचेंज और भारतीय रिज़र्व बैंक है, जिससे यह देश की वित्तीय राजधानी बनती है।"
},
{
"subject": "Economy",
"topic": "Seva Kshetra ka Vikas",
"question_en": "Which of the following best explains the growth of the IT-BPM industry in India?",
"question_hi": "भारत में आईटी-बीपीएम उद्योग की वृद्धि का सबसे अच्छा कारण कौन-सा है?",
"A_en": "Abundant coal reserves", "A_hi": "प्रचुर कोयला भंडार",
"B_en": "Large pool of skilled English-speaking workforce", "B_hi": "दक्ष अंग्रेज़ी बोलने वाले श्रमशक्ति का बड़ा पूल",
"C_en": "High import tariffs", "B_hi": "उच्च आयात शुल्क",
"D_en": "Government mining policy", "D_hi": "सरकार की खनन नीति",
"answer": "B",
"explanation_en": "India’s comparative advantage lies in its cost-effective, English-speaking technical talent that fuels IT-BPM exports.",
"explanation_hi": "भारत की तुलनात्मक बढ़त लागत-प्रभावी, अंग्रेज़ी बोलने वाली तकनीकी प्रतिभा में है जो आईटी-बीपीएम निर्यात को बढ़ावा देती है।"
},
{
"subject": "Economy",
"topic": "Seva Kshetra ka Vikas",
"question_en": "The Insurance Regulatory and Development Authority of India (IRDAI) falls under which service sub-sector?",
"question_hi": "भारतीय बीमा नियामक और विकास प्राधिकरण (IRDAI) किस सेवा उप-क्षेत्र के अंतर्गत आता है?",
"A_en": "Transport services", "A_hi": "परिवहन सेवाएँ",
"B_en": "Financial services", "B_hi": "वित्तीय सेवाएँ",
"C_en": "Telecommunication services", "B_hi": "दूरसंचार सेवाएँ",
"D_en": "Health services", "D_hi": "स्वास्थ्य सेवाएँ",
"answer": "B",
"explanation_en": "IRDAI regulates the insurance industry, which is a component of financial services.",
"explanation_hi": "IRDAI बीमा उद्योग को नियंत्रित करता है, जो वित्तीय सेवाओं का एक भाग है।"
},
{
"subject": "Economy",
"topic": "Seva Kshetra ka Vikas",
"question_en": "Which index is prepared by the Reserve Bank of India to measure activity in the services sector?",
"question_hi": "भारतीय रिज़र्व बैंक द्वारा सेवा क्षेत्र की गतिविधि मापने के लिए कौन-सा सूचकांक तैयार किया जाता है?",
"A_en": "Services PMI", "A_hi": "सेवा पीएमआई",
"B_en": "IIP", "B_hi": "IIP",
"C_en": "CPI", "D_hi": "CPI",
"D_en": "WPI", "D_hi": "WPI",
"answer": "A",
"explanation_en": "The Services Purchasing Managers’ Index (PMI) is the headline indicator tracked monthly to gauge services activity.",
"explanation_hi": "सेवा खरीद प्रबंधक सूचकांक (PMI) एक प्रमुख संकेतक है जिसे हर महीने सेवा गतिविधि का आकलन करने के लिए ट्रैक किया जाता है।"
},
{
"subject": "Economy",
"topic": "Seva Kshetra ka Vikas",
"question_en": "Which of the following is classified under community, social & personal services in India’s GDP calculations?",
"question_hi": "भारत के GDP गणना में निम्नलिखित में से किसे सामुदायिक, सामाजिक और व्यक्तिगत सेवाओं के अंतर्गत वर्गीकृत किया जाता है?",
"A_en": "Banking", "A_hi": "बैंकिंग",
"B_en": "Public administration and defence", "B_hi": "लोक प्रशासन और रक्षा",
"C_en": "Software exports", "B_hi": "सॉफ्टवेयर निर्यात",
"D_en": "Hotel & restaurants", "D_hi": "होटल और रेस्तरां",
"answer": "B",
"explanation_en": "Public administration, defence, and other government services are grouped under community, social & personal services.",
"explanation_hi": "लोक प्रशासन, रक्षा और अन्य सरकारी सेवाओं को सामुदायिक, सामाजिक और व्यक्तिगत सेवाओं के अंतर्गत समूहित किया जाता है।"
}
]