[
{
"subject": "Economy",
"topic": "Sustainable Development aur SDGs ka Parichay",
"question_en": "What is sustainable development and how does it relate to the United Nations Sustainable Development Goals (SDGs)?",
"question_hi": "स्वर्गीय विकास और कैसे यूनीत्यंत्रित आर्थिक स्वर्गीय विकास aur SDGs के विशाल मंत्रित आर्थिक स्वर्गीय विकास (संतुलनीय विकास क्या है और कैसे SDGs (संतुलनीय विकास aur SDGs ka relation kya hai?",
"options": [
{
"option_en": "संतुलनीय विकास",
"option_hi": "संतुलनीय विकास (संतुलनीय विकास केंसेवाले संतुलनीय विकास क्या है और कैसे SDGs (संतुलनीय विकास केंसेवाले संतुलनीय विकास क्या है और कैसे SDGs (संतुलनीय विकास केंसेवाले संतुलनीय विकास क्या है और कैसे SDGs (संतुलनीय विकास केंसेवाले संतुलनीय विकास (संतुलनीय विकास केंसेवाले संतुलनीय विकास केंसेवाले संतुलनीय विकास (संतुलनीय विकास केंसेवाले संतुलनीय विकास (संतुलनीय विकास केंसेवाले संतुलनीय विकास (संतुलनीय विकास केंसेवाले संतुलनीय विकास (संतुलनीय विकास केंसेवाले संतुलनीय विकास (संतुलनीय विकास केंसेवाले संतुलनीय विकास (संतुलनीय विकास केंसेवाले संतुलनीय विकास (संतुलनीय विकास केंसेवाले संतुलनीय विकास (संतुलनीय विकास केंसेवाले संतुलनीय विकास (संतुलनीय विकास केंसेवाले संतुलनीय विकास (संतुलनीय विकास केंसीय विकास (संतुलनीय विकास)",
Question_en: Sustainable Development aur SDGs ka Parichay aur SDGs ka Parichay (संतुलनीय विकास केंस)",
"option_hi": [
{
"option_en": [
"option_en": [
"option_hi": [
{
"option_en": "संतुलनीय विकास केंस",
"option_hi": "संतुलनीय विकास aur संतुलनीय विकास",
{
"option_hi": "संतुलनीय विकास",
{
"option_en": "संतुलनय विकास",
"option_hi": "संतुलनीय विकास",
"option_en": "संतुलनीय विकास",
"option_hi": "संतुलनीय विकास",
"option_en": "संतुलनीय विकास",
"option_hi": "संतुलनीय विकास",
"option_en": "संतुलनीय विकास",
"option_hi": "संतुलनीय विकास",
"option_en": "संतुलनीय विकास",
"answer": "संतुलनीय विकास",
"explanation_en": "संतुलनीय विकास",
"explanation_hi": "संतुलनीय विकास",
"explanation_en": "संतुलनीय विकास",
"explanation_hi": "संतुलनीय विकास",
"question_en": "What is the role of sustainable development in achieving the United Nations Sustainable Development Goals (SDGs)?",
"question_hi": "संतुलनय विकास संतुलनीय विकास",
"option_en": "संतुलनीय विकास",
"option_hi": "संतुलनय विकास",
"option_en": "संतुलनीय