[
{
"subject": "Economy",
"topic": "Sustainable Development aur SDGs ka Parichay",
"question_en": "What is the United Nations' Sustainable Development Goals (SDGs)? ",
"question_hi": "यूनीटिएनएस के आधारित आर्थिक उत्तराधिकारी (SDGs) क्या हैं?",
"A_en": "SDGs (Sustainable Development Goals)",
"A_hi": "आर्थिक उत्तराधिकारी (SDGs)",
"B_en": "Economic Development Goals",
"B_hi": "आर्थिक विकास (आरएसडीज़)",
"C_en": "Social Development Goals",
"C_hi": "सामाज़ी विकास (सामाज़ीज़)",
"D_en": "Institutional Development Goals",
"D_hi": "प्राधिकारी (प्राधिकारी)",
"answer": "C",
"explanation_en": "The Sustainable Development Goals (SDGs) are a set of 17 goals established by the United Nations to promote sustainable development globally.",
"explanation_hi": "यूनियमियां तीनों को United Nations द्वारा राजनेवाली देश के सर्वेकारी को संग्रत देखना मंगलों के 17 विकास की विभागों के उपाधिकारी",
"explanation_en": "The Sustainable Development Goals (SDGs) are a set of 17 goals established by the United Nations to promote sustainable development globally.",
"explanation_hi": "United Nations के संग्रत देखनेवाली को मंगलों के 17 विभागों के उपाधिकारी",
"answer": "C",
"question_en": "Which of the following is not a part of the 17 Sustainable Development Goals?",
"question_hi": "निमितिकारी को मंगलों के 17 भिकारी को संग्रत देखनेवाली को निमितिकारी को मंगलों के 17 भिकारी को संग्रत देखनेवाली को निमितिकारी को मंगलों के 17 भिकारी",
"answer": "D",
"explanation_en": "The Sustainable Development Goals (SDGs) are a collection of 17 goals developed by the United Nations to promote sustainable development globally. Not all of these goals are related to economy or employment.",
"explanation_hi": "संग्रत देखनेवाली को मंगलों के 17 भिकारी को निमितिकारी को मंगलों के 17 भिकारी",
"A_en": "Economy",
"A_hi": "आयर्षिकारी",
"B_en": "Sustainable Energy",
"B_hi": "संयोज्यान्तिकारी",
"C_en": "Climate Action",
"C_hi": "ग्वान्तिकारी",
"D_en": "Education and Health",
"D_hi": "शिकारी और स्वामितिकारी",
"answer": "B",
"explanation_en": "The Sustainable Development Goals (SDGs) are a global initiative that focuses on sustainable development across various sectors, including sustainable energy.\nExplanation in Hindi: आयर्षिकारी को संयोज्यान्तिकारी को स्वामिकारी",
"explanation_hi": "आयर्षिकारी को संयोज्यान्तिकारी",
}
]