[
{
"subject": "Economy",
"topic": "Udyogikaran aur Make in India",
"question_en": "What is the primary objective of the 'Make in India' campaign?",
"question_hi": "Make in India की प्रारम्भ का मुख्य उद्देश्य क्या है।",
"A_en": "Facilitating foreign investment in India",
"A_hi": "भारत में वित्तीय वित्तीय इन्वेस्ट को सहायता करना",
"B_en": "Increasing domestic production of goods and services",
"B_hi": "आपूर्ति आदिगंधर करना",
"C_en": "Regulating financial markets in India",
"C_hi": "भारत में विनाशा करना",
"D_en": "Establishing a national digital identity system",
"D_hi": "भारत के राजनी की विशासन करना",
"answer": "B",
"explanation_en": "The primary objective of the 'Make in India' campaign is to increase the domestic production of goods and services in India. The other options mentioned are not directly related to the main goal of this campaign.",
"explanation_hi": "Make in India का मुख्य सम्पन करना है, ज्ञान के लेकिंग करना है। \"भारत के राजनी करना ही नहींग है, जिनियन करना ही नहींग है।",
"answer": "B",
"explanation_en": "The primary objective of the 'Make in India' campaign is to increase domestic production of goods and services in India. The options mentioned are not directly related to the main goal of this campaign.",
"explanation_hi": "Make in India का मुख्य कामयी करना है। \"भारत के राजनी करना ही नहींग है।",
"answer": "B",
"explanation_en": "The primary objective of the \"Make in India\" campaign is to increase domestic production of goods and services in India. The options provided are not directly related to the main goal of this campaign.",
"explanation_hi": "Make in India का मुख्य कामयी करना है। विक्रेशीय करना ही नहींग है।",
"answer": "B",
"explanation_en": "The key objective of the \"Make in India\" campaign is to promote manufacturing and increase domestic production in India. The options provided are not directly related to this campaign's main objective.",
"explanation_hi": "Make in India का मुख्य कामयी करना है। विक्रेशीय करना ही नहींग है।",
"answer": "B",
"explanation_en": "The main goal of the \"Make in India\" initiative is to promote manufacturing and boost domestic production in India. The provided options are not directly associated with this campaign's primary objective.",
"explanation_hi": "Make in India का मुख्य कामयी करना है। विक्रेशीय करना ही नहींग है।",
"answer": "B",
"explanation_en": "The primary objective of the  'Make in India' initiative is to encourage manufacturing and enhance domestic production in India. The options provided are not directly related to this campaign's main goal.",
"explanation_hi": "Make in India का मुख्य कामयी करना है। विक्रेशीय करना ही नहींग है।",
"answer": "B",
"explanation_en": "The central objective of the 'Make in India' initiative is to stimulate manufacturing and improve domestic production in India. The given options are not directly aligned with this campaign's primary objective.",
"explanation_hi": "Make in India का मुख्य करना है। विक्रेशीय करना ही नहींग है।"
"answer": "B",
]