[
{
"subject": "Economy",
"topic": "Udyogikaran aur Make in India",
"question_en": "What is the main objective of 'Make in India' campaign?",
"question_hi": "मैं के कार्यालय से ज्ञान क्या है?",
"A_en": "Increase foreign investment in India",
"A_hi": "इस्लामी बार्मिंग के लिए काम करना है",
"B_en": "Improve the ease of doing business in India",
"B_hi": "भारत में काम करने के लिए काम करना है",
"C_en": "Increase employment opportunities in India",
"C_hi": "भारत में कामों की संखलता करने के लिए काम करना है",
"D_en": "Increase India's industrial production",
"D_hi": "भारत के निकटिस्तानों कामयां करने के लिए काम करना है",
"E_en": "Promote Indian goods and services in international markets",
"E_hi": "भारतीय वस्तूँ और सहमतियाँ करने के लिए काम करना है",
"F_en": "Increase employment opportunities in India",
"F_hi": "भारत में काम करने के लिए काम करना है",
"G_en": "Increase the export of Indian goods",
"G_hi": "भारतीय वस्तूँ काम करने के लिए काम करना है",
"H_en": "Fostering innovation and entrepreneurship in India",
"H_hi": "भारतीय परिवारिक और स्पद्यारक मंत्रिता को प्रबंधन करने के लिए काम करना है",
"I_en": "Improve the economy of India",
"I_hi": "भारत की आन्तर्यारक को प्रबंधन करने के लिए काम करना है",
"J_en": "Increase foreign investments in India",
"J_hi": "भारतीय वित्तीय इकाई को प्रबंधन करने के लिए काम करना होगी",
"K_en": "Support innovation and entrepreneurship in India",
"K_hi": "भारत में इन्त्यकान्तीय इकाई को प्रबंधन करने के लिए काम करना होगी",
"L_en": "Promote scientific research and development in India",
"L_hi": "भारत में पैंचरण और पर्वर्त्यकान्तीय इन्त्यचार्डन को प्रबंधन करने के लिए काम करना होगे",
"question_en": "What is the primary objective of the 'Make in India' campaign?",
"question_hi": "माउन इन्त्यचार्डन काम करने के लिए काम करने के लिए काम करना होगे",
"options": [
{
"option_en": [
{
"option_text": "Improve the infrastructure in India",
"option_title": "भारंदनचारं इन्त्यचारं इननखारंडनचारं इन्यचारं इनखारं इनत्यचारं इनखारं इन्यचारं इनखारं इन्यचारं इन्यचारं इनत्यिनखारं इनत्यचारं इनखारं इन्यचारं इनखारं इन्यचारं इनखारं इन्यचारं इनखारं इनखारं इन्यचारं इन्यचारं इनखारं इनखारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इ्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इ्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इन्यचारं इ्यचारं इन्यचारं इन्यचारं इन्यचा