[
{
"subject": "Economy",
"topic": "Udyogikaran aur Make in India",
"question_en": "Which sector was given the highest priority under the 'Make in India' campaign launched in 2014?",
"question_hi": "2014 में शुरू किए गए 'मेक इन इंडिया' अभियान के तहत किस क्षेत्र को सर्वोच्च प्राथमिकता दी गई थी?",
"A_en": "Agriculture", "A_hi": "कृषि",
"B_en": "Manufacturing", "B_hi": "उत्पादन (विनिर्माण)",
"C_en": "Services", "B_hi": "सेवाएँ",
"D_en": "Mining", "D_hi": "खनन",
"answer": "B",
"explanation_en": "The Make in India campaign primarily targeted manufacturing to raise its share in GDP from ~16% to 25% and create 100 million additional jobs by 2022.",
"explanation_hi": "मेक इन इंडिया अभियान मुख्यतः विनिर्माण क्षेत्र को लक्षित करता है ताकि इसे GDP में हिस्सेदारी ~16% से बढ़ाकर 25% की जा सके और 2022 तक 10 करोड़ अतिरिक्त रोज़गार सृजित हों।"
},
{
"subject": "Economy",
"topic": "Udyogikiran aur Make in India",
"question_en": "Under the Make in India initiative, what does the acronym 'FDI' first stand for?",
"question_hi": "मेक इन इंडिया पहल के अंतर्गत संक्षिप्त नाम 'FDI' सबसे पहले किसके लिए प्रयुक्त होता है?",
"A_en": "Foreign Direct Investment", "A_hi": "प्रत्यक्ष विदेशी निवेश",
"B_en": "Fast Developing Industry", "B_hi": "त्वरित विकासशील उद्योग",
"C_en": "Federal Development Index", "C_hi": "संघीय विकास सूचकांक",
"D_en": "Fiscal Distribution Initiative", "D_hi": "राजकोषीय वितरण पहल",
"answer": "A",
"explanation_en": "FDI (Foreign Direct Investment) liberalization was a core plank of Make in India to attract global capital into Indian manufacturing.",
"explanation_hi": "एफडीआई (प्रत्यक्ष विदेशी निवेश) में उदारीकरण मेक इन इंडिया का मुख्य आधार था ताकि भारतीय विनिर्माण में वैश्विक पूंजी आकर्षित की जा सके।"
},
{
"subject": "Economy",
"topic": "Udyogikiran aur Make in India",
"question_en": "Which of the following defence items was FIRST moved from the licensed to the open category under Make in India to boost domestic production?",
"question_hi": "मेक इन इंडिया के तहत घरेलू उत्पादन को बढ़ावा देने के लिए निम्नलिखित में से किस रक्षा वस्तु को पहली बार लाइसेंस श्रेणी से खुली श्रेणी में स्थानांतरित किया गया?",
"A_en": "Artillery guns", "A_hi": "आर्टिलरी बंदूकें",
"B_en": "Transport aircraft", "B_hi": "परिवहन विमान",
"C_en": "Drone components", "C_hi": "ड्रोन घटक",
"D_en": "Radars", "D_hi": "राडार",
"answer": "A",
"explanation_en": "In 2014 the government delisted artillery guns (155 mm) from the defence licence list, allowing private firms to produce without prior approval.",
"explanation_hi": "2014 में सरकार ने 155 मिमी आर्टिलरी बंदूकों को रक्षा लाइसेंस सूची से हटा दिया, जिससे निजी कंपनियाँ पूर्व अनुमोदन के बिना उत्पादन कर सकती हैं।"
},
{
"subject": "Economy",
"topic": "Udyogikiran aur Make in India",
"question_en": "As per the Make in India Action Plan 2021, the maximum incentive under the PLI scheme for large-scale electronics manufacturing is:",
"question_hi": "2021 के मेक इन इंडिया एक्शन प्लान के अनुसार बड़े पैमाने पर इलेक्ट्रॉनिक्स विनिर्माण के लिए PLI योजना के अंतर्गत अधिकतम प्रोत्साहन है:",
"A_en": "2% of incremental sales", "A_hi": "वृद्धिशील बिक्री का 2%",
"B_en": "4% of incremental sales", "B_hi": "वृद्धिशील बिक्री का 4%",
"C_en": "6% of incremental sales", "C_hi": "वृद्धिशील बिक्री का 6%",
"D_en": "8% of incremental sales", "D_hi": "वृद्धिशील बिक्री का 8%",
"answer": "C",
"explanation_en": "The PLI scheme offers an incentive of 6% on incremental sales of goods manufactured in India for the first two years, tapering thereafter.",
"explanation_hi": "PLI योजना पहले दो वर्षों में भारत में निर्मित वस्तुओं की वृद्धिशील बिक्री पर 6% प्रोत्साहन देती है, जिसके बाद धीरे-धीरे कम हो जाती है।"
},
{
"subject": "Economy",
"topic": "Udyogikiran aur Make in India",
"question_en": "Which state hosts the maximum number of operational Special Economic Zones (SEZs) linked to Make in India as of 2023?",
"question_hi": "2023 तक मेक इन इंडिया से जुड़े अधिकतम संचालित विशेष आर्थिक क्षेत्र (SEZ) किस राज्य में हैं?",
"A_en": "Gujarat", "A_hi": "गुजरात",
"B_en": "Tamil Nadu", "B_hi": "तमिलनाडु",
"C_en": "Maharashtra", "C_hi": "महाराष्ट्र",
"D_en": "Karnataka", "D_hi": "कर्नाटक",
"answer": "A",
"explanation_en": "Gujarat leads with over 30 notified and functional SEZs, leveraging ports and policy stability to attract Make in India units.",
"explanation_hi": "गुजरात 30 से अधिक अधिसूचित व कार्यशील SEZ के साथ अग्रणी है, जो बंदरगाहों और नीति स्थिरता के कारण मेक इन इंडिया इकाइयों को आकर्षित करता है।"
},
{
"subject": "Economy",
"topic": "Udyogikiran aur Make in India",
"question_en": "Which one of the following is NOT a pillar of the Make in India programme?",
"question_hi": "निम्नलिखित में से कौन-सा मेक इन इंडिया कार्यक्रम का स्तंभ (pillar) नहीं है?",
"A_en": "New Processes", "A_hi": "नई प्रक्रियाएँ",
"B_en": "New Infrastructure", "B_hi": "नया अवसंरचना",
"C_en": "New Sectors", "C_hi": "नए क्षेत्र",
"D_en": "New Currency", "D_hi": "नई मुद्रा",
"answer": "D",
"explanation_en": "Make in India rests on 4 pillars: New Processes, New Infrastructure, New Sectors and New Mindset; currency is irrelevant.",
"explanation_hi": "मेक इन इंडिया 4 स्तंभों—नई प्रक्रियाएँ, नई अवसंरचना, नए क्षेत्र और नई सोच—पर आधारित है; मुद्रा इससे संबंधित नहीं है।"
},
{
"subject": "Economy",
"topic": "Udyogikiran aur Make in India",
"question_en": "The 'Make in India Week' was first celebrated in which city?",
"question_hi": "'मेक इन इंडिया सप्ताह' पहली बार किस शहर में मनाया गया?",
"A_en": "New Delhi", "A_hi": "नई दिल्ली",
"B_en": "Mumbai", "B_hi": "मुंबई",
"C_en": "Bengaluru", "C_hi": "बेंगलुरु",
"D_en": "Pune", "D_hi": "पुणे",
"answer": "B",
"explanation_en": "The first-ever Make in India Week was held in Mumbai, Maharashtra from 13-18 February 2016.",
"explanation_hi": "पहला मेक इन इंडिया सप्ताह 13-18 फरवरी 2016 को मुंबई, महाराष्ट्र में आयोजित किया गया।"
},
{
"subject": "Economy",
"topic": "Udyogikiran aur Make in India",
"question_en": "Which of the following industrial corridors is aligned with the Delhi-Mumbai Make in India zone?",
"question_hi": "निम्नलिखित में से कौन-सा औद्योगिक गलियारा दिल्ली-मुंबई मेक इन इंडिया क्षेत्र के अनुरूप है?",
"A_en": "Amritsar-Kolkata", "A_hi": "अमृतसर-कोलकाता",
"B_en": "Chennai-Bengaluru", "B_hi": "चेन्नई-बेंगलुरु",
"C_en": "Western Dedicated Freight Corridor", "C_hi": "पश्चिमी समर्पित माल गलियारा",
"D_en": "East Coast Economic Corridor", "C_hi": "ईस्ट कोस्ट इकोनॉमिक गलियारा",
"answer": "C",
"explanation_en": "The 1504-km Western DFC runs from Dadri (UP) to Jawaharlal Nehru Port (Mumbai), forming the logistics spine of the Delhi-Mumbai Industrial Corridor.",
"explanation_hi": "1504 किमी लंबा पश्चिमी DFC दादरी (उप्र) से जवाहरलाल नेहरू बंदरगाह (मुंबई) तक फैला है और दिल्ली-मुंबई औद्योगिक गलियारे का रीढ़ है।"
},
{
"subject": "Economy",
"topic": "Udyogikiran aur Make in India",
"question_en": "Which among the following products has been kept OUT of the ambit of the Phased Manufacturing Programme (PMP) under Make in India?",
"question_hi": "निम्नलिखित में से किस उत्पाद को मेक इन इंडिया के तहत चरणबद्ध विनिर्माण कार्यक्रम (PMP) के दायरे से बाहर रखा गया है?",
"A_en": "Mobile phones", "A_hi": "मोबाइल फोन",
"B_en": "Electric vehicle chargers", "B_hi": "इलेक्ट्रिक वाहन चार्जर",
"C_en": "Solar modules", "C_hi": "सौर मॉड्यूल",
"D_en": "Crude petroleum", "D_hi": "कच्चा पेट्रोलियम",
"answer": "D",
"explanation_en": "Crude petroleum is a natural resource and cannot be manufactured; hence it is outside PMP which focuses on increasing local value addition.",
"explanation_hi": "कच्चा पेट्रोलियम एक प्राकृतिक संसाधन है जिसका विनिर्माण संभव नहीं; इसलिए यह स्थानीय मूल्य संवर्धन पर केंद्रित PMP से बाहर है।"
},
{
"subject": "Economy",
"topic": "Udyogikiran aur Make in India",
"question_en": "The 'Make in India' logo depicts which animal?",
"question_hi": "'मेक इन इंडिया' लोगो में किस जानवर को दर्शाया गया है?",
"A_en": "Lion", "A_hi": "सिंह",
"B_en": "Tiger", "B_hi": "बाघ",
"C_en": "Elephant", "C_hi": "हाथी",
"D_en": "Peacock", "D_hi": "मोर",
"answer": "A",
"explanation_en": "The logo is a stylised lion inspired by the Ashoka Chakra, symbolising strength, courage and tenacity of Indian manufacturing.",
"explanation_hi": "लोगो अशोक चक्र से प्रेरित एक स्टाइलिश सिंह है जो भारतीय विनिर्माण की शक्ति, साहस और दृढ़ता का प्रतीक है।"
}
]