[
{
"subject": "Economy",
"topic": "Udyogikaran aur Make in India",
"question_en": "Under which pillar of ‘Make in India’ does the ‘E-Biz Portal’ fall?",
"question_hi": "‘मेक इन इंडिया’ के किस स्तंभ के अंतर्गत ‘ई-बिज़ पोर्टल’ आता है?",
"A_en": "Skill India", "A_hi": "स्किल इंडिया",
"B_en": "Infrastructure", "B_hi": "इंफ्रास्ट्रक्चर",
"C_en": "Ease of Doing Business", "C_hi": "बिज़नेस में आसानी",
"D_en": "Innovation & IPR", "C_hi": "इनोवेशन और आईपीआर",
"answer": "C",
"explanation_en": "The E-Biz Portal is a digital platform that simplifies regulatory clearances and is part of the Ease of Doing Business pillar of Make in India.",
"explanation_hi": "ई-बिज़ पोर्टल एक डिजिटल प्लेटफ़ॉर्म है जो नियामक मंज़ूरियों को सरल बनाता है और यह मेक इन इंडिया के ‘ईज़ ऑफ़ डूइंग बिज़नेस’ स्तंभ का हिस्सा है।"
},
{
"subject": "Economy",
"topic": "Udyogikaran aur Make in India",
"question_en": "Which sector was kept outside the purview of the initial 25 sectors identified under Make in India in 2014?",
"question_hi": "2014 में मेक इन इंडिया के तहत चिन्हित प्रारंभिक 25 क्षेत्रों में से किस क्षेत्र को बाहर रखा गया था?",
"A_en": "Defence", "A_hi": "रक्षा",
"B_en": "Railways", "B_hi": "रेलवे",
"C_en": "Atomic Energy", "C_hi": "परमाणु ऊर्जा",
"D_en": "Insurance", "C_hi": "बीमा",
"answer": "C",
"explanation_en": "Atomic Energy was not among the initial 25 sectors opened up under Make in India due to strategic and security reasons.",
"explanation_hi": "परमाणु ऊर्जा को रणनीतिक एवं सुरक्षा कारणों से मेक इन इंडिया के प्रारंभिक 25 क्षेत्रों में शामिल नहीं किया गया था।"
},
{
"subject": "Economy",
"topic": "Udyogikaran aur Make in India",
"question_en": "What is the minimum FDI allowed under the automatic route in defence sector under Make in India?",
"question_hi": "मेक इन इंडिया के तहत रक्षा क्षेत्र में ऑटोमैटिक रूट के अंतर्गत न्यूनतम एफडीआई कितनी है?",
"A_en": "49%", "A_hi": "49%",
"B_en": "51%", "B_hi": "51%",
"C_en": "74%", "C_hi": "74%",
"D_en": "100%", "C_hi": "100%",
"answer": "A",
"explanation_en": "Up to 49% FDI is permitted under automatic route in defence; beyond that government approval is required.",
"explanation_hi": "रक्षा क्षेत्र में 49% तक एफडीआई को ऑटोमैटिक रूट की अनुमति है; इससे अधिक के लिए सरकारी मंज़ूरी आवश्यक है।"
},
{
"subject": "Economy",
"topic": "Udyogikaran aur Make in India",
"question_en": "Which state became the first to pass the Industrial Disputes (Amendment) Bill compatible with Make in India ease-of-business goals?",
"question_hi": "किस राज्य ने पहले ‘इंडस्ट्रियल डिस्प्यूट्स (अमेंडमेंट) बिल’ पारित किया जो मेक इन इंडिया के बिज़नेस-सरल लक्ष्यों के अनुरूप है?",
"A_en": "Gujarat", "A_hi": "गुजरात",
"B_en": "Rajasthan", "B_hi": "राजस्थान",
"C_en": "Maharashtra", "C_hi": "महाराष्ट्र",
"D_en": "Tamil Nadu", "C_hi": "तमिलनाडु",
"answer": "B",
"explanation_en": "Rajasthan was the first state to amend the Industrial Disputes Act to raise the threshold for prior government permission for layoffs, aligning with Make in India objectives.",
"explanation_hi": "राजस्थान ने मेक इन इंडिया उद्देश्यों के अनुरूप लेऑफ़ की पूर्व सरकारी अनुमति की सीमा बढ़ाकर इंडस्ट्रियल डिस्प्यूट्स एक्ट में संशोधन करने वाला पहला राज्य बना।"
},
{
"subject": "Economy",
"topic": "Udyogikaran aur Make in India",
"question_en": "Which programme was launched to provide skill training to 10 million youth under Make in India?",
"question_hi": "मेक इन इंडिया के तहत 10 मिलियन युवाओं को कौशल प्रशिक्षण देने के लिए कौन-सा कार्यकम शुरू किया गया?",
"A_en": "PMKVY", "A_hi": "पीएमकेवीवाई",
"B_en": "DDU-GKY", "B_hi": "डीडीयू-जीकेवाई",
"C_en": "ASPIRE", "C_hi": "ASPIRE",
"D_en": "Startup India", "C_hi": "स्टार्टअप इंडिया",
"answer": "A",
"explanation_en": "Pradhan Mantri Kaushal Vikas Yojana (PMKVY) was aligned with Make in India to impart market-relevant skills to 1 crore youth.",
"explanation_hi": "प्रधानमंत्री कौशल विकास योजना (PMKVY) को मेक इन इंडिया के साथ संरेखित कर 1 करोड़ युवाओं को बाज़ार-प्रासंगिक कौशल प्रदान करने के लिए शुरू किया गया।"
},
{
"subject": "Economy",
"topic": "Udyogikaran aur Make in India",
"question_en": "Which of the following is NOT a focus sector under the Make in India ‘Champion Services’ initiative?",
"question_hi": "निम्नलिखित में से कौन-सा क्षेत्र मेक इन इंडिया के ‘चैंपियन सर्विसेज़’ पहल का फोकस सेक्टर नहीं है?",
"A_en": "IT & ITeS", "A_hi": "आईटी और आईटीईएस",
"B_en": "Tourism & Hospitality", "B_hi": "पर्यटन और आतिथ्य",
"C_en":"Medical Value Travel", "C_hi": "मेडिकल वैल्यू ट्रैवल",
"D_en": "Coal Mining", "C_hi": "कोल माइनिंग",
"answer": "D",
"explanation_en": "Coal Mining is a primary sector activity and not listed under the Champion Services identified to boost services exports under Make in India.",
"explanation_hi": "कोल माइनिंग एक प्राथमिक क्षेत्र की गतिविधि है और इसे मेक इन इंडिया के अंतर्गत सर्विसेज़ निर्यात को बढ़ावा देने वाले चैंपियन सर्विसेज़ में शामिल नहीं किया गया है।"
},
{
"subject": "Economy",
"topic": "Udyogikaran aur Make in India",
"question_en": "Which dedicated fund was set up by the Union Budget 2015-16 for Make in India in defence?",
"question_hi": "केंद्रीय बजट 2015-16 ने रक्षा में मेक इन इंडिया के लिए किस समर्पित निधि की स्थापना की?",
"A_en": "Indian Development Fund", "A_hi": "इंडियन डेवलपमेंट फंड",
"B_en": "Defence Innovation Fund", "B_hi": "डिफेंस इनोवेशन फंड",
"C_en": "Make-II Fund", "C_hi": "मेक-Two फंड",
"D_en": "Defence Technology Fund", "C_hi": "डिफेंस टेक्नोलॉजी फंड",
"answer": "B",
"explanation_en": "Finance Minister announced a Defence Innovation Fund to promote R&D and innovation among SMEs supporting Make in India in defence.",
"explanation_hi": "वित्त मंत्री ने रक्षा में मेक इन इंडिया को बढ़ावा देने के लिए एसएमई में आरएंडडी तथा नवाचार को प्रोत्साहित करने हेतु डिफेंस इनोवेशन फंड की घोषणा की।"
},
{
"subject": "Economy",
"topic": "Udyogikaran aur Make in India",
"question_en": "Which among the following replaced the ‘Press Note 8 of 2017’ to streamline Make in India-related FDI policy?",
"question_hi": "निम्नलिखित में से किसने ‘प्रेस नोट 8 ऑफ 2017’ को प्रतिस्थापित कर मेक इन इंडिया से जुड़ी एफडीआई नीति को सुव्यवस्थित किया?",
"A_en": "Consolidated FDI Policy 2020", "A_hi": "कंसॉलिडेटेड एफडीआई पॉलिसी 2020",
"B_en": "Industrial Policy 2018", "B_hi": "इंडस्ट्रियल पॉलिसी 2018",
"C_en": "Draft National Policy 2019", "C_hi": "ड्राफ्ट नेशनल पॉलिसी 2019",
"D_en": "Make in India Handbook 2021", "C_hi": "मेक इन इंडिया हैंडबुक 2021",
"answer": "A",
"explanation_en": "Consolidated FDI Policy 2020 subsumed earlier press notes, bringing clarity and uniformity for investors under Make in India.",
"explanation_hi": "कंसॉलिडेटेड एफडीआई पॉलिसी 2020 ने पूर्व प्रेस नोट्स को समाहित कर मेक इन इंडिया के अंतर्गत निवेशकों के लिए स्पष्टता और एकरूपता लाई।"
},
{
"subject": "Economy",
"topic": "Udyogikaran aur Make in India",
"question_en": "What is the validity period of the Industrial Licence issued under Make in India for defence production?",
"question_hi": "मेक इन इंडिया के तहत रक्षा उत्पादन के लिए जारी इंडस्ट्रियल लाइसेंस की वैधता अवधि क्या होती है?",
"A_en": "3 years", "A_hi": "3 वर्ष",
"B_en": "5 years", "B_hi": "5 वर्ष",
"C_en": "7 years", "C_hi": "7 वर्ष",
"D_en": "10 years", "C_hi": "10 वर्ष",
"answer": "B",
"explanation_en": "As per DPIIT guidelines, an industrial licence for defence is valid for 5 years, with provision for renewal.",
"explanation_hi": "DPIIT दिशानिर्देशों के अनुसार रक्षा के लिए इंडस्ट्रियल लाइसेंस 5 वर्षों के लिए वैध होता है, जिसे नवीनीकृत किया जा सकता है।"
},
{
"subject": "Economy",
"topic": "Udyogikaran aur Make in India",
"question_en": "Which one of the following is a flagship scheme providing 50% capital subsidy for building common facility centres under Make in India?",
"question_hi": "मेक इन इंडिया के तहत कॉमन फैसिलिटी सेंटरों की स्थापना के लिए 50% पूंजीगत सब्सिडी देने वाला निम्नलिखित में से कौन-सा फ्लैगशिप योजना है?",
"A_en": "SFURTI", "A_hi": "एसएफयूआरटीआई",
"B_en": "CLCSS", "B_hi": "सीएलसीएसएस",
"C_en": "ASPIRE", "C_hi": "ASPIRE",
"D_en": "M-SIPS", "C_hi": "एम-सिप्स",
"answer": "A",
"explanation_en": "SFURTI (Scheme of Fund for Regeneration of Traditional Industries) supports common facility centres with 50% capital subsidy to boost clusters under Make in India.",
"explanation_hi": "एसएफयूआरटीआई (पारंपरिक उद्योग पुनर्जीवन निधि योजना) मेक इन इंडिया के तहत क्लस्टर्स को बढ़ावा देने हेतु 50% पूंजीगत सब्सिडी के साथ कॉमन फैसिलिटी सेंटरों को समर्थन देती है।"
}
]