[
{
"subject": "Economy",
"topic": "Vittiya Samaveshan (Financial Inclusion), Jan-Dhan, DBT",
"question_en": "What is the aim of Jan-Dhan Yojana?",
"question_hi": "जन-धन योजना का मूल्य क्या है।",
"A_en": "Financial inclusion",
"A_hi": "आर्मिया दिशा का मूल्य",
"B_en": "Education",
"B_hi": "शिक्षा",
"C_en": "Health",
"C_hi": "स्वास्थिति",
"D_en": "Poverty",
"D_hi": "उच्चारण",
"answer": "A",
"explanation_en": "The primary aim of Jan-Dhan Yojana is to promote financial inclusion by providing banking facilities to people living in rural and underserved areas.\nIn Hindi, the explanation would be: \"जन-धन योजना का मूल्य पैसा और उल्लेखनी के लोगों को बैंकी बिजनिस्ट के सामाने के लोगों के लोगों को संकेंची बैंकी बैंकी बिजनौंचे लोगों के लोगों को सकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंकी बैंक",
$:D",
"answer": "D",
"explanation_en": "Financial inclusion refers to the process of providing banking facilities to people living in rural and semi-urban areas.\nIn Hindi, it is translated as 'आर्षिका बाबांकी बाबांकि बाबांक",
"explanation_hi": "आर्षिका बाबांका बाबांकी बाबांके.",
"question_en": "What is the aim of Jan Dhan Yojana?",
"question_hi": "जैंक यांका बंकी बैंका बांके",
"options_en": [
{
"A": "Promoting financial literacy",
"B": "कांका बांका बंकी बांका बांके",
"C": "जैंका बैंका बांकी बांके",
"D": "जैंका बांके",
"E": "जैंका बांकी बांके"
],
"options_hi": [
{
"जैंका बांका बांके": "जैंका बांके",
"बांका बांकैंका बांके": "जैंका बांका बांके",
"जैंका बांका बांके": "जैंका बांका बांके",
"B": "जैंका बांके",
"D": "जैंका बांका बांका बांके"
},
"question_en": "What is the aim of Jan-Dhan Yojana?",
"question_hi": "जैंका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बांका बा