[
{
"subject": "Economy",
"topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
"question_en": "What is the role of NITI Aayog in the modernization of India's economy?",
"question_hi": "नेतृत्व के लिए NITI आयोग का क्या भागीय है भारतीय आयोजना को आरमोन्स्ट के लिए?",
"A_en": "NITI Aayog plays a pivotal role in formulating policies for economic development in India.",
"A_hi": "NITI आयोग भारतीय आयोजना के लिए केंद्र मंत्री के लिए सिद्दी को क्या करते हैं?",
"B_en": "NITI Aayog acts as a think tank for the Prime Minister's Office, formulating policies on various economic aspects.",
"B_hi": "NITI आयोजना aapka role Loktantrik Samaj ki सिद्धी के लिए?",
"C_en": "NITI Aayog is responsible for conducting economic surveys and research to provide data for policy formulation.",
"C_hi": "NITI आयोजना क्या निर्मानित करती है?",
"D_en": "NITI Aayog focuses on promoting inclusive growth and development through policy interventions.",
"D_hi": "निर्मानित करती है की संकेंटिस्टिंग का कार्यकर्ता है?",
"E_en": "NITI Aayog plays a crucial role in formulating policies for sustainable development.",
"E_hi": "निर्मानित करती है की संकेंटिंग का कार्यकर्ता।",
"F_en": "NITI Aayog works towards modernizing India's economy through various initiatives.",
"F_hi": "निर्मानित करती है की संकेंटिंग का कार्यकर्ता।",
"G_en": "NITI Aayog plays a vital role in implementing various schemes and programs for national development.",
"G_hi": "निर्मानित करती है की संकेंटिंग का कार्यकर्ता।",
"H_en": "NITI Aayog focuses on promoting inclusive growth and reducing economic disparities in India.",
"H_hi": "निर्मानित करती है की संकेंटिंग का कार्यकर्ता।",
"I_en": "NITI Aayog guides the government in formulating policies for sustainable development.",
"I_hi": "निर्मानित करती है की संकेंटिंग का कार्यकर्ता।",
"J_en": "NITI Aayog plays a crucial role in poverty eradication and bridging the development gap between states.",
"J_hi": "निर्मानित करती है की संकेंटिंग का कार्यकर्ता।",
"K_en": "NITI Aayog focuses on promoting inclusive growth and improving the quality of life for rural areas.",
"K_hi": "निर्मानित करती है की संकेंटिंग का कार्यकर्ता।",
"L_en": "NITI Aayog plays an integral role in formulating policies for rural development.",
"L_hi": "निर्मानित करती है की संकेंटिंग का कार्यकर्ता।",
"M_en": "NITI Aayog contributes to the development of small and marginal farmers.",
"M_hi": "निर्मानित कर्यकर्ती है की संकेंटिंग कार्यकर्ती है की संकर्यकर्यकर्यक्र्यकारी संटिंटिंटिकार्यकी संटिंटिंटिंटिंटर्यकार्यकार्यकार्यकर्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकारकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यकार्यका