[
  {
    "subject": "Economy",
    "topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
    "question_en": "In which year was the Planning Commission of India abolished?",
    "question_hi": "भारत की योजना आयोग को किस वर्ष भंग किया गया?",
    "A_en": "2013", "A_hi": "2013",
    "B_en": "2014", "B_hi": "2014",
    "C_en": "2015", "C_hi": "2015",
    "D_en": "2016", "D_hi": "2016",
    "answer": "B",
    "explanation_en": "The Planning Commission was abolished in 2014 and replaced by NITI Aayog.",
    "explanation_hi": "योजना आयोग को 2014 में भंग किया गया और उसकी जगह नीति आयोग ने ली।"
  },
  {
    "subject": "Economy",
    "topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
    "question_en": "Which of the following was NOT a primary reason for establishing NITI Aayog?",
    "question_hi": "निम्नलिखित में से कौन सा नीति आयोग की स्थापना का मुख्य कारण नहीं था?",
    "A_en": "To promote a collaborative federal structure", "A_hi": "सहकारी संघीय ढाँचे को बढ़ावा देना",
    "B_en": "To replace the directive nature of Planning Commission", "B_hi": "योजना आयोग के निर्देशात्मक स्वभाव को बदलना",
    "C_en": "To increase the number of five‑year plans", "C_hi": "पांच साल की योजनाओं की संख्या बढ़ाना",
    "D_en": "To provide a platform for policy coordination", "D_hi": "नीति समन्वय के लिए मंच उपलब्ध कराना",
    "answer": "C",
    "explanation_en": "NITI Aayog was set up to replace the directive Planning Commission, promote federalism and coordinate policies, not to increase the number of plans.",
    "explanation_hi": "नीति आयोग को निर्देशात्मक योजना आयोग को बदलने, संघीय ढाँचे को बढ़ावा देने और नीति समन्वय के लिए स्थापित किया गया, योजनाओं की संख्या बढ़ाने के लिए नहीं।"
  },
  {
    "subject": "Economy",
    "topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
    "question_en": "Which of these is a key feature that distinguishes NITI Aayog from the former Planning Commission?",
    "question_hi": "निम्नलिखित में से कौन सा प्रमुख विशेषता नीति आयोग को पूर्व योजना आयोग से अलग करती है?",
    "A_en": "It is a statutory body", "A_hi": "यह एक वैधानिक संस्था है",
    "B_en": "It functions as a policy advisory body", "B_hi": "यह नीति सलाहकारी संस्था के रूप में कार्य करता है",
    "C_en": "It prepares detailed five‑year plans", "C_hi": "यह विस्तृत पाँच साल की योजनाएँ तैयार करता है",
    "D_en": "It has a fixed budget allocation for each state", "D_hi": "इसके पास प्रत्येक राज्य के लिए तय बजट आवंटन है",
    "answer": "B",
    "explanation_en": "Unlike the Planning Commission, NITI Aayog is primarily an advisory body and does not prepare detailed plans.",
    "explanation_hi": "योजना आयोग के विपरीत, नीति आयोग मुख्य रूप से एक सलाहकारी संस्था है और विस्तृत योजनाएँ तैयार नहीं करता।"
  },
  {
    "subject": "Economy",
    "topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
    "question_en": "Which document served as the basis for the creation of NITI Aayog?",
    "question_hi": "किस दस्तावेज़ ने नीति आयोग की स्थापना का आधार तैयार किया?",
    "A_en": "The 11th Five‑Year Plan", "A_hi": "11वीं पंचवर्षीय योजना",
    "B_en": "The 12th Five‑Year Plan", "B_hi": "12वीं पंचवर्षीय योजना",
    "C_en": "The 13th Five‑Year Plan", "C_hi": "13वीं पंचवर्षीय योजना",
    "D_en": "The 14th Five‑Year Plan", "D_hi": "14वीं पंचवर्षीय योजना",
    "answer": "D",
    "explanation_en": "The 14th Five‑Year Plan (2012‑17) and its draft guidelines led to the establishment of NITI Aayog.",
    "explanation_hi": "14वीं पंचवर्षीय योजना (2012‑17) और उसके मसौदा दिशानिर्देशों ने नीति आयोग की स्थापना को प्रेरित किया।"
  },
  {
    "subject": "Economy",
    "topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
    "question_en": "Which of the following is NOT a function of NITI Aayog?",
    "question_hi": "निम्नलिखित में से कौन सा नीति आयोग का कार्य नहीं है?",
    "A_en": "Developing national economic strategy", "A_hi": "राष्ट्रीय आर्थिक रणनीति विकसित करना",
    "B_en": "Providing technical assistance to states", "B_hi": "राज्यों को तकनीकी सहायता प्रदान करना",
    "C_en": "Directly implementing government schemes", "C_hi": "सरकारी योजनाओं को सीधे लागू करना",
    "D_en": "Monitoring policy implementation", "D_hi": "नीति कार्यान्वयन की निगरानी करना",
    "answer": "C",
    "explanation_en": "NITI Aayog advises and monitors but does not directly implement schemes; that remains a state and central government function.",
    "explanation_hi": "नीति आयोग सलाह और निगरानी करता है, लेकिन योजनाओं को सीधे लागू नहीं करता; यह राज्य और केंद्रीय सरकार का कार्य है।"
  },
  {
    "subject": "Economy",
    "topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
    "question_en": "Who is the chairperson of NITI Aayog?",
    "question_hi": "नीति आयोग के अध्यक्ष कौन हैं?",
    "A_en": "Prime Minister of India", "A_hi": "भारत के प्रधान मंत्री",
    "B_en": "President of India", "B_hi": "भारत के राष्ट्रपति",
    "C_en": "Governor of India", "C_hi": "भारत के गवर्नर",
    "D_en": "Chief Minister of Delhi", "D_hi": "दिल्ली के मुख्यमंत्री",
    "answer": "A",
    "explanation_en": "The Prime Minister of India chairs NITI Aayog.",
    "explanation_hi": "भारत के प्रधान मंत्री नीति आयोग के अध्यक्ष हैं।"
  },
  {
    "subject": "Economy",
    "topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
    "question_en": "Which of the following best describes the relationship between NITI Aayog and the states?",
    "question_hi": "नीति आयोग और राज्यों के बीच संबंध को निम्नलिखित में से कौन सा सबसे अच्छा वर्णित करता है?",
    "A_en": "Centralized control with no state participation", "A_hi": "केंद्रीय नियंत्रण बिना राज्य भागीदारी के",
    "B_en": "Consultative and collaborative partnership", "B_hi": "परामर्शात्मक और सहयोगी साझेदारी",
    "C_en": "States are subordinate to NITI Aayog", "C_hi": "राज्य नीति आयोग के अधीन हैं",
    "D_en": "States have no role in policy formulation", "D_hi": "राज्यों की नीति निर्माण में कोई भूमिका नहीं है",
    "answer": "B",
    "explanation_en": "NITI Aayog promotes a collaborative federal structure where state governments actively participate in policy discussions.",
    "explanation_hi": "नीति आयोग एक सहयोगी संघीय ढाँचे को बढ़ावा देता है जहाँ राज्य सरकारें नीति चर्चाओं में सक्रिय रूप से भाग लेती हैं।"
  },
  {
    "subject": "Economy",
    "topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
    "question_en": "Which year was the NITI Aayog formally launched?",
    "question_hi": "नीति आयोग को आधिकारिक तौर पर किस वर्ष लॉन्च किया गया?",
    "A_en": "2014", "A_hi": "2014",
    "B_en": "2015", "B_hi": "2015",
    "C_en": "2016", "C_hi": "2016",
    "D_en": "2017", "D_hi": "2017",
    "answer": "B",
    "explanation_en": "NITI Aayog was formally launched on 12 January 2015.",
    "explanation_hi": "नीति आयोग को 12 जनवरी 2015 को आधिकारिक तौर पर लॉन्च किया गया।"
  },
  {
    "subject": "Economy",
    "topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
    "question_en": "Which of the following is a major difference in the way policy recommendations are made by NITI Aayog compared to the Planning Commission?",
    "question_hi": "नीति आयोग और योजना आयोग की तुलना में नीति सिफारिशें देने के तरीके में कौन सा प्रमुख अंतर है?",
    "A_en": "NITI Aayog issues binding directives", "A_hi": "नीति आयोग बाध्यकारी निर्देश जारी करता है",
    "B_en": "NITI Aayog uses a consultative approach", "B_hi": "नीति आयोग परामर्शात्मक दृष्टिकोण अपनाता है",
    "C_en": "Planning Commission had no formal process", "C_hi": "योजना आयोग का कोई औपचारिक प्रक्रिया नहीं थी",
    "D_en": "Both use identical processes", "D_hi": "दोनों एक ही प्रक्रियाओं का उपयोग करते हैं",
    "answer": "B",
    "explanation_en": "NITI Aayog adopts a consultative model involving stakeholders, whereas the Planning Commission was directive and centrally driven.",
    "explanation_hi": "नीति आयोग हितधारकों को शामिल करते हुए परामर्शात्मक मॉडल अपनाता है, जबकि योजना आयोग निर्देशात्मक और केंद्रीय रूप से संचालित था।"
  },
  {
    "subject": "Economy",
    "topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
    "question_en": "Which of the following statements about NITI Aayog’s role in development planning is correct?",
    "question_hi": "नीति आयोग की विकास योजना में भूमिका के बारे में कौन सा कथन सही है?",
    "A_en": "It replaces the State Planning Boards entirely", "A_hi": "यह राज्य योजना बोर्डों को पूरी तरह से बदल देता है",
    "B_en": "It provides a framework for inter‑governmental coordination", "B_hi": "यह अंतर-सरकारी समन्वय के लिए ढाँचा प्रदान करता है",
    "C_en": "It solely focuses on macroeconomic policy", "C_hi": "यह केवल मैक्रोइकोनॉमिक नीति पर केंद्रित है",
    "D_en": "It has no interaction with the Ministry of Finance", "D_hi": "यह वित्त मंत्रालय के साथ कोई संपर्क नहीं रखता",
    "answer": "B",
    "explanation_en": "NITI Aayog’s primary role is to facilitate coordination among central and state governments, not to replace state boards or act independently of finance ministry.",
    "explanation_hi": "नीति आयोग का प्रमुख कार्य केंद्रीय और राज्य सरकारों के बीच समन्वय को सुविधाजनक बनाना है, न कि राज्य बोर्डों को बदलना या वित्त मंत्रालय से स्वतंत्र रूप से कार्य करना।"
  }
]