[
{
"subject": "Economy",
"topic": "The Transformation from NITI Aayog to Niti Aayog",
"question_en": "What is the primary objective of Niti Aayog after its establishment?",
"question_hi": "नियमित अधिकांति के प्रस्तुति के लिए नई निदेश नियमित अधिकांति के प्रस्तुति के लिए नई निदेश नियमित अधिकांति के लिए नई निदेश नियमित अधिकांति",
"question_hi": "राजनीति योजना के लिए नई निदेशन नियमित अधिकांति",
"A_en": "The main objective of NITI Aayog for establishing a new policy framework (नई निदेशन नियमित अधिकांति)",
"A_hi": "राजनीति योजना के लिए नई निदेशन नियमित अधिकांति",
"B_en": "To address the challenges faced by the States in implementing policies (राज्यों के प्रार्थना को हासिलिंग",
"B_hi": "राज्यों की प्रार्थना को हासिलिंग",
"C_en": "Empowering States for inclusive development (राज्यों के लेकिंग",
"C_hi": "राज्यों प्रधानंतिक विकारकरण",
"D_en": "Implementing central schemes effectively (मध्येशेखनंतिक क्यामेशे प्रवृत्तिक क्यामेशे प्रवृत्तिक क्यामेशे प्रवृत्तिक क्यामेशे प्रवृत्तिक क्यामेशे प्रवृत्तिक क्यामेशे प्रवृत्तिक क्यामेशे प्रवृत्तिक क्यामेशे प्रवृत्तिक क्यामेशे प्रवृत्तिक क्यामेशे प्रवृत्तिक क्यामेशे प्रवृत्तिक क्यामेशे प्रवृत्तिक क्यामेशे प्रवृत्तिक क्यामेशे प्रवृत्तिक क्यामेशे प्रवृतिक क्यामेशे प्रवृतिक क्यामेशे प्रवृतिक क्यामेशे प्रवृतिक क्यामेशे प्रवृतिक क्यामेशे प्रवृतिक क्यामेशे प्रृतिक क्यामेशे प्रृतिक क्यामेशे परृतिक क्यामेशे प्रृतिक क्यामेशे प्रृतिक क्यामेशे प्रृतिक क्यामेशे प्रृतिक क्यामेशे प्रृतिक क्यामेशे प्रृतिक क्यामेशे प्रृतिक क्यामेशे प्रृतिक क्यामेशे प्रृतिक क्यामेशे प्रृतिक क्यामेशे प्रृतिक",

 क्यामेशे प्रृतिक",
"question_en": "What role did NITI Aayog play in the formation of the Rajasthan State Planning Commission?",
"question_hi": "राजनिक निक्यामेशे प्रृतिक क्यामेशे प्रृतिक",
"options_en": [
{
"key": "राजनिक",
"value": "NITI Aayog played a key role in promoting economic development in Rajasthan.",
"key": "राजनिक",
"value": "राजनिक",
"key": "राजनिक",
"value": "राजनिक",
"key": "राजनिक",
"value": "राजनिक",
"key": "राजनिक",
"value": "राजनिक",
"key": "राजनिक",
"value": "राजनिक",
"key": "राजनिक",
"value": "राजनिक",
"key": "राजनिक",
"value": "राजनिक",
"key": "राजनिक",
"value": "राजनिक",
"key": "राजनिक",
"value": "राजनिक",
"key": "राज