[
{
"subject": "Economy",
"topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
"question_en": "What is the main objective of the National Development Council (NDC)?",
"question_hi": "राष्ट्रीय विकास परिषद (NDC) का मुख्य उद्देश्य क्या है?",
"A_en": "To promote economic development through planning", "A_hi": "केवल आर्थिक विकास को प्रोत्साहित करने के लिए योजना बनाना",
"B_en": "To ensure the implementation of Five-Year Plans", "B_hi": "पांच वर्षीय योजनाओं के कार्यान्वयन की सुनिश्चित करना",
"C_en": "To establish a framework for the country's economic growth", "C_hi": "देश के आर्थिक विकास के लिए एक ढांचा स्थापित करना",
"D_en": "To provide a platform for inter-ministerial coordination", "D_hi": "मंत्रालयों के बीच समन्वय के लिए एक मंच प्रदान करना",
"answer": "C",
"explanation_en": "The National Development Council (NDC) is responsible for establishing a framework for the country's economic growth and development.",
"explanation_hi": "राष्ट्रीय विकास परिषद (NDC) देश के आर्थिक विकास और विकास के लिए एक ढांचा स्थापित करने के लिए जिम्मेदार है।"
},
{
"subject": "Economy",
"topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
"question_en": "What is the main difference between the Planning Commission and NITI Aayog?",
"question_hi": "प्लानिंग कमिशन और NITI Aayog में मुख्य अंतर क्या है?",
"A_en": "Planning Commission was a constitutional body, while NITI Aayog is not", "A_hi": "प्लानिंग कमिशन एक संविधानिक संस्था थी, जबकि NITI Aayog नहीं",
"B_en": "Planning Commission was advisory in nature, while NITI Aayog is executive", "B_hi": "प्लानिंग कमिशन सलाहकार प्रकृति का था, जबकि NITI Aayog कार्यकारी",
"C_en": "Planning Commission focused on economic development, while NITI Aayog focuses on social development", "C_hi": "प्लानिंग कमिशन आर्थिक विकास पर केंद्रित था, जबकि NITI Aayog सामाजिक विकास पर केंद्रित है",
"D_en": "Planning Commission was dissolved, while NITI Aayog is still in operation", "D_hi": "प्लानिंग कमिशन समाप्त हो गया, जबकि NITI Aayog अभी भी कार्य कर रहा है",
"answer": "C",
"explanation_en": "Planning Commission focused on economic development, while NITI Aayog focuses on social development, governance reforms, and other areas.",
"explanation_hi": "प्लानिंग कमिशन आर्थिक विकास पर केंद्रित था, जबकि NITI Aayog सामाजिक विकास, प्रशासनिक सुधार और अन्य क्षेत्रों पर केंद्रित है।"
},
{
"subject": "Economy",
"topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
"question_en": "What is the significance of the 7th Five-Year Plan?",
"question_hi": "सातवीं पंचवर्षीय योजना का महत्व क्या है?",
"A_en": "It marked the beginning of economic liberalization in India", "A_hi": "यह भारत में आर्थिक उदारीकरण का आरंभ था",
"B_en": "It was the first plan to focus on social development", "B_hi": "यह पहली योजना थी जो सामाजिक विकास पर केंद्रित थी",
"C_en": "It established the National Development Council (NDC)", "C_hi": "यह राष्ट्रीय विकास परिषद (NDC) स्थापित करने में सफल रहा",
"D_en": "It introduced the concept of decentralization in planning", "D_hi": "यह योजना में वितरण का विचार पेश किया",
"answer": "D",
"explanation_en": "The 7th Five-Year Plan introduced the concept of decentralization in planning, which aimed to involve local communities in the planning process.",
"explanation_hi": "सातवीं पंचवर्षीय योजना में वितरण का विचार पेश किया गया, जिसका उद्देश्य स्थानीय समुदायों को योजना प्रक्रिया में शामिल करना था।"
},
{
"subject": "Economy",
"topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
"question_en": "What is the role of the Ministry of Finance in the NITI Aayog?",
"question_hi": "NITI Aayog में वित्त मंत्रालय की भूमिका क्या है?",
"A_en": "To provide fiscal policy guidance", "A_hi": "वित्तीय नीति मार्गदर्शन प्रदान करना",
"B_en": "To oversee the implementation of NITI Aayog's recommendations", "B_hi": "NITI Aayog की सिफारिशों के कार्यान्वयन का निरीक्षण करना",
"C_en": "To provide administrative support to NITI Aayog", "C_hi": "NITI Aayog को प्रशासनिक समर्थन प्रदान करना",
"D_en": "To chair the NITI Aayog Governing Council", "D_hi": "NITI Aayog के शासन परिषद की अध्यक्षता करना",
"answer": "D",
"explanation_en": "The Ministry of Finance chairs the NITI Aayog Governing Council, which provides strategic direction to the organization.",
"explanation_hi": "वित्त मंत्रालय NITI Aayog के शासन परिषद की अध्यक्षता करता है, जो संगठन को रणनीतिक दिशा प्रदान करता है।"
},
{
"subject": "Economy",
"topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
"question_en": "What is the significance of the 12th Five-Year Plan?",
"question_hi": "बारहवीं पंचवर्षीय योजना का महत्व क्या है?",
"A_en": "It marked the beginning of India's journey towards becoming a developed economy", "A_hi": "यह भारत के एक विकसित अर्थव्यवस्था बनने की दिशा में उसकी यात्रा का आरंभ था",
"B_en": "It focused on inclusive growth and social development", "B_hi": "यह समावेशी विकास और सामाजिक विकास पर केंद्रित था",
"C_en": "It introduced the concept of public-private partnerships", "C_hi": "यह सार्वजनिक-व्यक्तिगत सहयोग का विचार पेश किया",
"D_en": "It established the National Investment and Manufacturing Zone (NIMZ)", "D_hi": "यह राष्ट्रीय निवेश और निर्माण क्षेत्र (NIMZ) स्थापित करने में सफल रहा",
"answer": "C",
"explanation_en": "The 12th Five-Year Plan introduced the concept of public-private partnerships, which aimed to promote investment and economic growth.",
"explanation_hi": "बारहवीं पंचवर्षीय योजना में सार्वजनिक-व्यक्तिगत सहयोग का विचार पेश किया गया, जिसका उद्देश्य निवेश और आर्थिक विकास को बढ़ावा देना था।"
},
{
"subject": "Economy",
"topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
"question_en": "What is the relationship between NITI Aayog and the World Bank?",
"question_hi": "NITI Aayog और विश्व बैंक के बीच क्या संबंध है?",
"A_en": "NITI Aayog is a subsidiary of the World Bank", "A_hi": "NITI Aayog विश्व बैंक की सहायक कंपनी है",
"B_en": "NITI Aayog is a partner of the World Bank", "B_hi": "NITI Aayog विश्व बैंक का साझेदार है",
"C_en": "NITI Aayog and the World Bank have a memorandum of understanding", "C_hi": "NITI Aayog और विश्व बैंक के बीच समझौता पत्र है",
"D_en": "NITI Aayog and the World Bank have a partnership agreement", "D_hi": "NITI Aayog और विश्व बैंक के बीच सहयोग समझौता है",
"answer": "C",
"explanation_en": "NITI Aayog and the World Bank have a memorandum of understanding, which outlines their areas of cooperation.",
"explanation_hi": "NITI Aayog और विश्व बैंक के बीच समझौता पत्र है, जो उनके सहयोग के क्षेत्रों को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
"question_en": "What is the role of the Prime Minister's Office (PMO) in NITI Aayog?",
"question_hi": "NITI Aayog में प्रधानमंत्री कार्यालय (PMO) की भूमिका क्या है?",
"A_en": "To provide administrative support to NITI Aayog", "A_hi": "NITI Aayog को प्रशासनिक समर्थन प्रदान करना",
"B_en": "To oversee the implementation of NITI Aayog's recommendations", "B_hi": "NITI Aayog की सिफारिशों के कार्यान्वयन का निरीक्षण करना",
"C_en": "To chair the NITI Aayog Governing Council", "C_hi": "NITI Aayog के शासन परिषद की अध्यक्षता करना",
"D_en": "To provide policy guidance to NITI Aayog", "D_hi": "NITI Aayog को नीति मार्गदर्शन प्रदान करना",
"answer": "D",
"explanation_en": "The Prime Minister's Office (PMO) provides policy guidance to NITI Aayog, which helps in shaping the organization's decisions.",
"explanation_hi": "प्रधानमंत्री कार्यालय (PMO) NITI Aayog को नीति मार्गदर्शन प्रदान करता है, जो संगठन के निर्णयों को आकार देने में मदद करता है।"
},
{
"subject": "Economy",
"topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
"question_en": "What is the significance of the 15th Finance Commission?",
"question_hi": "पंद्रहवें वित्त आयोग का महत्व क्या है?",
"A_en": "It marked the beginning of a new era in Indian finance", "A_hi": "यह भारतीय वित्त की एक नई दिशा का आरंभ था",
"B_en": "It focused on fiscal discipline and responsibility", "B_hi": "यह वित्तीय अनुशासन और जिम्मेदारी पर केंद्रित था",
"C_en": "It established the National Investment and Manufacturing Zone (NIMZ)", "C_hi": "यह राष्ट्रीय निवेश और निर्माण क्षेत्र (NIMZ) स्थापित करने में सफल रहा",
"D_en": "It provided a framework for the implementation of the Goods and Services Tax (GST)", "D_hi": "यह वस्तु और सेवा कर (GST) के कार्यान्वयन के लिए एक ढांचा प्रदान किया",
"answer": "D",
"explanation_en": "The 15th Finance Commission provided a framework for the implementation of the Goods and Services Tax (GST), which aimed to simplify tax compliance.",
"explanation_hi": "पंद्रहवें वित्त आयोग ने वस्तु और सेवा कर (GST) के कार्यान्वयन के लिए एक ढांचा प्रदान किया, जिसका उद्देश्य कर पालन को सरल बनाना था।"
},
{
"subject": "Economy",
"topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
"question_en": "What is the relationship between NITI Aayog and the Indian government?",
"question_hi": "NITI Aayog और भारत सरकार के बीच क्या संबंध है?",
"A_en": "NITI Aayog is a subsidiary of the Indian government", "A_hi": "NITI Aayog भारत सरकार की सहायक कंपनी है",
"B_en": "NITI Aayog is a partner of the Indian government", "B_hi": "NITI Aayog भारत सरकार का साझेदार है",
"C_en": "NITI Aayog has a memorandum of understanding with the Indian government", "C_hi": "NITI Aayog भारत सरकार के साथ समझौता पत्र है",
"D_en": "NITI Aayog has a partnership agreement with the Indian government", "D_hi": "NITI Aayog भारत सरकार के साथ सहयोग समझौता है",
"answer": "C",
"explanation_en": "NITI Aayog has a memorandum of understanding with the Indian government, which outlines their areas of cooperation.",
"explanation_hi": "NITI Aayog भारत सरकार के साथ समझौता पत्र है, जो उनके सहयोग के क्षेत्रों को दर्शाता है।"
},
{
"subject": "Economy",
"topic": "Yojana Aayog se NITI Aayog tak ka Parivartan",
"question_en": "What is the role of the Indian Institute of Technology (IIT) in NITI Aayog?",
"question_hi": "NITI Aayog में भारतीय प्रौद्योगिकी संस्थान (IIT) की भूमिका क्या है?",
"A_en": "To provide administrative support to NITI Aayog", "A_hi": "NITI Aayog को प्रशासनिक समर्थन प्रदान करना",
"B_en": "To oversee the implementation of NITI Aayog's recommendations", "B_hi": "NITI Aayog की सिफारिशों के कार्यान्वयन का निरीक्षण करना",
"C_en": "To chair the NITI Aayog Governing Council", "C_hi": "NITI Aayog के शासन परिषद की अध्यक्षता करना",
"D_en": "To provide technical expertise to NITI Aayog", "D_hi": "NITI Aayog को तकनीकी विशेषज्ञता प्रदान करना",
"answer": "D",
"explanation_en": "The Indian Institute of Technology (IIT) provides technical expertise to NITI Aayog, which helps in shaping the organization's decisions.",
"explanation_hi": "भारतीय प्रौद्योगिकी संस्थान (IIT) NITI Aayog को तकनीकी विशेषज्ञता प्रदान करता है, जो संगठन के निर्णयों को आकार देने में मदद करता है।"
}