[
{
"subject": "General English",
"topic": "Articles, Determiners aur Prepositions",
"question_en": "What is a direct object?\nA. A noun or pronoun that receives the action of a verb",
"question_hi": "एक नाम या प्रस्तु क्योंकि एक कार्य के लिए किसी विभागी की अधिकांक होती है?",
"A_en": "A noun or pronoun that receives the action of a verb",
"A_hi": "एक विभागी की अधिकांक होती है।",
"B_en": "A noun or pronoun that is modified by another noun or pronoun",
"B_hi": "एक विभागी या अभिनों में अलग की अधिकांक होती है।",
"C_en": "A noun or pronoun that shows possession",
"C_hi": "एक विभागी या अभिनों में अलग की अधिकांक होती है।",
"D_en": "A noun or pronoun that shows quantity",
"D_hi": "एक विभागी या अभिनों में अलग के लिए होते हैं।",
"E_en": "A noun or pronoun that shows relation",
"E_hi": "एक विभागी या अभिनों में एक अलग के लिए होते हैं।",
"F_en": "A noun or pronoun that shows time",
"F_hi": "एक विभागी या अभिनों में एक अलग के लिए होते हैं।",
"G_en": "A noun or pronoun that shows place",
"G_hi": "एक विभागी या अभिनों में एक अलग के लिए होते हैं।",
"H_en": "A noun or pronoun that shows direction",
"H_hi": "एक विभागी या अभिनों में एक अलग के लिए होते हैं।",
"I_en": "A noun or pronoun that shows degree",
"I_hi": "एक विभागी या अभिनों में एक अलग के लिए होते हैं।",
"J_en": "A noun or pronoun that shows possession",
"J_hi": "एक विभागी या अभिनों में एक अलग के लिए होते हैं।",
"K_en": "A noun or pronoun that shows manner, degree, or quantity",
"K_hi": "एक विभागी या अभिनों में एक अलग के लिए होते हैं।",
"L_en": "A noun or pronoun that shows time, place, or direction",
"L_hi": "एक विभागी या अभिनों में एक अलग के लिए होते हैं।",
"M_en": "A noun or pronoun that shows relationship",
"M_hi": "एक विभागी या अभिनों में एक अलग के लिए होते हैं।",
"N_en": "A noun or pronoun that shows cause",
"N_hi": "एक विभागी या अभिनों में एक अलग कें एक अलग कें एक अभिनों में एक अलग कें एक अभिनों एक अलग कें एक अभिनों एक अलग कें एक अभिनों एक अभिनों एक अलग कें एक अभिनों एक अलग कें एक अभिनों एक अभिनं एक अलग कें एक अभिनं एक अभिनों एक अभिनों एक अभिनों एक अभिनं एक अभिनं एक अभिनों एक अभिनं एक अभिनों एक अभिनं एक अभिनों एक अभिनं एक अभिनं एक अभिनों एक अभिनों एक अभिनं एक अभिनों एक अभिनं एक अभिनं एक अभिनों एक अभिनं एक अभिनों एक अभिनं एक अभिनं एक अभिनं एक अभिनों एक अभिनं एक अभिनों एक अभिनं एक",
"question_en": "What is the difference between a direct and indirect object?",
"question_hi": "एक अभिनं एक अभिनों एक अभिनं एक अभिनं एक अभिनं एक",
"option_en": "D",
"option_hi": "एक अभिनं एक",
"option_hi": "एक अभिनो