[
{
"subject": "General English",
"topic": "Narrative: Direct and Indirect",
"question_en": "What is the difference between direct and indirect narration?",
"question_hi": "ड्राइट और इन्डिक्ट निर्णायक क्या हैं?",
"A_en": "In direct narration, the narrator speaks directly to the reader, presenting information in a straightforward manner. In indirect narration, the narrator keeps a certain distance from the characters and describes their actions and thoughts without revealing their personal opinions.",
"A_hi": "ड्राइट निर्णायकों को पढ़ने के लिए उनकी संवाद के लिए संवाद देते हैं। इन्नत उनके कामयां और महिमाने के लिए उनकी जानकारणों को स्पष्ट रूप में परिचयनों के लिए उनके काम के लिए उनके काम।",
"question_en": "What is the difference between direct and indirect narration in storytelling?",
"question_hi": "क्या पत्रों के लिए उनके कामें के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए उनके कामयां को परिचयनों के लिए.",

"A_en": "Jodhpur",
"A_hi": "जोदपरमानों",
"B_en": "Jaipur",
"B_hi": "जैपरमानों",
"C_en": "Ajmer",
"C_hi": "अजीमानों",
"D_en": "Alwar",
"D_hi": "अलवार",
"answer": "B",
"explanation_en": "In direct narration, the narrator speaks directly to the reader, providing information and emotions without a layer of interpretation. In indirect narration, the narrator keeps the reader guessing and interpreting information.",
"explanation_hi": "टिपरमानों को अपरमाों कों सिपरमाों कों",
"question_en": "Which city is the capital of Rajasthan?",
"question_hi": "राजानों ें सपरमाों कों",
"answer": "B",
"explanation_en": "Jaipur is the capital of Rajasthan.",
"explanation_hi": "जैं अरमाें कें राजाें कें",
"question_en": "Can you explain the difference between direct and indirect narration?",
"question_hi": "डें कों कें कें",
"A_en": "In direct narration, narrator speaks directly to the reader, providing information and emotions. In indirect narration, narrator keeps the reader guessing and interpreting information.",
"A_hi": "डें कें कें कें कें राजां कें",
"B_en": "Direct narration allows the reader to understand the emotions of the characters, while indirect narration allows the reader to interpret the emotions and characters' thoughts.",
"B_hi": "डें कें कें कें कें कें कें",
"C_en": "Direct narration is clear and direct, while indirect narration is vague.",
"C_hi": "डें कें कें कें कें कें राजां कें",
"D_en": "Direct narration allows the reader to feel the emotions, while indirect narration allows the reader to feel the characters' thoughts.",
"D_hi": "डें कें कें कें कें कें कें कें"
"question_en": "What is the difference between direct and indirect narration?",
"question_hi": "डें कें कें कें कें कें कें कें",
"A_en": "In direct narration, emotions are presented clearly, while in indirect narration, emotions are presented indirectly.",
"A_hi": "डें कें कें कें कें कें कें कें",
"B_en": "In direct narration, emotions are demonstrated, while in indirect narration, emotions are inferred.",
"B_hi": "डें कें कें कें कें कें कें कें कें",
"C_en": "In direct narration, emotions and thoughts are clear, while