[
{
"subject": "Current Affairs",
"topic": "Biden Administration ke Under Bharat aur America ke Bechane ke liye Nai Samjhauta",
"question_en": "Biden Administration ke under Bharat aur America ke beechan ki kai baaton par ek naya samjhauta kiya gaya hai. Yah samjhauta ka pratham uddeshya kya tha?",
"question_hi": "बाइडन की अधीनता में भारत और अमेरिका के बीच व्यापार के लिए एक नई समझौते की कुछ बातों पर किया गया था। यह समझौते का पहला उद्देश्य क्या था?",
"A_en": "Davos Summit ke madhyam se Bharat aur America ke beech vishvaas ko badhvana", "A_hi": "दावोस समिट के माध्यम से भारत और अमेरिका के बीच विश्वास को बढ़ाना",
"B_en": "Bharat ko America ke naye urja karyakram mein shamil karna", "B_hi": "भारत को अमेरिका के नए ऊर्जा कार्यक्रम में शामिल करना",
"C_en": "Bharat aur America ke beech bechane ke liye naya mukhya uttejna", "C_hi": "भारत और अमेरिका के बीच व्यापार के लिए नया मुख्य उत्तेजक",
"D_en": "Bharat aur America ke beech rajiya suraksha samjhauta", "D_hi": "भारत और अमेरिका के बीच राष्ट्रीय सुरक्षा समझौता",
"answer": "A",
"explanation_en": "Biden Administration ke under, Bharat aur America ke beech vishvaas ko badhane aur ek naya samjhauta banana, Davos Summit ke madhyam se shuru kiya gaya tha.",
"explanation_hi": "बाइडन की अधीनता में भारत और अमेरिका के बीच विश्वास को बढ़ाने और एक नई समझौता करने के लिए, दावोस समिट के माध्यम से शुरू किया गया था।"
},
{
"subject": "Current Affairs",
"topic": "Volkswagen Group ne India mein Electric Vehicles ke liye naya plant ki shuruaat ki",
"question_en": "Volkswagen Group ne Bharat mein Electric Vehicles ke liye naya plant ki shuruaat karne ke liye kai prakriyaon ko poora kiya hai, lekin yah kahaan sthit hai?",
"question_hi": "वोल्क्सवैगन ग्रुप ने भारत में इलेक्ट्रिक वाहनों के लिए एक नया प्लांट शुरू करने के लिए कई प्रक्रियाओं को पूरा किया है, लेकिन यह कहां स्थित है?",
"A_en": "Bharatpur, Rajasthan", "A_hi": "भरतपुर, राजस्थान",
"B_en": "Noida, Uttar Pradesh", "B_hi": "नोएडा, उत्तर प्रदेश",
"C_en": "Pune, Maharashtra", "C_hi": "पुणे, महाराष्ट्र",
"D_en": "Tamil Nadu's Chennai", "D_hi": "तमिलनाडु का चेन्नई",
"answer": "A",
"explanation_en": "Volkswagen Group ne Bharatpur, Rajasthan mein ek naya plant sthapit kiya hai jahaan ve Electric Vehicles banayenge.",
"explanation_hi": "वोल्क्सवैगन ग्रुप ने भारतपुर, राजस्थान में एक नया प्लांट स्थापित किया है जहाँ वे इलेक्ट्रिक वाहन बनाएंगे।"
},
{
"subject": "Current Affairs",
"topic": "NASA ne Bharat ke liye Chandrayaan-3 Mission ka Launch Kiya",
"question_en": "NASA ne Bharat ke liye Chandrayaan-3 Mission ka launch kiya, lekin yah launch kahan se kiya gaya?",
"question_hi": "एनएसए ने भारत के लिए चंद्रयान-3 मिशन का लॉन्च किया, लेकिन यह लॉन्च कहाँ से किया गया?",
"A_en": "Satish Dhawan Space Centre, Sriharikota", "A_hi": "सतीश धवन स्पेस सेंटर, श्रीहरिकोटा",
"B_en": "ISRO's Bengaluru", "B_hi": "आईसरो का बेंगलुरु",
"C_en": "Bhubaneswar, Odisha", "C_hi": "भुवनेश्वर, ओडिशा",
"D_en": "Vikram Sarabhai Space Centre, Thiruvananthapuram", "D_hi": "विक्रम साराभाई स्पेस सेंटर, तिरुवनंतपुरम",
"answer": "A",
"explanation_en": "NASA ne Chandrayaan-3 Mission ka launch Satish Dhawan Space Centre, Sriharikota se kiya tha.",
"explanation_hi": "एनएसए ने चंद्रयान-3 मिशन का लॉन्च सतीश धवन स्पेस सेंटर, श्रीहरिकोटा से किया था।"
},
{
"subject": "Current Affairs",
"topic": "UNESCO ne Bharat ka Sabse Bada Jheel, Lake Nainital ko Global Importance Di",
"question_en": "UNESCO ne Bharat ka sabse bada jheel, Lake Nainital ko global importance di, iske liye kya karanon ke sambandh mein kiya gaya hai?",
"question_hi": "यूनेस्को ने भारत का सबसे बड़ा झील, लेक नैनीताल को ग्लोबल महत्व दिया, इसे लिए क्या कारणों के संबंध में किया गया है?",
"A_en": "Lake Nainital ke parvatmala aur prakritik samridhi", "A_hi": "लेक नैनीताल के पर्वतमाला और प्राकृतिक समृद्धि",
"B_en": "Lake Nainital ke parvatmala aur prakritik samridhi ke saath-sath apni vyavsaayik mahatva", "B_hi": "लेक नैनीताल के पर्वतमाला और प्राकृतिक समृद्धि के साथ-साथ अपनी व्यावसायिक महत्व",
"C_en": "Lake Nainital ke parvatmala aur prakritik samridhi ke saath-sath apni sanskritik mahatva", "C_hi": "लेक नैनीताल के पर्वतमाला और प्राकृतिक समृद्धि के साथ-साथ अपनी सांस्कृतिक महत्व",
"D_en": "Lake Nainital ke parvatmala aur prakritik samridhi ke saath-sath apni arthik utpadan", "D_hi": "लेक नैनीताल के पर्वतमाला और प्राकृतिक समृद्धि के साथ-साथ अपनी आर्थिक उत्पादन",
"answer": "B",
"explanation_en": "UNESCO ne Lake Nainital ko global importance di, iske liye yah kahaan ke karanon ke sambandh mein kiya gaya hai. Lake Nainital ke parvatmala aur prakritik samridhi ke saath-sath apni vyavsaayik mahatva ke karan UNESCO ne isko global importance di.",
"explanation_hi": "यूनेस्को ने लेक नैनीताल को ग्लोबल महत्व दिया, इसे लिए यहाँ के कारणों के संबंध में किया गया है। लेक नैनीताल के पर्वतमाला और प्राकृतिक समृद्धि के साथ-साथ अपनी व्यावसायिक महत्व के कारण यूनेस्को ने इसे ग्लोबल महत्व दिया।"
},
{
"subject": "Current Affairs",
"topic": "Bharat aur America ke beech Global Climate Action Summit ke Liye Nai Samjhauta",
"question_en": "Bharat aur America ke beech global climate action summit ke liye nai samjhauta ka pratham uddeshya kya tha?",
"question_hi": "भारत और अमेरिका के बीच ग्लोबल क्लाइमेट एक्शन समिट के लिए नई समझौते का पहला उद्देश्य क्या था?",
"A_en": "Bharat ko America ke naye urja karyakram mein shamil karna", "A_hi": "भारत को अमेरिका के नए ऊर्जा कार्यक्रम में शामिल करना",
"B_en": "Bharat aur America ke beech bechane ke liye naya mukhya uttejna", "B_hi": "भारत और अमेरिका के बीच व्यापार के लिए नया मुख्य उत्तेजक",
"C_en": "Bharat aur America ke beech rajiya suraksha samjhauta", "C_hi": "भारत और अमेरिका के बीच राष्ट्रीय सुरक्षा समझौता",
"D_en": "Bharat aur America ke beech global climate action summit ke liye naya samjhauta", "D_hi": "भारत और अमेरिका के बीच ग्लोबल क्लाइमेट एक्शन समिट के लिए नया समझौता",
"answer": "D",
"explanation_en": "Bharat aur America ke beech global climate action summit ke liye naya samjhauta ka pratham uddeshya yah tha ki Bharat aur America donon mil kar global climate action summit mein hissa lein.",
"explanation_hi": "भारत और अमेरिका के बीच ग्लोबल क्लाइमेट एक्शन समिट के लिए नया समझौता का पहला उद्देश्य यह था कि भारत और अमेरिका दोनों मिलकर ग्लोबल क्लाइमेट एक्शन समिट में हिस्सा लें।"
},
{
"subject": "Current Affairs",
"topic": "ISRO ne Bharat ka Pahla Private Mission, Vikram-S ko Launched Kiya",
"question_en": "ISRO ne Bharat ka pahla private mission, Vikram-S ko launch kiya, is mission ke liye ISRO ne konsi company ka Sahayata Li?",
"question_hi": "आईएसआरओ ने भारत का पहला प्राइवेट मिशन, विक्रम-एस को लॉन्च किया, इस मिशन के लिए आईएसआरओ ने किस कंपनी का सहयोग लिया?",
"A_en": "Skyroot Aerospace", "A_hi": "स्काईरूट एयरोस्पेस",
"B_en": "Agnikul Cosmos", "B_hi": "अग्निकुल कॉस्मॉस",
"C_en": "Skyroot Aerospace aur Agnikul Cosmos", "C_hi": "स्काईरूट एयरोस्पेस और अग्निकुल कॉस्मॉस",
"D_en": "ISRO ka ek khud ka project tha", "D_hi": "आईएसआरओ का एक खुद का प्रोजेक्ट था",
"answer": "C",
"explanation_en": "ISRO ne Vikram-S mission ko launch karne ke liye Skyroot Aerospace aur Agnikul Cosmos ke saath mil kar kaam kiya.",
"explanation_hi": "आईएसआरओ ने विक्रम-एस मिशन को लॉन्च करने के लिए स्काईरूट एयरोस्पेस और अग्निकुल कॉस्मॉस के साथ मिलकर काम किया।"
},
{
"subject": "Current Affairs",
"topic": "Bharat ka Sabse Bada Solar Power Plant, Bhadla Solar Park, 2,245 MW Tak Ka Capacity Wala",
"question_en": "Bharat ka sabse bada solar power plant, Bhadla Solar Park, 2,245 MW tak ka capacity wala, iske liye kyon banaya gaya?",
"question_hi": "भारत का सबसे बड़ा सौर ऊर्जा संयंत्र, भadla सोलर पार्क, 2,245 मेगावॉट तक की क्षमता वाला, इसके लिए क्यों बनाया गया?",
"A_en": "Bharat mein renewable energy ka vikas karna", "A_hi": "भारत में नवीकरणीय ऊर्जा का विकास करना",
"B_en": "Bharat mein electricity ka utpadan karna", "B_hi": "भारत में बिजली का उत्पादन करना",
"C_en": "Bharat mein climate change ko rokna", "C_hi": "भारत में जलवायु परिवर्तन को रोकना",
"D_en": "Bharat mein economy ka vikas karna", "D_hi": "भारत में अर्थव्यवस्था का विकास करना",
"answer": "A",
"explanation_en": "Bharat ka sabse bada solar power plant, Bhadla Solar Park, 2,245 MW tak ka capacity wala, iske liye Bharat mein renewable energy ka vikas karna tha.",
"explanation_hi": "भारत का सबसे बड़ा सौर ऊर्जा संयंत्र, भadla सोलर पार्क, 2,245 मेगावॉट तक की क्षमता वाला, इसके लिए भारत में नवीकरणीय ऊर्जा का विकास करना था।"
},
{
"subject": "Current Affairs",
"topic": "Bharat ka Pahla 3D-Printed House, Andhra Pradesh ke Vishakhapatnam Mein",
"question_en": "Bharat ka pahla 3D-printed house, Andhra Pradesh ke Vishakhapatnam mein, iske liye kyon banaya gaya?",
"question_hi": "भारत का पहला 3डी-प्रिंटेड हाउस, आंध्र प्रदेश के विशाखापत्तनम में, इसके लिए क्यों बनाया गया?",
"A_en": "Bharat mein affordable housing ka vikas karna", "A_hi": "भारत में सस्ती आवास का विकास करना",
"B_en": "Bharat mein construction ka samay kam karna", "B_hi": "भारत में निर्माण का समय कम करना",
"C_en": "Bharat mein environment ko bachana", "C_hi": "भारत में पर्यावरण को बचाना",
"D_en": "Bharat mein economy ka vikas karna", "D_hi": "भारत में अर्थव्यवस्था का विकास करना",
"answer": "A",
"explanation_en": "Bharat ka pahla 3D-printed house, Andhra Pradesh ke Vishakhapatnam mein, iske liye Bharat mein affordable housing ka vikas karna tha.",
"explanation_hi": "भारत का पहला 3डी-प्रिंटेड हाउस, आंध्र प्रदेश के विशाखापत्तनम में, इसके लिए भारत में सस्ती आवास का विकास करना था।"
},
{
"subject": "Current Affairs",
"topic": "Bharat ka Sabse Bada Tunnel, Shimla's Rohtang Tunnel 8.8 KM Upar",
"question_en": "Bharat ka sabse bada tunnel, Shimla's Rohtang Tunnel 8.8 KM upar, iske liye kyon banaya gaya?",
"question_hi": "भारत का सबसे बड़ा टनल, शिमला का रोहतांग टनल 8.8 किलोमीटर ऊपर, इसके लिए क्यों बनाया गया?",
"A_en": "Bharat mein transportation ka vikas karna", "A_hi": "भारत में परिवहन का विकास करना",
"B_en": "Bharat mein tourism ka vikas karna", "B_hi": "भारत में पर्यटन का विकास करना",
"C_en": "Bharat mein environment ko bachana", "C_hi": "भारत में पर्यावरण को बचाना",
"D_en": "Bharat mein economy ka vikas karna", "D_hi": "भारत में अर्थव्यवस्था का विकास करना",
"answer": "A",
"explanation_en": "Bharat ka sabse bada tunnel, Shimla's Rohtang Tunnel 8.8 KM upar, iske liye Bharat mein transportation ka vikas karna tha.",
"explanation_hi": "भारत का सबसे बड़ा टनल, शिमला का रोहतांग टनल 8.8 किलोमीटर ऊपर, इसके लिए भारत में परिवहन का विकास करना था।"
}
]