[
{
"subject": "Indian Polity",
"topic": "Constitution of India",
"question_en": "What is the Preamble to the Indian Constitution?",
"question_hi": "भारतीय संविधान का प्रस्तावना क्या है?",
"A_en": "It declares the objectives of the Constitution", "A_hi": "यह संविधान के उद्देश्यों को घोषित करता है",
"B_en": "It is a part of the Fundamental Rights", "B_hi": "यह मौलिक अधिकारों का हिस्सा है",
"C_en": "It is a part of the Directive Principles of State Policy", "C_hi": "यह राज्य नीति निर्देशों का हिस्सा है",
"D_en": "It is a part of the Emergency Provisions", "D_hi": "यह आपातकालीन प्रावधानों का हिस्सा है",
"answer": "A",
"explanation_en": "The Preamble declares the objectives of the Indian Constitution.",
"explanation_hi": "प्रस्तावना भारतीय संविधान के उद्देश्यों को घोषित करता है।"
},
{
"subject": "Indian Polity",
"topic": "Constitution of India",
"question_en": "What is the difference between a Directive Principle of State Policy and a Fundamental Right?",
"question_hi": "राज्य नीति निर्देश और मौलिक अधिकार के बीच अंतर क्या है?",
"A_en": "Directive Principles are enforceable by the courts", "A_hi": "नीति निर्देश न्यायालय द्वारा लागू किए जा सकते हैं",
"B_en": "Fundamental Rights are not enforceable by the courts", "B_hi": "मौलिक अधिकार न्यायालय द्वारा लागू नहीं किए जा सकते हैं",
"C_en": "Directive Principles are part of the Fundamental Rights", "C_hi": "नीति निर्देश मौलिक अधिकारों का हिस्सा है",
"D_en": "Directive Principles are not mentioned in the Constitution", "D_hi": "नीति निर्देश संविधान में नहीं उल्लिखित हैं",
"answer": "B",
"explanation_en": "Directive Principles of State Policy are not enforceable by the courts, whereas Fundamental Rights are enforceable by the courts.",
"explanation_hi": "राज्य नीति निर्देश न्यायालय द्वारा लागू नहीं किए जा सकते हैं, जबकि मौलिक अधिकार न्यायालय द्वारा लागू किए जा सकते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Parliament of India",
"question_en": "What is the term of office of a member of the Lok Sabha?",
"question_hi": "लोकसभा के सदस्य की कार्यकाल कितना होता है?",
"A_en": "5 years", "A_hi": "5 वर्ष",
"B_en": "6 years", "B_hi": "6 वर्ष",
"C_en": "7 years", "C_hi": "7 वर्ष",
"D_en": "variable", "D_hi": "परिवर्तनशील",
"answer": "A",
"explanation_en": "A member of the Lok Sabha has a term of office of 5 years.",
"explanation_hi": "लोकसभा के सदस्य का कार्यकाल 5 वर्ष होता है।"
},
{
"subject": "Indian Polity",
"topic": "Parliament of India",
"question_en": "What is the role of the Lok Sabha in the Indian Parliament?",
"question_hi": "भारतीय संसद में लोकसभा की भूमिका क्या है?",
"A_en": "It is the upper house of the Parliament", "A_hi": "यह संसद का ऊपरी सदन है",
"B_en": "It is the lower house of the Parliament", "B_hi": "यह संसद का निचला सदन है",
"C_en": "It has the power to appoint the Prime Minister", "C_hi": "यह प्रधान मंत्री को नियुक्त करने के अधिकार को रखता है",
"D_en": "It has the power to appoint the President", "D_hi": "यह राष्ट्रपति को नियुक्त करने के अधिकार को रखता है",
"answer": "B",
"explanation_en": "The Lok Sabha is the lower house of the Indian Parliament.",
"explanation_hi": "लोकसभा भारतीय संसद का निचला सदन है।"
},
{
"subject": "Indian Polity",
"topic": "Judiciary",
"question_en": "What is the Supreme Court of India?",
"question_hi": "भारत में उच्चतम न्यायालय क्या है?",
"A_en": "The highest court in the country", "A_hi": "देश का उच्चतम न्यायालय",
"B_en": "The court that interprets the Constitution", "B_hi": "संविधान को व्याख्या करने वाला न्यायालय",
"C_en": "The court that has the power to declare laws as unconstitutional", "C_hi": "कानूनों को अवैध घोषित करने का अधिकार रखने वाला न्यायालय",
"D_en": "The court that has the power to appoint the President", "D_hi": "राष्ट्रपति नियुक्त करने का अधिकार रखने वाला न्यायालय",
"answer": "C",
"explanation_en": "The Supreme Court of India has the power to declare laws as unconstitutional.",
"explanation_hi": "भारत का उच्चतम न्यायालय कानूनों को अवैध घोषित करने का अधिकार रखता है।"
},
{
"subject": "Indian Polity",
"topic": "Judiciary",
"question_en": "What is the role of the High Courts in the Indian judicial system?",
"question_hi": "भारतीय न्यायिक प्रणाली में उच्च न्यायालयों की भूमिका क्या है?",
"A_en": "They have the power to declare laws as unconstitutional", "A_hi": "वे कानूनों को अवैध घोषित करने का अधिकार रखते हैं",
"B_en": "They have the power to interpret the Constitution", "B_hi": "वे संविधान को व्याख्या करने का अधिकार रखते हैं",
"C_en": "They have the power to try cases related to civil and criminal law", "C_hi": "वे नागरिक और दंड संहिता से संबंधित मामलों का निपटारा करने का अधिकार रखते हैं",
"D_en": "They have the power to appoint the judges of the Supreme Court", "D_hi": "वे उच्चतम न्यायालय के न्यायाधीशों की नियुक्ति करने का अधिकार रखते हैं",
"answer": "C",
"explanation_en": "The High Courts in India have the power to try cases related to civil and criminal law.",
"explanation_hi": "भारत के उच्च न्यायालय नागरिक और दंड संहिता से संबंधित मामलों का निपटारा करने का अधिकार रखते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Electoral System",
"question_en": "What is the First-Past-The-Post (FPTP) system?",
"question_hi": "पहला-पास-दी-पोस्ट (FPTP) प्रणाली क्या है?",
"A_en": "A system where the candidate with the most votes wins", "A_hi": "वह प्रणाली जहां सबसे अधिक मत पड़ने वाले उम्मीदवार जीतते हैं",
"B_en": "A system where the candidate with the most votes is elected by a majority vote", "B_hi": "वह प्रणाली जहां सबसे अधिक मत पड़ने वाले उम्मीदवार बहुमत के मत से चुने जाते हैं",
"C_en": "A system where the candidate with the most votes is elected by a proportional representation", "C_hi": "वह प्रणाली जहां सबसे अधिक मत पड़ने वाले उम्मीदवार अनुपाती प्रतिनिधित्व द्वारा चुने जाते हैं",
"D_en": "A system where the candidate with the least votes is elected", "D_hi": "वह प्रणाली जहां सबसे कम मत पड़ने वाले उम्मीदवार चुने जाते हैं",
"answer": "A",
"explanation_en": "The First-Past-The-Post (FPTP) system is a system where the candidate with the most votes wins.",
"explanation_hi": "पहला-पास-दी-पोस्ट (FPTP) प्रणाली वह प्रणाली है जहां सबसे अधिक मत पड़ने वाले उम्मीदवार जीतते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Electoral System",
"question_en": "What is the concept of Single Transferable Vote (STV)?",
"question_hi": "सिंगल ट्रांसफरेबल वोट (STV) का सिद्धांत क्या है?",
"A_en": "A system where each voter has multiple preferences", "A_hi": "वह प्रणाली जहां प्रत्येक मतदाता कई पसंदीदा होते हैं",
"B_en": "A system where each voter has one preference", "B_hi": "वह प्रणाली जहां प्रत्येक मतदाता एक पसंदीदा होता है",
"C_en": "A system where the candidate with the most votes wins", "C_hi": "वह प्रणाली जहां सबसे अधिक मत पड़ने वाले उम्मीदवार जीतते हैं",
"D_en": "A system where the candidate with the least votes is elected", "D_hi": "वह प्रणाली जहां सबसे कम मत पड़ने वाले उम्मीदवार चुने जाते हैं",
"answer": "A",
"explanation_en": "The Single Transferable Vote (STV) system is a system where each voter has multiple preferences.",
"explanation_hi": "सिंगल ट्रांसफरेबल वोट (STV) प्रणाली वह प्रणाली है जहां प्रत्येक मतदाता कई पसंदीदा होते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj Institutions",
"question_en": "What is the 73rd Amendment to the Constitution?",
"question_hi": "संविधान का 73वां संशोधन क्या है?",
"A_en": "It provides for the establishment of Panchayati Raj Institutions", "A_hi": "यह पंचायती राज संस्थानों की स्थापना के लिए प्रदान करता है",
"B_en": "It provides for the establishment of Municipalities", "B_hi": "यह महानगरपालिकाओं की स्थापना के लिए प्रदान करता है",
"C_en": "It provides for the reservation of seats for SC/ST", "C_hi": "यह एससी/एसटी के लिए बैठने का आरक्षण प्रदान करता है",
"D_en": "It provides for the abolition of Panchayati Raj Institutions", "D_hi": "यह पंचायती राज संस्थानों को समाप्त करने के लिए प्रदान करता है",
"answer": "A",
"explanation_en": "The 73rd Amendment to the Constitution provides for the establishment of Panchayati Raj Institutions.",
"explanation_hi": "संविधान का 73वां संशोधन पंचायती राज संस्थानों की स्थापना के लिए प्रदान करता है।"
}