[
{
"subject": "Indian Polity",
"topic": "Constitution of India",
"question_en": "What is the Preamble to the Indian Constitution?",
"question_hi": "भारतीय संविधान का प्रस्तावना क्या है?",
"A_en": "It sets out the basic principles of the Constitution.",
"A_hi": "यह संविधान के मूल सिद्धांतों को परिभाषित करता है।",
"B_en": "It sets out the structure of the Government.",
"B_hi": "यह सरकार की संरचना को परिभाषित करता है।",
"C_en": "It sets out the rights of the citizens.",
"C_hi": "यह नागरिकों के अधिकारों को परिभाषित करता है।",
"D_en": "It sets out the duties of the citizens.",
"D_hi": "यह नागरिकों के कर्तव्यों को परिभाषित करता है।",
"answer": "A",
"explanation_en": "The Preamble to the Indian Constitution sets out the basic principles of the Constitution, such as justice, equality, liberty, and fraternity.",
"explanation_hi": "भारतीय संविधान के प्रस्तावना में संविधान के मूल सिद्धांतों को परिभाषित किया गया है, जैसे कि न्याय, समानता, स्वतंत्रता, और भाईचारा ।"
},
{
"subject": "Indian Polity",
"topic": "Executive",
"question_en": "Who is the Head of the Indian Executive?",
"question_hi": "भारतीय कार्यकारी का प्रमुख कौन है?",
"A_en": "The President of India",
"A_hi": "भारत के राष्ट्रपति",
"B_en": "The Prime Minister of India",
"B_hi": "भारत के प्रधान मंत्री",
"C_en": "The Chief Justice of India",
"C_hi": "भारत के मुख्य न्यायाधीश",
"D_en": "The Speaker of the Lok Sabha",
"D_hi": "लोकसभा के अध्यक्ष",
"answer": "A",
"explanation_en": "The President of India is the Head of the Indian Executive, who is elected by the Electoral College for a term of five years.",
"explanation_hi": "भारत के राष्ट्रपति भारतीय कार्यकारी के प्रमुख हैं, जो पांच साल की अवधि के लिए चुने जाते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Legislature",
"question_en": "What is the main function of the Legislature?",
"question_hi": "विधानमंडल की मुख्य कार्य क्या है?",
"A_en": "To make laws",
"A_hi": "कानून बनाना",
"B_en": "To interpret laws",
"B_hi": "कानूनों को व्याख्या करना",
"C_en": "To execute laws",
"C_hi": "कानूनों को लागू करना",
"D_en": "To advise the Executive",
"D_hi": "कार्यकारी को परामर्श देना",
"answer": "A",
"explanation_en": "The main function of the Legislature is to make laws, which are passed by the Parliament or the State Legislatures.",
"explanation_hi": "विधानमंडल की मुख्य कार्य कानून बनाना है, जो संसद या राज्य विधानमंडल द्वारा पारित किए जाते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Judiciary",
"question_en": "What is the highest court in India?",
"question_hi": "भारत में सर्वोच्च न्यायालय कौन सा है?",
"A_en": "The Supreme Court of India",
"A_hi": "भारत के सर्वोच्च न्यायालय",
"B_en": "The High Court of Delhi",
"B_hi": "दिल्ली के उच्च न्यायालय",
"C_en": "The High Court of Calcutta",
"C_hi": "कलकत्ता के उच्च न्यायालय",
"D_en": "The High Court of Bombay",
"D_hi": "बॉम्बे के उच्च न्यायालय",
"answer": "A",
"explanation_en": "The Supreme Court of India is the highest court in India, which has the power to interpret the Constitution and laws of the country.",
"explanation_hi": "भारत के सर्वोच्च न्यायालय भारत में सबसे उच्च न्यायालय है, जिसके पास संविधान और देश के कानूनों को व्याख्या करने की शक्ति है।"
},
{
"subject": "Indian Polity",
"topic": "Fundamental Rights",
"question_en": "What is the purpose of Article 14 of the Indian Constitution?",
"question_hi": "भारतीय संविधान के अनुच्छेद 14 का उद्देश्य क्या है?",
"A_en": "To provide equality before the law",
"A_hi": "कानून के सामने समानता प्रदान करना",
"B_en": "To provide freedom of speech and expression",
"B_hi": "भाषण और व्यक्ति की स्वतंत्रता प्रदान करना",
"C_en": "To provide right to education",
"C_hi": "शिक्षा का अधिकार प्रदान करना",
"D_en": "To provide right to equality before the law",
"D_hi": "कानून के सामने समानता का अधिकार प्रदान करना",
"answer": "A",
"explanation_en": "Article 14 of the Indian Constitution provides for equality before the law, which means that every person is equal before the law and is entitled to equal protection of the law.",
"explanation_hi": "भारतीय संविधान के अनुच्छेद 14 कानून के सामने समानता प्रदान करता है, जिसका अर्थ है कि प्रत्येक व्यक्ति कानून के सामने समान है और कानून की समान सुरक्षा का अधिकारी है।"
},
{
"subject": "Indian Polity",
"topic": "Directive Principles of State Policy",
"question_en": "What is the purpose of the Directive Principles of State Policy?",
"question_hi": "राज्य नीति निर्देशात्मक सिद्धांतों का उद्देश्य क्या है?",
"A_en": "To guide the government",
"A_hi": "सरकार को मार्गदर्शन करना",
"B_en": "To provide fundamental rights",
"B_hi": "मूल अधिकार प्रदान करना",
"C_en": "To provide directive principles",
"C_hi": "निर्देशात्मक सिद्धांत प्रदान करना",
"D_en": "To provide for social welfare",
"D_hi": "सामाजिक कल्याण के लिए प्रदान करना",
"answer": "A",
"explanation_en": "The Directive Principles of State Policy are guidelines for the government to follow, which are aimed at promoting social and economic welfare of the people.",
"explanation_hi": "राज्य नीति निर्देशात्मक सिद्धांत सरकार के लिए मार्गदर्शक सिद्धांत हैं, जिनका उद्देश्य लोगों के सामाजिक और आर्थिक कल्याण को बढ़ावा देना है।"
},
{
"subject": "Indian Polity",
"topic": "Federalism",
"question_en": "What is the concept of federalism in India?",
"question_hi": "भारत में संघवाद का सिद्धांत क्या है?",
"A_en": "A system of government in which power is divided between the central and state governments",
"A_hi": "एक ऐसा प्रणाली जहां शक्ति केंद्र और राज्य सरकारों के बीच बांटी जाती है",
"B_en": "A system of government in which power is concentrated in the hands of the central government",
"B_hi": "एक ऐसा प्रणाली जहां शक्ति केंद्र सरकार के हाथों में केंद्रित होती है",
"C_en": "A system of government in which power is concentrated in the hands of the state governments",
"C_hi": "एक ऐसा प्रणाली जहां शक्ति राज्य सरकारों के हाथों में केंद्रित होती है",
"D_en": "A system of government in which power is divided between the central and local governments",
"D_hi": "एक ऐसा प्रणाली जहां शक्ति केंद्र और स्थानीय सरकारों के बीच बांटी जाती है",
"answer": "A",
"explanation_en": "Federalism in India refers to a system of government in which power is divided between the central and state governments, which allows for greater autonomy and decision-making at the state level.",
"explanation_hi": "भारत में संघवाद एक ऐसी प्रणाली का संदर्भ देता है जहां शक्ति केंद्र और राज्य सरकारों के बीच बांटी जाती है, जिससे राज्य स्तर पर अधिक स्वायत्तता और निर्णय लेने की क्षमता होती है।"
},
{
"subject": "Indian Polity",
"topic": "Emergency Provisions",
"question_en": "What is the purpose of Article 352 of the Indian Constitution?",
"question_hi": "भारतीय संविधान के अनुच्छेद 352 का उद्देश्य क्या है?",
"A_en": "To declare a national emergency",
"A_hi": "राष्ट्रीय आपातकाल की घोषणा करना",
"B_en": "To declare a state emergency",
"B_hi": "राज्य आपातकाल की घोषणा करना",
"C_en": "To provide for the suspension of the Constitution",
"C_hi": "संविधान के विलम्ब के लिए प्रदान करना",
"D_en": "To provide for the appointment of the President",
"D_hi": "राष्ट्रपति की नियुक्ति के लिए प्रदान करना",
"answer": "A",
"explanation_en": "Article 352 of the Indian Constitution allows the President to declare a national emergency, which enables the government to take extraordinary measures to deal with a situation of national crisis.",
"explanation_hi": "भारतीय संविधान के अनुच्छेद 352 राष्ट्रपति को राष्ट्रीय आपातकाल की घोषणा करने की अनुमति देता है, जिससे सरकार को राष्ट्रीय आपदा का सामना करने के लिए असाधारण उपाय करने की अनुमति मिलती है।"
},
{
"subject": "Indian Polity",
"topic": "Amendment of the Constitution",
"question_en": "What is the process of amending the Indian Constitution?",
"question_hi": "भारतीय संविधान में संशोधन की प्रक्रिया क्या है?",
"A_en": "It requires a two-thirds majority in both Houses of Parliament",
"A_hi": "यह दोनों सदनों में दो-तिहाई से अधिक बहुमत की आवश्यकता होती है",
"B_en": "It requires a simple majority in both Houses of Parliament",
"B_hi": "यह दोनों सदनों में साधारण बहुमत की आवश्यकता होती है",
"C_en": "It requires a majority in the Lok Sabha",
"C_hi": "यह लोकसभा में बहुमत की आवश्यकता होती है",
"D_en": "It requires a consensus among all parties",
"D_hi": "यह सभी दलों में सहमति की आवश्यकता होती है",
"answer": "A",
"explanation_en": "The process of amending the Indian Constitution requires a two-thirds majority in both Houses of Parliament, which ensures that any change to the Constitution is done with the consensus of a majority of the members of Parliament.",
"explanation_hi": "भारतीय संविधान में संशोधन की प्रक्रिया में दोनों सदनों में दो-तिहाई से अधिक बहुमत की आवश्यकता होती है, जिससे यह सुनिश्चित होता है कि कोई भी संविधान में परिवर्तन बहुसंख्यक सदस्यों की सहमति के साथ किया जाए।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj",
"question_en": "What is the main objective of the Panchayati Raj system?",
"question_hi": "पंचायती राज प्रणाली का मुख्य उद्देश्य क्या है?",
"A_en": "To provide decentralized administration",
"A_hi": "वितरित प्रशासन प्रदान करना",
"B_en": "To provide for the representation of women",
"B_hi": "महिलाओं के प्रतिनिधित्व के लिए प्रदान करना",
"C_en": "To provide for the protection of the environment",
"C_hi": "पर्यावरण की सुरक्षा के लिए प्रदान करना",
"D_en": "To provide for the empowerment of the rural people",
"D_hi": "ग्रामीण लोगों को सशक्तिकरण के लिए प्रदान करना",
"answer": "A",
"explanation_en": "The main objective of the Panchayati Raj system is to provide decentralized administration, which enables the local governments to take decisions and implement policies at the grassroots level.",
"explanation_hi": "पंचायती राज प्रणाली का मुख्य उद्देश्य वितरित प्रशासन प्रदान करना है, जिससे स्थानीय सरकारें जमीनी स्तर पर निर्णय ले सकती हैं और नीतियों को लागू कर सकती हैं।"
}
]