[
{
"subject": "Indian Polity",
"topic": "Constitution of India",
"question_en": "What is the Preamble to the Constitution of India?",
"question_hi": "भारत के संविधान का पreamble क्या है?",
"A_en": "A brief introduction to the Constitution", "A_hi": "संविधान का एक छोटा सा परिचय",
"B_en": "A formal address to the citizens of India", "B_hi": "भारत के नागरिकों को एक आधिकारिक पत्र",
"C_en": "A preamble is a formal introduction to a bill or an act", "C_hi": "एक प्रारंभिक यह एक बिल या कानून का एक आधिकारिक परिचय है",
"D_en": "None of the above", "D_hi": "कोई भी नहीं",
"answer": "A",
"explanation_en": "The Preamble is a brief introduction to the Constitution, which sets out the objectives and ideals of the Constitution.",
"explanation_hi": "प्रारंभिक यह संविधान का एक छोटा सा परिचय है, जो संविधान के उद्देश्यों और आदर्शों को दर्शाता है।"
},
{
"subject": "Indian Polity",
"topic": "Fundamental Rights",
"question_en": "Which Article of the Indian Constitution provides for the Right to Freedom of Speech and Expression?",
"question_hi": "भारतीय संविधान के कौन से अनुच्छेद में अभिव्यक्ति की स्वतंत्रता का अधिकार शामिल है?",
"A_en": "Article 14", "A_hi": "अनुच्छेद 14",
"B_en": "Article 19(1)(a)", "B_hi": "अनुच्छेद 19(1)(a)",
"C_en": "Article 21", "C_hi": "अनुच्छेद 21",
"D_en": "Article 25", "D_hi": "अनुच्छेद 25",
"answer": "B",
"explanation_en": "Article 19(1)(a) provides for the Right to Freedom of Speech and Expression.",
"explanation_hi": "अनुच्छेद 19(1)(a) अभिव्यक्ति की स्वतंत्रता का अधिकार प्रदान करता है।"
},
{
"subject": "Indian Polity",
"topic": "Separation of Powers",
"question_en": "What is the doctrine of Separation of Powers?",
"question_hi": "शक्तियों के विभाजन का क्या अर्थ है?",
"A_en": "The concentration of power in the hands of one person", "A_hi": "एक व्यक्ति के हाथ में शक्ति का संकेंद्रण",
"B_en": "The distribution of power among three branches of the government", "B_hi": "सरकार के तीन शाखाओं में शक्ति का वितरण",
"C_en": "The abolition of the system of checks and balances", "C_hi": "जाँच-परख और संतुलन की प्रणाली का निष्प्रभावीकरण",
"D_en": "The doctrine of parliamentary supremacy", "D_hi": "संसदीय अनुप्रास का सिद्धांत",
"answer": "B",
"explanation_en": "The doctrine of Separation of Powers is the distribution of power among three branches of the government - the Legislature, the Executive, and the Judiciary.",
"explanation_hi": "शक्तियों के विभाजन का सिद्धांत सरकार की तीन शाखाओं - विधायी शाखा, कार्यपालिका शाखा, और न्यायपालिका शाखा - में शक्ति का वितरण है।"
},
{
"subject": "Indian Polity",
"topic": "Federalism",
"question_en": "What is the concept of Federalism in India?",
"question_hi": "भारत में संघवाद का क्या अर्थ है?",
"A_en": "A system of government where the power is concentrated in the hands of the central government", "A_hi": "एक ऐसी सरकार जहां शक्ति केंद्र सरकार के हाथों में केंद्रित होती है",
"B_en": "A system of government where power is divided between the central government and the state governments", "B_hi": "एक ऐसी सरकार जहां शक्ति केंद्र सरकार और राज्य सरकारों के बीच विभाजित होती है",
"C_en": "A system of government where the power is concentrated in the hands of the state governments", "C_hi": "एक ऐसी सरकार जहां शक्ति राज्य सरकारों के हाथों में केंद्रित होती है",
"D_en": "None of the above", "D_hi": "कोई भी नहीं",
"answer": "B",
"explanation_en": "Federalism in India refers to the division of power between the central government and the state governments.",
"explanation_hi": "भारत में संघवाद शक्ति केंद्र सरकार और राज्य सरकारों के बीच विभाजित होने का संदर्भ देता है।"
},
{
"subject": "Indian Polity",
"topic": "Emergency Provisions",
"question_en": "What is the purpose of Article 352 of the Indian Constitution?",
"question_hi": "भारतीय संविधान के अनुच्छेद 352 का उद्देश्य क्या है?",
"A_en": "To declare a state of national emergency", "A_hi": "राष्ट्रीय आपातकाल की घोषणा करने के लिए",
"B_en": "To declare a state of financial emergency", "B_hi": "आर्थिक आपातकाल की घोषणा करने के लिए",
"C_en": "To declare a state of constitutional emergency", "C_hi": "संविधानात्मक आपातकाल की घोषणा करने के लिए",
"D_en": "None of the above", "D_hi": "कोई भी नहीं",
"answer": "A",
"explanation_en": "Article 352 of the Indian Constitution authorizes the President to declare a state of national emergency.",
"explanation_hi": "भारतीय संविधान के अनुच्छेद 352 राष्ट्रपति को राष्ट्रीय आपातकाल की घोषणा करने की अनुमति देता है।"
},
{
"subject": "Indian Polity",
"topic": "Judicial Review",
"question_en": "What is the power of Judicial Review?",
"question_hi": "न्यायिक समीक्षा की शक्ति क्या है?",
"A_en": "The power to interpret the Constitution", "A_hi": "संविधान का अर्थ देने की शक्ति",
"B_en": "The power to declare laws as unconstitutional", "B_hi": "कानूनों को असंवैधानिक घोषित करने की शक्ति",
"C_en": "The power to amend the Constitution", "C_hi": "संविधान में संशोधन करने की शक्ति",
"D_en": "None of the above", "D_hi": "कोई भी नहीं",
"answer": "B",
"explanation_en": "The power of Judicial Review is the power to declare laws as unconstitutional.",
"explanation_hi": "न्यायिक समीक्षा की शक्ति कानूनों को असंवैधानिक घोषित करने की शक्ति है।"
},
{
"subject": "Indian Polity",
"topic": "Local Self-Government",
"question_en": "What is the concept of Local Self-Government?",
"question_hi": "स्थानीय स्वशासन का क्या अर्थ है?",
"A_en": "A system of government where the power is concentrated in the hands of the central government", "A_hi": "एक ऐसी सरकार जहां शक्ति केंद्र सरकार के हाथों में केंद्रित होती है",
"B_en": "A system of government where power is exercised by the local authorities", "B_hi": "एक ऐसी सरकार जहां शक्ति स्थानीय अधिकारियों द्वारा व्यापार की जाती है",
"C_en": "A system of government where the power is divided between the central government and the state governments", "C_hi": "एक ऐसी सरकार जहां शक्ति केंद्र सरकार और राज्य सरकारों के बीच विभाजित होती है",
"D_en": "None of the above", "D_hi": "कोई भी नहीं",
"answer": "B",
"explanation_en": "Local Self-Government refers to the system of government where power is exercised by the local authorities.",
"explanation_hi": "स्थानीय स्वशासन से स्थानीय अधिकारियों द्वारा शक्ति का कार्यान्वयन किया जाना है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj",
"question_en": "What is the Panchayati Raj system?",
"question_hi": "पंचायती राज प्रणाली क्या है?",
"A_en": "A system of government where the power is concentrated in the hands of the central government", "A_hi": "एक ऐसी सरकार जहां शक्ति केंद्र सरकार के हाथों में केंद्रित होती है",
"B_en": "A system of government where power is exercised by the local authorities", "B_hi": "एक ऐसी सरकार जहां शक्ति स्थानीय अधिकारियों द्वारा व्यापार की जाती है",
"C_en": "A system of government where the power is divided between the central government and the state governments", "C_hi": "एक ऐसी सरकार जहां शक्ति केंद्र सरकार और राज्य सरकारों के बीच विभाजित होती है",
"D_en": "None of the above", "D_hi": "कोई भी नहीं",
"answer": "B",
"explanation_en": "The Panchayati Raj system is a system of government where power is exercised by the local authorities.",
"explanation_hi": "पंचायती राज प्रणाली से स्थानीय अधिकारियों द्वारा शक्ति का कार्यान्वयन किया जाना है।"
},
{
"subject": "Indian Polity",
"topic": "Election Commission",
"question_en": "What is the role of the Election Commission in India?",
"question_hi": "भारत में चुनाव आयोग का क्या भूमिका है?",
"A_en": "To conduct elections to the Lok Sabha", "A_hi": "लोक सभा के चुनावों का आयोजन करना",
"B_en": "To conduct elections to the State Legislative Assemblies", "B_hi": "राज्य विधानसभाओं के चुनावों का आयोजन करना",
"C_en": "To conduct elections to the local bodies", "C_hi": "स्थानीय निकायों के चुनावों का आयोजन करना",
"D_en": "All of the above", "D_hi": "सभी ऊपर के",
"answer": "D",
"explanation_en": "The Election Commission is responsible for conducting elections to the Lok Sabha, State Legislative Assemblies, and local bodies.",
"explanation_hi": "चुनाव आयोग लोक सभा, राज्य विधानसभाओं और स्थानीय निकायों के चुनावों का आयोजन करने के लिए जिम्मेदार है।"
},
{
"subject": "Indian Polity",
"topic": "Judicial Appointments",
"question_en": "What is the process of judicial appointments in India?",
"question_hi": "भारत में न्यायिक नियुक्तियों की प्रक्रिया क्या है?",
"A_en": "The President appoints judges through a Collegium", "A_hi": "राष्ट्रपति एक कोलेजियम के माध्यम से न्यायाधीश नियुक्त करते हैं",
"B_en": "The Chief Justice of India appoints judges through a Collegium", "B_hi": "भारत के मुख्य न्यायाधीश एक कोलेजियम के माध्यम से न्यायाधीश नियुक्त करते हैं",
"C_en": "The Parliament appoints judges through a legislation", "C_hi": "संसद न्यायाधीशों को कानून द्वारा नियुक्त करती है",
"D_en": "None of the above", "D_hi": "कोई भी नहीं",
"answer": "A",
"explanation_en": "The President appoints judges through a Collegium, which is a group of senior judges of the Supreme Court.",
"explanation_hi": "राष्ट्रपति एक कोलेजियम के माध्यम से न्यायाधीश नियुक्त करते हैं, जो उच्चतम न्यायालय के वरिष्ठ न्यायाधीशों का एक समूह है।"
}
]