[
{
"subject": "Indian Polity",
"topic": "Constitution of India",
"question_en": "Who is the head of the Indian Union under the Constitution of India?",
"question_hi": "भारतीय संघ का शीर्ष अधिकारी भारतीय संविधान के अनुसार कौन है?",
"A_en": "The President of India", "A_hi": "भारत के राष्ट्रपति",
"B_en": "The Prime Minister of India", "B_hi": "भारत के प्रधानमंत्री",
"C_en": "The Chief Justice of India", "C_hi": "भारत के मुख्य न्यायाधीश",
"D_en": "The Speaker of the Lok Sabha", "D_hi": "लोकसभा के अध्यक्ष",
"answer": "A",
"explanation_en": "The President of India is the head of the Indian Union under the Constitution of India.",
"explanation_hi": "भारतीय संविधान के अनुसार भारत के राष्ट्रपति भारतीय संघ का शीर्ष अधिकारी हैं।"
},
{
"subject": "Indian Polity",
"topic": "Constitution of India",
"question_en": "What is the basic structure of the Constitution of India?",
"question_hi": "भारतीय संविधान की मूल बुनियाद क्या है?",
"A_en": "Unitary", "A_hi": "संघीय",
"B_en": "Federal", "B_hi": "संघीय",
"C_en": "Basic Structure", "C_hi": "मूल बुनियाद",
"D_en": "Amendment", "D_hi": "संशोधन",
"answer": "C",
"explanation_en": "The basic structure of the Constitution of India is a concept that refers to the fundamental principles and features of the Constitution that cannot be changed.",
"explanation_hi": "भारतीय संविधान की मूल बुनियाद एक ऐसी अवधारणा है जो संविधान की मूलभूत सिद्धांतों और विशेषताओं को संदर्भित करती है जो बदली नहीं जा सकती हैं।"
},
{
"subject": "Indian Polity",
"topic": "Parliament of India",
"question_en": "What is the name of the Upper House of the Parliament of India?",
"question_hi": "भारतीय संसद की ऊपरी सदन का नाम क्या है?",
"A_en": "Rajya Sabha", "A_hi": "राज्यसभा",
"B_en": "Lok Sabha", "B_hi": "लोकसभा",
"C_en": "State Assembly", "C_hi": "राज्य विधानसभा",
"D_en": "Union Council of Ministers", "D_hi": "केंद्रीय मंत्रिमंडल",
"answer": "A",
"explanation_en": "The Rajya Sabha is the Upper House of the Parliament of India.",
"explanation_hi": "राज्यसभा भारतीय संसद की ऊपरी सदन है।"
},
{
"subject": "Indian Polity",
"topic": "Fundamental Rights",
"question_en": "What are the six Fundamental Rights guaranteed by the Constitution of India?",
"question_hi": "भारतीय संविधान के द्वारा प्रतिपादित छह मौलिक अधिकार क्या हैं?",
"A_en": "Right to Equality, Right to Freedom, Right to Life, Right to Liberty, Right to Education, Right to Freedom of Speech and Expression", "A_hi": "समानता का अधिकार, स्वतंत्रता का अधिकार, जीवन का अधिकार, स्वतंत्रता का अधिकार, शिक्षा का अधिकार, अभिव्यक्ति की स्वतंत्रता का अधिकार",
"B_en": "Right to Equality, Right to Freedom, Right to Life, Right to Liberty, Right to Property, Right to Freedom of Speech and Expression", "B_hi": "समानता का अधिकार, स्वतंत्रता का अधिकार, जीवन का अधिकार, स्वतंत्रता का अधिकार, संपत्ति का अधिकार, अभिव्यक्ति की स्वतंत्रता का अधिकार",
"C_en": "Right to Equality, Right to Freedom, Right to Life, Right to Liberty, Right to Education, Right to Freedom of Speech and Expression, Right to Property", "C_hi": "समानता का अधिकार, स्वतंत्रता का अधिकार, जीवन का अधिकार, स्वतंत्रता का अधिकार, शिक्षा का अधिकार, अभिव्यक्ति की स्वतंत्रता का अधिकार, संपत्ति का अधिकार",
"D_en": "Right to Equality, Right to Freedom, Right to Life, Right to Liberty, Right to Education, Right to Freedom of Speech and Expression, Right to Property, Right to Information", "D_hi": "समानता का अधिकार, स्वतंत्रता का अधिकार, जीवन का अधिकार, स्वतंत्रता का अधिकार, शिक्षा का अधिकार, अभिव्यक्ति की स्वतंत्रता का अधिकार, संपत्ति का अधिकार, जानकारी का अधिकार",
"answer": "A",
"explanation_en": "The six Fundamental Rights guaranteed by the Constitution of India are Right to Equality, Right to Freedom, Right to Life, Right to Liberty, Right to Education, and Right to Freedom of Speech and Expression.",
"explanation_hi": "भारतीय संविधान द्वारा प्रतिपादित छह मौलिक अधिकार समानता का अधिकार, स्वतंत्रता का अधिकार, जीवन का अधिकार, स्वतंत्रता का अधिकार, शिक्षा का अधिकार, और अभिव्यक्ति की स्वतंत्रता का अधिकार हैं।"
},
{
"subject": "Indian Polity",
"topic": "Judicial System",
"question_en": "What is the highest court in India?",
"question_hi": "भारत में सर्वोच्च न्यायालय कौन सा है?",
"A_en": "Supreme Court of India", "A_hi": "भारत का उच्चतम न्यायालय",
"B_en": "High Court of India", "B_hi": "भारत की उच्च न्यायालय",
"C_en": "District Court of India", "C_hi": "भारत की जिला न्यायालय",
"D_en": "State Court of India", "D_hi": "भारत की राज्य न्यायालय",
"answer": "A",
"explanation_en": "The Supreme Court of India is the highest court in India.",
"explanation_hi": "भारत का उच्चतम न्यायालय भारत में सर्वोच्च न्यायालय है।"
},
{
"subject": "Indian Polity",
"topic": "Local Self-Government",
"question_en": "What is the local self-government body in India?",
"question_hi": "भारत में स्थानीय स्वशासन की संस्था क्या है?",
"A_en": "Panchayat", "A_hi": "पंचायत",
"B_en": "Municipal Corporation", "B_hi": "नगर निगम",
"C_en": "District Board", "C_hi": "जिला बोर्ड",
"D_en": "State Council", "D_hi": "राज्य परिषद",
"answer": "A",
"explanation_en": "The Panchayat is the local self-government body in India.",
"explanation_hi": "पंचायत भारत में स्थानीय स्वशासन की संस्था है।"
},
{
"subject": "Indian Polity",
"topic": "Emergency Provisions",
"question_en": "What is the President of India's power to proclaim a national emergency?",
"question_hi": "भारत के राष्ट्रपति द्वारा राष्ट्रीय आपातकाल की घोषणा करने की शक्ति क्या है?",
"A_en": "Article 352 of the Constitution", "A_hi": "संविधान के अनुच्छेद 352",
"B_en": "Article 356 of the Constitution", "B_hi": "संविधान के अनुच्छेद 356",
"C_en": "Article 360 of the Constitution", "C_hi": "संविधान के अनुच्छेद 360",
"D_en": "Article 361 of the Constitution", "D_hi": "संविधान के अनुच्छेद 361",
"answer": "A",
"explanation_en": "The President of India's power to proclaim a national emergency is given under Article 352 of the Constitution.",
"explanation_hi": "भारत के राष्ट्रपति द्वारा राष्ट्रीय आपातकाल की घोषणा करने की शक्ति संविधान के अनुच्छेद 352 के तहत दी गई है।"
},
{
"subject": "Indian Polity",
"topic": "Amendment of Constitution",
"question_en": "What is the process of amending the Constitution of India?",
"question_hi": "भारतीय संविधान को संशोधित करने की प्रक्रिया क्या है?",
"A_en": "Article 368 of the Constitution", "A_hi": "संविधान के अनुच्छेद 368",
"B_en": "Article 369 of the Constitution", "B_hi": "संविधान के अनुच्छेद 369",
"C_en": "Article 370 of the Constitution", "C_hi": "संविधान के अनुच्छेद 370",
"D_en": "Article 371 of the Constitution", "D_hi": "संविधान के अनुच्छेद 371",
"answer": "A",
"explanation_en": "The process of amending the Constitution of India is given under Article 368 of the Constitution.",
"explanation_hi": "भारतीय संविधान को संशोधित करने की प्रक्रिया संविधान के अनुच्छेद 368 के तहत दी गई है।"
},
{
"subject": "Indian Polity",
"topic": "Fundamental Duties",
"question_en": "What is the provision of Fundamental Duties in the Constitution of India?",
"question_hi": "भारतीय संविधान में मौलिक दायित्वों की प्रदान करने का प्रावधान क्या है?",
"A_en": "Article 51A of the Constitution", "A_hi": "संविधान के अनुच्छेद 51A",
"B_en": "Article 52A of the Constitution", "B_hi": "संविधान के अनुच्छेद 52A",
"C_en": "Article 53A of the Constitution", "C_hi": "संविधान के अनुच्छेद 53A",
"D_en": "Article 54A of the Constitution", "D_hi": "संविधान के अनुच्छेद 54A",
"answer": "A",
"explanation_en": "The provision of Fundamental Duties in the Constitution of India is given under Article 51A of the Constitution.",
"explanation_hi": "भारतीय संविधान में मौलिक दायित्व के प्रावधान के अनुच्छेद 51A के तहत दिए गए हैं।"
}