[
{
"subject": "Indian Polity",
"topic": "Constitution of India - Part 4 A (Directive Principles of State Policy)",
"question_en": "Which of the following is the objective of the Directive Principles of State Policy?",
"question_hi": "निर्देशात्मक प्रवर्तनीय राज्य नीति का उद्देश्य क्या है?",
"A_en": "To enforce the Fundamental Rights", "A_hi": "वस्तुनिष्ठ अधिकारों को प्रभावित करना",
"B_en": "To promote social and economic welfare", "B_hi": "सामाजिक और आर्थिक कल्याण को बढ़ावा देना",
"C_en": "To make the Constitution rigid", "C_hi": "संविधान को सख्त बनाना",
"D_en": "To give special powers to the President", "D_hi": "राष्ट्रपति को विशेष शक्तियां देना",
"answer": "B",
"explanation_en": "The Directive Principles of State Policy aim to promote social and economic welfare, social justice, and equality.",
"explanation_hi": "निर्देशात्मक प्रवर्तनीय राज्य नीति सामाजिक और आर्थिक कल्याण, सामाजिक न्याय और समानता को बढ़ावा देने का उद्देश्य रखती है।"
},
{
"subject": "Indian Polity",
"topic": "Constitution of India - Part 5 (The Union and its Territory)",
"question_en": "Who has the power to create a new state?",
"question_hi": "नई राज्य का निर्माण करने के लिए कौन शक्तिशाली है?",
"A_en": "The Parliament", "A_hi": "संसद",
"B_en": "The President", "B_hi": "राष्ट्रपति",
"C_en": "The Governor", "C_hi": "राज्यपाल",
"D_en": "The State Legislature", "D_hi": "राज्य विधान सभा",
"answer": "A",
"explanation_en": "The Parliament has the power to create a new state under Article 2 of the Constitution.",
"explanation_hi": "संविधान के अनुच्छेद 2 के तहत संसद को नई राज्य का निर्माण करने का अधिकार है।"
},
{
"subject": "Indian Polity",
"topic": "Constitution of India - Part 6 (The States)",
"question_en": "What is the main feature of a unicameral legislature?",
"question_hi": "एकात्र विधायिका का मुख्य विशेषता क्या है?",
"A_en": "It has two houses", "A_hi": "यह दो सदनों का होता है",
"B_en": "It has one house", "B_hi": "यह एक सदन का होता है",
"C_en": "It has no house", "C_hi": "यह कोई सदन नहीं होता है",
"D_en": "It has three houses", "D_hi": "यह तीन सदनों का होता है",
"answer": "B",
"explanation_en": "A unicameral legislature has only one house.",
"explanation_hi": "एकात्र विधायिका में केवल एक सदन होता है।"
},
{
"subject": "Indian Polity",
"topic": "Constitution of India - Part 7 (The Scheduled and Tribal Areas)",
"question_en": "What is the purpose of the Fifth Schedule?",
"question_hi": "पांचवें अनुसूची का उद्देश्य क्या है?",
"A_en": "To provide for the administration of scheduled areas", "A_hi": "संगठित क्षेत्रों के प्रशासन के लिए प्रावधान करना",
"B_en": "To provide for the welfare of scheduled tribes", "B_hi": "संगठित जनजातियों के कल्याण के लिए प्रावधान करना",
"C_en": "To provide for the promotion of Scheduled Castes", "C_hi": "वस्त्रित जातियों के प्रवर्तन के लिए प्रावधान करना",
"D_en": "To provide for the empowerment of women", "D_hi": "महिलाओं को सशक्तिकरण के लिए प्रावधान करना",
"answer": "A",
"explanation_en": "The Fifth Schedule provides for the administration of scheduled areas.",
"explanation_hi": "पांचवें अनुसूची संगठित क्षेत्रों के प्रशासन के लिए प्रावधान करती है।"
},
{
"subject": "Indian Polity",
"topic": "Constitution of India - Part 8 (Union Territories)",
"question_en": "Which of the following is a special power of the President in a Union Territory?",
"question_hi": "कौन सी विशेष शक्ति राष्ट्रपति को केंद्र शासित प्रदेश में है?",
"A_en": "To grant special powers to the Administrator", "A_hi": "प्रशासक को विशेष शक्तियां देना",
"B_en": "To appoint the Chief Minister", "B_hi": "मुख्यमंत्री की नियुक्ति करना",
"C_en": "To dissolve the Legislative Assembly", "C_hi": "विधान सभा को भंग करना",
"D_en": "To give special powers to the Governor", "D_hi": "राज्यपाल को विशेष शक्तियां देना",
"answer": "A",
"explanation_en": "The President has the power to grant special powers to the Administrator in a Union Territory.",
"explanation_hi": "राष्ट्रपति को केंद्र शासित प्रदेश में प्रशासक को विशेष शक्तियां देने का अधिकार है।"
},
{
"subject": "Indian Polity",
"topic": "Constitution of India - Part 9 (Powers of the Union and the States)",
"question_en": "Which of the following subjects is a concurrent subject?",
"question_hi": "कौन सा विषय समवर्ती विषय है?",
"A_en": "Defense", "A_hi": "रक्षा",
"B_en": "Education", "B_hi": "शिक्षा",
"C_en": "Health", "C_hi": "स्वास्थ्य",
"D_en": "Law and Order", "D_hi": "कानून और व्यवस्था",
"answer": "B",
"explanation_en": "Education is a concurrent subject, which means it is handled by both the Union and the States.",
"explanation_hi": "शिक्षा एक समवर्ती विषय है, जिसका अर्थ है कि यह दोनों केंद्र और राज्यों द्वारा संभाला जाता है।"
},
{
"subject": "Indian Polity",
"topic": "Constitution of India - Part 10 (The States in Part B of the First Schedule)",
"question_en": "What is the difference between a State and a Union Territory?",
"question_hi": "राज्य और केंद्र शासित प्रदेश में क्या अंतर है?",
"A_en": "A State has a Governor, while a Union Territory has a President", "A_hi": "राज्य में राज्यपाल होता है, जबकि केंद्र शासित प्रदेश में राष्ट्रपति होता है",
"B_en": "A State has a Legislative Assembly, while a Union Territory has a Legislative Council", "B_hi": "राज्य में विधान सभा होती है, जबकि केंद्र शासित प्रदेश में विधान परिषद होती है",
"C_en": "A State has a Chief Minister, while a Union Territory has a Chief Secretary", "C_hi": "राज्य में मुख्यमंत्री होता है, जबकि केंद्र शासित प्रदेश में मुख्य सचिव होता है",
"D_en": "A State has a Governor and a Legislative Assembly, while a Union Territory has a President and a Legislative Council", "D_hi": "राज्य में राज्यपाल और विधान सभा होती है, जबकि केंद्र शासित प्रदेश में राष्ट्रपति और विधान परिषद होती है",
"answer": "A",
"explanation_en": "A State has a Governor, while a Union Territory has a President.",
"explanation_hi": "राज्य में राज्यपाल होता है, जबकि केंद्र शासित प्रदेश में राष्ट्रपति होता है।"
},
{
"subject": "Indian Polity",
"topic": "Constitution of India - Part 11 (Short Title and Commencement)",
"question_en": "What is the purpose of the Preamble?",
"question_hi": "प्रारंभिक भाग का उद्देश्य क्या है?",
"A_en": "To provide a framework for the Constitution", "A_hi": "संविधान के लिए एक ढांचा प्रदान करना",
"B_en": "To define the relationship between the Union and the States", "B_hi": "केंद्र और राज्यों के बीच संबंध को परिभाषित करना",
"C_en": "To provide for the amendment of the Constitution", "C_hi": "संविधान के संशोधन के लिए प्रावधान करना",
"D_en": "To provide for the establishment of the Supreme Court", "D_hi": "सर्वोच्च न्यायालय की स्थापना के लिए प्रावधान करना",
"answer": "A",
"explanation_en": "The Preamble provides a framework for the Constitution.",
"explanation_hi": "प्रारंभिक भाग संविधान के लिए एक ढांचा प्रदान करता है।"
},
{
"subject": "Indian Polity",
"topic": "Constitution of India - Part 12 (Temporary, Transitional and Special Provisions)",
"question_en": "What is the purpose of the Seventh Schedule?",
"question_hi": "सातवें अनुसूची का उद्देश्य क्या है?",
"A_en": "To provide for the distribution of powers between the Union and the States", "A_hi": "केंद्र और राज्यों के बीच शक्ति का वितरण करने के लिए प्रावधान करना",
"B_en": "To provide for the administration of scheduled areas", "B_hi": "संगठित क्षेत्रों के प्रशासन के लिए प्रावधान करना",
"C_en": "To provide for the promotion of Scheduled Castes", "C_hi": "वस्त्रित जातियों के प्रवर्तन के लिए प्रावधान करना",
"D_en": "To provide for the empowerment of women", "D_hi": "महिलाओं को सशक्तिकरण के लिए प्रावधान करना",
"answer": "A",
"explanation_en": "The Seventh Schedule provides for the distribution of powers between the Union and the States.",
"explanation_hi": "सातवें अनुसूची केंद्र और राज्यों के बीच शक्ति का वितरण करने के लिए प्रावधान करती है।"
},
{
"subject": "Indian Polity",
"topic": "Constitution of India - Part 13 (Miscellaneous)",
"question_en": "What is the significance of the 73rd and 74th Amendments?",
"question_hi": "७३वें और ७४वें संशोधनों का क्या महत्व है?",
"A_en": "They provided for the establishment of the National Commission for Women", "A_hi": "वे महिला आयोग की स्थापना के लिए प्रावधान करते हैं",
"B_en": "They provided for the empowerment of women", "B_hi": "वे महिलाओं को सशक्तिकरण के लिए प्रावधान करते हैं",
"C_en": "They provided for the promotion of Scheduled Castes", "C_hi": "वे वस्त्रित जातियों के प्रवर्तन के लिए प्रावधान करते हैं",
"D_en": "They provided for the establishment of the National Human Rights Commission", "D_hi": "वे मानवाधिकार आयोग की स्थापना के लिए प्रावधान करते हैं",
"answer": "D",
"explanation_en": "The 73rd and 74th Amendments provided for the establishment of the National Human Rights Commission.",
"explanation_hi": "७३वें और ७४वें संशोधन मानवाधिकार आयोग की स्थापना के लिए प्रावधान करते हैं।"
}