[
{
"subject": "Indian Polity",
"topic": "Emergency Provisions",
"question_en": "Under which article of the Indian Constitution can the President proclaim a National Emergency?",
"question_hi": "भारतीय संविधान के किस अनुच्छेद के अंतर्गत राष्ट्रपति राष्ट्रीय आपातकाल की घोषणा कर सकता है?",
"A_en": "Article 350", "A_hi": "अनुच्छेद 350",
"B_en": "Article 356", "B_hi": "अनुच्छेद 356",
"C_en": "Article 352", "C_hi": "अनुच्छेद 352",
"D_en": "Article 360", "D_hi": "अनुच्छेद 360",
"answer": "C",
"explanation_en": "Article 352 empowers the President to proclaim a National Emergency if the security of India or any part thereof is threatened by war, external aggression, or armed rebellion.",
"explanation_hi": "अनुच्छेद 352 राष्ट्रपति को यह अधिकार देता है कि यदि भारत या उसके किसी भाग की सुरक्षा युद्ध, बाहरी आक्रमण या सशस्त्र विद्रोह के कारण खतरे में है तो वह राष्ट्रीय आपातकाल की घोषणा कर सकता है।"
},
{
"subject": "Indian Polity",
"topic": "Emergency Provisions",
"question_en": "Which of the following is NOT a ground for imposing a National Emergency under Article 352?",
"question_hi": "निम्नलिखित में से कौन-सा आधार अनुच्छेद 352 के तहत राष्ट्रीय आपातकाल लगाने के लिए वैध नहीं है?",
"A_en": "War", "A_hi": "युद्ध",
"B_en": "External aggression", "B_hi": "बाहरी आक्रमण",
"C_en": "Armed rebellion", "C_hi": "सशस्त्र विद्रोह",
"D_en": "Financial instability", "D_hi": "वित्तीय अस्थिरता",
"answer": "D",
"explanation_en": "Financial instability is the ground for Financial Emergency under Article 360, not for National Emergency under Article 352.",
"explanation_hi": "वित्तीय अस्थिरता अनुच्छेद 360 के तहत वित्तीय आपातकाल का आधार है, न कि अनुच्छेद 352 के तहत राष्ट्रीय आपातकाल का।"
},
{
"subject": "Indian Polity",
"topic": "Emergency Provisions",
"question_en": "The proclamation of a National Emergency must be approved by both Houses of Parliament within how many days?",
"question_hi": "राष्ट्रीय आपातकाल की घोषणा को संसद के दोनों सदनों द्वारा कितने दिनों के भीतर स्वीकृत किया जाना चाहिए?",
"A_en": "14 days", "A_hi": "14 दिन",
"B_en": "21 days", "B_hi": "21 दिन",
"C_en": "30 days", "C_hi": "30 दिन",
"D_en": "60 days", "D_hi": "60 दिन",
"answer": "B",
"explanation_en": "According to Article 352, the proclamation must be approved by both Houses of Parliament within one month (30 days) from the date of its issue, but the 44th Amendment reduced it to 21 days.",
"explanation_hi": "अनुच्छेद 352 के अनुसार घोषणा को जारी किए जाने की तिथि से एक माह (30 दिन) के भीतर संसद के दोनों सदनों द्वारा स्वीकृत किया जाना चाहिए, लेकिन 44वें संशोधन ने इसे 21 दिन कर दिया।"
},
{
"subject": "Indian Polity",
"topic": "Emergency Provisions",
"question_en": "Who can revoke a National Emergency proclamation?",
"question_hi": "राष्ट्रीय आपातकाल की घोषणा को कोण रद्द कर सकता है?",
"A_en": "The President", "A_hi": "राष्ट्रपति",
"B_en": "The Prime Minister", "B_hi": "प्रधानमंत्री",
"C_en": "Parliament only", "C_hi": "केवल संसद",
"D_en": "The Supreme Court", "D_hi": "सुप्रीम कोर्ट",
"answer": "A",
"explanation_en": "The President can revoke a National Emergency at any time by a subsequent proclamation without parliamentary approval.",
"explanation_hi": "राष्ट्रपति किसी भी समय संसद की स्वीकृति के बिना एक पश्चात् घोषणा द्वारा राष्ट्रीय आपातकाल को समाप्त कर सकता है।"
},
{
"subject": "Indian Polity",
"topic": "Emergency Provisions",
"question_en": "During a National Emergency, which fundamental right cannot be suspended?",
"question_hi": "राष्ट्रीय आपातकाल के दौरान कौन-सा मौलिक अधिकार निलंबित नहीं किया जा सकता?",
"A_en": "Right to Equality", "A_hi": "समानता का अधिकार",
"B_en": "Right to Freedom", "B_hi": "स्वतंत्रता का अधिकार",
"C_en": "Right to Life and Personal Liberty", "C_hi": "जीवन और व्यक्तिगत स्वतंत्रता का अधिकार",
"D_en": "Right to Property", "D_hi": "संपत्ति का अधिकार",
"answer": "C",
"explanation_en": "Article 21 (Right to Life and Personal Liberty) cannot be suspended even during a National Emergency, as per the 44th Amendment.",
"explanation_hi": "44वें संशोधन के अनुसार अनुच्छेद 21 (जीवन और व्यक्तिगत स्वतंत्रता का अधिकार) को राष्ट्रीय आपातकाल के दौरान भी निलंबित नहीं किया जा सकता।"
},
{
"subject": "Indian Polity",
"topic": "Emergency Provisions",
"question_en": "Which amendment inserted the provision that a National Emergency can be proclaimed only on the written advice of the Union Cabinet?",
"question_hi": "किस संशोधन ने यह प्रावधान डाला कि राष्ट्रीय आपातकाल केवल केंद्रीय मंत्रिमंडल के लिखित सुझाव पर ही घोषित किया जा सकता है?",
"A_en": "38th Amendment", "A_hi": "38वां संशोधन",
"B_en": "42nd Amendment", "B_hi": "42वां संशोधन",
"C_en": "44th Amendment", "B_hi": "44वां संशोधन",
"D_en": "48th Amendment", "D_hi": "48वां संशोधन",
"answer": "C",
"explanation_en": "The 44th Amendment (1978) inserted the clause that the President can proclaim a National Emergency only on the written advice of the Union Cabinet headed by the Prime Minister.",
"explanation_hi": "44वां संशोधन (1978) ने यह खंड डाला कि राष्ट्रपति केवल प्रधानमंत्री के नेतृत्व वाले केंद्रीय मंत्रिमंडल के लिखित सुझाव पर ही राष्ट्रीय आपातकाल की घोषणा कर सकता है।"
},
{
"subject": "Indian Polity",
"topic": "Emergency Provisions",
"question_en": "During a National Emergency, the Lok Sabha can extend its normal term by a law passed by Parliament for a period not exceeding how many years at a time?",
"question_hi": "राष्ट्रीय आपातकाल के दौरान लोकसभा अपना सामान्य कार्यकाल संसद द्वारा पारित कानून से एक बार में अधिकतम कितने वर्ष तक बढ़ा सकती है?",
"A_en": "Six months", "A_hi": "छह माह",
"B_en": "One year", "B_hi": "एक वर्ष",
"C_en": "Two years", "B_hi": "दो वर्ष",
"D_en": "Three years", "D_hi": "तीन वर्ष",
"answer": "B",
"explanation_en": "During a National Emergency, the Lok Sabha’s term can be extended by a law for a period not exceeding one year at a time.",
"explanation_hi": "राष्ट्रीय आपातकाल के दौरान लोकसभा का कार्यकाल एक कानून द्वारा एक बार में अधिकतम एक वर्ष तक बढ़ाया जा सकता है।"
},
{
"subject": "Indian Polity",
"topic": "Emergency Provisions",
"question_en": "Which of the following statements is correct regarding the approval of a National Emergency?",
"question_hi": "राष्ट्रीय आपातकाल की स्वीकृति के संबंध में निम्नलिखित में से कौन-सा कथन सत्य है?",
"A_en": "It requires a simple majority in both Houses", "A_hi": "इसके लिए दोनों सदनों में साधारण बहुमत की आवश्यकता होती है",
"B_en": "It requires a special majority in both Houses", "B_hi": "इसके लिए दोनों सदनों में विशेष बहुमत की आवश्यकता होती है",
"C_en": "It requires ratification by half the states", "C_hi": "इसके लिए आधे राज्यों द्वारा अनुमोदन की आवश्यकता होती है",
"D_en": "It requires approval of the Supreme Court", "D_hi": "इसके लिए सुप्रीम कोर्ट की स्वीकृति की आवश्यकता होती है",
"answer": "B",
"explanation_en": "A special majority (not less than two-thirds of members present and voting and a majority of the total membership of the House) is required in both Houses for approval.",
"explanation_hi": "स्वीकृति के लिए दोनों सदनों में विशेष बहुमत (उपस्थित और मतदान करने वाले सदस्यों के दो-तिहाई से कम नहीं और सदन की कुल सदस्यता का बहुमत) आवश्यक है।"
},
{
"subject": "Indian Polity",
"topic": "Emergency Provisions",
"question_en": "Which of the following emergencies has been declared the maximum number of times in India?",
"question_hi": "भारत में निम्नलिखित में से कौन-सा आपातकाल सबसे अधिक बार घोषित किया गया है?",
"A_en": "National Emergency", "A_hi": "राष्ट्रीय आपातकाल",
"B_en": "President’s Rule (State Emergency)", "B_hi": "राष्ट्रपति शासन (राज्य आपातकाल)",
"C_en": "Financial Emergency", "C_hi": "वित्तीय आपातकाल",
"D_en": "All equally", "D_hi": "सभी समान रूप से",
"answer": "B",
"explanation_en": "President’s Rule under Article 356 has been imposed more than 125 times, whereas National Emergency has been declared thrice and Financial Emergency never.",
"explanation_hi": "अनुच्छेद 356 के तहत राष्ट्रपति शासन 125 से अधिक बार लगाया गया है, जबकि राष्ट्रीय आपातकाल तीन बार और वित्तीय आपातकाल कभी भी घोषित नहीं किया गया।"
},
{
"subject": "Indian Polity",
"topic": "Emergency Provisions",
"question_en": "Which of the following is a characteristic of the 42nd Amendment regarding emergency provisions?",
"question_hi": "42वें संशोधन के आपातकालीन प्रावधानों से संबंधित निम्नलिखित में से कौन-सा लक्षण है?",
"A_en": "It made approval within 14 days mandatory", "A_hi": "इसने 14 दिनों के भीतर स्वीकृति अनिवार्य की",
"B_en": "It curtailed the power to suspend Fundamental Rights", "B_hi": "इसने मौलिक अधिकारों को निलंबित करने की शक्ति को सीमित किया",
"C_en": "It inserted that emergency could be proclaimed on armed rebellion", "B_hi": "इसने यह डाला कि सशस्त्र विद्रोह पर आपातकाल घोषित किया जा सकता है",
"D_en": "It removed judicial review of emergency proclamation", "D_hi": "इसने आपातकाल की घोषणा की न्यायिक समीक्षा हटा दी",
"answer": "D",
"explanation_en": "The 42nd Amendment (1976) inserted clauses that barred judicial review of the validity of an emergency proclamation, later partly removed by the 44th Amendment.",
"explanation_hi": "42वां संशोधन (1976) ने खंड डाले जिनसे आपातकाल की घोषणा की वैधता की न्यायिक समीक्षा पर रोक लग गई, बाद में 44वें संशोधन ने इसे आंशिक रूप से हटाया।"
}
]