[
{
"subject": "Indian Polity",
"topic": "Constitutional Framework",
"question_en": "Which provision of the Indian Constitution guarantees fundamental rights to citizens?",
"question_hi": "भारतीय संविधान का कौन सा प्रावधान नागरिकों को मूलभूत अधिकार प्रदान करता है?",
"A_en": "Article 19", "A_hi": "अर्टिकल 19",
"B_en": "Article 14", "B_hi": "अर्टिकल 14",
"C_en": "Article 21", "C_hi": "अर्टिकल 21",
"D_en": "Article 25", "D_hi": "अर्टिकल 25",
"answer": "C",
"explanation_en": "Article 21 of the Indian Constitution guarantees the right to life and liberty to all citizens.",
"explanation_hi": "भारतीय संविधान के अनुच्छेद 21 ने सभी नागरिकों को जीवन और स्वतंत्रता का अधिकार प्रदान किया है।"
},
{
"subject": "Indian Polity",
"topic": "Constitutional Framework",
"question_en": "What is the difference between a parliamentary system and a presidential system?",
"question_hi": "संसदीय प्रणाली और राष्ट्रपति प्रणाली के बीच क्या अंतर है?",
"A_en": "Parliamentary system has a stronger executive branch.", "A_hi": "संसदीय प्रणाली में अधिकारी शाखा अधिक शक्तिशाली है।",
"B_en": "Presidential system has a more powerful legislative branch.", "B_hi": "राष्ट्रपति प्रणाली में विधायी शाखा अधिक शक्तिशाली है।",
"C_en": "Parliamentary system has a more limited role for the judiciary.", "C_hi": "संसदीय प्रणाली में न्यायपालिका का अधिक सीमित भूमिका है।",
"D_en": "Presidential system has a stronger role for the executive and legislative branches.", "D_hi": "राष्ट्रपति प्रणाली में अधिकारी और विधायी शाखा का अधिक शक्तिशाली भूमिका है।",
"answer": "D",
"explanation_en": "A presidential system has a stronger role for the executive and legislative branches, whereas a parliamentary system has a stronger role for the executive branch.",
"explanation_hi": "राष्ट्रपति प्रणाली में अधिकारी और विधायी शाखा का अधिक शक्तिशाली भूमिका है, जबकि संसदीय प्रणाली में अधिकारी शाखा अधिक शक्तिशाली है।"
},
{
"subject": "Indian Polity",
"topic": "Constitutional Framework",
"question_en": "What is the concept of 'separation of powers' in the Indian Constitution?",
"question_hi": "भारतीय संविधान में 'शक्तियों का विभाजन' का क्या अर्थ है?",
"A_en": "Distribution of powers among the three branches of government.", "A_hi": "सरकार की तीन शाखाओं में शक्तियों का वितरण।",
"B_en": "Concentration of powers in the hands of the president.", "B_hi": "राष्ट्रपति के हाथों में शक्तियों का केंद्रीकरण।",
"C_en": "Limitation of powers of the legislative branch.", "C_hi": "विधायी शाखा की शक्तियों का सीमितरण।",
"D_en": "Delegation of powers to state governments.", "D_hi": "राज्य सरकारों को शक्तियों का दायित्व देना।",
"answer": "A",
"explanation_en": "The concept of 'separation of powers' in the Indian Constitution means the distribution of powers among the three branches of government, namely, the executive, legislative, and judicial.",
"explanation_hi": "भारतीय संविधान में 'शक्तियों का विभाजन' का अर्थ है सरकार की तीन शाखाओं में शक्तियों का वितरण, जिनमें अधिकारी, विधायी और न्यायपालिका शामिल हैं।"
},
{
"subject": "Indian Polity",
"topic": "Constitutional Framework",
"question_en": "Which part of the Indian Constitution deals with the fundamental duties of citizens?",
"question_hi": "भारतीय संविधान का कौन सा भाग नागरिकों के मूलभूत कर्तव्यों से संबंधित है?",
"A_en": "Part III", "A_hi": "भाग III",
"B_en": "Part IV", "B_hi": "भाग IV",
"C_en": "Part V", "C_hi": "भाग V",
"D_en": "Part XII", "D_hi": "भाग XII",
"answer": "B",
"explanation_en": "Part IV of the Indian Constitution deals with the fundamental duties of citizens.",
"explanation_hi": "भारतीय संविधान के भाग IV में नागरिकों के मूलभूत कर्तव्यों से संबंधित विवरण दिया गया है।"
},
{
"subject": "Indian Polity",
"topic": "Constitutional Framework",
"question_en": "What is the purpose of the 'Emergency Provisions' in the Indian Constitution?",
"question_hi": "भारतीय संविधान में 'अत्यधिकतर प्रावधान' का उद्देश्य क्या है?",
"A_en": "To prevent the executive from becoming too powerful.", "A_hi": "अधिकारी शाखा को अधिक शक्तिशाली होने से रोकना।",
"B_en": "To protect the fundamental rights of citizens.", "B_hi": "नागरिकों के मूलभूत अधिकारों की रक्षा करना।",
"C_en": "To provide for situations of national emergency.", "C_hi": "राष्ट्रीय आपातकालीन स्थितियों के लिए प्रावधान करना।",
"D_en": "To limit the powers of the judiciary.", "D_hi": "न्यायपालिका की शक्तियों को सीमित करना।",
"answer": "C",
"explanation_en": "The Emergency Provisions in the Indian Constitution provide for situations of national emergency, such as war, external aggression, or armed rebellion.",
"explanation_hi": "भारतीय संविधान में 'अत्यधिकतर प्रावधान' राष्ट्रीय आपातकालीन स्थितियों, जैसे युद्ध, बाहरी आक्रमण या सशस्त्र विद्रोह के लिए प्रावधान करता है।"
},
{
"subject": "Indian Polity",
"topic": "Constitutional Framework",
"question_en": "What is the concept of 'judicial review' in the Indian Constitution?",
"question_hi": "भारतीय संविधान में 'न्यायिक समीक्षा' का क्या अर्थ है?",
"A_en": "The power of the judiciary to interpret the Constitution.", "A_hi": "न्यायपालिका की शक्ति को संविधान का अर्थ देना।",
"B_en": "The power of the executive to interpret the Constitution.", "B_hi": "अधिकारी शाखा की शक्ति को संविधान का अर्थ देना।",
"C_en": "The power of the legislative to interpret the Constitution.", "C_hi": "विधायी शाखा की शक्ति को संविधान का अर्थ देना।",
"D_en": "The power of the president to interpret the Constitution.", "D_hi": "राष्ट्रपति की शक्ति को संविधान का अर्थ देना।",
"answer": "A",
"explanation_en": "The concept of 'judicial review' in the Indian Constitution means the power of the judiciary to interpret the Constitution and declare laws or government actions as unconstitutional.",
"explanation_hi": "भारतीय संविधान में 'न्यायिक समीक्षा' का अर्थ है न्यायपालिका को संविधान का अर्थ देने की शक्ति और कानूनों या सरकारी कार्रवाइयों को असंवैधानिक घोषित करना।"
},
{
"subject": "Indian Polity",
"topic": "Constitutional Framework",
"question_en": "Which article of the Indian Constitution provides for the supremacy of the Constitution?",
"question_hi": "भारतीय संविधान के कौन से अनुच्छेद में संविधान की सुप्रीमेसी का प्रावधान है?",
"A_en": "Article 13", "A_hi": "अर्टिकल 13",
"B_en": "Article 14", "B_hi": "अर्टिकल 14",
"C_en": "Article 15", "C_hi": "अर्टिकल 15",
"D_en": "Article 138", "D_hi": "अर्टिकल 138",
"answer": "A",
"explanation_en": "Article 13 of the Indian Constitution provides for the supremacy of the Constitution and declares that any law or government action that is inconsistent with the Constitution shall be void.",
"explanation_hi": "भारतीय संविधान के अनुच्छेद 13 में संविधान की सुप्रीमेसी का प्रावधान है और यह कहता है कि कोई भी कानून या सरकारी कार्रवाई जो संविधान से असंगत हो वह कानूनी रूप से वैध नहीं होगी।"
},
{
"subject": "Indian Polity",
"topic": "Constitutional Framework",
"question_en": "What is the concept of 'separation of powers' between the Centre and the States?",
"question_hi": "केंद्र और राज्यों के बीच 'शक्तियों का विभाजन' का क्या अर्थ है?",
"A_en": "The Centre has more powers than the States.", "A_hi": "केंद्र को राज्यों से अधिक शक्तियां हैं।",
"B_en": "The States have more powers than the Centre.", "B_hi": "राज्यों को केंद्र से अधिक शक्तियां हैं।",
"C_en": "The Centre and the States have equal powers.", "C_hi": "केंद्र और राज्यों के बीच समान शक्तियां हैं।",
"D_en": "The Centre has limited powers compared to the States.", "D_hi": "केंद्र की तुलना में राज्यों की अधिक शक्तियां हैं।",
"answer": "C",
"explanation_en": "The concept of 'separation of powers' between the Centre and the States means that both the Centre and the States have equal powers and that there is a division of powers between the two.",
"explanation_hi": "केंद्र और राज्यों के बीच 'शक्तियों का विभाजन' का अर्थ है कि दोनों केंद्र और राज्यों के बीच समान शक्तियां हैं और दोनों के बीच शक्तियों का विभाजन है।"
},
{
"subject": "Indian Polity",
"topic": "Constitutional Framework",
"question_en": "Which provision of the Indian Constitution deals with the relationship between the Centre and the States?",
"question_hi": "भारतीय संविधान का कौन सा प्रावधान केंद्र और राज्यों के बीच संबंध से संबंधित है?",
"A_en": "Article 249", "A_hi": "अर्टिकल 249",
"B_en": "Article 250", "B_hi": "अर्टिकल 250",
"C_en": "Article 251", "C_hi": "अर्टिकल 251",
"D_en": "Article 395", "D_hi": "अर्टिकल 395",
"answer": "C",
"explanation_en": "Article 251 of the Indian Constitution deals with the relationship between the Centre and the States.",
"explanation_hi": "भारतीय संविधान के अनुच्छेद 251 में केंद्र और राज्यों के बीच संबंध से संबंधित विवरण दिया गया है।"
},
{
"subject": "Indian Polity",
"topic": "Constitutional Framework",
"question_en": "What is the concept of 'cooperative federalism' in the Indian Constitution?",
"question_hi": "भारतीय संविधान में 'सहकारी संघवाद' का क्या अर्थ है?",
"A_en": "The Centre and the States work together to achieve common goals.", "A_hi": "केंद्र और राज्य मिलकर सामान्य लक्ष्यों को प्राप्त करने के लिए काम करते हैं।",
"B_en": "The Centre has more powers than the States.", "B_hi": "केंद्र को राज्यों से अधिक शक्तियां हैं।",
"C_en": "The States have more powers than the Centre.", "C_hi": "राज्यों को केंद्र से अधिक शक्तियां हैं।",
"D_en": "The Centre and the States have equal powers.", "D_hi": "केंद्र और राज्यों के बीच समान शक्तियां हैं।",
"answer": "A",
"explanation_en": "The concept of 'cooperative federalism' in the Indian Constitution means that the Centre and the States work together to achieve common goals and that there is a division of powers between the two.",
"explanation_hi": "भारतीय संविधान में 'सहकारी संघवाद' का अर्थ है कि केंद्र और राज्य मिलकर सामान्य लक्षाब प्राप्त करने के लिए काम करते हैं और दोनों के बीच शक्तियों का विभाजन है।"
}