[
{
"subject": "Indian Polity",
"topic": "Constitution of India",
"question_en": "What is the Preamble to the Constitution of India?",
"question_hi": "भारतीय संविधान के प्रस्तावना क्या है?",
"A_en": "The Constitution is a mere law of the land.", "A_hi": "संविधान केवल देश का कोई कानून है।",
"B_en": "It serves as a source of state power.", "B_hi": "यह राज्य की शक्ति का स्रोत काम करता है।",
"C_en": "It is a statement of the fundamental rights and duties of the citizens.", "C_hi": "यह नागरिकों के मौलिक अधिकारों और कर्तब्यों का वक्तव्य है।",
"D_en": "It outlines the structure and powers of the government.", "D_hi": "यह सरकार की संरचना और शक्तियों का वर्णन करता है।",
"answer": "C",
"explanation_en": "The Preamble to the Constitution of India is a statement that outlines the fundamental rights and duties of the citizens.",
"explanation_hi": "भारतीय संविधान के प्रस्तावना में नागरिकों के मौलिक अधिकारों और कर्तब्यों का वर्णन किया गया है।"
},
{
"subject": "Indian Polity",
"topic": "Constitution of India",
"question_en": "Which part of the Indian Constitution deals with the Fundamental Rights?",
"question_hi": "भारतीय संविधान में मौलिक अधिकारों से संबंधित हिस्सा कौन सा है?",
"A_en": "Part III", "A_hi": "भाग III",
"B_en": "Part IV", "B_hi": "भाग IV",
"C_en": "Part V", "C_hi": "भाग V",
"D_en": "Part II", "D_hi": "भाग II",
"answer": "A",
"explanation_en": "Part III of the Indian Constitution deals with the Fundamental Rights.",
"explanation_hi": "भारतीय संविधान का भाग III मौलिक अधिकारों से संबंधित है।"
},
{
"subject": "Indian Polity",
"topic": "Constitution of India",
"question_en": "What is the basis of the federal structure of the Indian government?",
"question_hi": "भारत सरकार के federal ढांचे का आधार क्या है?",
"A_en": "The presence of a single central government.", "A_hi": "एकल केंद्र सरकार की उपस्थिति।",
"B_en": "The division of powers between the Centre and the States.", "B_hi": "केंद्र और राज्यों के बीच शक्तियों का विभाजन।",
"C_en": "The presence of a unicameral legislature.", "C_hi": "एकचैंबरीय विधानसभा की उपस्थिति।",
"D_en": "The adoption of a parliamentary form of government.", "D_hi": "संसदीय प्रणाली को अपनाना",
"answer": "B",
"explanation_en": "The division of powers between the Centre and the States is the basis of the federal structure of the Indian government.",
"explanation_hi": "भारत सरकार के federal ढांचे का आधार केंद्र और राज्यों के बीच शक्तियों का विभाजन है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj",
"question_en": "What is the main objective of the 73rd Constitutional Amendment Act?",
"question_hi": "73वें संविधान संशोधन अधिनियम का मुख्य उद्देश्य क्या है?",
"A_en": "To promote the principles of social justice.", "A_hi": "सामाजिक न्याय के सिद्धांतों को बढ़ावा देना",
"B_en": "To provide a framework for the Panchayati Raj system.", "B_hi": "पंचायती राज प्रणाली के लिए एक ढांचा प्रदान करना",
"C_en": "To promote the decentralization of power.", "C_hi": "शक्ति केंद्रीयकरण को प्रोत्साहित करना",
"D_en": "To provide a mechanism for the election of Panchayat members.", "D_hi": "पंचायत सदस्यों का चुनाव प्रणाली प्रदान करना",
"answer": "B",
"explanation_en": "The 73rd Constitutional Amendment Act provides a framework for the Panchayati Raj system.",
"explanation_hi": "73वें संविधान संशोधन अधिनियम पंचायती राज प्रणाली के लिए एक ढांचा प्रदान करता है।"
},
{
"subject": "Indian Polity",
"topic": "Judiciary",
"question_en": "What is the Supreme Court of India's role in protecting the fundamental rights of citizens?",
"question_hi": "भारतीय सुप्रीम कोर्ट की भूमिका नागरिकों के मौलिक अधिकारों की रक्षा करने में क्या है?",
"A_en": "To interpret the Constitution and laws of the land.", "A_hi": "अधिकार व्याख्या करने और देश के कानूनों को व्याख्या करना",
"B_en": "To provide justice to the citizens.", "B_hi": "नागरिकों को न्याय प्रदान करना",
"C_en": "To protect the fundamental rights of citizens.", "C_hi": "नागरिकों के मौलिक अधिकारों की रक्षा करना",
"D_en": "To advise the President on matters of national importance.", "D_hi": "राष्ट्रीय महत्व के मामलों में राष्ट्रपति को सलाह देना",
"answer": "C",
"explanation_en": "The Supreme Court of India protects the fundamental rights of citizens by interpreting the Constitution and laws of the land.",
"explanation_hi": "भारतीय सुप्रीम कोर्ट नागरिकों के मौलिक अधिकारों की रक्षा करता है और अधिकार व्याख्या करता है।"
},
{
"subject": "Indian Polity",
"topic": "Local Self-Government",
"question_en": "What is the main feature of the 74th Constitutional Amendment Act?",
"question_hi": "74वें संविधान संशोधन अधिनियम का मुख्य विशेषता क्या है? ",
"A_en": "The establishment of the Gram Panchayat.", "A_hi": "ग्राम पंचायत की स्थापना",
"B_en": "The provision for the election of Panchayat members.", "B_hi": "पंचायत सदस्यों का चुनाव प्रणाली प्रदान करना",
"C_en": "The decentralization of power to the local bodies.", "C_hi": "स्थानीय संस्थाओं को शक्ति केंद्रीकरण करना",
"D_en": "The creation of a new tier of local government.", "D_hi": "स्थानीय सरकार का एक नया स्तर बनाना",
"answer": "C",
"explanation_en": "The 74th Constitutional Amendment Act provides for the decentralization of power to the local bodies.",
"explanation_hi": "74वें संविधान संशोधन अधिनियम स्थानीय संस्थाओं को शक्ति केंद्रीकरण करता है।"
},
{
"subject": "Indian Polity",
"topic": "Parliamentary System",
"question_en": "What is the main difference between the parliamentary and presidential systems of government?",
"question_hi": "सरकार के संसदीय और राष्ट्रपति प्रणाली के बीच मुख्य अंतर क्या है? ",
"A_en": "The presence of a president in the parliamentary system.", "A_hi": "संसदीय प्रणाली में राष्ट्रपति की उपस्थिति",
"B_en": "The division of powers between the Centre and the States.", "B_hi": "केंद्र और राज्यों के बीच शक्तियों का विभाजन",
"C_en": "The presence of a fixed term for the government.", "C_hi": "सरकार के लिए एक निश्चित अवधि की उपस्थिति",
"D_en": "The accountability of the government to the parliament.", "D_hi": "सरकार की संसद से जवाबदेही",
"answer": "D",
"explanation_en": "The main difference between the parliamentary and presidential systems of government is the accountability of the government to the parliament.",
"explanation_hi": "सरकार के संसदीय और राष्ट्रपति प्रणाली के बीच मुख्य अंतर सरकार की संसद से जवाबदेही है।"
},
{
"subject": "Indian Polity",
"topic": "Election Commission",
"question_en": "What is the main function of the Election Commission of India?",
"question_hi": "भारतीय निर्वाचन आयोग का मुख्य कार्य क्या है? ",
"A_en": "To conduct elections to the Lok Sabha and State Legislatures.", "A_hi": "लोकसभा और राज्य विधानसभाओं के लिए चुनाव आयोजित करना",
"B_en": "To provide a framework for the Panchayati Raj system.", "B_hi": "पंचायती राज प्रणाली के लिए एक ढांचा प्रदान करना",
"C_en": "To provide a mechanism for the election of the President and the Vice-President.", "C_hi": "राष्ट्रपति और उपराष्ट्रपति का चुनाव प्रणाली प्रदान करना",
"D_en": "To supervise the elections and ensure the integrity of the electoral process.", "D_hi": "चुनावों की निगरानी करना और चुनावी प्रक्रिया की अखंडता सुनिश्चित करना",
"answer": "D",
"explanation_en": "The main function of the Election Commission of India is to supervise the elections and ensure the integrity of the electoral process.",
"explanation_hi": "भारतीय निर्वाचन आयोग का मुख्य कार्य चुनावों की निगरानी करना और चुनावी प्रक्रिया की अखंडता सुनिश्चित करना है।"
},
{
"subject": "Indian Polity",
"topic": "Constitutional Bodies",
"question_en": "What is the main function of the Comptroller and Auditor General of India?",
"question_hi": "भारत के कंट्रोलर एंड ऑडिटर जनरल का मुख्य कार्य क्या है? ",
"A_en": "To audit the financial transactions of the government.", "A_hi": "सरकार के वित्तीय लेनदेन की ऑडिट करना",
"B_en": "To provide a framework for the Panchayati Raj system.", "B_hi": "पंचायती राज प्रणाली के लिए एक ढांचा प्रदान करना",
"C_en": "To supervise the elections and ensure the integrity of the electoral process.", "C_hi": "चुनावों की निगरानी करना और चुनावी प्रक्रिया की अखंडता सुनिश्चित करना",
"D_en": "To ensure the accountability of the government and its institutions.", "D_hi": "सरकार और उसकी संस्थाओं की जवाबदेही सुनिश्चित करना",
"answer": "D",
"explanation_en": "The main function of the Comptroller and Auditor General of India is to ensure the accountability of the government and its institutions.",
"explanation_hi": "भारत के कंट्रोलर एंड ऑडिटर जनरल का मुख्य कार्य सरकार और उसकी संस्थाओं की जवाबदेही सुनिश्चित करना है।"
},
{
"subject": "Indian Polity",
"topic": "Parliamentary Privileges",
"question_en": "What is the main purpose of the parliamentary privileges?",
"question_hi": "संसदीय अधिकारों का मुख्य उद्देश्य क्या है? ",
"A_en": "To protect the rights of the members of Parliament.", "A_hi": "संसद के सदस्यों के अधिकारों की रक्षा करना",
"B_en": "To ensure the accountability of the government.", "B_hi": "सरकार की जवाबदेही सुनिश्चित करना",
"C_en": "To provide a framework for the Panchayati Raj system.", "C_hi": "पंचायती राज प्रणाली के लिए एक ढांचा प्रदान करना",
"D_en": "To safeguard the dignity of the House.", "D_hi": "संसद की गरिमा की रक्षा करना",
"answer": "D",
"explanation_en": "The main purpose of the parliamentary privileges is to safeguard the dignity of the House.",
"explanation_hi": "संसदीय अधिकारों का मुख्य उद्देश्य संसद की गरिमा की रक्षा करना है।"
}