[
{
"subject": "Indian Polity",
"topic": "Constitutional Amendments",
"question_en": "Which article of the Indian Constitution deals with the amendment procedure?",
"question_hi": "भारतीय संविधान में संशोधन प्रक्रिया से संबंधित कौन सा लेख है?",
"A_en": "Article 368", "A_hi": "लेख 368",
"B_en": "Article 370", "B_hi": "लेख 370",
"C_en": "Article 352", "C_hi": "लेख 352",
"D_en": "Article 342", "D_hi": "लेख 342",
"answer": "A",
"explanation_en": "Article 368 deals with the amendment procedure of the Indian Constitution.",
"explanation_hi": "लेख 368 भारतीय संविधान के संशोधन प्रक्रिया से संबंधित है।"
},
{
"subject": "Indian Polity",
"topic": "Fundamental Rights",
"question_en": "What is the purpose of the Right to Equality as enshrined in the Indian Constitution?",
"question_hi": "भारतीय संविधान में समानता के अधिकार का उद्देश्य क्या है?",
"A_en": "To promote social justice", "A_hi": "सामाजिक न्याय को बढ़ावा देना",
"B_en": "To ensure equal opportunities for all", "B_hi": "सभी के लिए समान अवसर सुनिश्चित करना",
"C_en": "To protect the interests of the majority", "C_hi": "बहुसंख्यकों के हितों की रक्षा करना",
"D_en": "To promote communal harmony", "D_hi": "सामुदायिक सौहार्द को बढ़ावा देना",
"answer": "B",
"explanation_en": "The Right to Equality ensures that every individual has equal opportunities and is treated equally before the law.",
"explanation_hi": "समानता के अधिकार का उद्देश्य यह सुनिश्चित करना है कि प्रत्येक व्यक्ति को समान अवसर और कानून के समक्ष समान व्यवहार मिलता है।"
},
{
"subject": "Indian Polity",
"topic": "Parliamentary System",
"question_en": "What is the primary function of the Lok Sabha in the Indian Parliament?",
"question_hi": "भारतीय संसद में लोकसभा का प्राथमिक कार्य क्या है?",
"A_en": "To pass laws and approve the budget", "A_hi": "कानून पास करना और बजट की स्वीकृति देना",
"B_en": "To appoint the President and the Vice-President", "B_hi": "राष्ट्रपति और उपराष्ट्रपति की नियुक्ति करना",
"C_en": "To scrutinize the work of the Executive", "C_hi": "कार्यपालिका के कार्यों की समीक्षा करना",
"D_en": "To conduct investigations and inquires", "D_hi": "जांच और अन्वेषण करना",
"answer": "A",
"explanation_en": "The Lok Sabha is responsible for passing laws and approving the budget of the country, among other functions.",
"explanation_hi": "लोकसभा के पास देश के वित्तीय बजट की स्वीकृति करने और अन्य कार्यों के लिए कानून पारित करने की जिम्मेदारी है।"
},
{
"subject": "Indian Polity",
"topic": "Judiciary",
"question_en": "What is the power of judicial review in the Indian Constitution?",
"question_hi": "भारतीय संविधान में न्यायिक समीक्षा की शक्ति क्या है?",
"A_en": "To interpret laws and ensure they are in consonance with the Constitution", "A_hi": "कानूनों का अर्थ देना और यह सुनिश्चित करना कि वे संविधान के अनुरूप हैं",
"B_en": "To declare laws as unconstitutional", "B_hi": "कानूनों को असंवैधानिक घोषित करना",
"C_en": "To appoint judges to the higher judiciary", "C_hi": "उच्च न्यायपालिका में न्यायाधीशों की नियुक्ति करना",
"D_en": "To investigate and inquire into administrative actions", "D_hi": "प्रशासनिक कार्यों की जांच और अन्वेषण करना",
"answer": "A",
"explanation_en": "The judicial review power allows the judiciary to interpret laws and ensure they are in consonance with the Constitution.",
"explanation_hi": "न्यायिक समीक्षा की शक्ति न्यायपालिका को कानूनों का अर्थ देने और यह सुनिश्चित करने की अनुमति देती है कि वे संविधान के अनुरूप हैं।"
},
{
"subject": "Indian Polity",
"topic": "Federalism",
"question_en": "What is the principle of distribution of power between the Centre and the States in the Indian Constitution?",
"question_hi": "भारतीय संविधान में केंद्र और राज्यों के बीच शक्ति के वितरण का सिद्धांत क्या है?",
"A_en": "Division of powers between the Centre and the States", "A_hi": "केंद्र और राज्यों के बीच शक्तियों का विभाजन",
"B_en": "Concurrent List", "B_hi": "संयुक्त सूची",
"C_en": "Residual Powers", "C_hi": "बाकी शक्तियां",
"D_en": "Unitary System", "D_hi": "एकात्मक प्रणाली",
"answer": "A",
"explanation_en": "The principle of distribution of power between the Centre and the States is based on the division of powers between the Centre and the States.",
"explanation_hi": "केंद्र और राज्यों के बीच शक्ति के वितरण का सिद्धांत केंद्र और राज्यों के बीच शक्तियों के विभाजन पर आधारित है।"
},
{
"subject": "Indian Polity",
"topic": "Governance",
"question_en": "Who is the head of the Council of Ministers in the Indian government?",
"question_hi": "भारत सरकार में परिषद मंत्रियों का मुखिया कौन है?",
"A_en": "Prime Minister", "A_hi": "प्रधानमंत्री",
"B_en": "Home Minister", "B_hi": "कोयला मंत्री",
"C_en": "Finance Minister", "C_hi": "वित्त मंत्री",
"D_en": "Defence Minister", "D_hi": "रक्षा मंत्री",
"answer": "A",
"explanation_en": "The Prime Minister is the head of the Council of Ministers in the Indian government.",
"explanation_hi": "भारत सरकार में परिषद मंत्रियों का मुखिया प्रधानमंत्री है।"
},
{
"subject": "Indian Polity",
"topic": "Election Commission",
"question_en": "What is the primary function of the Election Commission of India?",
"question_hi": "भारतीय चुनाव आयोग का प्राथमिक कार्य क्या है?",
"A_en": "To conduct free and fair elections", "A_hi": "मुक्त और निष्पक्ष चुनाव आयोजित करना",
"B_en": "To appoint judges to the higher judiciary", "B_hi": "उच्च न्यायपालिका में न्यायाधीशों की नियुक्ति करना",
"C_en": "To scrutinize the work of the Executive", "C_hi": "कार्यपालिका के कार्यों की समीक्षा करना",
"D_en": "To investigate and inquire into administrative actions", "D_hi": "प्रशासनिक कार्यों की जांच और अन्वेषण करना",
"answer": "A",
"explanation_en": "The primary function of the Election Commission of India is to conduct free and fair elections.",
"explanation_hi": "भारतीय चुनाव आयोग का प्राथमिक कार्य मुक्त और निष्पक्ष चुनाव आयोजित करना है।"
},
{
"subject": "Indian Polity",
"topic": "Public Services",
"question_en": "What is the All India Services (AIS) in the context of the Indian Civil Services?",
"question_hi": "भारतीय सिविल सेवाओं के संदर्भ में तीन देश सेवाएं (AIS) क्या है?",
"A_en": "A service that provides assistance to the State Governments", "A_hi": "राज्य सरकारों की सहायता प्रदान करने वाली एक सेवा",
"B_en": "A service that provides assistance to the Centre", "B_hi": "केंद्र की सहायता प्रदान करने वाली एक सेवा",
"C_en": "A service that provides assistance to both the Centre and the States", "C_hi": "केंद्र और राज्यों की सहायता प्रदान करने वाली एक सेवा",
"D_en": "A service that provides assistance to the Public", "D_hi": "जनता की सहायता प्रदान करने वाली एक सेवा",
"answer": "C",
"explanation_en": "The All India Services (AIS) provides assistance to both the Centre and the States.",
"explanation_hi": "तीन देश सेवाएं (AIS) केंद्र और राज्यों की सहायता प्रदान करती है।"
},
{
"subject": "Indian Polity",
"topic": "International Relations",
"question_en": "What is the concept of Panchsheel in international relations?",
"question_hi": "अंतर्राष्ट्रीय संबंधों में पंचशील का सिद्धांत क्या है?",
"A_en": "A set of principles for peaceful coexistence", "A_hi": "शांति युग में सहयोग के लिए सिद्धांत",
"B_en": "A concept of non-alignment", "B_hi": "एक देश का अन्य देशों से अलग होना",
"C_en": "A concept of collective security", "C_hi": "सामूहिक सुरक्षा का सिद्धांत",
"D_en": "A concept of national sovereignty", "D_hi": "राष्ट्रीय संप्रभुता का सिद्धांत",
"answer": "A",
"explanation_en": "The concept of Panchsheel is a set of principles for peaceful coexistence in international relations.",
"explanation_hi": "पंचशील एक अंतर्राष्ट्रीय संबंधों में शांति युग में सहयोग के लिए सिद्धांत है।"
}
]