[
{
"subject": "Indian Polity",
"topic": "Constitution of India",
"question_en": "Which part of the Indian Constitution deals with the Fundamental Rights?",
"question_hi": "भारतीय संविधान का कौन सा भाग Fundamental Rights से संबंधित है?",
"A_en": "Part I", "A_hi": "भाग I",
"B_en": "Part II", "B_hi": "भाग II",
"C_en": "Part III", "C_hi": "भाग III",
"D_en": "Part IV", "D_hi": "भाग IV",
"answer": "C",
"explanation_en": "Part III of the Indian Constitution deals with the Fundamental Rights.",
"explanation_hi": "भारतीय संविधान का भाग III Fundamental Rights से संबंधित है।"
},
{
"subject": "Indian Polity",
"topic": "Constitution of India",
"question_en": "What is the name of the amendment that abolished the Privy Purse of the erstwhile Indian Princely States?",
"question_hi": "पुराने भारतीय शाही राज्यों के प्राइवी पुरसे को समाप्त करने वाले संशोधन का नाम क्या था?",
"A_en": "42nd Amendment", "A_hi": "42वां संशोधन",
"B_en": "24th Amendment", "B_hi": "24वां संशोधन",
"C_en": "26th Amendment", "C_hi": "26वां संशोधन",
"D_en": "17th Amendment", "D_hi": "17वां संशोधन",
"answer": "A",
"explanation_en": "The 24th Amendment abolished the Privy Purse of the erstwhile Indian Princely States.",
"explanation_hi": "24वां संशोधन ने पुराने भारतीय शाही राज्यों के प्राइवी पुरसे को समाप्त किया था।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj",
"question_en": "What is the main objective of the 73rd Constitutional Amendment Act, 1992?",
"question_hi": "73वें संविधान संशोधन अधिनियम, 1992 का मुख्य उद्देश्य क्या है?",
"A_en": "To provide reservation for Scheduled Castes and Scheduled Tribes in local bodies", "A_hi": "लोकल बॉडियों में अनुसूचित जातियों और अनुसूचित जनजातियों के लिए आरक्षण प्रदान करना",
"B_en": "To provide for the establishment of Gram Sabhas", "B_hi": "ग्राम सभाओं के निर्माण के लिए प्रदान करना",
"C_en": "To provide for the establishment of Panchayat Samitis", "C_hi": "पंचायत समितियों के निर्माण के लिए प्रदान करना",
"D_en": "To provide for the establishment of Zilla Parishads", "D_hi": "जिला परिषदों के निर्माण के लिए प्रदान करना",
"answer": "A",
"explanation_en": "The main objective of the 73rd Constitutional Amendment Act, 1992 is to provide reservation for Scheduled Castes and Scheduled Tribes in local bodies.",
"explanation_hi": "73वें संविधान संशोधन अधिनियम, 1992 का मुख्य उद्देश्य लोकल बॉडियों में अनुसूचित जातियों और अनुसूचित जनजातियों के लिए आरक्षण प्रदान करना है।"
},
{
"subject": "Indian Polity",
"topic": "Parliament",
"question_en": "Who is the Speaker of the Lok Sabha?",
"question_hi": "लोकसभा के अध्यक्ष कौन हैं?",
"A_en": "The Deputy Speaker", "A_hi": "उपाध्यक्ष",
"B_en": "The Leader of the House", "B_hi": "सदन के नेता",
"C_en": "The Prime Minister", "C_hi": "प्रधानमंत्री",
"D_en": "The Speaker of the Lok Sabha is elected by the Lok Sabha members", "D_hi": "लोकसभा सदस्यों द्वारा चुने गए लोकसभा के अध्यक्ष",
"answer": "D",
"explanation_en": "The Speaker of the Lok Sabha is elected by the Lok Sabha members.",
"explanation_hi": "लोकसभा के अध्यक्ष लोकसभा सदस्यों द्वारा चुने जाते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Judiciary",
"question_en": "What is the power of the President to grant pardons, reprieves, and remissions?",
"question_hi": "राष्ट्रपति द्वारा क्षमा, माफी और कमी की शक्ति क्या है?",
"A_en": "Executive power", "A_hi": "कार्यपालिका शक्ति",
"B_en": "Legislative power", "B_hi": "संसदीय शक्ति",
"C_en": "Judicial power", "C_hi": "न्यायिक शक्ति",
"D_en": "Constitutional power", "D_hi": "संवैधानिक शक्ति",
"answer": "D",
"explanation_en": "The power of the President to grant pardons, reprieves, and remissions is a constitutional power.",
"explanation_hi": "राष्ट्रपति द्वारा क्षमा, माफी और कमी की शक्ति संवैधानिक शक्ति है।"
},
{
"subject": "Indian Polity",
"topic": "Executive",
"question_en": "Who is the head of the Council of Ministers?",
"question_hi": "मंत्रिमंडल के अध्यक्ष कौन हैं?",
"A_en": "The Prime Minister", "A_hi": "प्रधानमंत्री",
"B_en": "The Deputy Prime Minister", "B_hi": "उपप्रधानमंत्री",
"C_en": "The Home Minister", "C_hi": "गृह मंत्री",
"D_en": "The Leader of the Opposition", "D_hi": "विपक्षी नेता",
"answer": "A",
"explanation_en": "The head of the Council of Ministers is the Prime Minister.",
"explanation_hi": "मंत्रिमंडल के अध्यक्ष प्रधानमंत्री हैं।"
},
{
"subject": "Indian Polity",
"topic": "Fundamental Rights",
"question_en": "What is the right to equality enshrined in the Indian Constitution?",
"question_hi": "भारतीय संविधान में समानता का अधिकार क्या है?",
"A_en": "Right to Equality", "A_hi": "समानता का अधिकार",
"B_en": "Right to Freedom", "B_hi": "स्वतंत्रता का अधिकार",
"C_en": "Right to Life", "C_hi": "जीवन का अधिकार",
"D_en": "Right to Education", "D_hi": "शिक्षा का अधिकार",
"answer": "A",
"explanation_en": "The right to equality is enshrined in the Indian Constitution.",
"explanation_hi": "समानता का अधिकार भारतीय संविधान में वर्णित है।"
},
{
"subject": "Indian Polity",
"topic": "Fundamental Rights",
"question_en": "Who is entitled to the right to freedom under Article 19 of the Indian Constitution?",
"question_hi": "भारतीय संविधान के अनुच्छेद 19 के तहत स्वतंत्रता का अधिकार किसको प्राप्त है?",
"A_en": "All citizens of India", "A_hi": "भारत के सभी नागरिक",
"B_en": "All residents of India", "B_hi": "भारत के सभी निवासी",
"C_en": "All citizens of India who are above 18 years of age", "C_hi": "भारत के सभी नागरिक जो 18 वर्ष से अधिक आयु के हैं",
"D_en": "All citizens of India who are above 21 years of age", "D_hi": "भारत के सभी नागरिक जो 21 वर्ष से अधिक आयु के हैं",
"answer": "A",
"explanation_en": "All citizens of India are entitled to the right to freedom under Article 19 of the Indian Constitution.",
"explanation_hi": "भारत के सभी नागरिक भारतीय संविधान के अनुच्छेद 19 के तहत स्वतंत्रता के अधिकार के पात्र हैं।"
},
{
"subject": "Indian Polity",
"topic": "Fundamental Rights",
"question_en": "What is the purpose of the Right to Freedom under Article 19 of the Indian Constitution?",
"question_hi": "भारतीय संविधान के अनुच्छेद 19 के तहत स्वतंत्रता का अधिकार का उद्देश्य क्या है?",
"A_en": "To protect the rights of all citizens of India", "A_hi": "भारत के सभी नागरिकों के अधिकारों की सुरक्षा करना",
"B_en": "To promote the welfare of all citizens of India", "B_hi": "भारत के सभी नागरिकों के कल्याण को बढ़ावा देना",
"C_en": "To protect the rights of minorities and weaker sections of society", "C_hi": "सामाजिक कमजोर वर्गों और अल्पसंख्यकों के अधिकारों की सुरक्षा करना",
"D_en": "To ensure the equality of all citizens of India", "D_hi": "भारत के सभी नागरिकों में समानता सुनिश्चित करना",
"answer": "A",
"explanation_en": "The main purpose of the Right to Freedom under Article 19 of the Indian Constitution is to protect the rights of all citizens of India.",
"explanation_hi": "भारतीय संविधान के अनुच्छेद 19 के तहत स्वतंत्रता का अधिकार का मुख्य उद्देश्य भारत के सभी नागरिकों के अधिकारों की सुरक्षा करना है।"
}
]