[
{
"subject": "Indian Polity",
"topic": "Basic Structure of Indian Constitution",
"question_en": "Which of the following provisions is a part of the basic structure of the Indian Constitution?",
"question_hi": "भारतीय संविधान की मूल संरचना में निम्नलिखित प्रावधान कौन सा है?",
"A_en": "Abolition of Privy Purses", "A_hi": "प्राइवी पुर्ज़ो का समाप्ति",
"B_en": "Right to Property", "B_hi": "संपत्ति का अधिकार",
"C_en": "Independent Judiciary", "C_hi": "स्वतंत्र न्यायपालिका",
"D_en": "Emergency Provisions", "D_hi": "आपातकालीन प्रावधान",
"answer": "C",
"explanation_en": "The provision of an independent judiciary is a part of the basic structure of the Indian Constitution.",
"explanation_hi": "भारतीय संविधान की मूल संरचना का एक भाग स्वतंत्र न्यायपालिका का प्रावधान है।"
},
{
"subject": "Indian Polity",
"topic": "Fundamental Rights",
"question_en": "Which of the following Fundamental Rights is not a justiciable right?",
"question_hi": "निम्नलिखित में से कौन सा मौलिक अधिकार न्यायिक है नहीं?",
"A_en": "Right to Equality", "A_hi": "समानता का अधिकार",
"B_en": "Right to Freedom", "B_hi": "स्वतंत्रता का अधिकार",
"C_en": "Right to Freedom of Speech and Expression", "C_hi": "बोलने और व्यक्त करने की स्वतंत्रता का अधिकार",
"D_en": "Right to Property", "D_hi": "संपत्ति का अधिकार",
"answer": "D",
"explanation_en": "Right to Property is not a justiciable right, it was abolished by the 44th Amendment Act, 1978.",
"explanation_hi": "संपत्ति का अधिकार एक न्यायिक अधिकार नहीं है, यह 1978 के 44वें संशोधन अधिनियम द्वारा समाप्त कर दिया गया था।"
},
{
"subject": "Indian Polity",
"topic": "Directive Principles of State Policy",
"question_en": "Which of the following Directive Principles of State Policy is related to the welfare of the Scheduled Castes?",
"question_hi": "निम्नलिखित निर्देशात्मक सिद्धांत राज्य नीति से संबंधित है कि शेड्युल्ड जातियों के कल्याण से?",
"A_en": "Right to Equality", "A_hi": "समानता का अधिकार",
"B_en": "Right to Freedom", "B_hi": "स्वतंत्रता का अधिकार",
"C_en": "Right to Education", "C_hi": "शिक्षा का अधिकार",
"D_en": "Untouchability is forbidden", "D_hi": "अछूतवाद को प्रतिबंधित किया गया है",
"answer": "D",
"explanation_en": "The Directive Principle of State Policy related to the welfare of the Scheduled Castes is that untouchability is forbidden.",
"explanation_hi": "शेड्युल्ड जातियों के कल्याण से संबंधित निर्देशात्मक सिद्धांत राज्य नीति यह है कि अछूतवाद को प्रतिबंधित किया गया है।"
},
{
"subject": "Indian Polity",
"topic": "Parliament of India",
"question_en": "How many members are elected by the President in the Lok Sabha?",
"question_hi": "लोक सभा में राष्ट्रपति द्वारा कितने सदस्य चुने जाते हैं?",
"A_en": "2", "A_hi": "2",
"B_en": "1", "B_hi": "1",
"C_en": "None", "C_hi": "कोई भी",
"D_en": "Depends on the party in power", "D_hi": "सदन में शासक दल पर निर्भर करता है",
"answer": "C",
"explanation_en": "No member is elected by the President in the Lok Sabha, all members are elected by the people of India.",
"explanation_hi": "लोक सभा में कोई भी सदस्य राष्ट्रपति द्वारा नहीं चुने जाते हैं, सभी सदस्य भारत के लोगों द्वारा चुने जाते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Judiciary in India",
"question_en": "What is the age limit for a person to be eligible to be appointed as a Judge of the Supreme Court?",
"question_hi": "एक व्यक्ति के लिए उच्चतम न्यायालय के न्यायाधीश के रूप में नियुक्त होने के लिए आयु सीमा क्या है?",
"A_en": "35 years", "A_hi": "35 वर्ष",
"B_en": "50 years", "B_hi": "50 वर्ष",
"C_en": "No age limit", "C_hi": "कोई आयु सीमा नहीं",
"D_en": "Not more than 62 years", "D_hi": "62 वर्ष से अधिक नहीं",
"answer": "D",
"explanation_en": "The age limit for a person to be eligible to be appointed as a Judge of the Supreme Court is not more than 62 years.",
"explanation_hi": "उच्चतम न्यायालय के न्यायाधीश के रूप में नियुक्त होने के लिए एक व्यक्ति की आयु सीमा 62 वर्ष से अधिक नहीं है।"
},
{
"subject": "Indian Polity",
"topic": "Constitutional Bodies",
"question_en": "Which of the following is a constitutional body that is responsible for the appointment of the Chief Election Commissioner?",
"question_hi": "निम्नलिखित एक संवैधानिक संस्था है जिसकी जिम्मेदारी चुनाव आयोग के अध्यक्ष की नियुक्ति करने की है?",
"A_en": "President", "A_hi": "राष्ट्रपति",
"B_en": "Prime Minister", "B_hi": "प्रधानमंत्री",
"C_en": "Chief Justice of India", "C_hi": "भारत के मुख्य न्यायाधीश",
"D_en": "Council of Ministers", "D_hi": "मंत्रिमंडल",
"answer": "A",
"explanation_en": "The President is responsible for the appointment of the Chief Election Commissioner.",
"explanation_hi": "राष्ट्रपति चुनाव आयोग के अध्यक्ष की नियुक्ति के लिए जिम्मेदार है।"
},
{
"subject": "Indian Polity",
"topic": "Emergency Provisions",
"question_en": "Who can proclaim a National Emergency under Article 352 of the Constitution?",
"question_hi": "कौन संविधान के अनुच्छेद 352 के तहत राष्ट्रीय आपातकाल की घोषणा कर सकता है?",
"A_en": "President", "A_hi": "राष्ट्रपति",
"B_en": "Prime Minister", "B_hi": "प्रधानमंत्री",
"C_en": "Chief Justice of India", "C_hi": "भारत के मुख्य न्यायाधीश",
"D_en": "Council of Ministers", "D_hi": "मंत्रिमंडल",
"answer": "A",
"explanation_en": "The President can proclaim a National Emergency under Article 352 of the Constitution.",
"explanation_hi": "संविधान के अनुच्छेद 352 के तहत राष्ट्रपति राष्ट्रीय आपातकाल की घोषणा कर सकता है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj",
"question_en": "What is the main objective of the 73rd Amendment to the Constitution?",
"question_hi": "73वें संशोधन अधिनियम का मुख्य उद्देश्य क्या है?",
"A_en": "To provide for the establishment of the National Commission for Minorities", "A_hi": "माइनोरिटीज के लिए राष्ट्रीय आयोग की स्थापना के लिए प्रदान करना",
"B_en": "To provide for the establishment of the National Commission for Scheduled Castes", "B_hi": "शेड्युल्ड जातियों के लिए राष्ट्रीय आयोग की स्थापना के लिए प्रदान करना",
"C_en": "To provide for the establishment of the Three-Tier Panchayati Raj System", "C_hi": "तीन-स्तरीय पंचायती राज प्रणाली की स्थापना के लिए प्रदान करना",
"D_en": "To provide for the establishment of the National Human Rights Commission", "D_hi": "मानवाधिकार आयोग की स्थापना के लिए प्रदान करना",
"answer": "C",
"explanation_en": "The main objective of the 73rd Amendment to the Constitution is to provide for the establishment of the Three-Tier Panchayati Raj System.",
"explanation_hi": "73वें संशोधन अधिनियम का मुख्य उद्देश्य तीन-स्तरीय पंचायती राज प्रणाली की स्थापना के लिए प्रदान करना है।"
},
{
"subject": "Indian Polity",
"topic": "Constitutional Amendments",
"question_en": "Which of the following amendments to the Constitution is also known as the 'Mini-Constitution'?",
"question_hi": "निम्नलिखित संविधान संशोधन को 'मिनी-संविधान' के रूप में भी जाना जाता है?",
"A_en": "42nd Amendment", "A_hi": "42वां संशोधन",
"B_en": "44th Amendment", "B_hi": "44वां संशोधन",
"C_en": "42nd Amendment is not known as the 'Mini-Constitution'", "C_hi": "42वां संशोधन 'मिनी-संविधान' नहीं जाना जाता है",
"D_en": "The 42nd Amendment is known as the 'Mini-Constitution'", "D_hi": "42वां संशोधन 'मिनी-संविधान' के रूप में जाना जाता है",
"answer": "D",
"explanation_en": "The 42nd Amendment is known as the 'Mini-Constitution'.",
"explanation_hi": "42वां संशोधन 'मिनी-संविधान' के रूप में जाना जाता है।"
},
{
"subject": "Indian Polity",
"topic": "Separation of Powers",
"question_en": "Which of the following is a principle of the Separation of Powers?",
"question_hi": "निम्नलिखित संविधान के कौन से सिद्धांत से अलगाव की शक्ति का सिद्धांत है?",
"A_en": "Executive, Legislative, and Judicial powers should be vested in one person", "A_hi": "कार्यकारी, विधायी और न्यायपालिका के शक्ति एक व्यक्ति में स्थित होनी चाहिए",
"B_en": "The Legislative power should be vested in the Executive", "B_hi": "विधायी शक्ति कार्यकारी में स्थित होनी चाहिए",
"C_en": "The Executive power should be vested in the Judiciary", "C_hi": "कार्यकारी शक्ति न्यायपालिका में स्थित होनी चाहिए",
"D_en": "The three branches of government should be separate and independent", "D_hi": "सरकार की तीन शाखाएं अलग और स्वतंत्र होनी चाहिए",
"answer": "D",
"explanation_en": "The principle of Separation of Powers is that the three branches of government should be separate and independent.",
"explanation_hi": "संविधान का सिद्धांत अलगाव की शक्ति यह है कि सरकार की तीन शाखाएं अलग और स्वतंत्र होनी चाहिए।"
}