[
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following is the correct purpose of the Fifth Schedule?",
"question_hi": "पांचवें शेड्यूल का सही उद्देश्य क्या है?",
"A_en": "To provide special rights to Scheduled Tribes in certain states", "A_hi": "कुछ राज्यों में अनुसूचित जनजातियों के विशेष अधिकार प्रदान करने के लिए",
"B_en": "To provide special rights to Scheduled Castes in certain states", "B_hi": "कुछ राज्यों में अनुसूचित जातियों के विशेष अधिकार प्रदान करने के लिए",
"C_en": "To provide special rights to the President of India", "C_hi": "भारत के राष्ट्रपति के विशेष अधिकार प्रदान करने के लिए",
"D_en": "To provide special rights to the Prime Minister of India", "D_hi": "भारत के प्रधानमंत्री के विशेष अधिकार प्रदान करने के लिए",
"answer": "A",
"explanation_en": "The Fifth Schedule provides special rights to Scheduled Tribes in certain states to protect their rights and interests.",
"explanation_hi": "पांचवें शेड्यूल का उद्देश्य कुछ राज्यों में अनुसूचित जनजातियों के अधिकारों और हितों की रक्षा करना है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following states has the highest number of Scheduled Tribes?",
"question_hi": "निम्नलिखित राज्यों में सबसे अधिक अनुसूचित जनजातियों की संख्या है, वह कौन सा है?",
"A_en": "Madhya Pradesh", "A_hi": "मध्य प्रदेश",
"B_en": "Odisha", "B_hi": "ओडिशा",
"C_en": "Chhattisgarh", "C_hi": "छत्तीसगढ़",
"D_en": "Andhra Pradesh", "D_hi": "आंध्र प्रदेश",
"answer": "C",
"explanation_en": "Chhattisgarh has the highest number of Scheduled Tribes in the country.",
"explanation_hi": "छत्तीसगढ़ देश में सबसे अधिक अनुसूचित जनजातियों की संख्या वाला राज्य है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the role of the Governor in the implementation of the Fifth Schedule?",
"question_hi": "पांचवें शेड्यूल के क्रियान्वयन में गवर्नर की भूमिका क्या है?",
"A_en": "The Governor has the power to appoint advisors to the Governor", "A_hi": "गवर्नर को सलाहकारों की नियुक्ति का अधिकार है",
"B_en": "The Governor is responsible for the administration of Scheduled Areas", "B_hi": "गवर्नर अनुसूचित क्षेत्रों के प्रशासन के लिए जिम्मेदार हैं",
"C_en": "The Governor has the power to make laws for Scheduled Areas", "C_hi": "गवर्नर के पास अनुसूचित क्षेत्रों के लिए कानून बनाने का अधिकार है",
"D_en": "The Governor is responsible for the protection of Scheduled Tribes", "D_hi": "गवर्नर अनुसूचित जनजातियों की सुरक्षा के लिए जिम्मेदार हैं",
"answer": "B",
"explanation_en": "The Governor is responsible for the administration of Scheduled Areas under the Fifth Schedule.",
"explanation_hi": "पांचवें शेड्यूल के तहत गवर्नर अनुसूचित क्षेत्रों के प्रशासन के लिए जिम्मेदार हैं।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following is a power of the President under the Fifth Schedule?",
"question_hi": "पांचवें शेड्यूल के तहत राष्ट्रपति की कौन सी शक्ति है?",
"A_en": "To make laws for Scheduled Areas", "A_hi": "अनुसूचित क्षेत्रों के लिए कानून बनाने की शक्ति",
"B_en": "To appoint advisors to the Governor", "B_hi": "गवर्नर को सलाहकारों की नियुक्ति करने की शक्ति",
"C_en": "To provide financial assistance to Scheduled Tribes", "C_hi": "अनुसूचित जनजातियों को आर्थिक सहायता प्रदान करने की शक्ति",
"D_en": "To provide protection to Scheduled Tribes", "D_hi": "अनुसूचित जनजातियों की सुरक्षा प्रदान करने की शक्ति",
"answer": "A",
"explanation_en": "The President has the power to make laws for Scheduled Areas under the Fifth Schedule.",
"explanation_hi": "पांचवें शेड्यूल के तहत राष्ट्रपति के पास अनुसूचित क्षेत्रों के लिए कानून बनाने की शक्ति है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the role of the State Legislature in the implementation of the Fifth Schedule?",
"question_hi": "पांचवें शेड्यूल के क्रियान्वयन में राज्य विधानसभा की भूमिका क्या है?",
"A_en": "The State Legislature has the power to make laws for Scheduled Areas", "A_hi": "राज्य विधानसभा के पास अनुसूचित क्षेत्रों के लिए कानून बनाने का अधिकार है",
"B_en": "The State Legislature is responsible for the administration of Scheduled Areas", "B_hi": "राज्य विधानसभा अनुसूचित क्षेत्रों के प्रशासन के लिए जिम्मेदार हैं",
"C_en": "The State Legislature has the power to appoint advisors to the Governor", "C_hi": "राज्य विधानसभा के पास गवर्नर को सलाहकारों की नियुक्ति करने का अधिकार है",
"D_en": "The State Legislature is responsible for the protection of Scheduled Tribes", "D_hi": "राज्य विधानसभा अनुसूचित जनजातियों की सुरक्षा के लिए जिम्मेदार हैं",
"answer": "C",
"explanation_en": "The State Legislature has the power to appoint advisors to the Governor under the Fifth Schedule.",
"explanation_hi": "पांचवें शेड्यूल के तहत राज्य विधानसभा के पास गवर्नर को सलाहकारों की नियुक्ति करने का अधिकार है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following is a right of the Scheduled Tribes under the Fifth Schedule?",
"question_hi": "पांचवें शेड्यूल के तहत अनुसूचित जनजातियों का कौन सा अधिकार है?",
"A_en": "To have a separate administration", "A_hi": "अलग प्रशासन होने का अधिकार",
"B_en": "To have a separate judiciary", "B_hi": "अलग न्यायपालिका होने का अधिकार",
"C_en": "To have a separate legislature", "C_hi": "अलग विधायिका होने का अधिकार",
"D_en": "To have the power to make laws for themselves", "D_hi": "अपने लिए कानून बनाने की शक्ति होने का अधिकार",
"answer": "A",
"explanation_en": "The Scheduled Tribes have the right to have a separate administration under the Fifth Schedule.",
"explanation_hi": "पांचवें शेड्यूल के तहत अनुसूचित जनजातियों का अधिकार अलग प्रशासन होने का है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the role of the Collector in the administration of Scheduled Areas?",
"question_hi": "अनुसूचित क्षेत्रों के प्रशासन में कलेक्टर की भूमिका क्या है?",
"A_en": "The Collector is responsible for the administration of Scheduled Areas", "A_hi": "कलेक्टर अनुसूचित क्षेत्रों के प्रशासन के लिए जिम्मेदार हैं",
"B_en": "The Collector is responsible for the protection of Scheduled Tribes", "B_hi": "कलेक्टर अनुसूचित जनजातियों की सुरक्षा के लिए जिम्मेदार हैं",
"C_en": "The Collector has the power to make laws for Scheduled Areas", "C_hi": "कलेक्टर के पास अनुसूचित क्षेत्रों के लिए कानून बनाने का अधिकार है",
"D_en": "The Collector is responsible for the development of Scheduled Areas", "D_hi": "कलेक्टर अनुसूचित क्षेत्रों के विकास के लिए जिम्मेदार हैं",
"answer": "A",
"explanation_en": "The Collector is responsible for the administration of Scheduled Areas under the Fifth Schedule.",
"explanation_hi": "पांचवें शेड्यूल के तहत कलेक्टर अनुसूचित क्षेत्रों के प्रशासन के लिए जिम्मेदार हैं।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following is a restriction on the powers of the Governor under the Fifth Schedule?",
"question_hi": "पांचवें शेड्यूल के तहत गवर्नर की शक्तियों पर कौन सी प्रतिबंध है?",
"A_en": "The Governor cannot make laws for Scheduled Areas", "A_hi": "गवर्नर अनुसूचित क्षेत्रों के लिए कानून नहीं बना सकते हैं",
"B_en": "The Governor cannot appoint advisors to the Governor", "B_hi": "गवर्नर गवर्नर को सलाहकार नहीं नियुक्त कर सकते हैं",
"C_en": "The Governor cannot provide financial assistance to Scheduled Tribes", "C_hi": "गवर्नर अनुसूचित जनजातियों को आर्थिक सहायता नहीं दे सकते हैं",
"D_en": "The Governor cannot provide protection to Scheduled Tribes", "D_hi": "गवर्नर अनुसूचित जनजातियों की सुरक्षा नहीं प्रदान कर सकते हैं",
"answer": "A",
"explanation_en": "The Governor cannot make laws for Scheduled Areas under the Fifth Schedule.",
"explanation_hi": "पांचवें शेड्यूल के तहत गवर्नर अनुसूचित क्षेत्रों के लिए कानून नहीं बना सकते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the role of the State Government in the implementation of the Fifth Schedule?",
"question_hi": "पांचवें शेड्यूल के क्रियान्वयन में राज्य सरकार की भूमिका क्या है?",
"A_en": "The State Government has the power to make laws for Scheduled Areas", "A_hi": "राज्य सरकार के पास अनुसूचित क्षेत्रों के लिए कानून बनाने का अधिकार है",
"B_en": "The State Government is responsible for the administration of Scheduled Areas", "B_hi": "राज्य सरकार अनुसूचित क्षेत्रों के प्रशासन के लिए जिम्मेदार हैं",
"C_en": "The State Government has the power to appoint advisors to the Governor", "C_hi": "राज्य सरकार के पास गवर्नर को सलाहकारों की नियुक्ति करने का अधिकार है",
"D_en": "The State Government is responsible for the protection of Scheduled Tribes", "D_hi": "राज्य सरकार अनुसूचित जनजातियों की सुरक्षा के लिए जिम्मेदार हैं",
"answer": "B",
"explanation_en": "The State Government is responsible for the administration of Scheduled Areas under the Fifth Schedule.",
"explanation_hi": "पांचवें शेड्यूल के तहत राज्य सरकार अनुसूचित क्षेत्रों के प्रशासन के लिए जिम्मेदार है।"
}