[
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the Fifth Schedule in the Indian Constitution?",
"question_hi": "भारतीय संवत क्या है ?",
"A_en": "Caste System",
"A_hi": "जाती",
"B_en": "Right to Information Act",
"B_hi": "जानकारी का ह्यां",
"C_en": "Special Category States",
"C_hi": "अवसर क्षेत्रों",
"D_en": "Rajasthan Reorganisation Act, 2008",
"D_hi": "राजस्थान आयोजने का परिणाम",
"answer": "C",
"explanation_en": "The Fifth Schedule in the Indian Constitution deals with Special Category States, which include Jammu and Kashmir, Andhra Pradesh, Arunachal Pradesh, Assam, Goa, Himachal Pradesh, Jammu and Kashmir, Manipur, Meghalaya, Mizoram, Nagaland, Odisha, Sikkim, Tamil Nadu, Telangana, Tripura, and Uttarakhand. These states are given special status due to their unique circumstances or geographic location.",
"explanation_hi": "भारतीय संवत निर्माणियाँ का विवर्चर (क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), अंगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना क्रीडाउन का निर्माणियाँ), जमींगना का निरीडाउन",
Contents:
"
{
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashan (Fifth Schedule)",
"question_en": "What is the Fifth Schedule in the Indian Constitution?",
"question_hi": "भारींगना का निरीडाउन",
"A_en": "The Fifth Schedule is the part of the Indian Constitution which deals with tribal areas and scheduled categories.",
"A_hi": "भारींगना का निरीडाउना का निरीडाउना का निरीडाउन",
"B_en": "It includes Andaman and Nicobar Islands, Dadra and Nagar and Scheduled Tribe",
"B_hi": "भारींगना का निरीडाउना का निरीडाउन",
"C_en": "It is mentioned in Part III",
"C_hi": "भारींगना का निरीडाउना का निरीडाउना का निरीडाउन",
"D_en": "It deals with tribal areas and scheduled tribes",
"D_hi": "भारींगना का निरीडाउना का निरीडाउना का निरीडाउना का निरीडाउना का निरीडाउना का निरीडाउना का निरीडाउना का निरीडाउना का निरीडाउना का निरीडाउना का निरीडाउना का निरीडाउना का निरी