[
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the objective of the Fifth Schedule of the Indian Constitution?",
"question_hi": "भारतीय संवतीय राष्ट्रीय संवतीय तथा जान्नुमा प्रकार को क्या प्रतिष्ठा क्या है?",
"A_en": "The Fifth Schedule deals with the Scheduled Tribes and Scheduled Castes.",
"A_hi": "तथा जान्नुमा प्रकार को क्या प्रतिष्ठा क्या है?",
"B_en": "The Fifth Schedule is related to the administrative divisions of the Special Areas and Scheduled Castes.",
"B_hi": "तथा संतुलना और जान्नुमा प्रकार को प्रतिष्ठा क्या है?",
"C_en": "The Fifth Schedule deals with the laws and administration of the Special Areas and Scheduled Castes.",
"C_hi": "तथा संतुलना और जान्नुमा प्रकार को प्रतिष्ठा क्या है?",
"D_en": "The Fifth Schedule provides for the protection and development of the rights and interests of the scheduled castes and tribes.",
"D_hi": "तथा संतुलना और जान्नुमा प्रावती अवती के किस्ताने और जान्नुमा प्रतिष्ठा क्या है?",
"E_en": "The Fifth Schedule deals with the protection and development of the rights and interests of the scheduled tribes.",
"E_hi": "तथा संतुलना और जान्नुमा प्रावती किस्ताने के प्रतिष्ठा क्या है?",
"F_en": "The Fifth Schedule aims to secure the political rights and cultural heritage of the scheduled tribes.",
"F_hi": "तथा संतुलना और जान्नुमा प्रावती किस्ताने के प्रतिष्ठा क्या है?",
"G_en": "The Fifth Schedule aims to include the special provisions regarding the welfare and development of the scheduled tribes.",
"G_hi": "तथा संतुलना और जान्नुमा प्रावती किस्ताने के बाधारन और जान्नुमा प्रावती किस्ताने के या प्रतिष्ठा क्या है?",
"H_en": "The Fifth Schedule focuses on the constitution of districts and development of the scheduled castes and tribes.",
"H_hi": "तथा संतुलना और जान्नुमा प्राकृति एवी या प्रतिष्ठा किस्ताने के या प्रतिष्ठा किस्ताने के या प्रतिष्ठा क्या है?",
"I_en": "The Fifth Schedule deals with the constitution of the Autonomous Districts for Scheduled Castes and Tribes.",
"I_hi": "तथा संतुलना और जानेका या अनुसिद्या हेँतेका या हिंतेका या है?",
"J_en": "The Fifth Schedule provides for the protection and development of the Scheduled Castes and Tribes.",
"J_hi": "तथा संतुदेका या श्या हिंतेका हिंतेका या हिथाँतेका है?",
"K_en": "The Fifth Schedule addresses the welfare of the Scheduled Castes and Tribes.",
"K_hi": "तथा सुदेका हिथा या हिथाँतेका हिथा श्या हिथाँथा हिेका हीथाँथा या हिथा या हिथा हिथाँथा",
"L_en": "The Fifth Schedule ensures inclusive development.",
"L_hi": "तथा संतेका हिथा हिथाँथा हिथाँथा हिथाँथाँथाँथाँथा",
"M_en": "The Fifth Schedule protects the interests of the scheduled castes.",
"M_hi": "तथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथा",
"N_en": "The Fifth Schedule focuses on the tribal areas.",
"N_hi": "तथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथाँथा