[
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the main objective of the Fifth Schedule of the Indian Constitution?",
"question_hi": "भारतीय संविधान की पांचवीं अनुसूची का मुख्य उद्देश्य क्या है?",
"A_en": "To provide special provisions for the administration of tribal areas", "A_hi": "आदिवासी क्षेत्रों के प्रशासन के लिए विशेष प्रावधान प्रदान करना",
"B_en": "To establish a separate state for tribal communities", "B_hi": "आदिवासी समुदायों के लिए एक अलग राज्य स्थापित करना",
"C_en": "To promote the economic development of scheduled areas", "C_hi": "अनुसूचित क्षेत्रों के आर्थिक विकास को बढ़ावा देना",
"D_en": "To protect the cultural heritage of tribal communities", "D_hi": "आदिवासी समुदायों की सांस्कृतिक विरासत की रक्षा करना",
"answer": "A",
"explanation_en": "The Fifth Schedule of the Indian Constitution provides special provisions for the administration and control of scheduled areas and scheduled tribes.",
"explanation_hi": "भारतीय संविधान की पांचवीं अनुसूची अनुसूचित क्षेत्रों और अनुसूचित जनजातियों के प्रशासन और नियंत्रण के लिए विशेष प्रावधान प्रदान करती है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following is a feature of the Fifth Schedule?",
"question_hi": "निम्नलिखित में से कौन पांचवीं अनुसूची की एक विशेषता है?",
"A_en": "It provides for the establishment of tribal advisory councils", "A_hi": "यह जनजातीय सलाहकार परिषदों की स्थापना के लिए प्रावधान करता है",
"B_en": "It empowers the governor to make regulations for scheduled areas", "B_hi": "यह अनुसूचित क्षेत्रों के लिए नियम बनाने के लिए राज्यपाल को अधिकृत करता है",
"C_en": "It provides for the allocation of funds for tribal development", "C_hi": "यह जनजातीय विकास के लिए धन के आवंटन के लिए प्रावधान करता है",
"D_en": "It guarantees the rights of non-tribal communities in scheduled areas", "D_hi": "यह अनुसूचित क्षेत्रों में गैर-जनजातीय समुदायों के अधिकारों की गारंटी देता है",
"answer": "B",
"explanation_en": "The Fifth Schedule empowers the governor to make regulations for the peace and good government of a scheduled area.",
"explanation_hi": "पांचवीं अनुसूची राज्यपाल को एक अनुसूचित क्षेत्र के शांति और अच्छे प्रशासन के लिए नियम बनाने के लिए अधिकृत करती है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the role of the Tribal Advisory Council under the Fifth Schedule?",
"question_hi": "पांचवीं अनुसूची के तहत जनजातीय सलाहकार परिषद की भूमिका क्या है?",
"A_en": "To advise the governor on matters related to tribal welfare", "A_hi": "जनजातीय कल्याण से संबंधित मामलों पर राज्यपाल को सलाह देना",
"B_en": "To make laws for the governance of scheduled areas", "B_hi": "अनुसूचित क्षेत्रों के शासन के लिए कानून बनाना",
"C_en": "To allocate funds for tribal development projects", "C_hi": "जनजातीय विकास परियोजनाओं के लिए धन आवंटित करना",
"D_en": "To investigate human rights violations in scheduled areas", "D_hi": "अनुसूचित क्षेत्रों में मानवाधिकार उल्लंघन की जांच करना",
"answer": "A",
"explanation_en": "The Tribal Advisory Council is a constitutional body that advises the governor on matters related to the welfare and advancement of scheduled tribes.",
"explanation_hi": "जनजातीय सलाहकार परिषद एक संवैधानिक निकाय है जो अनुसूचित जनजातियों के कल्याण और उन्नति से संबंधित मामलों पर राज्यपाल को सलाह देता है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which article of the Indian Constitution deals with the Fifth Schedule?",
"question_hi": "भारतीय संविधान का कौन सा अनुच्छेद पांचवीं अनुसूची से संबंधित है?",
"A_en": "Article 244", "A_hi": "अनुच्छेद 244",
"B_en": "Article 245", "B_hi": "अनुच्छेद 245",
"C_en": "Article 246", "C_hi": "अनुच्छेद 246",
"D_en": "Article 247", "D_hi": "अनुच्छेद 247",
"answer": "A",
"explanation_en": "Article 244 of the Indian Constitution deals with the Fifth Schedule, which provides for the administration and control of scheduled areas and scheduled tribes.",
"explanation_hi": "भारतीय संविधान का अनुच्छेद 244 पांचवीं अनुसूची से संबंधित है, जो अनुसूचित क्षेत्रों और अनुसूचित जनजातियों के प्रशासन और नियंत्रण के लिए प्रावधान करता है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the significance of the Fifth Schedule in the context of tribal governance?",
"question_hi": "आदिवासी प्रशासन के संदर्भ में पांचवीं अनुसूची का क्या महत्व है?",
"A_en": "It provides for the direct participation of tribal communities in governance", "A_hi": "यह शासन में आदिवासी समुदायों की सीधी भागीदारी के लिए प्रावधान करता है",
"B_en": "It ensures the protection of tribal rights and interests", "B_hi": "यह आदिवासी अधिकारों और हितों की रक्षा सुनिश्चित करता है",
"C_en": "It promotes the economic development of scheduled areas", "C_hi": "यह अनुसूचित क्षेत्रों के आर्थिक विकास को बढ़ावा देता है",
"D_en": "It facilitates the integration of tribal communities into the mainstream", "D_hi": "यह मुख्यधारा में आदिवासी समुदायों के एकीकरण को सुविधाजनक बनाता है",
"answer": "B",
"explanation_en": "The Fifth Schedule is significant because it ensures the protection of tribal rights and interests by providing for the administration and control of scheduled areas and scheduled tribes.",
"explanation_hi": "पांचवीं अनुसूची महत्वपूर्ण है क्योंकि यह अनुसूचित क्षेत्रों और अनुसूचित जनजातियों के प्रशासन और नियंत्रण के लिए प्रावधान करके आदिवासी अधिकारों और हितों की रक्षा सुनिश्चित करती है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the relationship between the Fifth Schedule and the Panchayat (Extension to Scheduled Areas) Act, 1996?",
"question_hi": "पांचवीं अनुसूची और पंचायत (अनुसूचित क्षेत्रों में विस्तार) अधिनियम, 1996 के बीच क्या संबंध है?",
"A_en": "The Act extends the provisions of the Fifth Schedule to panchayats in scheduled areas", "A_hi": "अधिनियम पांचवीं अनुसूची के प्रावधानों को अनुसूचित क्षेत्रों में पंचायतों तक विस्तारित करता है",
"B_en": "The Act overrides the provisions of the Fifth Schedule in scheduled areas", "B_hi": "अधिनियम अनुसूचित क्षेत्रों में पांचवीं अनुसूची के प्रावधानों को अस्वीकार करता है",
"C_en": "The Act has no relation to the Fifth Schedule", "C_hi": "अधिनियम का पांचवीं अनुसूची से कोई संबंध नहीं है",
"D_en": "The Act provides for the establishment of panchayats in non-scheduled areas", "D_hi": "अधिनियम गैर-अनुसूचित क्षेत्रों में पंचायतों की स्थापना के लिए प्रावधान करता है",
"answer": "A",
"explanation_en": "The Panchayat (Extension to Scheduled Areas) Act, 1996 extends the provisions of the Fifth Schedule to panchayats in scheduled areas, providing for the participation of tribal communities in local self-government.",
"explanation_hi": "पंचायत (अनुसूचित क्षेत्रों में विस्तार) अधिनियम, 1996 पांचवीं अनुसूची के प्रावधानों को अनुसूचित क्षेत्रों में पंचायतों तक विस्तारित करता है, स्थानीय स्वशासन में आदिवासी समुदायों की भागीदारी के लिए प्रावधान करता है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the purpose of the Tribal Advisory Council in the context of the Fifth Schedule?",
"question_hi": "पांचवीं अनुसूची के संदर्भ में जनजातीय सलाहकार परिषद का उद्देश्य क्या है?",
"A_en": "To advise the governor on matters related to tribal welfare and development", "A_hi": "जनजातीय कल्याण और विकास से संबंधित मामलों पर राज्यपाल को सलाह देना",
"B_en": "To make laws for the governance of scheduled areas", "B_hi": "अनुसूचित क्षेत्रों के शासन के लिए कानून बनाना",
"C_en": "To allocate funds for tribal development projects", "C_hi": "जनजातीय विकास परियोजनाओं के लिए धन आवंटित करना",
"D_en": "To investigate human rights violations in scheduled areas", "D_hi": "अनुसूचित क्षेत्रों में मानवाधिकार उल्लंघन की जांच करना",
"answer": "A",
"explanation_en": "The Tribal Advisory Council is a constitutional body that advises the governor on matters related to the welfare and development of scheduled tribes, as provided for in the Fifth Schedule.",
"explanation_hi": "जनजातीय सलाहकार परिषद एक संवैधानिक निकाय है जो पांचवीं अनुसूची में प्रदान किए गए अनुसूचित जनजातियों के कल्याण और विकास से संबंधित मामलों पर राज्यपाल को सलाह देता है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following is a consequence of the Fifth Schedule?",
"question_hi": "निम्नलिखित में से कौन पांचवीं अनुसूची का परिणाम है?",
"A_en": "Increased autonomy for tribal communities", "A_hi": "आदिवासी समुदायों के लिए बढ़ी हुई स्वायत्तता",
"B_en": "Improved economic development in scheduled areas", "B_hi": "अनुसूचित क्षेत्रों में सुधरी हुई आर्थिक विकास",
"C_en": "Enhanced protection of tribal rights and interests", "C_hi": "आदिवासी अधिकारों और हितों की बढ़ी हुई रक्षा",
"D_en": "Reduced participation of tribal communities in governance", "D_hi": "शासन में आदिवासी समुदायों की कम भागीदारी",
"answer": "C",
"explanation_en": "The Fifth Schedule provides for the administration and control of scheduled areas and scheduled tribes, which enhances the protection of tribal rights and interests.",
"explanation_hi": "पांचवीं अनुसूची अनुसूचित क्षेत्रों और अनुसूचित जनजातियों के प्रशासन और नियंत्रण के लिए प्रावधान करती है, जो आदिवासी अधिकारों और हितों की रक्षा को बढ़ाता है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the significance of the Fifth Schedule in the context of Indian federalism?",
"question_hi": "भारतीय संघवाद के संदर्भ में पांचवीं अनुसूची का क्या महत्व है?",
"A_en": "It provides for the decentralization of power to tribal communities", "A_hi": "यह आदिवासी समुदायों को शक्ति के विकेंद्रीकरण के लिए प्रावधान करता है",
"B_en": "It ensures the protection of tribal rights and interests", "B_hi": "यह आदिवासी अधिकारों और हितों की रक्षा सुनिश्चित करता है",
"C_en": "It promotes the economic development of scheduled areas", "C_hi": "यह अनुसूचित क्षेत्रों के आर्थिक विकास को बढ़ावा देता है",
"D_en": "It facilitates the integration of tribal communities into the mainstream", "D_hi": "यह मुख्यधारा में आदिवासी समुदायों के एकीकरण को सुविधाजनक बनाता है",
"answer": "B",
"explanation_en": "The Fifth Schedule is significant in the context of Indian federalism because it ensures the protection of tribal rights and interests, which is essential for maintaining the unity and integrity of the country.",
"explanation_hi": "भारतीय संघवाद के संदर्भ में पांचवीं अनुसूची महत्वपूर्ण है क्योंकि यह आदिवासी अधिकारों और हितों की रक्षा सुनिश्चित करती है, जो देश की एकता और अखंडता को बनाए रखने के लिए आवश्यक है।"
}
]