[
  {
    "subject": "Indian Polity",
    "topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
    "question_en": "What does the Fifth Schedule of the Constitution primarily deal with?",
    "question_hi": "संविधान के पाँचवे अनुसूची में मुख्यतः किस विषय पर चर्चा की गई है?",
    "A_en": "List of Scheduled Castes",
    "A_hi": "सूचीबद्ध जातियों की सूची",
    "B_en": "List of Scheduled Tribes",
    "B_hi": "सूचीबद्ध जनजातियों की सूची",
    "C_en": "List of Scheduled Areas",
    "C_hi": "सूचीबद्ध क्षेत्रों की सूची",
    "D_en": "Both B and C",
    "D_hi": "B और C दोनों",
    "answer": "D",
    "explanation_en": "The Fifth Schedule contains the lists of Scheduled Tribes and Scheduled Areas along with provisions for their administration.",
    "explanation_hi": "पाँचवी अनुसूची में सूचीबद्ध जनजातियों और सूचीबद्ध क्षेत्रों की सूचियाँ तथा उनके प्रशासन के प्रावधान शामिल हैं।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
    "question_en": "Which Article of the Constitution contains the Fifth Schedule?",
    "question_hi": "किस अनुच्छेद में पाँचवी अनुसूची शामिल है?",
    "A_en": "Article 244",
    "A_hi": "अनुच्छेद 244",
    "B_en": "Article 244A",
    "B_hi": "अनुच्छेद 244A",
    "C_en": "Article 245",
    "C_hi": "अनुच्छेद 245",
    "D_en": "Article 246",
    "D_hi": "अनुच्छेद 246",
    "answer": "A",
    "explanation_en": "The Fifth Schedule is incorporated under Article 244, which deals with the administration of Scheduled Areas and Tribes.",
    "explanation_hi": "पाँचवी अनुसूची अनुच्छेद 244 के अंतर्गत है, जो सूचीबद्ध क्षेत्रों और जनजातियों के प्रशासन से संबंधित है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
    "question_en": "Which of the following is NOT included in the Fifth Schedule?",
    "question_hi": "निम्नलिखित में से कौन-सा पाँचवी अनुसूची में शामिल नहीं है?",
    "A_en": "List of Scheduled Castes",
    "A_hi": "सूचीबद्ध जातियों की सूची",
    "B_en": "List of Scheduled Tribes",
    "B_hi": "सूचीबद्ध जनजातियों की सूची",
    "C_en": "List of Scheduled Areas",
    "C_hi": "सूचीबद्ध क्षेत्रों की सूची",
    "D_en": "List of Scheduled Cities",
    "D_hi": "सूचीबद्ध शहरों की सूची",
    "answer": "D",
    "explanation_en": "The Fifth Schedule does not contain a list of scheduled cities; it deals only with tribes and areas.",
    "explanation_hi": "पाँचवी अनुसूची में सूचीबद्ध शहरों की सूची नहीं है; यह केवल जनजातियों और क्षेत्रों से संबंधित है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
    "question_en": "The Fifth Schedule can be amended by Parliament through:",
    "question_hi": "पाँचवी अनुसूची को संसद द्वारा किस प्रकार संशोधित किया जा सकता है?",
    "A_en": "Simple majority",
    "A_hi": "सरल बहुमत",
    "B_en": "Two‑thirds majority",
    "B_hi": "दो-तिहाई बहुमत",
    "C_en": "Special majority",
    "C_hi": "विशेष बहुमत",
    "D_en": "Any of the above",
    "D_hi": "उपरोक्त सभी",
    "answer": "C",
    "explanation_en": "Amending any part of the Constitution, including the Fifth Schedule, requires a special majority under Article 368.",
    "explanation_hi": "संविधान के किसी भी भाग, जिसमें पाँचवी अनुसूची भी शामिल है, को संशोधित करने के लिए अनुच्छेद 368 के तहत विशेष बहुमत की आवश्यकता होती है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
    "question_en": "Who is primarily responsible for the administration of Scheduled Areas as per the Fifth Schedule?",
    "question_hi": "पाँचवी अनुसूची के अनुसार सूचीबद्ध क्षेत्रों के प्रशासन के लिए मुख्यतः कौन जिम्मेदार है?",
    "A_en": "Governor of the State",
    "A_hi": "राज्य के गवर्नर",
    "B_en": "Chief Minister of the State",
    "B_hi": "राज्य के मुख्यमंत्री",
    "C_en": "President of India",
    "C_hi": "भारत के राष्ट्रपति",
    "D_en": "Governor of the Union Territory",
    "D_hi": "संघटक के गवर्नर",
    "answer": "A",
    "explanation_en": "The Governor of the State has the power to administer Scheduled Areas as per provisions of the Fifth Schedule.",
    "explanation_hi": "पाँचवी अनुसूची के प्रावधानों के अनुसार राज्य के गवर्नर को सूचीबद्ध क्षेत्रों का प्रशासन करने का अधिकार है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
    "question_en": "Which of the following is a feature of the Fifth Schedule?",
    "question_hi": "निम्नलिखित में से कौन-सा पाँचवी अनुसूची का एक विशेषता है?",
    "A_en": "Reservation of seats in local bodies for Scheduled Tribes",
    "A_hi": "सूचीबद्ध जनजातियों के लिए स्थानीय निकायों में सीटों का आरक्षण",
    "B_en": "Reservation of seats in Parliament for Scheduled Castes",
    "B_hi": "सूचीबद्ध जातियों के लिए संसद में सीटों का आरक्षण",
    "C_en": "Reservation of seats in Legislative Assembly for Scheduled Tribes",
    "C_hi": "सूचीबद्ध जनजातियों के लिए विधान सभा में सीटों का आरक्षण",
    "D_en": "Reservation of seats in judiciary for Scheduled Tribes",
    "D_hi": "सूचीबद्ध जनजातियों के लिए न्यायपालिका में सीटों का आरक्षण",
    "answer": "A",
    "explanation_en": "The Fifth Schedule provides for reservation of seats in local bodies for Scheduled Tribes.",
    "explanation_hi": "पाँचवी अनुसूची में सूचीबद्ध जनजातियों के लिए स्थानीय निकायों में सीटों के आरक्षण का प्रावधान है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
    "question_en": "Which of the following is true regarding the list of Scheduled Tribes under the Fifth Schedule?",
    "question_hi": "पाँचवी अनुसूची के तहत सूचीबद्ध जनजातियों की सूची के बारे में कौन-सा कथन सही है?",
    "A_en": "It can be amended by Parliament without state consent",
    "A_hi": "इसे संसद द्वारा राज्य की सहमति के बिना संशोधित किया जा सकता है",
    "B_en": "It can be amended only by the President",
    "B_hi": "इसे केवल राष्ट्रपति द्वारा संशोधित किया जा सकता है",
    "C_en": "It can be amended by Parliament with the consent of the concerned state",
    "C_hi": "इसे संसद द्वारा संबंधित राज्य की सहमति से संशोधित किया जा सकता है",
    "D_en": "It is fixed and cannot be amended",
    "D_hi": "यह स्थिर है और संशोधित नहीं किया जा सकता",
    "answer": "C",
    "explanation_en": "Amendments to the list of Scheduled Tribes require Parliament’s consent along with that of the concerned state as per the Constitution.",
    "explanation_hi": "संविधान के अनुसार, सूचीबद्ध जनजातियों की सूची में संशोधन के लिए संसद और संबंधित राज्य की सहमति दोनों आवश्यक हैं।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
    "question_en": "Under the Fifth Schedule, which body is empowered to make decisions regarding the welfare of Scheduled Tribes?",
    "question_hi": "पाँचवी अनुसूची के तहत कौन-सा निकाय सूचीबद्ध जनजातियों के कल्याण के निर्णय लेने के लिए सक्षम है?",
    "A_en": "State Legislature",
    "A_hi": "राज्य विधानमंडल",
    "B_en": "Tribal Advisory Board",
    "B_hi": "जनजातीय सलाहकार बोर्ड",
    "C_en": "Central Government",
    "C_hi": "केंद्रीय सरकार",
    "D_en": "All of the above",
    "D_hi": "उपरोक्त सभी",
    "answer": "B",
    "explanation_en": "The Tribal Advisory Board, constituted under the Fifth Schedule, advises on matters concerning Scheduled Tribes.",
    "explanation_hi": "पाँचवी अनुसूची के अंतर्गत गठित जनजातीय सलाहकार बोर्ड, सूचीबद्ध जनजातियों से संबंधित मामलों पर सलाह देता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
    "question_en": "Which of the following statements about the Fifth Schedule is correct?",
    "question_hi": "पाँचवी अनुसूची के बारे में कौन-सा कथन सही है?",
    "A_en": "It lists Scheduled Castes",
    "A_hi": "यह सूचीबद्ध जातियों की सूची देता है",
    "B_en": "It lists Scheduled Tribes",
    "B_hi": "यह सूचीबद्ध जनजातियों की सूची देता है",
    "C_en": "It provides for the appointment of a Chief Minister for Scheduled Areas",
    "C_hi": "यह सूचीबद्ध क्षेत्रों के लिए मुख्यमंत्री की नियुक्ति का प्रावधान देता है",
    "D_en": "Both B and C",
    "D_hi": "B और C दोनों",
    "answer": "D",
    "explanation_en": "The Fifth Schedule contains lists of Scheduled Tribes and Scheduled Areas and provides for local governance in those areas.",
    "explanation_hi": "पाँचवी अनुसूची में सूचीबद्ध जनजातियों और क्षेत्रों की सूचियाँ तथा उन क्षेत्रों में स्थानीय शासन के प्रावधान शामिल हैं।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
    "question_en": "Which body is specifically mentioned in the Fifth Schedule to administer Scheduled Areas?",
    "question_hi": "पाँचवी अनुसूची में सूचीबद्ध क्षेत्रों के प्रशासन के लिए विशेष रूप से कौन-सा निकाय उल्लेखित है?",
    "A_en": "Tribal Development Council",
    "A_hi": "जनजातीय विकास परिषद",
    "B_en": "Tribal Advisory Board",
    "B_hi": "जनजातीय सलाहकार बोर्ड",
    "C_en": "Tribal Council",
    "C_hi": "जनजातीय परिषद",
    "D_en": "Both B and C",
    "D_hi": "B और C दोनों",
    "answer": "B",
    "explanation_en": "The Fifth Schedule provides for the creation of a Tribal Advisory Board to oversee the administration of Scheduled Areas.",
    "explanation_hi": "पाँचवी अनुसूची के तहत सूचीबद्ध क्षेत्रों के प्रशासन की देखरेख के लिए जनजातीय सलाहकार बोर्ड की स्थापना का प्रावधान है।"
  }
]