[
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the purpose of the Fifth Schedule in the Indian Constitution?",
"question_hi": "भारतीय संविधान में पांचवें अनुसूची का उद्देश्य क्या है?",
"A_en": "To provide special powers to the President", "A_hi": "राष्ट्रपति को विशेष शक्तियां प्रदान करने के लिए",
"B_en": "To provide special protection to Scheduled Tribes", "B_hi": "अनुसूचित जनजातियों को विशेष संरक्षण प्रदान करने के लिए",
"C_en": "To provide special powers to the Governor", "C_hi": "राज्यपाल को विशेष शक्तियां प्रदान करने के लिए",
"D_en": "To provide special powers to the Parliament", "D_hi": "संसद को विशेष शक्तियां प्रदान करने के लिए",
"answer": "B",
"explanation_en": "The Fifth Schedule is intended to provide special protection to Scheduled Tribes and their lands.",
"explanation_hi": "पांचवें अनुसूची का उद्देश्य अनुसूचित जनजातियों और उनके भूमि को विशेष संरक्षण प्रदान करना है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following areas are covered under the Fifth Schedule?",
"question_hi": "पांचवें अनुसूची के तहत निम्नलिखित क्षेत्र शामिल हैं?",
"A_en": "Districts of Andhra Pradesh and Telangana", "A_hi": "अंड्रा प्रदेश और तेलंगाना के जिले",
"B_en": "Districts of Madhya Pradesh and Chhattisgarh", "B_hi": "मध्य प्रदेश और छत्तीसगढ़ के जिले",
"C_en": "Districts of Odisha and Jharkhand", "C_hi": "ओडिशा और झारखंड के जिले",
"D_en": "Districts of Assam, Meghalaya, Tripura, and Manipur", "D_hi": "असम, मेघालय, त्रिपुरा, और मणिपुर के जिले",
"answer": "D",
"explanation_en": "The districts of Assam, Meghalaya, Tripura, and Manipur are covered under the Fifth Schedule.",
"explanation_hi": "असम, मेघालय, त्रिपुरा, और मणिपुर के जिले पांचवें अनुसूची के तहत आते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the role of the Governor in relation to the Fifth Schedule?",
"question_hi": "पांचवें अनुसूची से संबंधित राज्यपाल की भूमिका क्या है?",
"A_en": "To implement the decisions of the Parliament", "A_hi": "संसद के निर्णयों को लागू करने के लिए",
"B_en": "To protect the interests of Scheduled Tribes", "B_hi": "अनुसूचित जनजातियों के हितों की रक्षा करने के लिए",
"C_en": "To provide guidance to the Tribes' councils", "C_hi": "जनजातियों की परिषदों को मार्गदर्शन प्रदान करने के लिए",
"D_en": "To coordinate with the Centre and State", "D_hi": "केंद्र और राज्य के साथ समन्वय करने के लिए",
"answer": "C",
"explanation_en": "The Governor provides guidance to the Tribes' councils under the Fifth Schedule.",
"explanation_hi": "राज्यपाल पांचवें अनुसूची के तहत जनजातियों की परिषदों को मार्गदर्शन प्रदान करते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following is a key feature of the Fifth Schedule?",
"question_hi": "पांचवें अनुसूची का एक महत्वपूर्ण विशेषता क्या है?",
"A_en": "It provides special rights to the Scheduled Tribes", "A_hi": "यह अनुसूचित जनजातियों को विशेष अधिकार प्रदान करता है",
"B_en": "It provides special powers to the Governor", "B_hi": "यह राज्यपाल को विशेष शक्तियां प्रदान करता है",
"C_en": "It provides special protection to the Scheduled Areas", "C_hi": "यह अनुसूचित क्षेत्रों को विशेष संरक्षण प्रदान करता है",
"D_en": "It provides special powers to the Parliament", "D_hi": "यह संसद को विशेष शक्तियां प्रदान करता है",
"answer": "C",
"explanation_en": "The Fifth Schedule provides special protection to the Scheduled Areas.",
"explanation_hi": "पांचवें अनुसूची अनुसूचित क्षेत्रों को विशेष संरक्षण प्रदान करता है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the significance of the Fifth Schedule in the context of Scheduled Tribes?",
"question_hi": "अनुसूचित जनजातियों के संदर्भ में पांचवें अनुसूची की महत्ता क्या है?",
"A_en": "It provides a framework for the administration of Scheduled Tribes", "A_hi": "यह अनुसूचित जनजातियों के प्रशासन के लिए एक ढांचा प्रदान करता है",
"B_en": "It provides a mechanism for the protection of Scheduled Tribes' rights", "B_hi": "यह अनुसूचित जनजातियों के अधिकारों की रक्षा के लिए एक प्रणाली प्रदान करता है",
"C_en": "It provides a framework for the development of Scheduled Tribes", "C_hi": "यह अनुसूचित जनजातियों के विकास के लिए एक ढांचा प्रदान करता है",
"D_en": "It provides a mechanism for the empowerment of Scheduled Tribes", "D_hi": "यह अनुसूचित जनजातियों को सशक्तिकरण के लिए एक प्रणाली प्रदान करता है",
"answer": "B",
"explanation_en": "The Fifth Schedule provides a mechanism for the protection of Scheduled Tribes' rights.",
"explanation_hi": "पांचवें अनुसूची अनुसूचित जनजातियों के अधिकारों की रक्षा के लिए एक प्रणाली प्रदान करता है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following is a key objective of the Fifth Schedule?",
"question_hi": "पांचवें अनुसूची का एक महत्वपूर्ण मकसद क्या है?",
"A_en": "To promote the development of Scheduled Tribes", "A_hi": "अनुसूचित जनजातियों के विकास को प्रोत्साहित करना",
"B_en": "To protect the rights of Scheduled Tribes", "B_hi": "अनुसूचित जनजातियों के अधिकारों की रक्षा करना",
"C_en": "To provide special powers to the Governor", "C_hi": "राज्यपाल को विशेष शक्तियां प्रदान करना",
"D_en": "To coordinate with the Centre and State", "D_hi": "केंद्र और राज्य के साथ समन्वय करना",
"answer": "B",
"explanation_en": "The key objective of the Fifth Schedule is to protect the rights of Scheduled Tribes.",
"explanation_hi": "पांचवें अनुसूची का मुख्य उद्देश्य अनुसूचित जनजातियों के अधिकारों की रक्षा करना है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the role of the Centre in relation to the Fifth Schedule?",
"question_hi": "पांचवें अनुसूची से संबंधित केंद्र की भूमिका क्या है?",
"A_en": "To implement the decisions of the Governor", "A_hi": "राज्यपाल के निर्णयों को लागू करने के लिए",
"B_en": "To provide guidance to the Tribes' councils", "B_hi": "जनजातियों की परिषदों को मार्गदर्शन प्रदान करने के लिए",
"C_en": "To coordinate with the State", "C_hi": "राज्य के साथ समन्वय करने के लिए",
"D_en": "To provide special powers to the Governor", "D_hi": "राज्यपाल को विशेष शक्तियां प्रदान करने के लिए",
"answer": "C",
"explanation_en": "The Centre coordinates with the State in relation to the Fifth Schedule.",
"explanation_hi": "केंद्र पांचवें अनुसूची से संबंधित राज्य के साथ समन्वय करता है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following is a key feature of the Scheduled Areas?",
"question_hi": "अनुसूचित क्षेत्रों की एक महत्वपूर्ण विशेषता क्या है?",
"A_en": "They have special powers to the Governor", "A_hi": "वे राज्यपाल को विशेष शक्तियां प्रदान करते हैं",
"B_en": "They have special protection to the Scheduled Tribes", "B_hi": "वे अनुसूचित जनजातियों को विशेष संरक्षण प्रदान करते हैं",
"C_en": "They have special development plans", "C_hi": "वे विशेष विकास योजनाएं हैं",
"D_en": "They have special powers to the Parliament", "D_hi": "वे संसद को विशेष शक्तियां प्रदान करते हैं",
"answer": "B",
"explanation_en": "The Scheduled Areas have special protection to the Scheduled Tribes.",
"explanation_hi": "अनुसूचित क्षेत्रों में अनुसूचित जनजातियों को विशेष संरक्षण प्रदान किया जाता है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the significance of the Tribes' councils in the context of the Fifth Schedule?",
"question_hi": "पांचवें अनुसूची के संदर्भ में जनजातियों की परिषदों की महत्ता क्या है?",
"A_en": "They provide a framework for the administration of Scheduled Tribes", "A_hi": "वे अनुसूचित जनजातियों के प्रशासन के लिए एक ढांचा प्रदान करते हैं",
"B_en": "They provide a mechanism for the protection of Scheduled Tribes' rights", "B_hi": "वे अनुसूचित जनजातियों के अधिकारों की रक्षा के लिए एक प्रणाली प्रदान करते हैं",
"C_en": "They provide a framework for the development of Scheduled Tribes", "C_hi": "वे अनुसूचित जनजातियों के विकास के लिए एक ढांचा प्रदान करते हैं",
"D_en": "They provide a mechanism for the empowerment of Scheduled Tribes", "D_hi": "वे अनुसूचित जनजातियों को सशक्तिकरण के लिए एक प्रणाली प्रदान करते हैं",
"answer": "B",
"explanation_en": "The Tribes' councils provide a mechanism for the protection of Scheduled Tribes' rights.",
"explanation_hi": "जनजातियों की परिषदें अनुसूचित जनजातियों के अधिकारों की रक्षा के लिए एक प्रणाली प्रदान करती हैं।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following is a key benefit of the Fifth Schedule?",
"question_hi": "पांचवें अनुसूची का एक महत्वपूर्ण लाभ क्या है?",
"A_en": "It provides special powers to the Governor", "A_hi": "यह राज्यपाल को विशेष शक्तियां प्रदान करता है",
"B_en": "It provides special protection to the Scheduled Tribes", "B_hi": "यह अनुसूचित जनजातियों को विशेष संरक्षण प्रदान करता है",
"C_en": "It provides special development plans", "C_hi": "यह विशेष विकास योजनाएं प्रदान करता है",
"D_en": "It provides a mechanism for the empowerment of Scheduled Tribes", "D_hi": "यह अनुसूचित जनजातियों को सशक्तिकरण के लिए एक प्रणाली प्रदान करता है",
"answer": "B",
"explanation_en": "The Fifth Schedule provides special protection to the Scheduled Tribes.",
"explanation_hi": "पांचवें अनुसूची अनुसूचित जनजातियों को विशेष संरक्षण प्रदान करता है।"
}