[
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the purpose of the Fifth Schedule in the Indian Constitution?",
"question_hi": "भारतीय संविधान में पांचवें अनुसूची का उद्देश्य क्या है?",
"A_en": "To provide special rights to scheduled tribes", "A_hi": "तलित जनजातियों को विशेष अधिकार प्रदान करने के लिए",
"B_en": "To provide special rights to scheduled areas", "B_hi": "तलित क्षेत्रों को विशेष अधिकार प्रदान करने के लिए",
"C_en": "To provide special rights to scheduled castes", "C_hi": "तलित जातियों को विशेष अधिकार प्रदान करने के लिए",
"D_en": "To provide special rights to scheduled tribes in scheduled areas", "D_hi": "तलित क्षेत्रों में तलित जनजातियों को विशेष अधिकार प्रदान करने के लिए",
"answer": "D",
"explanation_en": "The Fifth Schedule provides special rights to scheduled tribes in scheduled areas, which includes provisions for their administration, welfare and advancement.",
"explanation_hi": "पांचवें अनुसूची के तहत तलित क्षेत्रों में तलित जनजातियों को विशेष अधिकार प्रदान किए जाते हैं, जिसमें उनके प्रशासन, कल्याण और उन्नति के प्रबंधन के प्रावधान शामिल होते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following is an example of a scheduled area?",
"question_hi": "निम्नलिखित में से कौन सा एक तलित क्षेत्र का उदाहरण है?",
"A_en": "A district in the state of Maharashtra", "A_hi": "महाराष्ट्र राज्य में एक जिला",
"B_en": "The Andaman and Nicobar Islands", "B_hi": "अंडमान और निकोबार द्वीप समूह",
"C_en": "A tribal reserve in the state of Odisha", "C_hi": "ओडिशा राज्य में एक जनजाति आरक्षित क्षेत्र",
"D_en": "The Himalayan region of Jammu and Kashmir", "D_hi": "जम्मू और कश्मीर के हिमालयी क्षेत्र",
"answer": "C",
"explanation_en": "Scheduled areas are designated by the state government to provide special rights to the tribes living there.",
"explanation_hi": "तलित क्षेत्र राज्य सरकार द्वारा निर्धारित किए जाते हैं ताकि वहां रहने वाली जनजातियों को विशेष अधिकार प्रदान किए जा सकें।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the role of the Governor in the administration of scheduled areas?",
"question_hi": "तलित क्षेत्रों के प्रशासन में राज्यपाल की भूमिका क्या है?",
"A_en": "To provide special powers to the state government", "A_hi": "राज्य सरकार को विशेष शक्तियां प्रदान करने के लिए",
"B_en": "To ensure the welfare and advancement of the tribes", "B_hi": "जनजातियों के कल्याण और उन्नति की गारंटी देने के लिए",
"C_en": "To appoint the collector as the chief administrator", "C_hi": "collector को मुख्य प्रशासक के रूप में नियुक्त करने के लिए",
"D_en": "To implement the Fifth Schedule in the state", "D_hi": "पांचवें अनुसूची को राज्य में लागू करने के लिए",
"answer": "D",
"explanation_en": "The Governor is responsible for implementing the provisions of the Fifth Schedule in the state, which includes provisions for the administration, welfare and advancement of the tribes.",
"explanation_hi": "राज्यपाल को राज्य में पांचवें अनुसूची के प्रावधानों का पालन करना होता है, जिसमें जनजातियों के प्रशासन, कल्याण और उन्नति के प्रबंधन के प्रावधान शामिल होते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following is a provision of the Fifth Schedule?",
"question_hi": "निम्नलिखित में से कौन सा पांचवें अनुसूची के प्रावधानों का हिस्सा है?",
"A_en": "To provide special rights to scheduled castes", "A_hi": "तलित जातियों को विशेष अधिकार प्रदान करने के लिए",
"B_en": "To provide special rights to scheduled areas", "B_hi": "तलित क्षेत्रों को विशेष अधिकार प्रदान करने के लिए",
"C_en": "To provide special rights to scheduled tribes in scheduled areas", "C_hi": "तलित क्षेत्रों में तलित जनजातियों को विशेष अधिकार प्रदान करने के लिए",
"D_en": "To provide special rights to scheduled tribes in non-scheduled areas", "D_hi": "अतलित क्षेत्रों में तलित जनजातियों को विशेष अधिकार प्रदान करने के लिए",
"answer": "C",
"explanation_en": "The Fifth Schedule provides special rights to scheduled tribes in scheduled areas, which includes provisions for their administration, welfare and advancement.",
"explanation_hi": "पांचवें अनुसूची के तहत तलित क्षेत्रों में तलित जनजातियों को विशेष अधिकार प्रदान किए जाते हैं, जिसमें उनके प्रशासन, कल्याण और उन्नति के प्रबंधन के प्रावधान शामिल होते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Who is the chief administrator of a scheduled area?",
"question_hi": "तलित क्षेत्र का मुख्य प्रशासक कौन होता है?",
"A_en": "The Collector", "A_hi": "कलेक्टर",
"B_en": "The District Magistrate", "B_hi": "जिला मजिस्ट्रेट",
"C_en": "The Superintendent of Police", "C_hi": "सुपरिटेंडेंट ऑफ पुलिस",
"D_en": "The Tribal Advisor", "D_hi": "जनजाति सलाहकार",
"answer": "B",
"explanation_en": "The District Magistrate is the chief administrator of a scheduled area, responsible for implementing the provisions of the Fifth Schedule.",
"explanation_hi": "जिला मजिस्ट्रेट एक तलित क्षेत्र का मुख्य प्रशासक होता है, जिसका दायित्व पांचवें अनुसूची के प्रावधानों को लागू करना होता है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the significance of the Fifth Schedule in the Indian Constitution?",
"question_hi": "भारतीय संविधान में पांचवें अनुसूची का महत्व क्या है?",
"A_en": "To provide special rights to scheduled castes", "A_hi": "तलित जातियों को विशेष अधिकार प्रदान करने के लिए",
"B_en": "To provide special rights to scheduled areas", "B_hi": "तलित क्षेत्रों को विशेष अधिकार प्रदान करने के लिए",
"C_en": "To provide special rights to scheduled tribes in scheduled areas", "C_hi": "तलित क्षेत्रों में तलित जनजातियों को विशेष अधिकार प्रदान करने के लिए",
"D_en": "To protect the rights of indigenous peoples", "D_hi": "आदिवासी लोगों के अधिकारों की रक्षा के लिए",
"answer": "D",
"explanation_en": "The Fifth Schedule is significant as it provides special rights to scheduled tribes in scheduled areas, which includes provisions for their administration, welfare and advancement.",
"explanation_hi": "पांचवें अनुसूची का महत्व है कि यह तलित क्षेत्रों में तलित जनजातियों को विशेष अधिकार प्रदान करता है, जिसमें उनके प्रशासन, कल्याण और उन्नति के प्रबंधन के प्रावधान शामिल होते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Who is responsible for implementing the provisions of the Fifth Schedule?",
"question_hi": "पांचवें अनुसूची के प्रावधानों को लागू करने के लिए कौन जिम्मेदार है?",
"A_en": "The State Government", "A_hi": "राज्य सरकार",
"B_en": "The Central Government", "B_hi": "केंद्र सरकार",
"C_en": "The Governor", "C_hi": "राज्यपाल",
"D_en": "The Tribal Administration", "D_hi": "जनजाति प्रशासन",
"answer": "C",
"explanation_en": "The Governor is responsible for implementing the provisions of the Fifth Schedule, which includes provisions for the administration, welfare and advancement of the tribes.",
"explanation_hi": "राज्यपाल पांचवें अनुसूची के प्रावधानों को लागू करने के लिए जिम्मेदार होते हैं, जिसमें जनजातियों के प्रशासन, कल्याण और उन्नति के प्रबंधन के प्रावधान शामिल होते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "What is the purpose of the Tribal Advisory Council?",
"question_hi": "जनजाति सलाहकार परिषद का उद्देश्य क्या है?",
"A_en": "To advise the Governor on tribal welfare", "A_hi": "जनजाति कल्याण पर राज्यपाल को विशेषज्ञ सलाह देने के लिए",
"B_en": "To advise the State Government on tribal administration", "B_hi": "जनजाति प्रशासन पर राज्य सरकार को विशेषज्ञ सलाह देने के लिए",
"C_en": "To advise the Central Government on tribal welfare", "C_hi": "जनजाति कल्याण पर केंद्र सरकार को विशेषज्ञ सलाह देने के लिए",
"D_en": "To provide medical aid to the tribes", "D_hi": "जनजातियों को चिकित्सा सहायता प्रदान करने के लिए",
"answer": "A",
"explanation_en": "The Tribal Advisory Council advises the Governor on tribal welfare, which includes provisions for the administration, welfare and advancement of the tribes.",
"explanation_hi": "जनजाति सलाहकार परिषद राज्यपाल को जनजाति कल्याण पर विशेषज्ञ सलाह देती है, जिसमें जनजातियों के प्रशासन, कल्याण और उन्नति के प्रबंधन के प्रावधान शामिल होते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following is a provision of the Sixth Schedule?",
"question_hi": "निम्नलिखित में से कौन सा छठे अनुसूची के प्रावधानों का हिस्सा है?",
"A_en": "To provide special rights to scheduled castes", "A_hi": "तलित जातियों को विशेष अधिकार प्रदान करने के लिए",
"B_en": "To provide special rights to scheduled areas", "B_hi": "तलित क्षेत्रों को विशेष अधिकार प्रदान करने के लिए",
"C_en": "To provide special rights to scheduled tribes in scheduled areas", "C_hi": "तलित क्षेत्रों में तलित जनजातियों को विशेष अधिकार प्रदान करने के लिए",
"D_en": "To provide special rights to autonomous districts", "D_hi": "स्वायत्त जिलों को विशेष अधिकार प्रदान करने के लिए",
"answer": "D",
"explanation_en": "The Sixth Schedule provides special rights to autonomous districts, which includes provisions for their administration, welfare and advancement.",
"explanation_hi": "छठे अनुसूची के तहत स्वायत्त जिलों को विशेष अधिकार प्रदान किए जाते हैं, जिसमें उनके प्रशासन, कल्याण और उन्नति के प्रबंधन के प्रावधान शामिल होते हैं।"
}
]