[
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Under which paragraph of the Fifth Schedule is the power to declare an area as a Scheduled Area vested in the President?",
"question_hi": "पंचम अनुसूची के किस अनुच्छेद के अंतर्गत राष्ट्रपति को कोई क्षेत्र अनुसूचित क्षेत्र घोषित करने की शक्ति प्राप्त है?",
"A_en": "Para 3", "A_hi": "पैरा 3",
"B_en": "Para 6", "B_hi": "पैरा 6",
"C_en": "Para 7", "C_hi": "पैरा 7",
"D_en": "Para 10", "D_hi": "पैरा 10",
"answer": "B",
"explanation_en": "Paragraph 6 of the Fifth Schedule empowers the President to declare any area as a Scheduled Area or to alter, increase, decrease or rescind such notification.",
"explanation_hi": "पंचम अनुसूची का पैरा 6 राष्ट्रपति को किसी क्षेत्र को अनुसूचित क्षेत्र घोषित करने या ऐसी अधिसूचना में संशोधन, वृद्धि, कमी या रद्द करने की शक्ति देता है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Who chairs the Tribes Advisory Council (TAC) in a Fifth Schedule State?",
"question_hi": "पंचम अनुसूची राज्य में जनजाति सलाहकार परिषद (टीएसी) की अध्यक्षता कौन करता है?",
"A_en": "Chief Minister", "A_hi": "मुख्यमंत्री",
"B_en": "Governor", "B_hi": "राज्यपाल",
"C_en": "Minister for Tribal Welfare", "B_hi": "जनजाति कल्याण मंत्री",
"D_en": "Chief Secretary", "D_hi": "मुख्य सचिव",
"answer": "A",
"explanation_en": "As per Para 4 of the Fifth Schedule, the Tribes Advisory Council is to be chaired by the Chief Minister of the state.",
"explanation_hi": "पंचम अनुसूची के पैरा 4 के अनुसार जनजाति सलाहकार परिषद की अध्यक्षता राज्य के मुख्यमंत्री द्वारा की जाती है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following states is NOT covered under the Fifth Schedule?",
"question_hi": "निम्नलिखित में से कौन-सा राज्य पंचम अनुसूची के अंतर्गत नहीं आता?",
"A_en": "Jharkhand", "A_hi": "झारखंड",
"B_en": "Chhattisgarh", "B_hi": "छत्तीसगढ़",
"C_en": "Rajasthan", "C_hi": "राजस्थान",
"D_en": "Kerala", "D_hi": "केरल",
"answer": "D",
"explanation_en": "Kerala does not have any Scheduled Areas and hence is not covered under the Fifth Schedule.",
"explanation_hi": "केरल में कोई अनुसूचित क्षेत्र नहीं है, इसलिए यह पंचम अनुसूची के अंतर्गत नहीं आता।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "The Fifth Schedule gives which of the following powers to the Governor of a Scheduled Area?",
"question_hi": "पंचम अनुसूची अनुसूचित क्षेत्र के राज्यपाल को निम्नलिखित में से कौन-सी शक्ति देती है?",
"A_en": "Power to promulgate ordinances", "A_hi": "अध्यादेश जारी करने की शक्ति",
"B_en": "Power to disqualify MLAs", "B_hi": "विधायकों को अयोग्य घोषित करने की शक्ति",
"C_en": "Power to make regulations for peace and good government", "C_hi": "शांति और सुशासन के लिए विनियम बनाने की शक्ति",
"D_en": "Power to dissolve state legislature", "D_hi": "राज्य विधानमंडल को भंग करने की शक्ति",
"answer": "C",
"explanation_en": "Para 5 of the Fifth Schedule empowers the Governor to make regulations for the peace and good government of Scheduled Areas after consulting the TAC.",
"explanation_hi": "पंचम अनुसूची का पैरा 5 राज्यपाल को टीएसी से परामर्श के बाद अनुसूचित क्षेत्रों की शांति और सुशासन के लिए विनियम बनाने की शक्ति देता है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which constitutional amendment inserted the Fifth Schedule in the Constitution of India?",
"question_hi": "भारत के संविधान में पंचम अनुसूची किस संविधान संशोधन द्वारा सम्मिलित की गई?",
"A_en": "7th Amendment", "A_hi": "7वां संशोधन",
"B_en": "Constitution originally contained it", "B_hi": "संविधान में मूल रूप से ही थी",
"C_en": "24th Amendment", "C_hi": "24वां संशोधन",
"D_en": "42nd Amendment", "D_hi": "42वां संशोधन",
"answer": "B",
"explanation_en": "The Fifth Schedule was part of the Constitution as originally adopted in 1950 and was not inserted by any later amendment.",
"explanation_hi": "पंचम अनुसूची 1950 में मूल रूप से स्वीकार किए गए संविधान का भाग थी, इसे बाद में किसी संशोधन द्वारा सम्मिलित नहीं किया गया।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following reports is laid annually by the Governor before the state legislature under the Fifth Schedule?",
"question_hi": "निम्नलिखित में से कौन-सी रिपोर्ट राज्यपाल द्वारा पंचम अनुसूची के तहत वर्ष में एक बार राज्य विधानमंडल के समक्ष रखी जाती है?",
"A_en": "Finance Commission Report", "A_hi": "वित्त आयोग रिपोर्ट",
"B_en": "Tribes Advisory Council Report", "B_hi": "जनजाति सलाहकार परिषद रिपोर्ट",
"C_en": "Annual Report on Administration of Scheduled Areas", "C_hi": "अनुसूचित क्षेत्रों के प्रशासन पर वार्षिक रिपोर्ट",
"D_en": "CAG Report", "D_hi": "CAG रिपोर्ट",
"answer": "C",
"explanation_en": "Para 3 of the Fifth Schedule mandates the Governor to lay an annual report on the administration of Scheduled Areas before the state legislature.",
"explanation_hi": "पंचम अनुसूची का पैरा 3 राज्यपाल को अनुसूचित क्षेत्रों के प्रशासन पर वार्षिक रिपोर्ट राज्य विधानमंडल के समक्ष रखने को अनिवार्य करता है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which article of the Constitution deals with the Fifth Schedule?",
"question_hi": "संविधान का कौन-सा अनुच्छेद पंचम अनुसूची से संबंधित है?",
"A_en": "Article 244", "A_hi": "अनुच्छेद 244",
"B_en": "Article 275", "B_hi": "अनुच्छेद 275",
"C_en": "Article 370", "C_hi": "अनुच्छेद 370",
"D_en": "Article 243", "D_hi": "अनुच्छेद 243",
"answer": "A",
"explanation_en": "Article 244 provides for the administration of Scheduled Areas and Tribal Areas and refers to the Fifth and Sixth Schedules.",
"explanation_hi": "अनुच्छेद 244 अनुसूचित क्षेत्रों और जनजातीय क्षेत्रों के प्रशासन का प्रावधान करता है और पंचम तथा छठी अनुसूचियों का उल्लेख करता है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "The regulation-making power of the Governor under the Fifth Schedule is subject to the assent of which authority?",
"question_hi": "पंचम अनुसूची के तहत राज्यपाल की विनियम बनाने की शक्ति किस प्राधिकारी की स्वीकृति के अधीन है?",
"A_en": "State Cabinet", "A_hi": "राज्य मंत्रिमंडल",
"B_en": "President", "B_hi": "राष्ट्रपति",
"C_en": "Tribes Advisory Council only", "C_hi": "केवल जनजाति सलाहकार परिषद",
"D_en": "Parliament", "D_hi": "संसद",
"answer": "B",
"explanation_en": "Regulations made by the Governor under Para 5 require the assent of the President to become effective.",
"explanation_hi": "पैरा 5 के तहत राज्यपाल द्वारा बनाए गए विनियम प्रभावी होने के लिए राष्ट्रपति की स्वीकृति की आवश्यकता होती है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "Which of the following is a criterion for declaring an area as a Scheduled Area?",
"question_hi": "निम्नलिखित में से कौन-सा मानदंड किसी क्षेत्र को अनुसूचित क्षेत्र घोषित करने का है?",
"A_en": "High density of Scheduled Caste population", "A_hi": "अनुसूचित जाति जनसंख्या की उच्च घनत्व",
"B_en": "Preponderance of tribal population", "B_hi": "जनजातीय जनसंख्या की प्रभुत्व",
"C_en": "Urbanization level below 30%", "C_hi": "शहरीकरण स्तर 30% से कम",
"D_en": "Literacy rate below 50%", "D_hi": "साक्षरता दर 50% से कम",
"answer": "B",
"explanation_en": "The primary criterion is the preponderance of tribal population and their socio-economic backwardness.",
"explanation_hi": "प्राथमिक मानदंड जनजातीय जनसंख्या की प्रभुत्व और उनकी सामाजिक-आर्थिक पिछड़ापन है।"
},
{
"subject": "Indian Polity",
"topic": "Anusuchit Kshetra aur Janjatiya Prashasan (Fifth Schedule)",
"question_en": "The Fifth Schedule aims to protect the interests of which groups?",
"question_hi": "पंचम अनुसूची किन समूहों के हितों की रक्षा करने का उद्देश्य रखती है?",
"A_en": "Scheduled Castes only", "A_hi": "केवल अनुसूचित जाति",
"B_en": "Scheduled Tribes only", "B_hi": "केवल अनुसूचित जनजाति",
"C_en": "Both Scheduled Castes and Scheduled Tribes", "C_hi": "अनुसूचित जाति और अनुसूचित जनजाति दोनों",
"D_en": "Other Backward Classes", "D_hi": "अन्य पिछड़ा वर्ग",
"answer": "B",
"explanation_en": "The Fifth Schedule specifically deals with the administration and welfare of Scheduled Tribes in Scheduled Areas.",
"explanation_hi": "पंचम अनुसूचि विशेष रूप से अनुसूचित क्षेत्रों में अनुसूचित जनजातियों के प्रशासन और कल्याण से संबंधित है।"
}
]