[
{
"subject": "Indian Polity",
"topic": "Bhartiya Samvidhan: Prakriti, Prastavana aur Maulik Adhikar",
"question_en": "What is the Preamble of the Indian Constitution?",
"question_hi": "भारतीय संविधान का प्रस्तावना क्या है?",
"A_en": "It mentions the fundamental rights and duties of citizens.",
"A_hi": "यह नागरिकों के मौलिक अधिकार और कर्त्तव्यों का उल्लेख करता है।",
"B_en": "It contains the philosophy of the Indian Constitution.",
"B_hi": "यह भारतीय संविधान की दर्शन को संग्रहीत करता है।",
"C_en": "It lists the powers and functions of the government.",
"C_hi": "यह सरकार की शक्तियों और कार्यों की सूची बनाता है।",
"D_en": "It is a brief introduction to the Indian Constitution.",
"D_hi": "यह भारतीय संविधान का एक अल्पविराम है।",
"answer": "B",
"explanation_en": "The Preamble of the Indian Constitution contains the philosophy and objectives of the Constitution.",
"explanation_hi": "भारतीय संविधान का प्रस्तावना संविधान की दर्शन और उद्देश्यों को संग्रहीत करता है।"
},
{
"subject": "Indian Polity",
"topic": "Bhartiya Samvidhan: Prakriti, Prastavana aur Maulik Adhikar",
"question_en": "What are the basic features of the Indian Constitution?",
"question_hi": "भारतीय संविधान के मूल विशेषता क्या हैं?",
"A_en": "Separation of powers and federal structure.",
"A_hi": "शक्तियों का विभाजन और संघीय ढांचा।",
"B_en": "Unitary structure and parliamentary system.",
"B_hi": "संघीय ढांचा और संसदीय प्रणाली।",
"C_en": "Directive principles of state policy and fundamental rights.",
"C_hi": "राज्य नीति के निर्देशात्मक सिद्धांत और मूलभूत अधिकार।",
"D_en": "All of the above.",
"D_hi": "सब कुछ ऊपर",
"answer": "D",
"explanation_en": "The Indian Constitution has several basic features, including separation of powers, federal structure, directive principles of state policy, and fundamental rights.",
"explanation_hi": "भारतीय संविधान में कई मूल विशेषताएं हैं, जिनमें शक्तियों का विभाजन, संघीय ढांचा, राज्य नीति के निर्देशात्मक सिद्धांत और मूलभूत अधिकार शामिल हैं।"
},
{
"subject": "Indian Polity",
"topic": "Bhartiya Samvidhan: Prakriti, Prastavana aur Maulik Adhikar",
"question_en": "What are the Fundamental Duties of citizens of India?",
"question_hi": "भारत के नागरिकों के मौलिक कर्त्तव्य क्या हैं?",
"A_en": "To vote in elections and pay taxes.",
"A_hi": "चुनावों में मतदान करना और कर देना।",
"B_en": "To respect the Constitution and maintain law and order.",
"B_hi": "संविधान का सम्मान करना और कानून और व्यवस्था बनाए रखना।",
"C_en": "To preserve the integrity of the nation and protect the environment.",
"C_hi": "राष्ट्र की एकता बनाए रखना और पर्यावरण की रक्षा।",
"D_en": "All of the above.",
"D_hi": "सब कुछ ऊपर",
"answer": "D",
"explanation_en": "The Fundamental Duties of citizens of India include respecting the Constitution, maintaining law and order, preserving the integrity of the nation, and protecting the environment.",
"explanation_hi": "भारत के नागरिकों के मौलिक कर्त्तव्यों में संविधान का सम्मान करना, कानून और व्यवस्था बनाए रखना, राष्ट्र की एकता बनाए रखना और पर्यावरण की रक्षा शामिल है।"
},
{
"subject": "Indian Polity",
"topic": "Bhartiya Samvidhan: Prakriti, Prastavana aur Maulik Adhikar",
"question_en": "What is the concept of 'Right to Life' in the Indian Constitution?",
"question_hi": "भारतीय संविधान में 'जीवन का अधिकार' का सिद्धांत क्या है?",
"A_en": "It means the right to live with dignity.",
"A_hi": "यह गरिमा से जीने का अधिकार है।",
"B_en": "It means the right to die.",
"B_hi": "यह मरने का अधिकार है।",
"C_en": "It means the right to freedom of speech and expression.",
"C_hi": "यह विचार व्यक्त करने और अभिव्यक्ति की स्वतंत्रता का अधिकार है।",
"D_en": "It means the right to live with security.",
"D_hi": "यह सुरक्षा के साथ जीने का अधिकार है।",
"answer": "A",
"explanation_en": "The concept of 'Right to Life' in the Indian Constitution means the right to live with dignity and security.",
"explanation_hi": "भारतीय संविधान में 'जीवन का अधिकार' का सिद्धांत गरिमा और सुरक्षा के साथ जीने का अधिकार है।"
},
{
"subject": "Indian Polity",
"topic": "Bhartiya Samvidhan: Prakriti, Prastavana aur Maulik Adhikar",
"question_en": "What is the concept of 'Right to Freedom' in the Indian Constitution?",
"question_hi": "भारतीय संविधान में 'आजादी का अधिकार' का सिद्धांत क्या है?",
"A_en": "It means the right to freedom of speech and expression.",
"A_hi": "यह विचार व्यक्त करने और अभिव्यक्ति की स्वतंत्रता का अधिकार है।",
"B_en": "It means the right to life and liberty.",
"B_hi": "यह जीवन और स्वतंत्रता का अधिकार है।",
"C_en": "It means the right to assemble and associate.",
"C_hi": "यह एकत्रित होने और संगठन का अधिकार है।",
"D_en": "It means the right to move freely throughout the territory of India.",
"D_hi": "यह भारत के क्षेत्र में स्वतंत्र रूप से चलने का अधिकार है।",
"answer": "D",
"explanation_en": "The concept of 'Right to Freedom' in the Indian Constitution means the right to move freely throughout the territory of India.",
"explanation_hi": "भारतीय संविधान में 'आजादी का अधिकार' का सिद्धांत भारत के क्षेत्र में स्वतंत्र रूप से चलने का अधिकार है।"
},
{
"subject": "Indian Polity",
"topic": "Bhartiya Samvidhan: Prakriti, Prastavana aur Maulik Adhikar",
"question_en": "What is the concept of 'Right to Equality' in the Indian Constitution?",
"question_hi": "भारतीय संविधान में 'समानता का अधिकार' का सिद्धांत क्या है?",
"A_en": "It means the right to be treated equally in the eyes of the law.",
"A_hi": "यह कानून की आंखों में समान रूप से व्यवहार का अधिकार है।",
"B_en": "It means the right to be treated differently under the law.",
"B_hi": "यह कानून के तहत अलग-अलग व्यवहार का अधिकार है।",
"C_en": "It means the right to freedom of speech and expression.",
"C_hi": "यह विचार व्यक्त करने और अभिव्यक्ति की स्वतंत्रता का अधिकार है।",
"D_en": "It means the right to life and liberty.",
"D_hi": "यह जीवन और स्वतंत्रता का अधिकार है।",
"answer": "A",
"explanation_en": "The concept of 'Right to Equality' in the Indian Constitution means the right to be treated equally in the eyes of the law.",
"explanation_hi": "भारतीय संविधान में 'समानता का अधिकार' का सिद्धांत कानून की आंखों में समान रूप से व्यवहार का अधिकार है।"
},
{
"subject": "Indian Polity",
"topic": "Bhartiya Samvidhan: Prakriti, Prastavana aur Maulik Adhikar",
"question_en": "What is the concept of 'Right to Freedom of Speech and Expression' in the Indian Constitution?",
"question_hi": "भारतीय संविधान में 'विचार व्यक्त करने और अभिव्यक्ति की स्वतंत्रता का अधिकार' का सिद्धांत क्या है?",
"A_en": "It means the right to express opinions and ideas freely.",
"A_hi": "यह नि:स्वार्थ विचार और विचारों की अभिव्यक्ति का अधिकार है।",
"B_en": "It means the right to criticize the government.",
"B_hi": "यह सरकार की आलोचना करने का अधिकार है।",
"C_en": "It means the right to assemble and associate.",
"C_hi": "यह एकत्रित होने और संगठन का अधिकार है।",
"D_en": "It means the right to move freely throughout the territory of India.",
"D_hi": "यह भारत के क्षेत्र में स्वतंत्र रूप से चलने का अधिकार है।",
"answer": "A",
"explanation_en": "The concept of 'Right to Freedom of Speech and Expression' in the Indian Constitution means the right to express opinions and ideas freely.",
"explanation_hi": "भारतीय संविधान में 'विचार व्यक्त करने और अभिव्यक्ति की स्वतंत्रता का अधिकार' का सिद्धांत नि:स्वार्थ विचार और विचारों की अभिव्यक्ति का अधिकार है।"
},
{
"subject": "Indian Polity",
"topic": "Bhartiya Samvidhan: Prakriti, Prastavana aur Maulik Adhikar",
"question_en": "What is the concept of 'Right to Freedom of Assembly' in the Indian Constitution?",
"question_hi": "भारतीय संविधान में 'एकत्रित होने का अधिकार' का सिद्धांत क्या है?",
"A_en": "It means the right to assemble peacefully.",
"A_hi": "यह शांतिपूर्वक एकत्रित होने का अधिकार है।",
"B_en": "It means the right to express opinions and ideas freely.",
"B_hi": "यह नि:स्वार्थ विचार और विचारों की अभिव्यक्ति का अधिकार है।",
"C_en": "It means the right to move freely throughout the territory of India.",
"C_hi": "यह भारत के क्षेत्र में स्वतंत्र रूप से चलने का अधिकार है।",
"D_en": "It means the right to criticize the government.",
"D_hi": "यह सरकार की आलोचना करने का अधिकार है।",
"answer": "A",
"explanation_en": "The concept of 'Right to Freedom of Assembly' in the Indian Constitution means the right to assemble peacefully.",
"explanation_hi": "भारतीय संविधान में 'एकत्रित होने का अधिकार' का सिद्धांत शांतिपूर्वक एकत्रित होने का अधिकार है।"
},
{
"subject": "Indian Polity",
"topic": "Bhartiya Samvidhan: Prakriti, Prastavana aur Maulik Adhikar",
"question_en": "What is the concept of 'Right to Freedom of Association' in the Indian Constitution?",
"question_hi": "भारतीय संविधान में 'संगठन का अधिकार' का सिद्धांत क्या है?",
"A_en": "It means the right to form and join associations.",
"A_hi": "यह संगठनों का गठन और संगठन में शामिल होने का अधिकार है।",
"B_en": "It means the right to express opinions and ideas freely.",
"B_hi": "यह नि:स्वार्थ विचार और विचारों की अभिव्यक्ति का अधिकार है।",
"C_en": "It means the right to move freely throughout the territory of India.",
"C_hi": "यह भारत के क्षेत्र में स्वतंत्र रूप से चलने का अधिकार है।",
"D_en": "It means the right to criticize the government.",
"D_hi": "यह सरकार की आलोचना करने का अधिकार है।",
"answer": "A",
"explanation_en": "The concept of 'Right to Freedom of Association' in the Indian Constitution means the right to form and join associations.",
"explanation_hi": "भारतीय संविधान में 'संगठन का अधिकार' का सिद्धांत संगठनों का गठन और संगठन में शामिल होने का अधिकार है।"
}