[
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "What is the concept of e-governance in the context of good governance?",
"question_hi": "बीकानेर के संबंधित सफल प्रभावों का अध्ययन",
"A_en": "Electronic Governance", "A_hi": "इलेक्ट्रॉनिक ग्राहकल्याणिक सरकार",
"B_en": "Information Technology", "B_hi": "प्रमाण",
"C_en": "Public Administration", "C_hi": "सरकारी",
"D_en": "Computer Science", "D_hi": "कविता",
"answer": "B",
"explanation_en": "Electronic governance, also known as cyber governance, refers to the application of information technology for the efficient and transparent administration of government services. It focuses on using technology to improve the quality of governance and provide better services to the citizens.\n\nइलेक्ट्रॉनिक सरकार (En: Cyber Governance, Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्ट्रॉनिक सरकार (Hindi: इलेक्रॉनैक सरैक (Hindi: इलेक सरैक).",
 

इलेक सरैक (Hindi: इलेक सरैक)",



इलेक सरैक (Hindi: इलेक सरैक)",



इलेक सरैक (Hindi: इलेक सरैक)",



इलेक सरैक (Hindi: इलेक सरैक) इलेक (Hindi: इलेक)",



इलेक सरैक (Hindi: इक सरैक)",



इलेक सरैक (Hindi: इक सरैक)",



इलेक सरैक (Hindi: इक सरैक)",


इलेक सरैक (Hindi: इक सरैक)",

इलेक सरैक (Hindi: इक सरैक)",
इलेक सरैक (Hindi: इक सरैक)",
इलेक सरैक (Hindi: इक सरैक)",
इलेक सरैक (Hindi: इक सरैक)",
इलेक सरैक (Hindi: इक सरैक)",
इक सरैक (Hindi: इक सरैक)",
इक सरैक (Hindi: इक सरैक)",
इक सरैक (Hindi: इक सरैक)",
इक सरैक (Hindi: इक सरैक)",
इक सरैक (Hindi: इक सरैक)",
इक सरैक (Hindi: इक सरैक)",
इक सरैक (Hindi: इक सरैक)",
इक सरैक (Hindi: इक सरैक)",
इक सरैक (Hindi: इक सरैक)",
इक सरैक (Hindi: इक सरैक)",
इक सरैक (Hindi: इक सरैक)",
इक सरैक (