<think>
Okay, I need to create 10 high-quality MCQ questions on the topic of E-Governance and the Concept of Good Governance in Indian Polity. Let me start by recalling what E-Governance and Good Governance entail. E-Governance refers to the use of information and communication technologies by the government to improve public services, transparency, and efficiency. Good Governance involves principles like accountability, transparency, and participation.

First question: Maybe an overview question. What is the main objective of E-Governance in India? The answer would be enhancing transparency and efficiency. The other options could be about reducing population, increasing taxes, etc.

Second question: Which initiative is part of E-Governance in India? E-Seva is a real initiative, so the options can include others like E-Pension, E-Courts, E-Post. The correct answer would be all of these.

Third question: The National e-Governance Plan (NeGP) was launched in which year? It was 2006. The other years can be around that.

Fourth question: What does the concept of Good Governance emphasize? Principles like accountability and transparency.

Fifth question: Which government body is responsible for implementing e-Governance projects? The National e-Governance Division under MeitY.

Sixth question: The mission of the Digital India program (2015) is to transform India into a digitally empowered society. Other options can be misleading like related to health or education.

Seventh question: The key component of e-Governance is the use of ICT (Information and Communication Technology) for government activities. Options could include IT, AI, IoT, etc.

Eighth question: Which of the following is a challenge in e-Governance implementation? Infrastructure gaps.

Ninth question: The concept of "Good Governance" was first proposed by which organization? UNDP (United Nations Development Programme).

Tenth question: The e-Governance ranking of Indian states is prepared by the Ministry of Electronics and Information Technology (MeitY). Other options can be NITI Aayog or RBI.

Now, translating all these into Hindi. Make sure the language is clear and matches the testbook style. Check the explanations to ensure they are accurate and concise. Verify the correct answers and possible distractors. Ensure that each question follows the JSON structure provided, with subject, topic, question in both languages, options, answer, and explanations. Also, confirm the difficulty level is appropriate for exams like LDC, CET, RAS, SSC, and Railway. Avoid any markdown and just output the raw JSON.
</think>

[
  {
    "subject": "Indian Polity",
    "topic": "E-Governance aur Good Governance ki Avdharna",
    "question_en": "What is the primary objective of E-Governance in India?",
    "question_hi": "भारत में ई-गवर्नेंस का प्रमुख उद्देश्य क्या है?",
    "A_en": "To reduce population growth",
    "A_hi": "जनसंख्या वृद्धि को कम करना",
    "B_en": "To increase tax collection",
    "B_hi": "कर आय को बढ़ाना",
    "C_en": "To enhance transparency and efficiency in public services",
    "C_hi": "सार्वजनिक सेवाओं में पारदर्शिता और कार्यक्षमता बढ़ाना",
    "D_en": "To promote private sector dominance",
    "D_hi": "निजी क्षेत्र की प्रभुत्व बढ़ाना",
    "answer": "C",
    "explanation_en": "E-Governance in India aims to improve public service delivery through transparency and efficiency.",
    "explanation_hi": "भारत में ई-गवर्नेंस सार्वजनिक सेवाओं में पारदर्शिता और कार्यक्षमता के माध्यम से डिलीवरी में सुधार करने का उद्देश्य रखता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "E-Governance aur Good Governance ki Avdharna",
    "question_en": "Which of the following is an e-Governance initiative in India?",
    "question_hi": "निम्नलिखित में से कौन भारत में ई-गवर्नेंस की एक पहल है?",
    "A_en": "E-Seva",
    "A_hi": "ई-सेवा",
    "B_en": "E-Pension",
    "B_hi": "ई-पेंशन",
    "C_en": "E-Courts",
    "C_hi": "ई-कोर्ट",
    "D_en": "All of the above",
    "D_hi": "उपरोक्त सभी",
    "answer": "D",
    "explanation_en": "E-Seva, E-Pension, and E-Courts are key e-Governance initiatives in India.",
    "explanation_hi": "ई-सेवा, ई-पेंशन और ई-कोर्ट भारत में ई-गवर्नेंस की मुख्य पहलें हैं।"
  },
  {
    "subject": "Indian Polity",
    "topic": "E-Governance aur Good Governance ki Avdharna",
    "question_en": "In which year was the National e-Governance Plan (NeGP) launched?",
    "question_hi": "राष्ट्रीय ई-गवर्नेंस योजना (एनईजीपी) किस वर्ष शुरू की गई थी?",
    "A_en": "2001",
    "A_hi": "2001",
    "B_en": "2006",
    "B_hi": "2006",
    "C_en": "2010",
    "C_hi": "2010",
    "D_en": "2015",
    "D_hi": "2015",
    "answer": "B",
    "explanation_en": "The National e-Governance Plan was launched in 2006 to drive digital governance.",
    "explanation_hi": "राष्ट्रीय ई-गवर्नेंस योजना 2006 में डिजिटल गवर्नेंस को बढ़ावा देने के लिए शुरू की गई थी।"
  },
  {
    "subject": "Indian Polity",
    "topic": "E-Governance aur Good Governance ki Avdharna",
    "question_en": "What does the concept of Good Governance emphasize?",
    "question_hi": "अच्छी शासन की अवधारणा किस पर बल देती है?",
    "A_en": "Corruption and nepotism",
    "A_hi": "भ्रष्टाचार और कर्मचारी के चयन में घरेलू संबंधों का लाभ उठाना",
    "B_en": "Accountability and transparency",
    "B_hi": "जवाबदेही और पारदर्शिता",
    "C_en": "Centralization of power",
    "C_hi": "शक्ति का केंद्रीकरण",
    "D_en": "All of the above",
    "D_hi": "उपरोक्त सभी",
    "answer": "B",
    "explanation_en": "Good Governance focuses on principles like accountability and transparency.",
    "explanation_hi": "अच्छी शासन केंद्रित शक्ति के बजाय जवाबदेही और पारदर्शिता के सिद्धांतों पर ध्यान केंद्रित करती है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "E-Governance aur Good Governance ki Avdharna",
    "question_en": "Which government body is responsible for e-Governance projects in India?",
    "question_hi": "भारत में ई-गवर्नेंस परियोजनाओं के लिए कौन सा सरकारी निकाय उत्तरदायी है?",
    "A_en": "Ministry of Home Affairs",
    "A_hi": "गृह मंत्रालय",
    "B_en": "National e-Governance Division (NeGD)",
    "B_hi": "राष्ट्रीय ई-गवर्नेंस विभाग (एनईजीडी)",
    "C_en": "Ministry of Finance",
    "C_hi": "वित्त मंत्रालय",
    "D_en": "Ministry of Education",
    "D_hi": "शिक्षा मंत्रालय",
    "answer": "B",
    "explanation_en": "The National e-Governance Division under MeitY oversees e-Governance initiatives.",
    "explanation_hi": "ई-गवर्नेंस पहलों की निगरानी करने के लिए मेजर एंड इलेक्ट्रॉनिक्स एवं सूचना प्रौद्योगिकी मंत्रालय के तहत राष्ट्रीय ई-गवर्नेंस विभाग है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "E-Governance aur Good Governance ki Avdharna",
    "question_en": "What is the mission of the Digital India program (launched in 2015)?",
    "question_hi": "2015 में शुरू किए गए डिजिटल भारत कार्यक्रम का उद्देश्य क्या है?",
    "A_en": "To provide free mobile phones to citizens",
    "A_hi": "नागरिकों को मुफ्त में मोबाइल फोन प्रदान करना",
    "B_en": "To transform India into a digitally empowered society",
    "B_hi": "भारत को एक डिजिटल रूप से सशक्त समाज में बदलना",
    "C_en": "To eliminate all government taxes",
    "C_hi": "सभी शासन करों को समाप्त करना",
    "D_en": "To reduce the use of technology in governance",
    "D_hi": "शासन में तकनीक के उपयोग को कम करना",
    "answer": "B",
    "explanation_en": "Digital India aims to create a digital infrastructure and ensure digital literacy.",
    "explanation_hi": "डिजिटल भारत का उद्देश्य डिजिटल बुनियादी ढांचा बनाने और डिजिटल साक्षरता सुनिश्चित करने का है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "E-Governance aur Good Governance ki Avdharna",
    "question_en": "Which is a key component of e-Governance?",
    "question_hi": "ई-गवर्नेंस का एक मुख्य घटक क्या है?",
    "A_en": "Use of Information and Communication Technology (ICT)",
    "A_hi": "सूचना और संचार प्रौद्योगिकी (आईसीटी) का उपयोग",
    "B_en": "Traditional paper-based records",
    "B_hi": "पारंपरिक कागज पर आधारित रिकॉर्ड",
    "C_en": "Manual data entry",
    "C_hi": "स्वयं-डेटा प्रविष्टि",
    "D_en": "All of the above",
    "D_hi": "उपरोक्त सभी",
    "answer": "A",
    "explanation_en": "ICT is a cornerstone of e-Governance for efficient service delivery.",
    "explanation_hi": "ई-गवर्नेंस में सुगम सेवा डिलीवरी के लिए आईसीटी एक महत्वपूर्ण चट्टान है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "E-Governance aur Good Governance ki Avdharna",
    "question_en": "What is a major challenge in e-Governance implementation?",
    "question_hi": "ई-गवर्नेंस के क्रियान्वयन में एक प्रमुख चुनौती क्या है?",
    "A_en": "Lack of infrastructure",
    "A_hi": "बुनियादी ढांचे की कमी",
    "B_en": "High population density",
    "B_hi": "उच्च जनसंख्या घनत्व",
    "C_en": "Excessive government expenditure",
    "C_hi": "अत्यधिक सरकारी व्यय",
    "D_en": "All of the above",
    "D_hi": "उपरोक्त सभी",
    "answer": "A",
    "explanation_en": "Infrastructure gaps hinder the effective implementation of e-Governance.",
    "explanation_hi": "बुनियादी ढांचे के अंतर ई-गवर्नेंस के प्रभावी क्रियान्वयन को रोकते हैं।"
  },
  {
    "subject": "Indian Polity",
    "topic": "E-Governance aur Good Governance ki Avdharna",
    "question_en": "Which organization first proposed the concept of Good Governance?",
    "question_hi": "अच्छी शासन की अवधारणा सर्वप्रथम किस संगठन ने प्रस्तावित की थी?",
    "A_en": "World Health Organization (WHO)",
    "A_hi": "विश्व स्वास्थ्य संगठन (डब्ल्यूएचओ)",
    "B_en": "United Nations Development Programme (UNDP)",
    "B_hi": "संयुक्त राष्ट्र विकास कार्यक्रम (यूएनडीपी)",
    "C_en": "International Monetary Fund (IMF)",
    "C_hi": "अंतरराष्ट्रीय मुद्रा कोष (आईएमएफ)",
    "D_en": "World Bank",
    "D_hi": "विश्व बैंक",
    "answer": "B",
    "explanation_en": "The UNDP first introduced the concept of Good Governance in 1997.",
    "explanation_hi": "यूएनडीपी ने 1997 में अच्छी शासन की अवधारणा को पहली बार पेश किया था।"
  },
  {
    "subject": "Indian Polity",
    "topic": "E-Governance aur Good Governance ki Avdharna",
    "question_en": "Which ministry prepares the e-Governance ranking of Indian states?",
    "question_hi": "भारतीय राज्यों के ई-गवर्नेंस रैंकिंग किस मंत्रालय द्वारा तैयार क