[
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "Which article of the Indian Constitution provides for the right to access information under the Right to Information Act, 2005?",
"question_hi": "भारतीय संविधान का कौन-सा अनुच्छेद सूचना के अधिकार अधिनियम, 2005 के अंतर्गत सूचना प्राप्त करने का अधिकार प्रदान करता है?",
"A_en": "Article 19(1)(a)", "A_hi": "अनुच्छेद 19(1)(क)",
"B_en": "Article 21", "B_hi": "अनुच्छेद 21",
"C_en": "Article 32", "B_hi": "अनुच्छेद 32",
"D_en": "Article 226", "D_hi": "अनुच्छेद 226",
"answer": "A",
"explanation_en": "Article 19(1)(a) guarantees freedom of speech and expression, which has been interpreted by the Supreme Court to include the right to information.",
"explanation_hi": "अनुच्छेद 19(1)(क) वाक् एवं अभिव्यक्ति की स्वतन्त्रता सुनिश्चित करता है, जिसे उच्चतम न्यायालय ने सूचना के अधिकार के रूप में व्याख्यायित किया है।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "Which mission was launched by the Government of India to promote e-Governance and transform India into a digitally empowered society?",
"question_hi": "भारत सरकार द्वारा ई-गवर्नेंस को बढ़ावा देने और भारत को डिजिटल रूप से सशक्त समाज बनाने के लिए किस मिशन की शुरुआत की गई?",
"A_en": "Digital India", "A_hi": "डिजिटल इंडिया",
"B_en": "Smart Cities", "B_hi": "स्मार्ट सिटीज़",
"C_en": "Make in India", "B_hi": "मेक इन इंडिया",
"D_en": "Swachh Bharat", "D_hi": "स्वच्छ भारत",
"answer": "A",
"explanation_en": "Digital India was launched in 2015 to ensure government services are available to citizens electronically and to bring about good governance through technology.",
"explanation_hi": "डिजिटल इंडिया की शुरुआत 2015 में हुई थी ताकि सरकारी सेवाएँ नागरिकों को इलेक्ट्रॉनिक रूप से उपलब्ध हो सकें और प्रौद्योगिकी के माध्यम से सुशासन सुनिश्चित हो।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "Which portal serves as the single-window access to information and services being provided by various Indian Government entities for citizens?",
"question_hi": "कौन-सा पोर्टल भारतीय नागरिकों को विभिन्न सरकारी संस्थाओं द्वारा दी जा रही सूचनाओं और सेवाओं के लिए एकल खिड़की पहुँच प्रदान करता है?",
"A_en": "India.gov.in", "A_hi": "इंडिया.गॉव.इन",
"B_en": "DigiLocker", "B_hi": "डिजिलॉकर",
"C_en": "MyGov", "B_hi": "माईगॉव",
"D_en": "GSTN", "D_hi": "जीएसटीएन",
"answer": "A",
"explanation_en": "India.gov.in is the National Portal of India, developed as a single-window access to information and services provided by government bodies.",
"explanation_hi": "इंडिया.गॉव.इन भारत का राष्ट्रीय पोर्टल है, जिसे सरकारी निकायों द्वारा दी जा रही सूचनाओं और सेवाओं की एकल खिड़की पहुँच के रूप में विकसित किया गया है।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "Which component of Good Governance emphasizes the ethical use of power and accountability of public officials?",
"question_hi": "सुशासन के किस घटक पर सार्वजनिक अधिकारियों की नैतिक शक्ति के उपयोग व जवाबदेही का बल दिया जाता है?",
"A_en": "Transparency", "A_hi": "पारदर्शिता",
"B_en": "Accountability", "B_hi": "जवाबदेही",
"C_en": "Efficiency", "B_hi": "दक्षता",
"D_en": "Rule of Law", "D_hi": "कानून का शासन",
"answer": "B",
"explanation_en": "Accountability ensures that public officials are answerable for their actions and decisions, making it a cornerstone of good governance.",
"explanation_hi": "जवाबदेही यह सुनिश्चित करती है कि सार्वजनिक अधिकारी अपने कार्यों और निर्णयों के लिए उत्तरदायी हैं, जिससे यह सुशासन का आधारस्तंभ बन जाता है।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "Which Central Act mandates proactive disclosure of information by public authorities to promote transparency?",
"question_hi": "कौन-सा केंद्रीय अधिनियम पारदर्शिता बढ़ाने के लिए सार्वजनिक प्राधिकारियों द्वारा सक्रिय सूचना प्रकटीकरण को अनिवार्य बनाता है?",
"A_en": "RTI Act, 2005", "A_hi": "सूचना का अधिकार अधिनियम, 2005",
"B_en": "Digital Personal Data Protection Act, 2023", "B_hi": "डिजिटल व्यक्तिगत डेटा संरक्षण अधिनियम, 2023",
"C_en": "IPC, 1860", "B_hi": "भारतीय दंड संहिता, 1860",
"D_en": "Evidence Act, 1872", "D_hi": "साक्ष्य अधिनियम, 1872",
"answer": "A",
"explanation_en": "Section 4(2) of the RTI Act obliges every public authority to maintain and proactively disclose information to the public.",
"explanation_hi": "सूचना का अधिकार अधिनियम की धारा 4(2) प्रत्येक सार्वजनिक प्राधिकरण को सूचना को सक्रिय रूप से प्रकट करने का दायित्व देती है।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "Which initiative provides cloud-based document wallet service to Indian citizens to store their certificates digitally?",
"question_hi": "किस पहल के तहत भारतीय नागरिकों को अपने प्रमाणपत्रों को डिजिटल रूप में संग्रहीत करने के लिए क्लाउड आधारित दस्तावेज़ वॉलेट सेवा प्रदान की जाती है?",
"A_en": "DigiLocker", "A_hi": "डिजिलॉकर",
"B_en": "UMANG", "B_hi": "उमंग",
"C_en": "PayGov", "B_hi": "पेजॉव",
"D_en": "e-Hospital", "D_hi": "ई-हॉस्पिटल",
"answer": "A",
"explanation_en": "DigiLocker is a flagship initiative under Digital India that offers 1 GB free cloud space to store documents and certificates.",
"explanation_hi": "डिजिलॉकर डिजिटल इंडिया की एक प्रमुख पहल है जो दस्तावेज़ों और प्रमाणपत्रों को संग्रहीत करने के लिए 1 जीबी निःशुल्क क्लाउड स्थान प्रदान करती है।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "Which award is given to government organizations for excellence in implementing e-Governance initiatives?",
"question_hi": "ई-गवर्नेंस पहलों को क्रियान्वित करने में उत्कृष्टता के लिए कौन-सा पुरस्कार सरकारी संगठनों को दिया जाता है?",
"A_en": "National e-Governance Awards", "A_hi": "राष्ट्रीय ई-गवर्नेंस पुरस्कार",
"B_en": "Shanti Swarup Bhatnagar Prize", "B_hi": "शांति स्वरूप भटनागर पुरस्कार",
"C_en": "Jawaharlal Nehru Award", "B_hi": "जवाहरलाल नेहरू पुरस्कार",
"D_en": "Prime Minister’s Awards for Excellence", "D_hi": "प्रधानमंत्री उत्कृष्टता पुरस्कार",
"answer": "A",
"explanation_en": "National e-Governance Awards are conferred annually by the Department of Administrative Reforms & Public Grievances to recognize exemplary initiatives.",
"explanation_hi": "प्रशासनिक सुधार एवं लोक शिकायत विभाग द्वारा प्रतिवर्ष राष्ट्रीय ई-गवर्नेंस पुरस्कार दिए जाते हैं ताकि अनुकरणीय पहलों को मान्यता मिल सके।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "Which Committee first recommended the establishment of the Central Vigilance Commission to ensure good governance and probity?",
"question_hi": "किस समिति ने सर्वप्रथम सुशासन और ईमानदारी सुनिश्चित करने के लिए केंद्रीय सतर्कता आयोग की स्थापना की सिफारिश की थी?",
"A_en": "Santhanam Committee", "A_hi": "संथानम समिति",
"B_en": "Sarkaria Commission", "B_hi": "सरकारिया आयोग",
"C_en": "Administrative Reforms Commission of 1966", "B_hi": "1966 का प्रशासनिक सुधार आयोग",
"D_en": "2nd Administrative Reforms Commission", "D_hi": "द्वितीय प्रशासनिक सुधार आयोग",
"answer": "A",
"explanation_en": "The Santhanam Committee (1962-64) recommended the creation of the Central Vigilance Commission to tackle corruption and promote integrity.",
"explanation_hi": "संथानम समिति (1962-64) ने भ्रष्टाचार से निपटने व ईमानदारी बढ़ाने के लिए केंद्रीय सतर्कता आयोग के गठन की सिफारिश की थी।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "Which provision under the RTI Act allows inspection of public works and documents by citizens?",
"question_hi": "आरटीआई अधिनियम की कौन-सी धारा नागरिकों को सार्वजनिक कार्यों और दस्तावेज़ों के निरीक्षण की अनुमति देती है?",
"A_en": "Section 2(j)(i)", "A_hi": "धारा 2(ज)(i)",
"B_en": "Section 4(1)(b)", "B_hi": "धारा 4(1)(ब)",
"C_en": "Section 8(1)", "B_hi": "धारा 8(1)",
"D_en": "Section 19", "D_hi": "धारा 19",
"answer": "A",
"explanation_en": "Section 2(j)(i) defines 'right to information' to include inspection of work, documents and records held by public authorities.",
"explanation_hi": "धारा 2(ज)(i) 'सूचना के अधिकार' को सार्वजनिक प्राधिकारियों के पास रखे कार्यों, दस्तावेज़ों और अभिलेखों के निरीक्षण तक विस्तारित करती है।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "Which pillar of Good Governance is primarily promoted by the Government’s grievance redressal mechanism through CPGRAMS?",
"question_hi": "CPGRAMS के माध्यम से सरकार की शिकायत निवारण व्यवस्था प्रमुख रूप से सुशासन के किस स्तंभ को बढ़ावा देती है?",
"A_en": "Transparency", "A_hi": "पारदर्शिता",
"B_en": "Participation", "B_hi": "भागीदारी",
"C_en": "Rule of Law", "B_hi": "कानून का शासन",
"D_en": "Accountability", "D_hi": "जवाबदेही",
"answer": "D",
"explanation_en": "The Centralised Public Grievance Redress and Monitoring System (CPGRAMS) holds departments accountable to citizens by tracking and resolving their grievances.",
"explanation_hi": "केंद्रीकृत लोक शिकायत निवारण एवं निगरानी प्रणाली (CPGRAMS) नागरिकों की शिकायतों का अनुसरण व निवारण कर विभागों को उत्तरदायी बनाती है।"
}
]