[
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "What is E-Governance?",
"question_hi": "ई-गवर्नेंस क्या है?",
"A_en": "Computerization of Government", "A_hi": "सरकार का कंप्यूटरीकरण",
"B_en": "E-Governance is the use of technology to improve the delivery of public services", "B_hi": "ई-गवर्नेंस में सरकारी सेवाओं की सुविधा में सुधार के लिए प्रौद्योगिकी का उपयोग",
"C_en": "Good Governance means absence of Corruption", "C_hi": "गुड गवर्नेंस का अर्थ है भ्रष्टाचार की अनुपस्थिति",
"D_en": "E-Governance is a set of policies and practices that promote transparency and accountability", "D_hi": "ई-गवर्नेंस तो पारदर्शिता और जवाबदेही को बढ़ावा देने के लिए नीतियों और प्रथाओं का संग्रह है",
"answer": "B",
"explanation_en": "E-Governance refers to the use of technology to deliver public services in a more efficient and effective manner.",
"explanation_hi": "ई-गवर्नेंस सरकारी सेवाओं को अधिक कुशलता से प्रदान करने के लिए प्रौद्योगिकी का उपयोग करने को संदर्भित करता है।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "What is meant by Good Governance?",
"question_hi": "गुड गवर्नेंस का अर्थ क्या है?",
"A_en": "Good Governance refers to the ability of government to provide basic necessities to its citizens", "A_hi": "गुड गवर्नेंस का अर्थ है सरकार की वह क्षमता जो अपने नागरिकों को मूलभूत आवश्यकताओं को प्रदान करने में सक्षम होती है",
"B_en": "Good Governance is a set of principles that ensure transparency, accountability and responsiveness in governance", "B_hi": "गुड गवर्नेंस एक सेट है जो पारदर्शिता, जवाबदेही और जवाबदेही को सुनिश्चित करने वाली सिद्धांतों को संदर्भित करता है",
"C_en": "Good Governance means absence of Opposition", "C_hi": "गुड गवर्नेंस का अर्थ है विपक्ष की अनुपस्थिति",
"D_en": "Good Governance is a new term used in Indian Politics", "D_hi": "गुड गवर्नेंस भारतीय राजनीति में एक नया शब्द है",
"answer": "B",
"explanation_en": "Good Governance is a set of principles that ensure transparency, accountability and responsiveness in governance.",
"explanation_hi": "गुड गवर्नेंस एक सेट है जो पारदर्शिता, जवाबदेही और जवाबदेही को सुनिश्चित करने वाली सिद्धांतों को संदर्भित करता है।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "What is the significance of E- Governance in India?",
"question_hi": "भारत में ई-गवर्नेंस का महत्व क्या है?",
"A_en": "E-Governance has increased corruption in India", "A_hi": "भारत में ई-गवर्नेंस ने भ्रष्टाचार को बढ़ावा दिया है",
"B_en": "E-Governance has improved the delivery of public services in India", "B_hi": "भारत में ई-गवर्नेंस ने सरकारी सेवाओं की सुविधा को सुधारा है",
"C_en": "E-Governance is not relevant to Indian Politics", "C_hi": "भारतीय राजनीति में ई-गवर्नेंस से कोई संबंध नहीं है",
"D_en": "E-Governance is a means to increase the power of government", "D_hi": "ई-गवर्नेंस सरकार की शक्ति को बढ़ावा देने का साधन है",
"answer": "B",
"explanation_en": "E-Governance has improved the delivery of public services in India by making them more efficient and accessible.",
"explanation_hi": "भारत में ई-गवर्नेंस ने सरकारी सेवाओं को अधिक कुशलता और पहुंच से सुधारा है।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "What is the role of citizen participation in Good Governance?",
"question_hi": "गुड गवर्नेंस में नागरिक भागीदारी की भूमिका क्या है?",
"A_en": "Citizen participation is not necessary for Good Governance", "A_hi": "नागरिक भागीदारी गुड गवर्नेंस के लिए आवश्यक नहीं है",
"B_en": "Citizen participation is a key aspect of Good Governance", "B_hi": "नागरिक भागीदारी गुड गवर्नेंस की एक प्रमुख विशेषता है",
"C_en": "Citizen participation is only for urban areas", "C_hi": "नागरिक भागीदारी केवल शहरी क्षेत्रों के लिए है",
"D_en": "Citizen participation is not a part of Indian Politics", "D_hi": "नागरिक भागीदारी भारतीय राजनीति का हिस्सा नहीं है",
"answer": "B",
"explanation_en": "Citizen participation is a key aspect of Good Governance as it ensures that the government is accountable to its citizens.",
"explanation_hi": "नागरिक भागीदारी गुड गवर्नेंस की एक प्रमुख विशेषता है, जिससे सरकार नागरिकों के प्रति जवाबदेह होती है।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "What is the relationship between E-Governance and Good Governance?",
"question_hi": "ई-गवर्नेंस और गुड गवर्नेंस के मध्य संबंध क्या है?",
"A_en": "E-Governance is a replacement for Good Governance", "A_hi": "ई-गवर्नेंस गुड गवर्नेंस का विकल्प है",
"B_en": "E-Governance is a means to achieve Good Governance", "B_hi": "ई-गवर्नेंस गुड गवर्नेंस को प्राप्त करने का साधन है",
"C_en": "E-Governance and Good Governance are unrelated", "C_hi": "ई-गवर्नेंस और गुड गवर्नेंस के बीच कोई संबंध नहीं है",
"D_en": "E-Governance is a hindrance to Good Governance", "D_hi": "ई-गवर्नेंस गुड गवर्नेंस को बाधित करता है",
"answer": "B",
"explanation_en": "E-Governance is a means to achieve Good Governance by making government services more efficient and accessible.",
"explanation_hi": "ई-गवर्नेंस गुड गवर्नेंस को प्राप्त करने का साधन है, जिससे सरकारी सेवाओं को अधिक कुशलता और पहुंच से सुधारा जा सकता है।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "What is the importance of transparency in Good Governance?",
"question_hi": "गुड गवर्नेंस में पारदर्शिता का महत्व क्या है?",
"A_en": "Transparency is not necessary for Good Governance", "A_hi": "पारदर्शिता गुड गवर्नेंस के लिए आवश्यक नहीं है",
"B_en": "Transparency is a key principle of Good Governance", "B_hi": "पारदर्शिता गुड गवर्नेंस की एक प्रमुख सिद्धांत है",
"C_en": "Transparency is only for government officials", "C_hi": "पारदर्शिता केवल सरकारी अधिकारियों के लिए है",
"D_en": "Transparency is not a part of Indian Politics", "D_hi": "पारदर्शिता भारतीय राजनीति का हिस्सा नहीं है",
"answer": "B",
"explanation_en": "Transparency is a key principle of Good Governance as it ensures that the government is accountable to its citizens.",
"explanation_hi": "पारदर्शिता गुड गवर्नेंस की एक प्रमुख सिद्धांत है, जिससे सरकार नागरिकों के प्रति जवाबदेह होती है।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "What is the role of Information Technology in E-Governance?",
"question_hi": "ई-गवर्नेंस में सूचना प्रौद्योगिकी की भूमिका क्या है?",
"A_en": "Information Technology is not used in E-Governance", "A_hi": "सूचना प्रौद्योगिकी ई-गवर्नेंस में उपयोग नहीं होती है",
"B_en": "Information Technology is a means to deliver public services", "B_hi": "सूचना प्रौद्योगिकी सरकारी सेवाओं को प्रदान करने का साधन है",
"C_en": "Information Technology is a replacement for E-Governance", "C_hi": "सूचना प्रौद्योगिकी ई-गवर्नेंस का विकल्प है",
"D_en": "Information Technology is a hindrance to E-Governance", "D_hi": "सूचना प्रौद्योगिकी ई-गवर्नेंस को बाधित करती है",
"answer": "B",
"explanation_en": "Information Technology is a means to deliver public services in a more efficient and effective manner.",
"explanation_hi": "सूचना प्रौद्योगिकी सरकारी सेवाओं को अधिक कुशलता और पहुंच से सुधारा जा सकता है।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "What is the relationship between E-Governance and citizen participation?",
"question_hi": "ई-गवर्नेंस और नागरिक भागीदारी के मध्य संबंध क्या है?",
"A_en": "E-Governance is a hindrance to citizen participation", "A_hi": "ई-गवर्नेंस नागरिक भागीदारी को बाधित करता है",
"B_en": "E-Governance is a means to increase citizen participation", "B_hi": "ई-गवर्नेंस नागरिक भागीदारी को बढ़ावा देता है",
"C_en": "E-Governance and citizen participation are unrelated", "C_hi": "ई-गवर्नेंस और नागरिक भागीदारी के बीच कोई संबंध नहीं है",
"D_en": "E-Governance is a replacement for citizen participation", "D_hi": "ई-गवर्नेंस नागरिक भागीदारी का विकल्प है",
"answer": "B",
"explanation_en": "E-Governance is a means to increase citizen participation by making government services more accessible and accountable.",
"explanation_hi": "ई-गवर्नेंस नागरिक भागीदारी को बढ़ावा देता है, जिससे सरकारी सेवाएं अधिक पहुंच और जवाबदेह होती हैं।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "What is the importance of accountability in Good Governance?",
"question_hi": "गुड गवर्नेंस में जवाबदेही का महत्व क्या है?",
"A_en": "Accountability is not necessary for Good Governance", "A_hi": "जवाबदेही गुड गवर्नेंस के लिए आवश्यक नहीं है",
"B_en": "Accountability is a key principle of Good Governance", "B_hi": "जवाबदेही गुड गवर्नेंस की एक प्रमुख सिद्धांत है",
"C_en": "Accountability is only for government officials", "C_hi": "जवाबदेही केवल सरकारी अधिकारियों के लिए है",
"D_en": "Accountability is not a part of Indian Politics", "D_hi": "जवाबदेही भारतीय राजनीति का हिस्सा नहीं है",
"answer": "B",
"explanation_en": "Accountability is a key principle of Good Governance as it ensures that the government is responsible to its citizens.",
"explanation_hi": "जवाबदेही गुड गवर्नेंस की एक प्रमुख सिद्धांत है, जिससे सरकार नागरिकों के प्रति जवाबदेह होती है।"
},
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "What is the relationship between E-Governance and transparency?",
"question_hi": "ई-गवर्नेंस और पारदर्शिता के मध्य संबंध क्या है?",
"A_en": "E-Governance is a hindrance to transparency", "A_hi": "ई-गवर्नेंस पारदर्शिता को बाधित करता है",
"B_en": "E-Governance is a means to increase transparency", "B_hi": "ई-गवर्नेंस पारदर्शिता को बढ़ावा देता है",
"C_en": "E-Governance and transparency are unrelated", "C_hi": "ई-गवर्नेंस और पारदर्शिता के बीच कोई संबंध नहीं है",
"D_en": "E-Governance is a replacement for transparency", "D_hi": "ई-गवर्नेंस पारदर्शिता का विकल्प है",
"answer": "B",
"explanation_en": "E-Governance is a means to increase transparency by making government services more accessible and accountable.",
"explanation_hi": "ई-गवर्नेंस पारदर्शिता को बढ़ावा देता है, जिससे सरकारी सेवाएं अधिक पहुंच और जवाबदेह होती हैं।"
}