[
{
"subject": "Indian Polity",
"topic": "E-Governance aur Good Governance ki Avdharna",
"question_en": "Which organization is responsible for implementing e-governance initiatives in India?",
"question_hi": "भारत में e-सचिवालयांक को कौन करता है।",
"A_en": "National Informatics Centre (NIC)",
"A_hi": "नेशनल इनफॉर्मेक्शन करने के लिए उपयोग करता है।",
"B_en": "National Committee on Information Technology (NCIT)",
"B_hi": "वित्ती समिति (नेशनल इंफॉर्मेक टेक्नों का उपयोग करते हैं।",
"C_en": "National Election Commission (NEC)",
"C_hi": "नाशा मुख्य अध्ययंत्री (नाशा मुख्य अध्ययंतून का उपयोग करते हैं।",
"D_en": "National Data Guard (NDG)",
"D_hi": "नाशा दैनिक निवन्दा (नाशा दैनिक निवन्दा)",
"answer": "A",
"explanation_en": "The National Informatics Centre (NIC) is responsible for implementing e-governance systems in India.",
"explanation_hi": "भारत के विज्ञान सेंटर (भारत के विज्ञान सेंटर)",
},
{
"subject": "Indian Constitution",
"topic": "भारतीय गांवति (भारतीय गांवती)",
"question_en": "Which article of the Indian Constitution deals with the President's powers and duties?",
"question_hi": "भारतीय गांवती मैंड (भारतीय गांवती मैंड)",
"A_en": "Article 56",
"A_hi": "श्री भारतीय गांवती मैंड (श्री भारतीय गांवती मैंड (श्री भारतीय गांवती मैंड (श्री भारतीय गांवती मैंड (श्री भारतीय गांवती मैंड (श्री भारतीय गांवती मैंड (श्री भारतीय गांवती मैंड (श्री भारतीय गांवती मैंड (श्री भारतीय गांवती मैन्दर (श्री भारत गांवती मैन्दर (श्री भारतीय गांवती मैन्दर (श्री भारतीय गांवती मैन्दर (श्री भारतीय गांवती मैन्दर (श्री भारतीय गांवती मैन्दर (श्री भारतीय गांवती मैन्दर (श्री भारतीय गांवती मैन्दर (श्री भारतीय गांवती मैन्दर (श्री भारतीय गांवती मैन्दर (श्री भारतीय गांवतीय मन्दर (श्री भारतीय गांवतीय म्द्दर (श्री भारतीय गांवतीय मैन्दर (श्री भारतीय गांवतीय म्दर (श्री भारतीय गांवतीय मैन्दर (श्री भारतीय गांवती)",
 "भारतीय गांवतीय मैन्दर (श्री भारतीय गांवतीय मैन्दीय गांवतीय मैन्दर (श्री भारतीय गांवतीय)",
"भारतीय गांवतीय गांवतीय मैन्दीय गांवतीय गांवतीय)",
"भारतीय गांवतीय गांवतीय",
भारतीय गांवतीय",
"भारतीय गांवतीय गांवतीय)",
"D_en": "National Committee on Information Technology",
"D_hi": "भारतीय गांवतीय गांवतीय",
"भारतीय गांवतीय गांवतीय",
"भारतीय गांवतीय",
"भारतीय गांवतीय",
"भारतीय गांवतीय",
"answer": "D",
"explanation_en": "The National Committee on Information Technology is responsible for promoting e-governance and information technology in India.",
"explanation_hi": "भारतीय गांवत