[
{
"subject": "Indian Polity",
"topic": "Lokpal, Lokayukt aur Soochna ka Adhikar (RTI)",
"question_en": "What is the main objective of the Lokpal Act, 2013?",
"question_hi": "लोकपाल अधिनियम, 2013 का मुख्य उद्देश्य क्या है?",
"A_en": "To establish a separate Lokayukta for each state",
"A_hi": "प्रत्येक राज्य के लिए एक अलग लोकायुक्त स्थापित करना",
"B_en": "To provide a platform for citizens to file complaints against corruption",
"B_hi": "भ्रष्टाचार के खिलाफ नागरिकों को शिकायतें दायर करने के लिए एक मंच प्रदान करना",
"C_en": "To establish a Lokpal with the power to investigate and prosecute public servants",
"C_hi": "सार्वजनिक सेवकों की जांच और अभियोजन के लिए शक्तियान्वित करने वाला लोकपाल स्थापित करना",
"D_en": "To repeal the Prevention of Corruption Act, 1988",
"D_hi": "भ्रष्टाचार निवारण अधिनियम, 1988 को रद्द करना",
"answer": "C",
"explanation_en": "The Lokpal Act, 2013 aims to provide a robust mechanism for investigating and prosecuting public servants for corruption.",
"explanation_hi": "लोकपाल अधिनियम, 2013 का उद्देश्य भ्रष्टाचार के लिए सार्वजनिक सेवकों की जांच और अभियोजन के लिए एक मजबूत मैकेनिज्म प्रदान करना है।"
},
{
"subject": "Indian Polity",
"topic": "Lokpal, Lokayukt aur Soochna ka Adhikar (RTI)",
"question_en": "What is the Right to Information Act, 2005?",
"question_hi": "सूचना का अधिकार अधिनियम, 2005 क्या है?",
"A_en": "A law that provides protection to whistleblowers",
"A_hi": "व्हिसलब्लोअरों को सुरक्षा प्रदान करने वाला कानून",
"B_en": "A law that provides a platform for citizens to seek information from public authorities",
"B_hi": "पब्लिक प्राधिकरणों से जानकारी प्राप्त करने के लिए नागरिकों के लिए एक मंच प्रदान करने वाला कानून",
"C_en": "A law that punishes those who seek information from public authorities",
"C_hi": "पब्लिक प्राधिकरणों से जानकारी प्राप्त करने वालों को दंडित करने वाला कानून",
"D_en": "A law that provides a mechanism for investigating and prosecuting public servants",
"D_hi": "सार्वजनिक सेवकों की जांच और अभियोजन के लिए एक मैकेनिज्म प्रदान करने वाला कानून",
"answer": "B",
"explanation_en": "The Right to Information Act, 2005 provides a platform for citizens to seek information from public authorities.",
"explanation_hi": "सूचना का अधिकार अधिनियम, 2005 नागरिकों को पब्लिक प्राधिकरणों से जानकारी प्राप्त करने के लिए एक मंच प्रदान करता है।"
},
{
"subject": "Indian Polity",
"topic": "Lokpal, Lokayukt aur Soochna ka Adhikar (RTI)",
"question_en": "What is the role of the Central Information Commission?",
"question_hi": "केंद्रीय सूचना आयोग की भूमिका क्या है?",
"A_en": "To investigate and prosecute public servants",
"A_hi": "सार्वजनिक सेवकों की जांच और अभियोजन करना",
"B_en": "To provide information to citizens on central government schemes",
"B_hi": "केंद्र शासित योजनाओं के बारे में नागरिकों को जानकारी प्रदान करना",
"C_en": "To oversee the implementation of the Right to Information Act, 2005",
"C_hi": "सूचना का अधिकार अधिनियम, 2005 का कार्यान्वयन देखना",
"D_en": "To provide legal advice to public authorities",
"D_hi": "पब्लिक प्राधिकरणों को कानूनी सलाह देना",
"answer": "C",
"explanation_en": "The Central Information Commission oversees the implementation of the Right to Information Act, 2005.",
"explanation_hi": "केंद्रीय सूचना आयोग सूचना का अधिकार अधिनियम, 2005 का कार्यान्वयन देखता है।"
},
{
"subject": "Indian Polity",
"topic": "Lokpal, Lokayukt aur Soochna ka Adhikar (RTI)",
"question_en": "What is the difference between Lokpal and Lokayukta?",
"question_hi": "लोकपाल और लोकायुक्त में क्या अंतर है?",
"A_en": "Lokpal is a central body while Lokayukta is a state body",
"A_hi": "लोकपाल एक केंद्रीय संस्था है जबकि लोकायुक्त एक राज्य संस्था है",
"B_en": "Lokpal deals with central government officials while Lokayukta deals with state government officials",
"B_hi": "लोकपाल केंद्र शासित अधिकारियों के साथ संबंधित है जबकि लोकायुक्त राज्य शासित अधिकारियों के साथ संबंधित है",
"C_en": "Lokpal has more powers than Lokayukta",
"C_hi": "लोकपाल के पास लोकायुक्त की तुलना में अधिक शक्तियां हैं",
"D_en": "Lokayukta is a constitutional body while Lokpal is a statutory body",
"D_hi": "लोकायुक्त एक संविधान संस्था है जबकि लोकपाल एक कानूनी संस्था है",
"answer": "A",
"explanation_en": "Lokpal is a central body while Lokayukta is a state body.",
"explanation_hi": "लोकपाल एक केंद्रीय संस्था है जबकि लोकायुक्त एक राज्य संस्था है।"
},
{
"subject": "Indian Polity",
"topic": "Lokpal, Lokayukt aur Soochna ka Adhikar (RTI)",
"question_en": "What is the significance of the Lokpal Act, 2013?",
"question_hi": "लोकपाल अधिनियम, 2013 का महत्व क्या है?",
"A_en": "It provides a platform for citizens to file complaints against corruption",
"A_hi": "भ्रष्टाचार के खिलाफ नागरिकों को शिकायतें दायर करने के लिए एक मंच प्रदान करता है",
"B_en": "It establishes a separate Lokayukta for each state",
"B_hi": "प्रत्येक राज्य के लिए एक अलग लोकायुक्त स्थापित करता है",
"C_en": "It provides a mechanism for investigating and prosecuting public servants",
"C_hi": "सार्वजनिक सेवकों की जांच और अभियोजन के लिए एक मैकेनिज्म प्रदान करता है",
"D_en": "It repeals the Prevention of Corruption Act, 1988",
"D_hi": "भ्रष्टाचार निवारण अधिनियम, 1988 को रद्द करता है",
"answer": "C",
"explanation_en": "The Lokpal Act, 2013 provides a mechanism for investigating and prosecuting public servants for corruption.",
"explanation_hi": "लोकपाल अधिनियम, 2013 भ्रष्टाचार के लिए सार्वजनिक सेवकों की जांच और अभियोजन के लिए एक मैकेनिज्म प्रदान करता है।"
},
{
"subject": "Indian Polity",
"topic": "Lokpal, Lokayukt aur Soochna ka Adhikar (RTI)",
"question_en": "Who is the head of the Central Information Commission?",
"question_hi": "केंद्रीय सूचना आयोग के अध्यक्ष कौन हैं?",
"A_en": "The Chief Information Commissioner",
"A_hi": "मुख्य सूचना आयुक्त",
"B_en": "The Lokpal",
"B_hi": "लोकपाल",
"C_en": "The Prime Minister",
"C_hi": "प्रधानमंत्री",
"D_en": "The President",
"D_hi": "राष्ट्रपति",
"answer": "A",
"explanation_en": "The Chief Information Commissioner is the head of the Central Information Commission.",
"explanation_hi": "केंद्रीय सूचना आयोग के अध्यक्ष मुख्य सूचना आयुक्त हैं।"
},
{
"subject": "Indian Polity",
"topic": "Lokpal, Lokayukt aur Soochna ka Adhikar (RTI)",
"question_en": "What is the time limit for public authorities to respond to an RTI application?",
"question_hi": "पब्लिक प्राधिकरणों को एक RTI आवेदन पर प्रतिक्रिया देने के लिए समय सीमा क्या है?",
"A_en": "7 days",
"A_hi": "7 दिन",
"B_en": "10 days",
"B_hi": "10 दिन",
"C_en": "30 days",
"C_hi": "30 दिन",
"D_en": "60 days",
"D_hi": "60 दिन",
"answer": "C",
"explanation_en": "Public authorities have 30 days to respond to an RTI application.",
"explanation_hi": "पब्लिक प्राधिकरणों को एक RTI आवेदन पर 30 दिनों के भीतर प्रतिक्रिया देनी होती है।"
},
{
"subject": "Indian Polity",
"topic": "Lokpal, Lokayukt aur Soochna ka Adhikar (RTI)",
"question_en": "What is the penalty for not responding to an RTI application?",
"question_hi": "एक RTI आवेदन पर प्रतिक्रिया न देने के लिए दंड क्या है?",
"A_en": "Rs. 250",
"A_hi": "₹ 250",
"B_en": "Rs. 500",
"B_hi": "₹ 500",
"C_en": "Rs. 1000",
"C_hi": "₹ 1000",
"D_en": "Rs. 5000",
"D_hi": "₹ 5000",
"answer": "C",
"explanation_en": "Not responding to an RTI application can result in a penalty of Rs. 1000.",
"explanation_hi": "एक RTI आवेदन पर प्रतिक्रिया न देने के लिए दंड ₹ 1000 है।"
},
{
"subject": "Indian Polity",
"topic": "Lokpal, Lokayukt aur Soochna ka Adhikar (RTI)",
"question_en": "Who can file an RTI application?",
"question_hi": "RTI आवेदन कौन दायर कर सकता है?",
"A_en": "Any citizen of India",
"A_hi": "भारत का कोई भी नागरिक",
"B_en": "Only government officials",
"B_hi": "केवल सरकारी अधिकारी",
"C_en": "Only those who have paid taxes",
"C_hi": "केवल जिन्होंने कर दिया है",
"D_en": "Only those who have a voter's ID",
"D_hi": "केवल जिन्हें वोटर आईडी है",
"answer": "A",
"explanation_en": "Any citizen of India can file an RTI application.",
"explanation_hi": "भारत का कोई भी नागरिक RTI आवेदन दायर कर सकता है।"
}
]