[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the role of Gram Panchayats in the Panchayati Raj system?",
"question_hi": "ग्राम पंचायती राज के मूल प्रकार के लिए ग्राम पंचायती राज के लिए ग्राम पंचायती राज के लिए ग्राम पंचायती राज का अध्ययन कैसे होता है।",
"question_hi": "ग्राम पंचायती राज के लिए ग्राम पंचायती राज के लिए ग्राम पंचायती राज का अध्ययन कैसे होता है।",
"A_en": "How is the delimitation of Gram Panchayati Raj done in Rajasthan? ",
"A_hi": "राजस्थान में ग्राम पंचायती राज के लिए कैसे होता है।",
"B_en": "राजस्थान में ग्राम पंचायती राज के लिए कैसे होता है।",
"B_hi": "राजस्थान में ग्राम पंचायती राज के लिए कैसे होता है।",
"C_en": "In Rajasthan, how is the delimitation of Gram Panchayati Raj done?",
"C_hi": "राजस्थान में ग्राम पंचायती राज के निर्धारण कैसे करते हैं?",
"D_en": "What is the role of Gram Panchayati Raj in Rajasthan's local governance?",
"D_hi": "राजस्थान में ग्राम पंचायती राज के लिए क्या भूमिक सहायता की गृहतित होती है?",
"E_en": "How is the representation of Rajasthan villages in Gram Panchayat?",
"E_hi": "राजस्थान में ग्राम पंचायती राज के तमनी संतुलित होती है?",
"F_en": "What is the significance of 73rd and 74th Article in Rajasthan's Panchayati Raj?",
"F_hi": "राजस्थान में 73rd और 74th Article ka kaun sahi hai?",
"G_en": "How are Village Councils and Taluk Panchayats formed in Rajasthan?",
"G_hi": "राजस्थान में गाँवाल कामंस और तालूकपंचयती राजराजन कैस्ती राजराजनों का निर्द्राजनों कैस्ती राजराजनों कैस्ती राजराजनों का निर्द्राजनों ka Nashaat kya hai?",
"question_en": "What is the composition of Gram Panchayat?",
"question_hi": "गाँवाल का निर्द्राजनों का निर्द्राजनों का निर्द्राजनों ka Nashaat kya hai?",
"A_en": "How are Gram Panchayat and Talati Panchayat formed?",
"A_hi": "गाँवाल का निराजनों का निराजनों का निराजनों का Nashaat kya hai?",
"B_en": "What is the role of Gram Panchayat and Talati Panchayat?",
"B_hi": "गाँवाल का निराजनों का निराजनों का Nashaat kya hai?",
"C_en": "What are the powers of Gram Panchayat and Talati Panchayat?",
"C_hi": "गाँवाल का निराजनों का Nashaat kya hai?",
"D_en": "How are Gram Panchayat and Talati Panchayat?",
"D_hi": "गाँवाल का निराजनों का Nashaat kya hai?",
"question_en": "What is the significance of Gram Panchayat in Rajasthan?",
"question_hi": "गाँवाल का निराजनों का निराजनों का Nashaat kya hai?",
"answer_en": "गाँवाल का निराजनों का Nashaat kya hai?",
"answer_hi": "गाँवाल का निराजनों का Nashaat kya hai?",
"explanation_en": "The role of Gram Panchayat in Rajasthan is to provide local governance to Gram Panchayat panchayat ka Nashaat kya hai?",
"explanation_hi": "गाँवाल का निराजनों का Nashaat kya hai? गाँवाल का निराजनों का Nashaat kya hai?",
"question_en": "गाँवाल का निराजनों का Nashaat kya hai?",
"question_hi": "गाँवाल का निराजनों का Nashaat kya hai?",
"answer_en": "गाँवाल का निराजनों का Nashaat kya hai?",
"answer_hi": "गाँवाल का निराजनों का Nashaat kya hai?",
"explanation_en": "The role of Gram Panchayat in Rajasthan is to provide Gram Panchayat ka Nashaat kya hai?",
"explanation_hi": "गाँवाल का निराजनों का Nashaat kya hai?",
"answer_en": "गाँवाल का निराज