[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the significance of the 73rd and 74th Amendments in Indian Panchayati Raj?",
"question_hi": "इस्लामी और 74वें समिति का मतलब इंडियन पंचायती राज्य के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ करके बार्मिंदिक पाठ के बार्मिंदिक पाठ के बार्मिंदिक पाठ करके बार्मिंदिक पाठ करके बार्मिंदिक पाठ करके बार्मिंदिक पाठ करके बार्मिंदिक पाठ",

"question_en": "What is the role of the 73rd and 74th Constitutional Amendment in Panchayati Raj and Nagrik Swasthya Karya?",
"A_en": "The 73rd and 74th Constitutional Amendment have enhanced the powers of Panchayats and Municipalities in providing healthcare services.",
"B_en": "The 73rd and 74th Constitutional Amendment have increased the role of Panchayats and Municipalities in governing local areas.",
"C_en": "The 73rd and 74th Constitutional Amendment have introduced changes in the Panchayat and Nagrik Swasthya Karya systems.",
"D_en": "The 73rd and 74th Constitutional Amendment have brought improvements in the functioning of Panchayat and Nagrik Swasthya Karya systems.",
"answer_en": "The 73rd and 74th Constitutional Amendment have increased the role of Panchayats and Municipalities in providing healthcare services.",
"question_hi": "73rd aur 74th संतिक संतिक संतिक संतिक संतिक संतिक",
"A_hi": "73rd संतिक संतिक संतिक संतिक",
"B_hi": "73rd संतिक संतिक संतिक",
"C_hi": "73rd aur 74th संतिक संतिक",
"D_hi": "73rd aur 74th संतिक",
"answer_hi": "73rd संतिक संतिक",
"question_en": "What is the role of Rajasthan Panchayat in the 73rd and 74th Constitutional Amendment?",
"A_en": "Rajasthan Panchayat plays a vital role in 73rd and 74th संतिक",
"B_en": "राटिक संतिक संतिक",
"C_en": "राटिक संतिक",
"D_en": "राटिक संतिक",
"answer_en": "राटिक संतिक",
"question_hi": "राटिक संतिक",
"A_hi": "राटिक संतिक",
"B_hi": "राटिक संतिक",
"C_hi": "राटिक संतिक",
"D_hi": "राटिक संतिक",
"answer_hi": "राटिक संतिक",
"question_en": "Rajasthan Panchayat ki role in Griha Ki Baalna Hai?",
"A_en": "राटिक संतिक",
"B_en": "राटिक संतिक",
"C_en": "राटिक संतिक",
"D_en": "राटिक संतिक",
"answer_hi": "राटिक संतिक",
"answer_en": "राटिक संतिक",
"question_hi": "राटिक संतिक",
"question_en": "राटिक संतिक",
"A_hi": "राटिक संतिक",
"A_en": "राटिक संतिक",
"B_hi": "राटिक संतिक",
"B_en": "राटिक संतिक",
"C_hi": "राटिक संतिक",
"C_en": "राटिक संतिक",
"D_hi": "र