<think>
Okay, I need to create 10 high-quality MCQs on the topic of Panchayati Raj and Urban Governance (73rd and 74th Amendments) for exams like Rajasthan LDC, CET, RAS, SSC, and Railway NTPC. Let me start by recalling the key points from both amendments. 

The 73rd Amendment Act of 1992 deals with Panchayati Raj institutions. Important aspects include the establishment of a three-tier structure at state, district, and village levels. It mandates regular elections, reservation of seats for SC/ST and women, and the creation of a State Election Commission for conducting panchayat elections. The 74th Amendment Act of 1992 focuses on urban local bodies like municipalities. It also has a three-tier structure for larger cities, provisions for reservation, and independent bodies to oversee elections.

I should cover each of these points in separate questions. For example, one question could be about the constitutional amendments themselves. Another might ask about reservation percentages. I need to ensure that the options are plausible and the explanations are clear. Also, the difficulty level should be appropriate for these exams, not too basic but not overly complex.

Let me brainstorm possible questions. First, which amendment is for Panchayati Raj? Second, the three-tier structure. Third, reservation for women. Fourth, the role of the State Election Commission. Fifth, the 74th Amendment's focus. Sixth, the percentage of seats reserved for SC/ST. Seventh, the term duration for Panchayats. Eighth, the body responsible for conducting elections. Ninth, the reservation in urban bodies. Tenth, the constitutional provision for financial autonomy.

Now, I need to frame these into clear questions. Make sure the options are in both Hindi and English. For example, question 1: Which amendment introduced Panchayati Raj? Options would be 73rd, 74th, 72nd, 75th. The answer is 73rd. 

Similarly, for each point, create a question. Check for any possible mistakes. For instance, the 74th Amendment is about urban bodies, so that's a separate question. Reservation percentages are typically 33% for women and 7.5% for SC/ST. The State Election Commission is established under the 73rd Amendment. The term for Panchayats is 5 years. The 74th Amendment deals with municipalities. The 11th Schedule lists powers for Panchayats. The 12th Schedule lists powers for municipalities. The answer to the financial autonomy question would be the 11th Schedule, but wait, the 73rd Amendment's 11th Schedule gives Panchayats powers, while the 74th's 12th Schedule does the same for urban bodies. Maybe the question is about the schedule for Panchayats, so 11th. 

I need to ensure that each question has a clear and correct answer, and the options are not confusing. Also, the explanations should reinforce the correct information. Let me structure each question with the correct answer and a concise explanation in both languages. Double-check the percentages and the schedules. For example, 33% reservation for women in Panchayats and 7.5% for SC/ST. 

Alright, compiling all these into the required JSON format, making sure the Hindi and English options are correctly translated and in the right order. Also, each question should follow the structure provided in the example. No extra text, just the raw JSON. Let me verify each question for accuracy and clarity.
</think>

[
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which constitutional amendment introduced the system of Panchayati Raj in India?",
    "question_hi": "भारत में पंचायती राज प्रणाली किस संविधान संशोधन द्वारा पेश की गई थी?",
    "A_en": "73rd Amendment Act, 1992",
    "A_hi": "73वां संशोधन अधिनियम, 1992",
    "B_en": "74th Amendment Act, 1992",
    "B_hi": "74वां संशोधन अधिनियम, 1992",
    "C_en": "72nd Amendment Act, 1992",
    "C_hi": "72वां संशोधन अधिनियम, 1992",
    "D_en": "75th Amendment Act, 1992",
    "D_hi": "75वां संशोधन अधिनियम, 1992",
    "answer": "A",
    "explanation_en": "The 73rd Amendment Act, 1992, introduced the system of Panchayati Raj and established the constitutional framework for rural local governance.",
    "explanation_hi": "1992 का 73वां संशोधन अधिनियम पंचायती राज प्रणाली को पेश करने वाला था और ग्रामीण स्थानीय शासन के लिए संवैधानिक ढांचा स्थापित किया।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the three-tier structure of Panchayati Raj as established by the 73rd Amendment?",
    "question_hi": "73वें संशोधन द्वारा स्थापित पंचायती राज की तीन स्तरीय संरचना क्या है?",
    "A_en": "Gram Panchayat, Block Development Office, District Collector",
    "A_hi": "ग्राम पंचायत, ब्लॉक विकास कार्यालय, जिला अधिकारी",
    "B_en": "Gram Panchayat, Panchayat Samiti, Zila Parishad",
    "B_hi": "ग्राम पंचायत, पंचायत समिति, जिला परिषद",
    "C_en": "Village Council, Municipal Corporation, State Assembly",
    "C_hi": "गांव की सभा, नगर निगम, राज्य विधान सभा",
    "D_en": "Panchayat, Mandal, State",
    "D_hi": "पंचायत, मंडल, राज्य",
    "answer": "B",
    "explanation_en": "The 73rd Amendment established a three-tier system: Gram Panchayat (village level), Panchayat Samiti (block level), and Zila Parishad (district level).",
    "explanation_hi": "73वें संशोधन ने तीन स्तरीय प्रणाली स्थापित की: ग्राम पंचायत (ग्राम स्तर), पंचायत समिति (ब्लॉक स्तर) और जिला परिषद (जिला स्तर)।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What percentage of seats are reserved for women in Panchayati Raj institutions as per the 73rd Amendment?",
    "question_hi": "73वें संशोधन के अनुसार पंचायती राज संस्थानों में महिलाओं के लिए कितना प्रतिशत सीटें आरक्षित हैं?",
    "A_en": "25%",
    "A_hi": "25%",
    "B_en": "33%",
    "B_hi": "33%",
    "C_en": "50%",
    "C_hi": "50%",
    "D_en": "5%",
    "D_hi": "5%",
    "answer": "B",
    "explanation_en": "The 73rd Amendment mandates a 33% reservation for women in all elected positions at the panchayat level.",
    "explanation_hi": "73वें संशोधन के अनुसार पंचायत स्तर पर सभी चुनी हुई पदों में महिलाओं के लिए 33% आरक्षण अनिवार्य है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which body is responsible for conducting elections to the Panchayati Raj institutions?",
    "question_hi": "पंचायती राज संस्थानों के चुनावों के आयोजन के लिए कौन सा निकाय उत्तरदायी है?",
    "A_en": "Election Commission of India",
    "A_hi": "भारत चुनाव आयोग",
    "B_en": "State Election Commission",
    "B_hi": "राज्य चुनाव आयोग",
    "C_en": "Gram Panchayat",
    "C_hi": "ग्राम पंचायत",
    "D_en": "Ministry of Panchayati Raj",
    "D_hi": "पंचायती राज मंत्रालय",
    "answer": "B",
    "explanation_en": "The State Election Commission, established under the 73rd Amendment, is empowered to conduct elections to the Panchayati Raj institutions.",
    "explanation_hi": "73वें संशोधन के अधीन राज्य चुनाव आयोग पंचायती राज संस्थानों के चुनावों के आयोजन के लिए शक्तिशालित है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the term duration for Panchayati Raj institutions as per the 73rd Amendment?",
    "question_hi": "73वें संशोधन के अनुसार पंचायती राज संस्थानों की अवधि कितनी होती है?",
    "A_en": "3 years",
    "A_hi": "3 वर्ष",
    "B_en": "4 years",
    "B_hi": "4 वर्ष",
    "C_en": "5 years",
    "C_hi": "5 वर्ष",
    "D_en": "6 years",
    "D_hi": "6 वर्ष",
    "answer": "C",
    "explanation_en": "The 73rd Amendment Act, 1992, mandates a 5-year term for all Panchayati Raj institutions, with elections held at the end of the term.",
    "explanation_hi": "1992 के 73वें संशोधन अधिनियम के अनुसार सभी पंचायती राज संस्थानों की अवधि 5 वर्ष होती है, जिसके अंत में चुनाव करे जाते हैं।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which constitutional amendment introduced the system of urban local self-government in India?",
    "question_hi": "भारत में शहरी स्वतंत्र स्थानीय शासन प्रणाली किस संविधान संशोधन द्वारा पेश की गई थी?",
    "A_en": "74th Amendment Act, 1992",
    "A_hi": "74वां संशोधन अधिनियम, 1992",
    "B_en": "73rd Amendment Act, 1992",
    "B_hi": "73वां संशोधन अधिनियम, 1992",
    "C_en": "75th Amendment Act, 1992",
    "C_hi": "75वां संशोधन अधिनियम, 1992",
    "D_en": "76th Amendment Act, 2014",
    "D_hi": "76वां संशोधन अधिनियम, 2014",
    "answer": "A",
    "explanation_en": "The 74th Amendment Act, 1992, introduced the constitutional framework for urban local self-government, focusing on municipalities.",
    "explanation_hi": "1992 का 74वां संशोधन अधिनियम शहरी स्वतंत्र स्थानीय शासन के संवैधानिक ढांचा पेश करने वाला था, जो नगर पालिकाओं पर केंद्रित था।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What percentage of seats are reserved for Scheduled Castes and Scheduled Tribes in urban local bodies under the 74th Amendment?",
    "question_hi": "74वें संशोधन के तहत नगर निकायों में अनुसूचित जाति और अनुसूचित जनजाति के लिए सीटों का आरक्षण कितना प्रतिशत है?",
    "A_en": "7.5%",
    "A_hi": "7.5%",
    "B_en": "10%",
    "B_hi": "10%",
    "C_en": "15%",
    "C_hi": "15%",
    "D_en": "20%",
    "D_hi": "20%",
    "answer": "A",
    "explanation_en": "The 74th Amendment mandates 7.5% reservation of seats for Scheduled Castes and Scheduled Tribes in urban local bodies.",
    "explanation_hi": "74वें संशोधन के अनुसार नगर निकायों में अनुसूचित जाति और अनुसूचित जनजाति के लिए सीटों का 7.5% आरक्षित किया गया है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which of the following is NOT a provision of the 73rd Amendment?",
    "question_hi": "निम्नलिखित में से कौन 73वें संशोधन की एक प्रावधान नहीं है?",
    "A_en": "Reservation of seats for women",
    "A_hi": "महिलाओं के लिए आरक्षित सीटों का आरक्षण",
    "B_en": "Establishment of State Election Commission",
    "B_hi": "र