[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "Which article of the Indian Constitution deals with Panchayati Raj?",
"question_hi": "इंडिया संविधान में पंचायती राज के बार्बिया के अन्तर्यामी क्या है?",
"A_en": "Article 242",
"A_hi": "आरटिक क्या है?",
"B_en": "Article 243",
"B_hi": "आरटिक क्या है?",
"C_en": "Article 244",
"C_hi": "आरटिक क्या है?",
"D_en": "Article 245",
"D_hi": "आरटिक क्या है?",
"answer": "B",
"explanation_en": "Article 243 is related to the Panchayati Raj system in India.",
"explanation_hi": "आरटिक को इन्साइन के राज्य में पंचायती राज्य क्या है।",
"explanation_en": "Article 243 is related to the Panchayati Raj system in India.",
"explanation_hi": "आरटिक को इन्साइन के राज्य में पंचायती राज्य क्या है।",
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "Which Article in the 73rd Amendment Act deals with local self-government?",
"question_hi": "73वी में क्या आरटिक को इन्साइन के राज्य में पंचायती राज्य के में पंचायती राज्य के राज्य में पंचायती राज्य के में पंचायती राज्य के राज्य में पंचायती राज्य के राज्य में पंचायती राज्य के राज्य में पंचायती राज्य के राज्य में पंचायती राज्य के राज्य में पंचायती राज्य के राज्य में पंचायती राज्य के राज्य में पंचायती राज्य के राज्य में पंचायती राज्य के राज्य में पंचायती राज्य के राज्य में पंचायती राज्य के राज्य में पंचायती राज्य में पंचायती राज्य के राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य में पंचायती",
"answer": "B",
"explanation_en": "The 73rd Amendment Act deals with the reservation of seats for SC/ST/OBC/BC/EBC in local bodies.",
"explanation_hi": "73rd में पंचायती राज्य में पंचायती राज्य में पंचायती राज्य मे