<think>
Okay, let's tackle this task. The user wants 10 high-quality MCQs on the 73rd and 74th Amendments of the Indian Constitution, focusing on Panchayati Raj and Nagariya Swashasan. They need the questions in both Hindi and English, with explanations in both languages as well. The format is a strict JSON structure as provided.

First, I need to recall the key points of these amendments. The 73rd Amendment 1992 deals with Panchayats (rural), establishing a three-tier system, reservations for SCs, STs, and women. The 74th Amendment 1992 is about urban local bodies (Nagar Panchayats, Municipal Councils, etc.), also focusing on structure, powers, and reservations. Both amendments aim to decentralize governance and empower local bodies.

I should check the structure of the previous example to ensure alignment. Each question must have subject, topic, question in both languages, four options in both languages, the correct answer, and explanations in both languages. The topics should cover various aspects like the years of amendments, reservations, key features, constitutional articles, powers, and elections.

Let me start brainstorming questions. For the 73rd Amendment, questions could be about the year, the three-tier system, reservation of seats, powers, elections. Similarly for 74th, the same structure. I need to ensure that each question tests a specific detail without overlapping. Also, the options should be plausible, with the correct answer being the one from the Constitution.

For example, a question on the year of the 73rd Amendment. The options could confuse with other years like 1990 or 1995. Another on the three-tier system: Gram Panchayat, Panchayat Samiti, Zila Parishad. Reservations: 1/3 for women, and 2/3 for SCs/STs? Wait, actually, the 73rd Amendment mandates at least one-third of seats reserved for women, SCs, and STs. So the options need to be precise.

I need to verify facts: the 73rd Amendment was 1992, 74th also 1992. The constitutional articles are 243B to 243O for Panchayats and 243P to 243ZG for Municipalities. For the Nagariya Swashasan, the 74th Amendment also mentions the three-tier system in urban areas, but the structure is different. The key elements are the establishment of municipalities, powers, and functions.

Another point: the 73rd Amendment makes the Panchayats constitutional bodies, and their elections are conducted by the State Election Commission. Similarly for the 74th, the elections for urban bodies are conducted by the same State Election Commission.

Now, creating the questions. Let's make sure each question is distinct and covers different aspects. For example, one question on the year, another on the reservation percentage for women, another on the three-tier system, another on the constitutional articles, another on the powers (taxation, land ownership), elections, and maybe some on the difference between the two amendments.

Wait, the user mentioned "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)", so some questions might be specific to each amendment, others might compare them. For example, a question comparing the reservation of seats between the two.

I need to ensure that the options are in both languages, so translation must be accurate. For example, "Gram Panchayat" in Hindi is "ग्राम पंचायत". Also, explanations must clearly state the correct answer and the reasoning.

Let me check each question for accuracy. For instance, the 73rd Amendment reserves one-third of the seats for women. The options could include other fractions like 25% or 50%, but the correct is 33%. Similarly, the 74th Amendment also provides for reservations in urban bodies.

Another point: both amendments empower local bodies with responsibilities in various sectors like education, health, and infrastructure. The 73rd Amendment gives Panchayats powers over land and agricultural resources, while the 74th deals with urban planning, public health, etc.

I should also consider the structure of the questions. For example, a question on the constitutional article that deals with the establishment of Panchayats (Article 243B) and Municipalities (Article 243P). The answer for Panchayats is Article 243B, and for Municipalities, it's Article 243P.

Now, compiling all these into the JSON structure. Let me start drafting each question, making sure there are 10 in total, each with unique aspects. I'll need to cross-verify facts to avoid mistakes. For example, the 73rd Amendment was passed in 1992, so the options for the year question should include 1992 as the correct answer.

After drafting, I'll review each question for clarity, correct answer, and accurate explanations in both languages. Also, checking for any repetition or overlapping topics among the questions.
</think>

[
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "Which constitutional amendment in India introduced the Panchayati Raj system?",
        "question_hi": "भारत में पंचायती राज प्रणाली को कौन से संविधान संशोधन ने शुरू किया?",
        "A_en": "73rd Amendment", "A_hi": "73वां संशोधन",
        "B_en": "74th Amendment", "B_hi": "74वां संशोधन",
        "C_en": "72nd Amendment", "C_hi": "72वां संशोधन",
        "D_en": "71st Amendment", "D_hi": "71वां संशोधन",
        "answer": "A",
        "explanation_en": "The 73rd Constitutional Amendment Act of 1992 introduced the Panchayati Raj system to decentralize governance in rural areas.",
        "explanation_hi": "1992 का 73वां संविधान संशोधन अधिनियम गाँव के क्षेत्रों में शासन के केंद्रीकरण को कम करके पंचायती राज प्रणाली शुरू किया।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "What is the minimum reservation of seats for women in Panchayati Raj institutions?",
        "question_hi": "पंचायती राज संस्थाओं में महिलाओं के लिए न्यूनतम सीटों की आरक्षण क्या है?",
        "A_en": "1/3", "A_hi": "1/3",
        "B_en": "1/2", "B_hi": "1/2",
        "C_en": "1/4", "C_hi": "1/4",
        "D_en": "1/5", "D_hi": "1/5",
        "answer": "A",
        "explanation_en": "The 73rd Amendment mandates a minimum reservation of one-third of seats for women in Panchayati Raj institutions.",
        "explanation_hi": "73वें संशोधन में पंचायती राज संस्थाओं में महिलाओं के लिए न्यूनतम एक-तिहाई सीटों के आरक्षण की आवश्यकता है।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "Which of the following is NOT a part of the three-tier system of Panchayati Raj?",
        "question_hi": "निम्नलिखित में से कौन-सा पंचायती राज की तीन स्तरीय प्रणाली का हिस्सा नहीं है?",
        "A_en": "Gram Panchayat", "A_hi": "ग्राम पंचायत",
        "B_en": "Panchayat Samiti", "B_hi": "पंचायत समिति",
        "C_en": "Zila Parishad", "C_hi": "जिला परिषद",
        "D_en": "Municipal Corporation", "D_hi": "नगर निगम",
        "answer": "D",
        "explanation_en": "The three-tier system of Panchayati Raj includes Gram Panchayat, Panchayat Samiti, and Zila Parishad. Municipal Corporations are part of urban governance under the 74th Amendment.",
        "explanation_hi": "पंचायती राज की तीन स्तरीय प्रणाली में ग्राम पंचायत, पंचायत समिति और जिला परिषद शामिल हैं। नगर निगम 74वें संशोधन के तहत शहरी शासन का हिस्सा हैं।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "What is the constitutional article that deals with the establishment of Panchayats?",
        "question_hi": "पंचायतों की स्थापना के लिए संविधान के कौन-से अनुच्छेद से संबंधित है?",
        "A_en": "Article 243B", "A_hi": "अनुच्छेद 243B",
        "B_en": "Article 243P", "B_hi": "अनुच्छेद 243P",
        "C_en": "Article 243D", "C_hi": "अनुच्छेद 243D",
        "D_en": "Article 243A", "D_hi": "अनुच्छेद 243A",
        "answer": "A",
        "explanation_en": "Article 243B of the Indian Constitution establishes the Panchayats as institutions of self-government in rural areas.",
        "explanation_hi": "संविधान का अनुच्छेद 243B गाँव के क्षेत्रों में स्व-शासन के संस्थानों के रूप में पंचायतों की स्थापना करता है।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "Which constitutional amendment introduced the concept of Municipalities in urban areas?",
        "question_hi": "शहरी क्षेत्रों में नगर परिषदों की अवधारणा को कौन से संविधान संशोधन ने शुरू किया?",
        "A_en": "73rd Amendment", "A_hi": "73वां संशोधन",
        "B_en": "74th Amendment", "B_hi": "74वां संशोधन",
        "C_en": "75th Amendment", "C_hi": "75वां संशोधन",
        "D_en": "76th Amendment", "D_hi": "76वां संशोधन",
        "answer": "B",
        "explanation_en": "The 74th Constitutional Amendment Act of 1992 introduced Municipalities to decentralize urban governance.",
        "explanation_hi": "1992 का 74वां संविधान संशोधन अधिनियम शहरी शासन के केंद्रीकरण को कम करके नगर परिषदों को शुरू किया।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "Which of the following is NOT a power conferred to Panchayats under the 73rd Amendment?",
        "question_hi": "निम्नलिखित में से कौन-सी 73वें संशोधन के तहत पंचायतों को निर्धारित शक्ति नहीं है?",
        "A_en": "Land ownership", "A_hi": "जमीन का स्वामित्व",
        "B_en": "Tax collection", "B_hi": "कर वसूली",
        "C_en": "Urban planning", "C_hi": "नगर योजना",
        "D_en": "Implementation of welfare schemes", "D_hi": "कल्याणकारी योजनाओं का कार्यान्वयन",
        "answer": "C",
        "explanation_en": "Urban planning is a responsibility of Municipalities under the 74th Amendment, not Panchayats.",
        "explanation_hi": "नगर योजना 74वें संशोधन के तहत नगर परिषदों की जिम्मेदारी है, न कि पंचायतों की।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "What is the minimum reservation for Scheduled Castes and Scheduled Tribes in Panchayati Raj institutions?",
        "question_hi": "पंचायती राज संस्थाओं में अनुसूचित जाति और अनुसूचित जनजाति के लिए न्यूनतम आरक्षण कितना है?",
        "A_en": "1/3", "A_hi": "1/3",
        "B_en": "As per their population proportion", "B_hi": "उनकी जनसंख्या अनुपात के अनुसार",
        "C_en": "50%", "C_hi": "50%",
        "D_en": "25%", "D_hi": "25%",
        "answer": "B",
        "explanation_en": "Reservation for SCs and STs in Panchayati Raj institutions is determined by the population proportion of these groups in the area.",
        "explanation_hi": "पंचायती राज संस्थाओं में अनुसूचित जाति और अनुसूचित जनजाति के लिए आरक्षण क्षेत्र की इन समूहों की जनसंख्या अनुपात के अनुसार निर्धारित किया जाता है।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "Which body conducts elections for Panchayats?",
        "question_hi": "पंचायतों के चुनाव कौन सा निकाय आयोजित करता है?",
        "A_en": "State Election Commission", "A_hi": "राज्य चुनाव आयोग",
        "B_en": "Election Commission of India", "B_hi": "भारत चुनाव आयो