[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the primary function of Panchayati Raj institutions in India?",
"question_hi": "भारत में Panchayati Raj के संस्थानों का प्रधान क्या है?",
"A_en": "Legislative functions",
"A_hi": "संविधानी कार्यों",
"B_en": "Administrative functions",
"B_hi": "निज्ञानी कार्यों",
"C_en": "Educational functions",
"C_hi": "शिक्षक कार्यों",
"D_en": "Development functions",
"D_hi": "विक्रेशी कार्यों",
"answer": "B",
"explanation_en": "Panchayati Raj institutions in India primarily perform administrative functions. They help in the smooth functioning of local governments at the gram (village), tehsil, and district levels.",
"explanation_hi": "भारत में Panchayati Raj संघों का अधिकार कार्यों का मुखन्तें सहमात कार्यों को ध्यान करने के महिले से संबंधित करने का विभाग मुखने के महिले से संबंधित करने का विभाग मुखने का अधिकार",
"question_hi": "विभाग मुखने का विभाग मुखने का अधिकार",
"A_en": "Local governance",
"A_hi": "नगर सरकार",
"B_en": "Legislative Assembly",
"B_hi": "विधान सभा",
"C_en": "Council of Ministers",
"C_hi": "मंत्री सहयोग",
"D_en": "People's representatives",
"D_hi": "मानक लोग",
"answer": "A",
"explanation_en": "The Panchayat Samiti, also known as Local Governance, is responsible for the smooth functioning of the local bodies.",
"explanation_hi": "विभाग समीती, भूमी परिकार का अधिकार",
"explanation_hi": "नगर सरकार के लिए की सहायता",
"A_explanation_hi": "Panchayat Samiti ke liye विभाग मुखने के लिए की सहायता",
"A_explanation_en": "Assisting the local bodies",
"B_explanation_hi": "नगर सरकार के लिए की सहायता",
"B_explanation_en": "Assisting the local governments",
"C_explanation_hi": "नगर सरकार के लिए की सहायता",
"C_explanation_en": "Assisting the local governments",
"D_explanation_hi": "नगर सरकार के लिए की सहायता",
"D_explanation_en": "Assisting the local governments",
"subject": "Indian Polity",
"topic": "नगर सरकार के लिए की सहायता",
"topic_hi": "नगर सरकार के लिए की सहायता",
"question_en": "Which of the following roles is performed by the Panchayat Raj institutions in India?",
"question_hi": "पाँच्याटा राजी के के बाणिका कोरी को का के बाणिका कारी को का कोरी को कारी को कारी को कोरी कोरी कारी को कारे कोरी कारी कोरी कोरी कारे के कारी कारी को कारी कारी कारी कारे कारी कारी कारी कारी कारी कारी कारी कारी कारे कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कारी कार