<think>
Okay, I need to create 10 high-quality MCQs on the topic of Panchayati Raj and Nagariya Swashasan (73rd and 74th Amendments) for exams like Rajasthan State Exams, SSC, and Railway NTPC. Let me start by recalling the key points of these amendments.

First, the 73rd Amendment Act, 1992, relates to the Panchayati Raj institutions. It aims to decentralize governance, providing constitutional status and representation to local self-governance. Similarly, the 74th Amendment Act, 1992, deals with urban local bodies (Municipalities), enhancing their role in urban governance.

Important aspects to cover include the provisions of the amendments, such as the constitutional status given to Panchayats and Municipalities, reservation of seats for SCs, STs, women, and other marginalized groups, the structure of these institutions (Gram Sabha, Zila Parishad, etc.), their powers and functions, financial provisions like the Finance Commission, and the constitutional amendments' implementation.

Now, to frame questions that test understanding of these elements. Each question should have four options in both Hindi and English. The answers need to be accurate, and explanations should clarify why the correct option is right.

For example, a question might ask which constitutional amendment introduced the Panchayati Raj system. The correct answer would be the 73rd Amendment. Another question could focus on the reservation percentages for SCs and STs in urban local bodies under the 74th Amendment.

I also need to ensure the difficulty level is appropriate for state and national-level exams. Avoid very technical or obscure details unless they're fundamental. Check for any common misconceptions that might be tested here, like confusing the 73rd and 74th amendments' provisions.

Let me outline the questions step by step, making sure each covers a unique aspect of the topic. Topics could include the constitutional amendment years, key features, structure, reservation percentages, financial commissions, and the role of state governments. Also, include questions on the duration of terms and the head of local bodies.

Need to double-check facts: 73rd Amendment was in 1992, 74th in the same year. The 73rd Amendment reserves at least one-third of the seats for women in Panchayats. The 74th Amendment does the same for urban bodies. The Finance Commission plays a role in making recommendations regarding the distribution of funds between the state and local bodies.

Another point is the Gram Sabha, which is the foundation of the Panchayati Raj system, consisting of all registered voters in a village. The head of a Panchayat is called a Sarpanch. For urban bodies, the head is a Mayor or Municipal Chairperson.

Also, the 73rd Amendment mandates the establishment of a State Election Commission for conducting local body elections. The 74th Amendment does not mention this, so that's a key difference between the two.

Each question should be clear and unambiguous. Avoid overlapping topics. For example, one question on the constitutional amendment year, another on reservation percentages, another on the role of the Finance Commission, etc.

Now, drafting the questions in Hindi and English, ensuring the translations are accurate. The explanations should reinforce the correct information and clarify any potential confusion.
</think>

[
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which constitutional amendment introduced the Panchayati Raj system in India?",
    "question_hi": "भारत में पंचायती राज प्रणाली को कौन-सा संविधान संशोधन पेश किया?",
    "A_en": "73rd Amendment Act, 1992", "A_hi": "73वां संशोधन अध्यादेश, 1992",
    "B_en": "74th Amendment Act, 1992", "B_hi": "74वां संशोधन अध्यादेश, 1992",
    "C_en": "75th Amendment Act, 1993", "C_hi": "75वां संशोधन अध्यादेश, 1993",
    "D_en": "72nd Amendment Act, 1992", "D_hi": "72वां संशोधन अध्यादेश, 1992",
    "answer": "A",
    "explanation_en": "The 73rd Amendment Act of 1992 established the constitutional basis for Panchayati Raj institutions in India.",
    "explanation_hi": "1992 का 73वां संशोधन अध्यादेश भारत में पंचायती राज प्रणाली के लिए संवैधानिक आधार स्थापित करता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Under the 74th Amendment Act, what is the minimum reservation of seats for women in urban local bodies?",
    "question_hi": "74वें संशोधन अध्यादेश के तहत शहरी स्थानीय निकायों में महिलाओं के लिए न्यूनतम सीटों का आरक्षण कितना है?",
    "A_en": "One-third", "A_hi": "एक-तिहाई",
    "B_en": "One-fourth", "B_hi": "एक-चौथाई",
    "C_en": "One-fifth", "C_hi": "एक-पांचवां",
    "D_en": "One-half", "D_hi": "आधा",
    "answer": "A",
    "explanation_en": "The 74th Amendment Act mandates at least one-third of the seats in urban local bodies to be reserved for women.",
    "explanation_hi": "74वें संशोधन अध्यादेश में शहरी स्थानीय निकायों में महिलाओं के लिए कम से कम एक-तिहाई सीटों के आरक्षण की आवश्यकता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the term of office for Panchayati Raj institutions as per the 73rd Amendment?",
    "question_hi": "73वें संशोधन के अनुसार पंचायती राज संस्थानों के कार्यकाल की अवधि क्या है?",
    "A_en": "5 years", "A_hi": "5 साल",
    "B_en": "4 years", "B_hi": "4 साल",
    "C_en": "6 years", "C_hi": "6 साल",
    "D_en": "3 years", "D_hi": "3 साल",
    "answer": "A",
    "explanation_en": "The 73rd Amendment specifies a 5-year term for Panchayati Raj institutions.",
    "explanation_hi": "73वें संशोधन में पंचायती राज संस्थानों के लिए 5 साल के कार्यकाल की अवधि निर्दिष्ट की गई है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which body is responsible for conducting elections to Panchayati Raj institutions according to the 73rd Amendment?",
    "question_hi": "73वें संशोधन के अनुसार पंचायती राज संस्थानों के चुनावों के आयोजन के लिए कौन-सा निकाय उत्तरदायी है?",
    "A_en": "Election Commission of India", "A_hi": "भारतीय चुनाव आयोग",
    "B_en": "State Election Commission", "B_hi": "राज्य चुनाव आयोग",
    "C_en": "Ministry of Home Affairs", "C_hi": "गृह मंत्रालय",
    "D_en": "Gram Sabha", "D_hi": "ग्राम सभा",
    "answer": "B",
    "explanation_en": "The 73rd Amendment mandates the establishment of a State Election Commission to conduct elections for Panchayati Raj institutions.",
    "explanation_hi": "73वें संशोधन में पंचायती राज संस्थानों के चुनावों के आयोजन के लिए राज्य चुनाव आयोग की स्थापना करने की आवश्यकता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the minimum number of seats reserved for Scheduled Castes (SCs) in urban local bodies per the 74th Amendment?",
    "question_hi": "74वें संशोधन के अनुसार शहरी स्थानीय निकायों में अनुसूचित जाति (एससी) के लिए आरक्षित सीटों की न्यूनतम संख्या क्या है?",
    "A_en": "Equal to their population proportion", "A_hi": "उनकी जनसंख्या अनुपात के बराबर",
    "B_en": "10%", "B_hi": "10%",
    "C_en": "15%", "C_hi": "15%",
    "D_en": "20%", "D_hi": "20%",
    "answer": "A",
    "explanation_en": "The 74th Amendment requires urban local bodies to reserve seats for SCs and STs in proportion to their population in the area.",
    "explanation_hi": "74वें संशोधन में अनुसूचित जाति (एससी) और अनुसूचित जनजाति (एसटी) के लिए उनकी जनसंख्या के अनुपात में आरक्षण करने की आवश्यकता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which of the following is NOT a feature of the 73rd Amendment Act?",
    "question_hi": "निम्नलिखित में से कौन-सा 73वें संशोधन अध्यादेश की विशेषता नहीं है?",
    "A_en": "Reservation of seats for women", "A_hi": "महिलाओं के लिए सीटों का आरक्षण",
    "B_en": "Constitutional status to Panchayats", "B_hi": "पंचायतों को संवैधानिक दर्जा देना",
    "C_en": "Power to levy taxes", "C_hi": "कर लगाने की शक्ति",
    "D_en": "Establishment of Municipal Corporations", "D_hi": "नगर निगमों की स्थापना",
    "answer": "D",
    "explanation_en": "The 73rd Amendment focuses on rural local governance and does not include the establishment of Municipal Corporations, which is unrelated to rural bodies.",
    "explanation_hi": "73वें संशोधन ग्रामीण स्थानीय शासन पर केंद्रित है और नगर निगमों की स्थापना से संबंधित नहीं है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the role of the Finance Commission under the 73rd Amendment?",
    "question_hi": "73वें संशोधन के अनुसार वित्त आयोग की भूमिका क्या है?",
    "A_en": "To recommend financial resources for Panchayats", "A_hi": "पंचायतों के लिए वित्तीय संसाधनों की अनुशंसा करना",
    "B_en": "To conduct elections", "B_hi": "चुनावों का आयोजन करना",
    "C_en": "To appoint the Sarpanch", "C_hi": "सरपंच की नियुक्ति करना",
    "D_en": "To manage urban infrastructure", "D_hi": "शहरी बुनियादी ढांचे का प्रबंधन करना",
    "answer": "A",
    "explanation_en": "The Finance Commission under the 73rd Amendment is responsible for recommending financial resources to Panchayats.",
    "explanation_hi": "73वें संशोधन के तहत वित्त आयोग पंचायतों के लिए वित्तीय संसाधनों की अनुशंसा करता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which part of the Indian Constitution contains the provisions for Panchayati Raj?",
    "question_hi": "भारतीय संविधान के किस भाग में पंचायती राज के प्रावधान शामिल हैं?",
    "A_en": "Part IX", "A_hi": "भाग IX",
    "B_en": "Part IXA", "B_hi": "भाग IXA",
    "C_en": "Part X", "C_hi": "भाग X",
    "D_en": "Part XI", "D_hi": "भाग XI",
    "answer": "B",
    "explanation_en": "The 73rd Amendment added Part IXA to the Constitution, detailing the provisions for Panchayati Raj.",
    "explanation_hi": "73वें संशोधन में संविधान में भाग IXA को जोड़ा गया था, जिसमें पंचायती राज के प्रावधान बताए गए हैं।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the minimum reservation of seats for Scheduled Tribes (STs) in Panchayati Raj institutions per the 73rd Amendment?",
    "question_hi": "73वें संशोधन के अनु