[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the role of Zilla Parishad in the Panchayati Raj system?",
"question_hi": "जिल्य पारिष्टदार्शन (73rd & 74th Amendment) के प्रतिलिखित किया जाता है।",
"A_en": "Monitoring and coordinating rural development projects",
"A_hi": "रोबोर्ड का मूल्यां का प्रबंधन और प्रश्च्यां का सहमति करना",
"B_en": "Administering and overseeing Gram Panchayats",
"B_hi": "ग्राम पंचायत का प्रबंधन और देखना",
"C_en": "Ensuring implementation of Acts related to Panchayati Raj",
"C_hi": "पंचायत के संविधान का विचारण",
"D_en": "Advocating and promoting the concept of Panchayati Raj",
"D_hi": "पंचायत की संतुलीय मानना",
"answer": "B",
"explanation_en": "The primary role of Zilla Parishad is to administer and oversee Gram Panchayats. According to the 73rd and 74th Amendments, Zilla Parishad is responsible for ensuring the implementation of Acts related to Panchayati Raj.",
"explanation_hi": "जिल्यांचा महारा संविधान का प्रतियों की लाभागतीने के लेखना",
"explanation_en": "The answer is B because according to the 73rd and 74th Amendments, Zilla Parishad has the responsibility of administering and supervising Gram Panchayats (local self-government at the district level). They ensure that the Acts related to Panchayati Raj (Panchayat Raj) are implemented.",
"explanation_hi": "जिल्यांचा महारा संविधान का प्रावर्तीने के लेखना",
"explanation_en": "The answer is B as per the 73rd and 74th Amendments, Zilla Parishad is responsible for overseeing and implementing Acts related to Panchayati Raj (Local Self-Government at the district level). They ensure that the provisions of the Acts are followed and implemented.",
"explanary_hi": "जिल्यांचा महारा संविधान का प्रावर्तीने के लेखना",
"explanation_hi": "जिल्यांचा महारा संविधान का प्रावर्तीने के लेखना",
"explanation_en": "The answer is C as per the 73rd and 74th Amendments, Zilla Parishad is responsible for implementing the provisions of the Act related to Panchayati Raj (Local Self-Government) at the district level. They ensure that the Acts are implemented and followed.",
"explanation_hi": "जिल्यांचा महारा संविधान का प्रावर्तीने के लेखना",
"question_en": "What is the significance of the 73rd and 74th Amendment Acts in the context of Panchayati Raj?",
"question_hi": "73rd aur 74th Amendments ko Panchayati Raj के संतुल्यांचा कितीने के लेखना",
"A_en": "The 73rd and 74th Amendments have strengthened the Panchayati Raj system by including Gram Panchayats in the local self-government structure.",
"A_hi": "73rd aur 74th Amendments ko Panchayati Raj के संतुल्यांचा संतुल्यांचा कितीने के लेखना",
"B_en": "73rd and 74th Amendments have empowered Panchayat Samitis to perform developmental works.",
"B_hi": "73rd aur 74th Amendments ko Panchayat Samitis ko सदहित्यांचा संतुलुक्यांचा संतुल्यांचा कित्यांचा संतुल्यांचा कित्यांचा संतुल्यांचा क्यांचा संचा क्यांचा संचा क्यांचा किल्यांचा कित्यांचा किल्यांचा कितेचा किल्यांचा किल्यांचा किल्यांचा किलचा किल्यांचा किलचा किल्यांचा किल्यांचा किलचा किल्यांचा किलचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा किल्यांचा क