[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the significance of the 73rd and 74th Amendments in Indian Panchayati Raj system?",
"question_hi": "आरंभिक कार्य और 74वें संवत्सरों का महत्व इनमें पाठियाँ पर प्रतिरोध किया जाता है।",
"A_en": "The 73rd and 74th Amendments were introduced to strengthen the Panchayati Raj system in India.",
"A_hi": "आरंभिक कार्य और 74वें संवत्सरों का महत्व पाठियाँ प्रतिरोध किया जाता है।",
"B_en": "The 73rd and 74th Amendments were introduced to provide a constitutional basis to Panchayati Raj system in India.",
"B_hi": "आरंभिक कार्य और 74वें संवत्सरों का महत्व पाठियाँ प्रतिरोध किया जाता है।",
"C_en": "The 73rd and 74th Amendments were introduced to provide administrative autonomy to Panchayats in India.",
"C_hi": "आरंभी कार्य और 74वें संवत्सरों का महत्व पाठियाँ प्रतिरोध किया जाता है।",
"D_en": "The 73rd and 74th Amendments aimed to strengthen the Local Self-Government system in India.",
"D_hi": "आरंभी कार्य और 74वें संवत्सरों का महत्व पाठियाँ प्रतिरोध किया जाता है।",
"E_en": "The 73rd and 74th Amendments were aimed at empowering local bodies through decentralization.",
"E_hi": "आरंभी कार्य और 74वें संवत्सरों को डिस्टेबल पदकत लिए किया जाता है।",
"F_en": "The 73rd and 74th Amendments aimed at ensuring better representation for scheduled castes and tribes in local bodies.",
"F_hi": "आरंभी कार्य और 74वें स्थित करने का मतिल की संवत्सरों और गैरियाँ की विभाग के मिलने करने का मतिल की संवत्सरों और गैरियाँ की विभाग को किया प्रवर्तक के मिलने करने का मतिल की संवत्सरों और गैरियाँ की विभाग को किया प्रवर्तक करने करने का मतिल की संवत्सरों और गैरियाँ की विभाग करने करने का मतिल की संवत्सरों और गु करने करने का मतिल की संवत्सरों लो करने करी संवत्सरों लो करे का मतिल की संवत्सरों करु करी संवत्सरों करे का मतिल की संवत्सरों के का मतिल करी संवत्सरों का मतिल के कु की संवत्सरों के का मतिल के की संवत्सरों का मतिल के का संवत्सरों के की संवत्सरों का मतिल के की संवत्सरों का मतिल के का संवत्सरों के का संवत्सरों का मतिल के का संवत्सरों का संवत्सरों का संवत्सरों का संवत्सरों का संवत्सरों का संवत्सरों का संवत्सरों का संवत्सरों का संवत्सरों का संवत्सरों का संवत्सरों का संवत्सरों का संवत्सरों का संवत्सरों का संवत्सरों का संवत्सरों