<think>
Okay, let's tackle this. The user wants 10 high-quality MCQs on the 73rd and 74th Amendments to the Indian Constitution, focusing on Panchayati Raj and Nagariya Swashasan. First, I need to recall the key points of these amendments. The 73rd Amendment deals with rural local governance (Panchayats), and the 74th with urban (Nagar Panchayats). Both were passed in 1992-93. Important aspects include provisions for 3-tier structure, reservation for SC/ST and women, powers and functions, financial autonomy, and constitutional status.

Now, I need to create questions that test understanding of these amendments. Let's start with the basics. Question 1 could be about which constitutional amendment introduced the Panchayati Raj system. The answer is 73rd. Then another question about the year it was enacted, which is 1992. Wait, the 73rd Amendment was enacted in 1993 but passed in 1992. Need to confirm the exact dates. Similarly for the 74th, passed in 1992, enacted in 1993.

Next, the number of tiers in the Panchayati Raj system. The answer is three: Gram Panchayat, Block, and Zila Parishad. For the Nagarpalika, maybe a question about the urban structure. Also, the minimum age for being a member is 21 for both. Reservation of seats for women is 1/3rd in both cases. The Constitution (Seventy-third Amendment) Act, 1992 added Part IX to the Constitution.

Another point is the duration of the Panchayat. It's 5 years, unless dissolved earlier. The state government can suspend it if necessary. The 74th Amendment established a three-tier urban system: Nagar Panchayat, Municipal Council, and Municipal Corporation.

Need to ensure that each question is clear and the options are plausible. For example, when asking about the constitutional amendment, options could include 71st, 72nd, 73rd, 74th. The answer is 73rd for Panchayati Raj. Similarly for Nagariya Swashasan, it's 74th.

Also, check if there are any specific provisions, like the requirement for states to conduct elections regularly, or the role of the State Election Commission. The 73rd Amendment mandates elections every five years. The 74th Amendment might have similar provisions.

Need to make sure the explanations are concise but accurate. For example, explaining that the 73rd Amendment added Part IX to the Constitution, establishing the framework for Panchayats. The 74th added Part IXA for municipalities.

Now, compiling all these points into 10 questions, ensuring a mix of basic to moderate difficulty. Avoid repetition. Each question should target a specific aspect of the amendments. Let me list out possible questions:

1. Which amendment introduced Panchayati Raj? (73rd)
2. Year of enactment? (1993)
3. Tiers in Panchayati Raj? (3)
4. Reservation for women? (1/3rd)
5. Minimum age for Panchayat membership? (21)
6. Duration of Panchayat? (5 years)
7. What part was added? (Part IX)
8. What about 74th Amendment's urban structure? (3 tiers)
9. What is the role of State Election Commission? (Conduct elections)
10. Which amendment deals with urban local bodies? (74th)

Now, draft the questions in both Hindi and English. Make sure the translations are accurate. For example, "नगरीय स्वशासन" for Nagariya Swashasan.

Check the options for each question. For example, in the first question, the options could be 71st, 72nd, 73rd, 74th. Answer is 73rd.

Avoid tricky options. Ensure that each question is unambiguous. For the explanation, provide a brief but correct reason. For instance, explaining that the 73rd Amendment mandates 1/3rd reservation for women in all elected bodies.
</think>

[
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "कौन सा संविधान संशोधन ग्रामीण स्वशासन (पंचायती राज) के लिए आधार बना?",
    "question_hi": "Which constitutional amendment laid the foundation for rural self-government (Panchayati Raj)?",
    "A_en": "71st", "A_hi": "71वां",
    "B_en": "72nd", "B_hi": "72वां",
    "C_en": "73rd", "C_hi": "73वां",
    "D_en": "74th", "D_hi": "74वां",
    "answer": "C",
    "explanation_en": "The 73rd Constitutional Amendment Act, 1992 established the framework for Panchayati Raj institutions.",
    "explanation_hi": "संविधान संशोधन अध्यादेश (73वां), 1992 ने पंचायती राज संस्थानों के लिए ढांचा स्थापित किया।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "74वें संविधान संशोधन के अधीन शहरी स्वशासन का कार्यकाल कितने वर्ष होता है?",
    "question_hi": "What is the tenure of urban self-government institutions under the 74th Constitutional Amendment?",
    "A_en": "3 years", "A_hi": "3 साल",
    "B_en": "4 years", "B_hi": "4 साल",
    "C_en": "5 years", "C_hi": "5 साल",
    "D_en": "6 years", "D_hi": "6 साल",
    "answer": "C",
    "explanation_en": "The 74th Amendment Act, 1992 mandates a 5-year tenure for urban local bodies.",
    "explanation_hi": "1992 के 74वें संशोधन अध्यादेश द्वारा शहरी स्थानीय निकायों को 5 वर्ष का कार्यकाल अनिवार्य किया गया है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "73वें संशोधन द्वारा संविधान में कौन सा भाग जोड़ा गया?",
    "question_hi": "Which part of the Constitution was added by the 73rd Amendment?",
    "A_en": "Part IX", "A_hi": "भाग IX",
    "B_en": "Part IXA", "B_hi": "भाग IXA",
    "C_en": "Part IXB", "C_hi": "भाग IXB",
    "D_en": "Part IXC", "D_hi": "भाग IXC",
    "answer": "A",
    "explanation_en": "The 73rd Amendment added Part IX (Panchayats) to the Constitution of India.",
    "explanation_hi": "73वें संशोधन ने भारतीय संविधान में भाग IX (पंचायतें) जोड़ा।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "पंचायती राज संस्थानों में महिलाओं के लिए सीटों का आरक्षण कितना है?",
    "question_hi": "What is the reservation of seats for women in Panchayati Raj institutions?",
    "A_en": "1/3rd", "A_hi": "1/3 वें",
    "B_en": "1/4th", "B_hi": "1/4 वें",
    "C_en": "1/2", "C_hi": "1/2",
    "D_en": "1/5th", "D_hi": "1/5 वें",
    "answer": "A",
    "explanation_en": "The 73rd Amendment mandates 1/3rd reservation of seats for women in all elected bodies at every level.",
    "explanation_hi": "73वें संशोधन द्वारा हर स्तर पर महिलाओं के लिए मतदान निकायों में 1/3 वें सीटों का आरक्षण अनिवार्य किया गया है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "शहरी स्वशासन के लिए कौन सा संविधान संशोधन जिम्मेदार है?",
    "question_hi": "Which constitutional amendment is responsible for urban self-government?",
    "A_en": "71st", "A_hi": "71वां",
    "B_en": "72nd", "B_hi": "72वां",
    "C_en": "73rd", "C_hi": "73वां",
    "D_en": "74th", "D_hi": "74वां",
    "answer": "D",
    "explanation_en": "The 74th Constitutional Amendment Act, 1992 established the framework for urban local bodies (Municipalities).",
    "explanation_hi": "1992 के 74वें संविधान संशोधन अध्यादेश ने शहरी स्थानीय निकायों (नगर परिषद) के लिए ढांचा स्थापित किया।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "पंचायती राज संस्थानों की आयु कम से कम कितनी होनी चाहिए?",
    "question_hi": "What is the minimum age for membership in Panchayati Raj institutions?",
    "A_en": "18 years", "A_hi": "18 साल",
    "B_en": "21 years", "B_hi": "21 साल",
    "C_en": "25 years", "C_hi": "25 साल",
    "D_en": "30 years", "D_hi": "30 साल",
    "answer": "B",
    "explanation_en": "The 73rd Amendment mandates that candidates for Panchayat membership must be at least 21 years old.",
    "explanation_hi": "73वें संशोधन द्वारा पंचायत सदस्यता के उम्मीदवारों के लिए 21 वर्ष की आयु न्यूनतम आवश्यकता निर्धारित की गई है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "74वें संशोधन द्वारा शहरी स्वशासन में कितने स्तर हैं?",
    "question_hi": "How many tiers are there in urban self-government under the 74th Amendment?",
    "A_en": "2", "A_hi": "2",
    "B_en": "3", "B_hi": "3",
    "C_en": "4", "C_hi": "4",
    "D_en": "5", "D_hi": "5",
    "answer": "B",
    "explanation_en": "The 74th Amendment provides for a three-tier structure of urban local bodies: Nagar Panchayat, Municipal Council, and Municipal Corporation.",
    "explanation_hi": "74वें संशोधन ने शहरी स्थानीय निकायों के लिए तीन स्तरों की व्यवस्था की: नगर पंचायत, नगर परिषद, और नगर निगम।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "राज्य सरकार किस कारण से पंचायत के कार्यकाल को स्थगित कर सकती है?",
    "question_hi": "Under what circumstance can a state government suspend the tenure of a Panchayat?",
    "A_en": "If elections are not held", "A_hi": "अगर चुनाव नहीं कराए गए",
    "B_en": "In case of financial crisis", "B_hi": "वित्तीय संकट की दशा में",
    "C_en": "If the Panchayat is dissolved", "C_hi": "अगर पंचायत भंग कर दी गई हो",
    "D_en": "If there is a constitutional emergency", "D_hi": "अगर संवैधानिक आपातकाल हो",
    "answer": "C",
    "explanation_en": "The 73rd Amendment empowers the state government to suspend the Panchayat if it is dissolved.",
    "explanation_hi": "73वें संशोधन द्वारा राज्य सरकार को पंचायत को स्थगित करने की शक्ति दी गई है अगर वह भंग कर दी गई हो।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "किस संविधान संशोधन द्वारा राज्य चुनाव आयोग की स्थापना की गई गई?",
    "question_hi": "Which constitutional amendment established the State Election Commission?",
    "A_en": "71st", "A_hi": "71वां",
    "B_en": "72nd", "B_hi": "72वां",
    "C_en": "73rd", "C_hi": "73वां",
    "D_en": "74th", "D_hi": "74वां",
    "answer": "C",
    "explanation_en": "The 73rd Amendment created the State Election Commission to oversee elections for Panchayats.",
    "explanation_hi": "73वें संशोधन ने पंचायतों के चुनावों की निगरानी के लिए राज्य चुनाव आयोग की स्थापना की।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "73वें और 74व