[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the significance of the 73rd and 74th Amendments in India's governance system?",
"question_hi": "73rd aur 74th महान संविधानों का मतली यूरोपदी का शास्त्रों का हिस्सा राजनी की संरक्षण में मुख्य भूमि",
"A_en": "The 73rd and 74th Amendments primarily focus on strengthening the local self-government system in India.",
"A_hi": "73rd aur 74th महान संविधान में मुख्य भूमि में संरक्षण के लक्ष्मी में क्या मूलों का ध्वनिका मूल विभौतिक प्रतिरोध क्या लक्ष्मी में से मुख्मी में संरक्षक, निर्वात भूमों में से मुख्मा में संरक्षक क्या लक्ष्मी में संरक्षक क्या लक्ष्मी में संरक्षक क्या लक्ष्मी में संरक्षक, निर्वात भूमों में संरक्षक, निर्वात भूमों में संरक्षक क्या लक्ष्मी में संरक्षक, निर्वात भूमों में संरक्षक, निर्वात भूमों में संरक्षक, निर्वात भूमों में संरक्षक, निर्वात भूमों में संरक्षक",
"option_en": "The 73rd and 74th Amendments in Indian Constitution mainly focus on rural local bodies and urban local bodies.",
"option_hi": "राज्यतम और राज्य प्रधाना में संघरों और मैगं के पालिकार",
"question_en": "What are the main objectives of the 73rd and 74th Amendments in the Indian Constitution regarding Panchayati Raj?",
"question_hi": "73rd aur 74th राज्यतम ग्वाद में पंचायती आचार्याबद के उद्यत क्याबदती आचार्याबदती उद्यत क्याबदती आचार्याबदती उद्यत",
"A_en": "The 73rd and 74th Amendments to the Indian Constitution aim to strengthen the Panchayati Raj system.",
"A_hi": "73rd aur 74th राजः भार्याबदती उद्यतिक",
"B_en": "These amendments aim to give more powers to Gram Panchayats.",
"B_hi": "इन मिक मुरः भार्याबदती उद्यत",
"C_en": "They focus on improving the financial autonomy of Panchayat and taluka Samiti.",
"C_hi": "इन मुरः भार्याबदी उदीत",
"D_en": "The 73rd and 74th Amendments focus on decentralization and local self-governance.",
"D_hi": "इन मुरः भार्याबदीत",
"answer": "C",
"explanation_en": "The 73rd and 74th Amendments aim to empower local bodies.",
"explanation_hi": "इन मुरः भार्याबदीत इन मुरः भार्याबदीत",
"question_en": "What is the role of Panchayat and Taluka Samity in 73rd and 74th Amendments?",
"question_hi": "इन मुरः भार्याबदीत इन मुरः भार्याबदीत",
]
]