<think>
Okay, so I need to create 10 high-quality MCQs on the topic of Panchayati Raj and Nagariya Swashasan, focusing on the 73rd and 74th Amendments. Let me start by recalling what I know about these amendments.

The 73rd Amendment Act, 1992, deals with Panchayati Raj institutions. It aims to provide constitutional status and protection to the Panchayats. The key points include the establishment of three-tier systems at the village, block, and district levels. Reservation for SCs, STs, and women is also a crucial part. The 74th Amendment Act, 1992, is about urban local governments, like municipalities, and similarly provides for three-tier systems in urban areas. Both amendments mandate elections every 5 years and give Panchayats/NMCs the power to prepare plans for economic development and social justice.

Now, to formulate questions. Let me think of different aspects. First, the years of the amendments. Then, key features like reservation, three-tier structure, powers, and maybe the constitutional article numbers. Also, differences between the two amendments.

Let me start with the first question: Which amendment provides constitutional status to Panchayats? The answer would be 73rd. Then a similar one for Nagarpalikas, which is 74th. Next, the three-tier system for both. Reservation percentages for SCs and STs. Women's reservation in Panchayats. Election frequency. Power to prepare plans. The constitutional articles involved might be 243 for Panchayats and 243P for Nagarpalikas. Also, maybe the minimum age for becoming a member, which is 21 for Panchayats and 21 for Nagarcouncillors. The difference between the two amendments: one is for rural, the other for urban. The 73rd allows for a Gram Sabha, while the 74th covers municipalities.

Wait, I need to verify some points. For example, the percentage reservation for SCs and STs is 7.5% each? Or is it separate? Also, the 73rd Amendment says 1/3rd of the total seats are reserved for women. The election frequency is every 5 years, unless dissolved earlier. The 74th Amendment also provides for a three-tier system in urban areas. The constitutional articles: 243A to 243O for Panchayats, and 243P to 243ZG for Nagarpalikas. The 73rd Amendment was passed in 1992, and so was the 74th. Both came into effect on June 1, 1993. The 73rd Amendment gives Panchayats the power to levy taxes, and the 74th does the same for municipalities. The Gram Sabha is the foundational body in the Panchayati Raj system. The 73rd Amendment also provides for the establishment of a State Election Commission for conducting Panchayat elections.

Now, possible questions:

1. Which amendment provides constitutional status to Panchayats? (73rd)
2. Which amendment deals with urban local governments? (74th)
3. What is the reservation for SCs and STs in Panchayats? (not less than 7.5% each)
4. Reservation for women in Panchayats? (1/3rd)
5. Election frequency for Panchayats? (5 years)
6. Constitutional article for Panchayats? (243)
7. Three-tier system in Panchayats: Gram Panchayat, Block, Zila Parishad.
8. Power to prepare plans for economic development: Panchayats under 73rd.
9. Difference between 73rd and 74th: Rural vs Urban.
10. Minimum age to become a member of Panchayat? (21)
11. State Election Commission under which amendment? (73rd)
12. The 74th Amendment provides for three-tier urban system: Municipalities, Municipal Corporations, and Nagar Panchayats.
13. Reservation for SCs and STs in Nagarpalikas? (Same as Panchayats, 7.5% each)
14. Women's reservation in Nagarpalikas? (1/3rd)
15. Election frequency for Nagarpalikas? (5 years)
16. Constitutional article for Nagarpalikas? (243P)
17. The 73rd Amendment was passed in which year? (1992)
18. The 74th Amendment came into effect on? (June 1, 1993)
19. Which amendment allows Panchayats to levy taxes? (73rd)
20. Gram Sabha is part of which system? (Panchayati Raj)

Now, selecting 10 of these, ensuring a mix of facts and understanding. Need to avoid overlap and cover various aspects. Let's pick:

1. Which amendment provides constitutional status to Panchayats? (73rd)
2. The reservation for women in Panchayats is: (1/3rd)
3. The 74th Amendment relates to: (Urban local government)
4. The minimum age to be a member of a Panchayat is: (21 years)
5. The three-tier system in Panchayati Raj includes: (Gram Panchayat, Block, Zila Parishad)
6. The election frequency for Panchayats is: (Every 5 years)
7. The constitutional article that provides for the 73rd Amendment is: (Article 243)
8. The 73rd Amendment allows Panchayats to: (Prepare plans for economic development)
9. The reservation for SC/ST in Panchayats is not less than: (7.5%)
10. The State Election Commission is established under the: (73rd Amendment)

Now, phrasing each question correctly. For example, the first question should ask which amendment gives constitutional status. The options would be 71st, 72nd, 73rd, 74th. Answer is 73rd. Similarly for others. Need to ensure options are plausible. Also, explanations should clarify the points.

Check for accuracy: The 73rd Amendment was 1992, came into effect 1993. The reservation for SC/ST is not less than 7.5% each. Women's reservation is 1/3rd. The three-tier system: village, block, district. The 74th Amendment relates to urban areas. The election frequency is 5 years. The constitutional article for Panchayats is Article 243A to 243O. The State Election Commission is under 73rd. The 73rd Amendment allows Panchayats to prepare plans for economic development and social justice. The minimum age is 21.

Now, structure each question in English and Hindi, with options in both languages. The answer should be correct, and explanations in both languages. Need to make sure that the options are in order (A, B, C, D) and the answer key matches. Also, avoid any typos or factual errors. For example, the 73rd Amendment's constitutional articles start at 243A, but the question might refer to the main article, so perhaps use "Article 243" as an option when asking for the constitutional article. However, technically, the provisions are from 243A to 243O. But for a multiple-choice question, using "Article 243" might be acceptable as the main article.

Okay, compiling all this into the required JSON format now.
</think>

```json
[
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which amendment provides constitutional status to the Panchayati Raj institutions?",
    "question_hi": "पंचायती राज संस्थानों को संवैधानिक अवस्था कौन सा संविधान संशोधन प्रदान करता है?",
    "A_en": "73rd Amendment", "A_hi": "73वाँ संशोधन",
    "B_en": "74th Amendment", "B_hi": "74वाँ संशोधन",
    "C_en": "71st Amendment", "C_hi": "71वाँ संशोधन",
    "D_en": "72nd Amendment", "D_hi": "72वाँ संशोधन",
    "answer": "A",
    "explanation_en": "The 73rd Constitution Amendment Act, 1992, provides constitutional status to the Panchayati Raj institutions.",
    "explanation_hi": "1992 का 73वाँ संविधान संशोधन अधिनियम पंचायती राज संस्थानों को संवैधानिक अवस्था प्रदान करता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the reservation for women in the Panchayati Raj institutions?",
    "question_hi": "पंचायती राज संस्थानों में महिलाओं के लिए आरक्षण क्या है?",
    "A_en": "1/4 of the total seats", "A_hi": "कुल सीटों का 1/4",
    "B_en": "1/3 of the total seats", "B_hi": "कुल सीटों का 1/3",
    "C_en": "1/2 of the total seats", "C_hi": "कुल सीटों का 1/2",
    "D_en": "No reservation", "D_hi": "कोई आरक्षण नहीं",
    "answer": "B",
    "explanation_en": "The 73rd Amendment mandates that at least one-third of the total seats are reserved for women in the Panchayati Raj institutions.",
    "explanation_hi": "73वाँ संशोधन पंचायती राज संस्थानों में कुल सीटों के कम से कम एक-तिहाई के लिए महिलाओं का आरक्षण आवश्यक करता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "The 74th Amendment Act deals with which of the following?",
    "question_hi": "74वें संशोधन कानून निम्नलिखित में से किसके साथ संबंधित है?",
    "A_en": "Urban local government", "A_hi": "शहरी स्थानीय सरकार",
    "B_en": "Rural local government", "B_hi": "ग्रामीण स्थानीय सरकार",
    "C_en": "Central Government", "C_hi": "केंद्र सरकार",
    "D_en": "State Government", "D_hi": "राज्य सरकार",
    "answer": "A",
    "explanation_en": "The 74th Amendment Act of 1992 provides constitutional status to urban local governments such as municipalities.",
    "explanation_hi": "1992 का 74वाँ संशोधन अधिनियम नगर परिषदों जैसे शहरी स्थानीय सरकारों को संवैधानिक अवस्था प्रदान करता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the minimum age required to be a member of a Panchayat?",
    "question_hi": "एक पंचायत के सदस्य बनने के लिए न्यूनतम आयु क्या है?",
    "A_en": "18 years", "A_hi": "18 वर्ष",
    "B_en": "21 years", "B_hi": "21 वर्ष",
    "C_en": "25 years", "C_hi": "25 वर्ष",
    "D_en": "30 years", "D_hi": "30 वर्ष",
    "answer": "B",
    "explanation_en": "The minimum age required to be a member of a Panchayat is 21 years as per the 73rd Amendment.",
    "explanation_hi": "73वें संशोधन के अनुसार पंचायत के सदस्य बनने के लिए न्यूनतम आयु 21 वर्ष है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which of the following is NOT a tier in the Panchayati Raj system?",
    "question_hi": "निम्नलिखित में से कौन-सा पंचायती राज प्रणाली में एक स्तर नहीं है?",
    "A_en": "Gram Panchayat", "A_hi": "ग्राम पंचायत",
    "B_en": "Zila Parishad", "B_hi": "जिला परिषद्",
    "C_en": "Municipal Corporation", "C_hi": "नगर निगम",
    "D_en": "Panchayat Samiti", "D_hi": "पंचायत समिति",
    "answer": "C",
    "explanation_en": "Municipal Corporation is part of the urban local government system under the 74th Amendment, not the Panchayati Raj system.",
    "explanation_hi": "नगर निगम 74वें संशोधन के तहत शहरी स्थानीय सरकार प्रणाली का हिस्सा है, पंचायती राज प्रणाली का नहीं।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "The State Election Commission is established under which amendment?",
    "question_hi": "राज्य चुनाव आयोग किस संशोधन के तहत स्थापित किया गया है?",
    "A_en": "73rd Amendment", "A_hi": "73वाँ संशोधन",
    "B_en": "74th Amendment", "B_hi": "74वाँ संशोधन",
    "C_en": "71st Amendment", "C_hi": "71वाँ संशोधन",
    "D_en": "72nd Amendment", "D_hi": "72वाँ संशोधन",
    "answer": "A",
    "explanation_en": "The 73rd Amendment establishes the State Election Commission to conduct elections for Panchayati Raj institutions.",
    "explanation_hi": "73वाँ संशोधन पंचायती राज संस्थानों के लिए चुनावों के आयोजन के लिए राज्य चुनाव आयोग की स्थापना करता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the reservation for Scheduled Castes (SCs) and Scheduled Tribes (STs) in the Panchayati Raj institutions?",
    "question_hi": "पंचायती राज संस्थानों में अनुसूचित जाति (एससी) और अनुसूचित जनजाति (एसटी) के लिए आरक्षण क्या है?",
    "A_en": "Not