<think>
Okay, I need to create 10 high-quality MCQs on the topic of Panchayati Raj and Nagariya Swashasan, specifically covering the 73rd and 74th Amendments. The user wants the questions in both Hindi and English, with explanations in both languages as well. The output must be in a strict JSON format similar to the example provided. Let me start by recalling the key points of these amendments.

First, the 73rd Amendment is about Panchayats (rural local government) and the 74th Amendment pertains to Municipalities (urban local government). Both were passed in 1992. The 73rd Amendment provides for the constitution of Panchayats at three tiers: village, intermediate, and district levels. It mandates regular elections, reservation of seats for SCs, STs, and women, and the establishment of State Election Commissions. The 74th Amendment does something similar for urban areas, establishing Municipalities with three tiers: Nagar Panchayat, Municipal Council, and Municipal Corporation.

I need to structure questions that test understanding of these amendments. Let me start with the first question: Which amendment deals with Panchayati Raj? The answer is 73rd. Then, the urban counterpart is 74th. Next, maybe the year they were passed. Then, the reservation percentages for women. Also, the structure of the Panchayats: three tiers. The role of the State Election Commission. The minimum age for membership. The duration of the Panchayat term. The number of seats reserved for SC/ST. The power to delegate functions to Panchayats. And one on the constitutional provisions for municipalities.

I need to make sure each question is clear and the options are plausible. For example, for the reservation of women, options could include 30%, 33%, 50%, etc. The correct answer is 33%. For the year, options might be 1990, 1992, 1995. The answer is 1992. The tiers: village, intermediate, district. For the State Election Commission's role, the correct answer would be conducting elections. The minimum age is 21. The term is 5 years. Reservation for SC/ST is 1/4th, so 25%. The State Government can delegate powers. The Municipalities' structure is three tiers.

I need to write each question in both Hindi and English, ensuring the translations are accurate. The explanations should clarify why the correct answer is right. Let me check each point again to avoid errors. For example, the 73rd Amendment gives the structure for Panchayats, and the 74th for Municipalities. Reservation for SC/ST is 1/4th of the seats. Women's reservation is 33%. The State Election Commission is established by the 73rd Amendment. The term is 5 years. The State Government delegates functions. The Municipalities have three tiers. The minimum age is 21. The term is 5 years. The reservation for SC/ST is 25%. The correct answer for the question on the constitutional provision for municipalities is the 74th Amendment. That should cover all the key points.
</think>

[
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "73rd Amendment is related to which of the following?",
    "question_hi": "73वें संविधान संशोधन से निम्नलिखित में से किसका संबंध है?",
    "A_en": "Panchayati Raj",
    "A_hi": "पंचायती राज",
    "B_en": "Urban Local Government",
    "B_hi": "शहरी स्थानीय शासन",
    "C_en": "Judicial Reforms",
    "C_hi": "न्यायिक सुधार",
    "D_en": "Central Government",
    "D_hi": "केंद्र सरकार",
    "answer": "A",
    "explanation_en": "The 73rd Constitutional Amendment Act, 1992, provides for the constitution of Panchayats (rural local self-government).",
    "explanation_hi": "73वें संविधान संशोधन अध्यादेश, 1992, पंचायतों (ग्रामीण स्थानीय स्वशासन) के गठन के लिए प्रदान करता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which amendment deals with the constitutional provisions for municipalities?",
    "question_hi": "शहरी स्वशासन के संवैधानिक प्रावधानों के संबंध में कौन सा संशोधन है?",
    "A_en": "72nd Amendment",
    "A_hi": "72वां संशोधन",
    "B_en": "73rd Amendment",
    "B_hi": "73वां संशोधन",
    "C_en": "74th Amendment",
    "C_hi": "74वां संशोधन",
    "D_en": "75th Amendment",
    "D_hi": "75वां संशोधन",
    "answer": "C",
    "explanation_en": "The 74th Constitutional Amendment Act, 1992, provides for the constitution of Municipalities (urban local self-government).",
    "explanation_hi": "74वें संविधान संशोधन अध्यादेश, 1992, नगर पालिकाओं (शहरी स्थानीय स्वशासन) के गठन के लिए प्रदान करता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the minimum age required to become a member of a Panchayat?",
    "question_hi": "पंचायत के सदस्य बनने के लिए न्यूनतम आयु क्या है?",
    "A_en": "18 years",
    "A_hi": "18 वर्ष",
    "B_en": "21 years",
    "B_hi": "21 वर्ष",
    "C_en": "25 years",
    "C_hi": "25 वर्ष",
    "D_en": "30 years",
    "D_hi": "30 वर्ष",
    "answer": "B",
    "explanation_en": "Section 5 of the 73rd Amendment Act specifies that the minimum age for a member of a Panchayat is 21 years.",
    "explanation_hi": "73वें संशोधन अध्यादेश की धारा 5 निर्दिष्ट करती है कि पंचायत के सदस्यों की न्यूनतम आयु 21 वर्ष है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What percentage of seats is reserved for women in Panchayats?",
    "question_hi": "पंचायतों में महिलाओं के लिए कितने प्रतिशत सीटों का आरक्षण है?",
    "A_en": "30%",
    "A_hi": "30%",
    "B_en": "33%",
    "B_hi": "33%",
    "C_en": "35%",
    "C_hi": "35%",
    "D_en": "40%",
    "D_hi": "40%",
    "answer": "B",
    "explanation_en": "The 73rd Amendment mandates a minimum of 33% reservation for women in all elected positions at all levels of Panchayats.",
    "explanation_hi": "73वें संशोधन में पंचायतों के सभी स्तरों पर चुने गए पदों में महिलाओं के लिए 33% आरक्षण की आवश्यकता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Under which constitutional provision is the State Election Commission established?",
    "question_hi": "किस संवैधानिक प्रावधान के तहत राज्य निर्वाचन आयोग की स्थापना की गई है?",
    "A_en": "72nd Amendment",
    "A_hi": "72वां संशोधन",
    "B_en": "73rd Amendment",
    "B_hi": "73वां संशोधन",
    "C_en": "74th Amendment",
    "C_hi": "74वां संशोधन",
    "D_en": "75th Amendment",
    "D_hi": "75वां संशोधन",
    "answer": "B",
    "explanation_en": "The 73rd Amendment establishes the State Election Commission to conduct elections to the Panchayats.",
    "explanation_hi": "73वें संशोधन में पंचायतों के चुनावों के आयोजन के लिए राज्य निर्वाचन आयोग की स्थापना की गई है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the tenure of a Panchayat?",
    "question_hi": "पंचायत का मुदत कितनी होती है?",
    "A_en": "3 years",
    "A_hi": "3 वर्ष",
    "B_en": "4 years",
    "B_hi": "4 वर्ष",
    "C_en": "5 years",
    "C_hi": "5 वर्ष",
    "D_en": "6 years",
    "D_hi": "6 वर्ष",
    "answer": "C",
    "explanation_en": "The 73rd Amendment provides for a five-year term for Panchayats, with elections held regularly.",
    "explanation_hi": "73वें संशोधन में पंचायतों के लिए पांच वर्ष की अवधि निर्धारित की गई है, जिसमें नियमित चुनाव होते हैं।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which of the following is a feature of the 74th Amendment?",
    "question_hi": "निम्नलिखित में से कौन 74वें संशोधन की एक विशेषता है?",
    "A_en": "Reservation of seats for SCs/STs",
    "A_hi": "एससी/एसटी के लिए सीटों का आरक्षण",
    "B_en": "Three-tier structure of Municipalities",
    "B_hi": "नगर पालिकाओं की तीन स्तरीय रचना",
    "C_en": "Women's reservation",
    "C_hi": "महिलाओं का आरक्षण",
    "D_en": "All of the above",
    "D_hi": "उपरोक्त सभी",
    "answer": "D",
    "explanation_en": "The 74th Amendment includes reservation for SCs/STs, a three-tier structure for Municipalities, and provisions for women's reservation.",
    "explanation_hi": "74वें संशोधन में एससी/एसटी के आरक्षण, नगर पालिकाओं की तीन स्तरीय रचना और महिलाओं के आरक्षण के प्रावधान शामिल हैं।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the percentage of seats reserved for SCs and STs in Panchayats?",
    "question_hi": "पंचायतों में एससी और एसटी के लिए आरक्षित सीटों का प्रतिशत क्या है?",
    "A_en": "10%",
    "A_hi": "10%",
    "B_en": "15%",
    "B_hi": "15%",
    "C_en": "20%",
    "C_hi": "20%",
    "D_en": "25%",
    "D_hi": "25%",
    "answer": "D",
    "explanation_en": "The 73rd Amendment reserves seats for SCs and STs at 25% of the total seats in Panchayats.",
    "explanation_hi": "73वें संशोधन में पंचायतों में पंचायतों की कुल सीटों के 25% एससी और एसटी के लिए आरक्षित हैं।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which authority can delegate powers to the Panchayats?",
    "question_hi": "पंचायतों को शक्तियों के अधिकार किस द्वारा देय होता है?",
    "A_en": "President of India",
    "A_hi": "भारत के राष्ट्रपति",
    "B_en": "Prime Minister",
    "B_hi": "प्रधान मंत्री",
    "C_en": "Governor of the State",
    "C_hi": "राज्य के राज्यपाल",
    "D_en": "State Government",
    "D_hi": "राज्य सरकार",
    "answer": "D",
    "explanation_en": "The State Government has the authority to delegate powers to the Panchayats as per the 73rd Amendment.",
    "explanation_hi": "73वें संशोधन के अनुसार राज्य सरकार के पास पंचायतों को शक्तियों के अधिकार देने की शक्ति है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the structure of Municipalities under the 74th Amendment?",
    "question_hi": "74वें संशोधन के तहत नगर पालिकाओं की रचना क्या है?",
    "A_en": "Two-tier structure",
    "A_hi": "दो स्तरीय रचना",
    "