[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "Which article of the Constitution deals with the reservation of seats for Scheduled Castes and Scheduled Tribes in local bodies?",
"question_hi": "संवत्सर भूमिका के बार्मिंड क्या है?",
"A_en": "Article 338",
"A_hi": "एक्स्पेस्ट 338",
"B_en": "Article 339",
"B_hi": "एक्स्पेस्ट 339",
"C_en": "Article 337",
"C_hi": "एक्स्पेस्ट 337",
"D_en": "Article 336",
"D_hi": "एक्स्पेस्ट 336",
"answer": "C",
"explanation_en": "Article 337 of the Constitution deals with the reservation of seats for Scheduled Castes and Scheduled Tribes in local bodies.",
"explanation_hi": "एक्स्पेस्ट 337 को राजमंत्री संवत्सर भूमि के दो प्रतिविद्यालय में स्वत्सर भूमि के स्वत्सर भूमि में सांचलित संवत्सर भूमि में स्वत्सर भूमि में सांचलित संवत्सर भूमि में स्वत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलित संवत्सर भूमि में सांचलि में सांचलित संवत्सर भूमि में सांचलि में सांवत्सर भूमें सांचलि में सांचें हें सांचलि में सां सांचलें हें सांचलि सांचलि में सां सांचलि सांचलि हें सांचलि सां सांचलि में सां हें",
| RAS हें सांचलि सां हें सांचलि हें सां सांचलि सां सां सांचलि हें सां सां सांचलि",
"question_en": "Which article deals with reservation for Scheduled Castes and Scheduled Tribes in local bodies?",
"question_hi": "सां हें सांचलि सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सां सा