[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the main objective of the 73rd Amendment to the Indian Constitution?",
"question_hi": "भारतीय संविधान के 73वें संशोधन का मुख्य उद्देश्य क्या है?",
"A_en": "To empower the urban local bodies", "A_hi": "नगरीय स्थानीय निकायों को सशक्त बनाने के लिए",
"B_en": "To strengthen the Panchayati Raj system", "B_hi": "पंचायती राज प्रणाली को मजबूत करने के लिए",
"C_en": "To promote the concept of cooperative federalism", "C_hi": "सहकारी संघवाद की अवधारणा को बढ़ावा देने के लिए",
"D_en": "To reduce the powers of the state governments", "D_hi": "राज्य सरकारों की शक्तियों को कम करने के लिए",
"answer": "B",
"explanation_en": "The 73rd Amendment to the Indian Constitution aims to strengthen the Panchayati Raj system by providing constitutional status to the three-tier Panchayat system.",
"explanation_hi": "भारतीय संविधान के 73वें संशोधन का उद्देश्य पंचायती राज प्रणाली को मजबूत करना है, जिसमें तीन-स्तरीय पंचायत प्रणाली को संवैधानिक दर्जा दिया गया है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "Which of the following is a key feature of the 74th Amendment to the Indian Constitution?",
"question_hi": "निम्नलिखित में से कौन भारतीय संविधान के 74वें संशोधन की एक प्रमुख विशेषता है?",
"A_en": "Creation of a new tier of local government", "A_hi": "स्थानीय सरकार के एक नए स्तर का निर्माण",
"B_en": "Empowerment of the state governments", "B_hi": "राज्य सरकारों को सशक्त बनाना",
"C_en": "Establishment of a district planning committee", "C_hi": "जिला योजना समिति की स्थापना",
"D_en": "Introduction of a new system of taxation", "D_hi": "कराधान की एक नई प्रणाली की शुरुआत",
"answer": "C",
"explanation_en": "The 74th Amendment to the Indian Constitution provides for the establishment of a district planning committee to prepare a draft development plan for the district.",
"explanation_hi": "भारतीय संविधान के 74वें संशोधन में जिले के लिए एक मसौदा विकास योजना तैयार करने के लिए एक जिला योजना समिति की स्थापना का प्रावधान है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the minimum number of members required for a Gram Sabha?",
"question_hi": "ग्राम सभा के लिए न्यूनतम सदस्य संख्या क्या है?",
"A_en": "10", "A_hi": "10",
"B_en": "20", "B_hi": "20",
"C_en": "50", "C_hi": "50",
"D_en": "No minimum limit", "D_hi": "न्यूनतम सीमा नहीं",
"answer": "D",
"explanation_en": "There is no minimum limit on the number of members required for a Gram Sabha, as it consists of all the registered voters in the area.",
"explanation_hi": "ग्राम सभा के लिए न्यूनतम सदस्य संख्या नहीं है, क्योंकि इसमें क्षेत्र के सभी पंजीकृत मतदाता शामिल होते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "Which article of the Indian Constitution deals with the provisions related to the Panchayati Raj system?",
"question_hi": "भारतीय संविधान का कौन सा अनुच्छेद पंचायती राज प्रणाली से संबंधित प्रावधानों से संबंधित है?",
"A_en": "Article 40", "A_hi": "अनुच्छेद 40",
"B_en": "Article 243", "B_hi": "अनुच्छेद 243",
"C_en": "Article 280", "C_hi": "अनुच्छेद 280",
"D_en": "Article 370", "D_hi": "अनुच्छेद 370",
"answer": "B",
"explanation_en": "Article 243 of the Indian Constitution deals with the provisions related to the Panchayati Raj system.",
"explanation_hi": "भारतीय संविधान का अनुच्छेद 243 पंचायती राज प्रणाली से संबंधित प्रावधानों से संबंधित है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the term of office for members of a Panchayat?",
"question_hi": "पंचायत के सदस्यों का कार्यकाल क्या है?",
"A_en": "3 years", "A_hi": "3 वर्ष",
"B_en": "4 years", "B_hi": "4 वर्ष",
"C_en": "5 years", "C_hi": "5 वर्ष",
"D_en": "6 years", "D_hi": "6 वर्ष",
"answer": "C",
"explanation_en": "The term of office for members of a Panchayat is 5 years.",
"explanation_hi": "पंचायत के सदस्यों का कार्यकाल 5 वर्ष है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the purpose of the State Election Commission?",
"question_hi": "राज्य निर्वाचन आयोग का उद्देश्य क्या है?",
"A_en": "To conduct elections to the state legislature", "A_hi": "राज्य विधायिका के लिए चुनाव आयोजित करने के लिए",
"B_en": "To conduct elections to the Panchayats and Municipalities", "B_hi": "पंचायतों और नगरपालिकाओं के लिए चुनाव आयोजित करने के लिए",
"C_en": "To oversee the functioning of the state government", "C_hi": "राज्य सरकार के कार्यों की देखरेख करने के लिए",
"D_en": "To investigate into the complaints against the state government", "D_hi": "राज्य सरकार के खिलाफ शिकायतों की जांच करने के लिए",
"answer": "B",
"explanation_en": "The State Election Commission is responsible for conducting elections to the Panchayats and Municipalities.",
"explanation_hi": "राज्य निर्वाचन आयोग पंचायतों और नगरपालिकाओं के लिए चुनाव आयोजित करने के लिए जिम्मेदार है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the significance of the 73rd Amendment to the Indian Constitution?",
"question_hi": "भारतीय संविधान के 73वें संशोधन का क्या महत्व है?",
"A_en": "It has led to the empowerment of the state governments", "A_hi": "इसने राज्य सरकारों को सशक्त बनाया है",
"B_en": "It has strengthened the Panchayati Raj system", "B_hi": "इसने पंचायती राज प्रणाली को मजबूत किया है",
"C_en": "It has reduced the powers of the local governments", "C_hi": "इसने स्थानीय सरकारों की शक्तियों को कम किया है",
"D_en": "It has increased the role of the central government in local affairs", "D_hi": "इसने स्थानीय मामलों में केंद्र सरकार की भूमिका को बढ़ाया है",
"answer": "B",
"explanation_en": "The 73rd Amendment to the Indian Constitution has strengthened the Panchayati Raj system by providing constitutional status to the three-tier Panchayat system.",
"explanation_hi": "भारतीय संविधान के 73वें संशोधन ने पंचायती राज प्रणाली को मजबूत किया है, जिसमें तीन-स्तरीय पंचायत प्रणाली को संवैधानिक दर्जा दिया गया है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "Which of the following is a function of the District Planning Committee?",
"question_hi": "निम्नलिखित में से कौन जिला योजना समिति का कार्य है?",
"A_en": "To prepare a plan for the district", "A_hi": "जिले के लिए एक योजना तैयार करना",
"B_en": "To implement the plan prepared by the state government", "B_hi": "राज्य सरकार द्वारा तैयार की गई योजना को लागू करना",
"C_en": "To monitor the progress of the plan", "C_hi": "योजना की प्रगति की निगरानी करना",
"D_en": "To allocate funds to the local governments", "D_hi": "स्थानीय सरकारों को धन आवंटित करना",
"answer": "A",
"explanation_en": "The District Planning Committee is responsible for preparing a plan for the district, which includes the plans prepared by the Panchayats and the Municipalities.",
"explanation_hi": "जिला योजना समिति जिले के लिए एक योजना तैयार करने के लिए जिम्मेदार है, जिसमें पंचायतों और नगरपालिकाओं द्वारा तैयार की गई योजनाएं शामिल हैं।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the role of the Gram Sabha in the Panchayati Raj system?",
"question_hi": "पंचायती राज प्रणाली में ग्राम सभा की भूमिका क्या है?",
"A_en": "To elect the members of the Panchayat", "A_hi": "पंचायत के सदस्यों का चुनाव करना",
"B_en": "To approve the budget of the Panchayat", "B_hi": "पंचायत के बजट को मंजूरी देना",
"C_en": "To oversee the functioning of the Panchayat", "C_hi": "पंचायत के कार्यों की देखरेख करना",
"D_en": "To identify the beneficiaries of the government schemes", "D_hi": "सरकारी योजनाओं के लाभार्थियों की पहचान करना",
"answer": "D",
"explanation_en": "The Gram Sabha plays a crucial role in identifying the beneficiaries of the government schemes and ensuring that the benefits reach the targeted groups.",
"explanation_hi": "ग्राम सभा सरकारी योजनाओं के लाभार्थियों की पहचान करने और यह सुनिश्चित करने में एक महत्वपूर्ण भूमिका निभाती है कि लाभ लक्षित समूहों तक पहुंचें।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the significance of the 74th Amendment to the Indian Constitution?",
"question_hi": "भारतीय संविधान के 74वें संशोधन का क्या महत्व है?",
"A_en": "It has led to the empowerment of the urban local bodies", "A_hi": "इसने नगरीय स्थानीय निकायों को सशक्त बनाया है",
"B_en": "It has strengthened the Panchayati Raj system", "B_hi": "इसने पंचायती राज प्रणाली को मजबूत किया है",
"C_en": "It has reduced the powers of the state governments", "C_hi": "इसने राज्य सरकारों की शक्तियों को कम किया है",
"D_en": "It has increased the role of the central government in local affairs", "D_hi": "इसने स्थानीय मामलों में केंद्र सरकार की भूमिका को बढ़ाया है",
"answer": "A",
"explanation_en": "The 74th Amendment to the Indian Constitution has led to the empowerment of the urban local bodies by providing constitutional status to the Municipalities.",
"explanation_hi": "भारतीय संविधान के 74वें संशोधन ने नगरपालिकाओं को संवैधानिक दर्जा देकर नगरीय स्थानीय निकायों को सशक्त बनाया है।"
}
]