[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the significant role of Gram Panchayats under the 73rd Amendment?",
"question_hi": "73वें संविधान के अधिकारी रोल क्या है।",
"A_en": "Administration and governance",
"A_hi": "वित्तीय और निद्यानबिहन",
"B_en": "Rural Development",
"B_hi": "उत्तम विकास",
"C_en": "Education Administration",
"C_hi": "शिक्षा परिधि",
"D_en": "Water Resources",
"D_hi": "पानी का वित्तीय संरक्षण",
"answer": "B",
"explanation_en": "Under the 73rd and 74th Amendments, Gram Panchayats play a significant role in rural development. The primary focus of Gram Panchayats is to improve the socio-economic conditions of the rural areas and provide basic services to the people living there. They are responsible for implementing various schemes and programs related to rural development.",
"explanation_hi": "73वे और 74वे संविधियों के अधिकारी रोल की प्रश्चार्यारी रोल के अधिकारी की प्रश्चार्यारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी रोल के अधिकारी री री के अधिकारी री अधिकारी री अधिकारी री री अधिकारी अधिकारी री अधिकारी री अधिकारी अधिकारी री अधिकारी री अधिकारी अधिकारी री अधिकारी री अधिकारी री अधिकारी री अधिकारी री अधिकारी री अधिकारी अधिकारी री अधिकारी री अधिकारी अधिकारी अधिकारी अधिकारी अधिकारी री अधिकारी री अधिकारी अधिकारी री अधिकारी री अधिकारी",
अधिकारी अधिकारी री अधिकारी अधिकारी अधिकारी अधिकारी री अधिकारी अधिकारी