<think>
Okay, let's tackle this task. The user wants 10 high-quality MCQs on the topic of Panchayati Raj and Nagariya Swashasan (73rd and 74th Amendments) in Indian Polity. Each question must be in both Hindi and English, with answers and explanations. The JSON structure is specific, so I need to make sure I follow it exactly.

First, I need to recall the key points of the 73rd and 74th Amendments. The 73rd Amendment is about Panchayati Raj Institutions (PRIs), and the 74th Amendment relates to urban local bodies. Important aspects include the constitutional status, structure, powers, and functions of these bodies. I should focus on details like the three-tier system, reservation for SCs/STs and women, financial provisions, and the roles of state and local governments.

Now, I need to generate questions that test understanding of these amendments. Let me start with the first question. The 73rd Amendment added Part IX to the Constitution, so a question on that could be good. The second question might be about the composition of Panchayats. Reservation of seats for SCs and STs is another key point. The 74th Amendment's addition to the Constitution is also important. I should cover the three tiers of PRIs: Gram Panchayat, Panchayat Samiti, and Zila Parishad. The role of the State Election Commission in conduct of elections is crucial. Financial provisions like the Finance Commission's recommendations under the 73rd Amendment would be a good question. The term of a Panchayat is another key detail. The 74th Amendment's main focus on urban local bodies like Municipalities. Lastly, the constitutional authority for urban local bodies is the 74th Amendment.

I need to ensure that each question has four options, with the correct answer indicated. The explanations should briefly summarize why the correct answer is right. I have to write both Hindi and English versions for each part. Let me check if all the questions are distinct and cover different aspects. Also, avoid any technical errors in the facts. For example, confirming that the 73rd Amendment added Part IX, and the 74th Amendment added Part IXA. Also, the reservation percentages for women in Panchayats is 33%, which is a known fact. The term of a Panchayat is 5 years, and the State Election Commission is established under the Constitution.

Now, structuring each JSON object with the correct keys: subject, topic, question_en, question_hi, options A-D in both languages, answer, and explanations. Need to ensure the JSON is valid, with proper commas and brackets. Let me verify each question's accuracy. For instance, the 74th Amendment deals with urban local bodies, and the 73rd with rural. The three tiers of PRIs are Gram Panchayat, Mandal Parishad, and Zila Parishad. The State Finance Commission is established under the 73rd Amendment, not the Union. The State Election Commission is under the 73rd Amendment. The 74th Amendment's Part IXA mentions urban local bodies. The percentage of women's reservation is 33% as per the 73rd Amendment. The term of a Municipal Corporation is 5 years under the 74th Amendment. The constitutional basis for urban local bodies is the 74th Amendment. The constitutional basis for rural local bodies is the 73rd Amendment. The role of the State Government in constituting urban local bodies is under the 74th Amendment.

I think that covers all the key points. Let me now put them into the JSON structure, making sure the Hindi and English options are correctly translated and the explanations are concise and accurate. Also, check that the answer options are correctly labeled (A, B, C, D) and that the answer key points to the correct option. Each question should be clear and unambiguous. Once done, validate the JSON to ensure there are no syntax errors. That should do it.
</think>

[
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which constitutional amendment added Part IX to the Constitution of India, dealing with Panchayati Raj?",
    "question_hi": "कौन सा संविधान संशोधन भारतीय संविधान में ग्रामीण स्वशासन (पंचायती राज) के संबंध में भाग IX जोड़ा गया था?",
    "A_en": "73rd Amendment",
    "A_hi": "73वां संशोधन",
    "B_en": "74th Amendment",
    "B_hi": "74वां संशोधन",
    "C_en": "72nd Amendment",
    "C_hi": "72वां संशोधन",
    "D_en": "71st Amendment",
    "D_hi": "71वां संशोधन",
    "answer": "A",
    "explanation_en": "The 73rd Constitutional Amendment Act, 1992 added Part IX to the Constitution to establish Panchayati Raj institutions.",
    "explanation_hi": "1992 के 73वें संविधान संशोधन अधिनियम ने पंचायती राज संस्थाओं की स्थापना के लिए संविधान में भाग IX जोड़ा।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the composition of the Panchayat at the village level?",
    "question_hi": "ग्राम स्तर पर पंचायत की संरचना क्या है?",
    "A_en": "Gram Panchayat",
    "A_hi": "ग्राम पंचायत",
    "B_en": "Panchayat Samiti",
    "B_hi": "पंचायत समिति",
    "C_en": "Zila Parishad",
    "C_hi": "जिला परिषद",
    "D_en": "Municipal Corporation",
    "D_hi": "नगर निगम",
    "answer": "A",
    "explanation_en": "The village-level Panchayat is known as Gram Panchayat.",
    "explanation_hi": "गांव के स्तर पर पंचायत को ग्राम पंचायत कहा जाता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which of the following is NOT a provision of the 73rd Amendment?",
    "question_hi": "निम्नलिखित में से कौन-सा 73वें संशोधन की एक प्रावधान नहीं है?",
    "A_en": "Reservation of seats for SCs and STs",
    "A_hi": "अनुसूचित जाति और अनुसूचित जनजाति के लिए सीटों का आरक्षण",
    "B_en": "Reservation of seats for women",
    "B_hi": "महिलाओं के लिए सीटों का आरक्षण",
    "C_en": "Constitution of State Finance Commission",
    "C_hi": "राज्य वित्त आयोग का गठन",
    "D_en": "Abolition of Panchayat system",
    "D_hi": "पंचायत प्रणाली का उन्मूलन",
    "answer": "D",
    "explanation_en": "The 73rd Amendment strengthened the Panchayat system by introducing reservations and financial provisions.",
    "explanation_hi": "73वें संशोधन ने आरक्षण और वित्तीय प्रावधानों के माध्यम से पंचायत प्रणाली को मजबूत किया।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the term of office for a Panchayat?",
    "question_hi": "एक पंचायत के कार्यकाल का समय क्या है?",
    "A_en": "3 years",
    "A_hi": "3 साल",
    "B_en": "4 years",
    "B_hi": "4 साल",
    "C_en": "5 years",
    "C_hi": "5 साल",
    "D_en": "6 years",
    "D_hi": "6 साल",
    "answer": "C",
    "explanation_en": "The 73rd Amendment fixed the term of Panchayats at five years.",
    "explanation_hi": "73वें संशोधन ने पंचायतों के कार्यकाल को पांच वर्ष तक सीमित कर दिया।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which constitutional amendment introduced Part IXA dealing with urban local governance?",
    "question_hi": "कौन सा संविधान संशोधन शहरी स्थानीय शासन के संबंध में भाग IXA शामिल करता है?",
    "A_en": "73rd Amendment",
    "A_hi": "73वां संशोधन",
    "B_en": "74th Amendment",
    "B_hi": "74वां संशोधन",
    "C_en": "75th Amendment",
    "C_hi": "75वां संशोधन",
    "D_en": "72nd Amendment",
    "D_hi": "72वां संशोधन",
    "answer": "B",
    "explanation_en": "The 74th Constitutional Amendment Act, 1992 added Part IXA to the Constitution for urban local bodies.",
    "explanation_hi": "1992 के 74वें संविधान संशोधन अधिनियम ने शहरी स्थानीय निकायों के लिए संविधान में भाग IXA जोड़ा।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the minimum age required to be a member of a Gram Panchayat?",
    "question_hi": "ग्राम पंचायत के सदस्य बनने के लिए न्यूनतम आयु सीमा क्या है?",
    "A_en": "18 years",
    "A_hi": "18 वर्ष",
    "B_en": "21 years",
    "B_hi": "21 वर्ष",
    "C_en": "25 years",
    "C_hi": "25 वर्ष",
    "D_en": "30 years",
    "D_hi": "30 वर्ष",
    "answer": "B",
    "explanation_en": "A person must be at least 21 years old to be a member of a Gram Panchayat.",
    "explanation_hi": "ग्राम पंचायत के सदस्य बनने के लिए एक व्यक्ति के कम से कम 21 वर्ष के होना आवश्यक है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What percentage of seats is reserved for women in Panchayati Raj institutions under the 73rd Amendment?",
    "question_hi": "73वें संशोधन के तहत पंचायती राज संस्थानों में महिलाओं के लिए कितने प्रतिशत सीटों का आरक्षण है?",
    "A_en": "30%",
    "A_hi": "30%",
    "B_en": "33%",
    "B_hi": "33%",
    "C_en": "25%",
    "C_hi": "25%",
    "D_en": "20%",
    "D_hi": "20%",
    "answer": "B",
    "explanation_en": "The 73rd Amendment reserves at least one-third of the total seats for women in Panchayati Raj institutions.",
    "explanation_hi": "73वें संशोधन ने पंचायती राज संस्थाओं में महिलाओं के लिए कुल सीटों के तिहाई तक आरक्षण किया है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which of the following is the highest authority in the Panchayati Raj system?",
    "question_hi": "निम्नलिखित में से कौन पंचायती राज प्रणाली में शीर्ष अधिकारी है?",
    "A_en": "Gram Panchayat",
    "A_hi": "ग्राम पंचायत",
    "B_en": "Gram Sabha",
    "B_hi": "ग्राम सभा",
    "C_en": "Panchayat Samiti",
    "C_hi": "पंचायत समिति",
    "D_en": "Zila Parishad",
    "D_hi": "जिला परिषद",
    "answer": "B",
    "explanation_en": "The Gram Sabha, consisting of all adult residents in a village, is the highest authority in the Panchayati Raj system.",
    "explanation_hi": "एक गांव में सभी वयस्क निवासियों वाली ग्राम सभा पंचायती राज प्रणाली में शीर्ष अधिकारी है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which body is responsible for conducting elections to Panchayats?",
    "question_hi": "पंचायतों के चुनाव कराने के लिए कौन सा निकाय जिम्मेदार है?",
    "A_en": "State Election Commission",
    "A_hi": "राज्य चुनाव आयोग",
    "B_en": "Election Commission of India",
    "B_hi": "भारतीय चुनाव आयोग",
    "C_en": "Zila Parishad",
    "C_hi": "जिला परिषद",
    "D_en": "Gram Sabha",
    "D_hi": "ग्राम सभा",
    "answer": "A",
    "explanation_en": "The State Election Commission was created under the 73rd Amendment to conduct elections to Panchayats.",
    "explanation_hi": "73वें संशोधन के तहत पंचायतों के चुनाव कराने के लिए राज्य चुनाव आयोग क