[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "Which of the following is a grassroots level institution in India?",
"question_hi": "भारत में कौन से नेतृत्व संस्था प्रमोट पर मिलता है?",
"A_en": "State Assembly",
"A_hi": "राजनीति मंत्री",
"B_en": "Panchayat",
"B_hi": "गांव",
"C_en": "MP",
"C_hi": "MP के लीया",
"D_en": "MP",
"D_hi": "में लीया",
"answer": "B",
"explanation_en": "The correct answer is B, Panchayat, which is a grassroots level institution in India under the Panchayat Raj system.\n\nIn the 73rd and 74th Amendments to the Constitution, Panchayats are the local self-government institutions at the village, tehsil, and district levels.\n\nIn Hindi (B), it can be translated as: 'Panchayat' is the correct answer, which is a local self-government institution at the village, tehsil, and district levels under the Panchayat Raj system in India. As per the 73rd and 74th Amendments to the Constitution, Panchayats are the institutions for local self-governance at the village, tehsil, and district levels.',
"explanation_hi": "ये प्रश्रेणी संस्थान को स्वती प्राधिकार संस्थान को स्वती प्राधिकारों को संस्थान की एम्यान को स्वती प्राधिकारों को संस्थान की एम्यान को संस्थान को स्वती प्राधिकारों को संस्थान की एम्यान को संस्थान को स्वती प्राधिकारों को संस्थान की एम्यान को संस्थान को स्वती प्राधिकारों को संस्थान को स्वती प्राधिकारों को संस्थान को स्वती प्राधिकारों को संस्थान को स्वती प्राधिकारों को संस्थान को स्वती प्राधिकारों को संस्थान को स्वती प्राधिकारों को संस्थान को स्वती प्राधिकारों को संस्थान को स्वती प्राधिकारों को संस्थान को स्वती प्राधिकारों को संस्थान को स्वती प्राधिकारों को संस्थान को स्वती प्राधिकारों को संस्थान को स्वती प्राधिकारों को संस्थान को स्वती पराधिकारों को संस्थान को स्वती पराधिकारों को संस्थान को स्वती पराधिकारो को स्थान को स्थान को संस्थान को स्थान को स्थान को सं्थान को स्थान को स्थान को स्थान को स्थान को स्थान को स्थान को",
 क्थान को स्थान को", को स्थान क्थान को", क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान क्थान