<think>
Okay, let's tackle this task. The user wants 10 high-quality MCQs on the topic of Panchayati Raj and Nagariya Swashasan, specifically the 73rd and 74th Amendments. The questions need to be in both Hindi and English, with explanations in both languages as well. They also need to follow a strict JSON structure and be in the testbook style.

First, I'll recall the key points of the 73rd and 74th Amendments. The 73rd Amendment is about Panchayati Raj institutions, giving them constitutional status and powers. The 74th Amendment relates to urban local bodies like municipalities. Important aspects include the three-tier structure, reservation for SC/ST and women, elections, and the powers delegated to these bodies.

I need to ensure that each question tests a specific part of these amendments. For example, one question could be about the constitutional amendments themselves, another about the structure, reservation percentages, powers, and roles. I should avoid overlapping topics but cover all critical areas.

Let me start with the first question: Identifying the constitutional amendments. Then move on to the three-tier system. Next, the reservation for scheduled castes and tribes. Maybe a question on the powers of panchayats under the 73rd Amendment. Then another on the 74th Amendment's focus areas. The role of the state government in elections, the minimum population for a municipality, the role of the Gram Sabha, the tenure of panchayats, and finally a question on the constitutional provision for urban local bodies.

Each question needs four options, with the correct answer marked. The explanations should be concise but informative. I'll need to translate both the questions and explanations accurately into Hindi. Also, ensuring that the JSON structure is correct without any markdown. Let me check each question for clarity and correctness, making sure there's no repetition and that all key points are covered.
</think>

[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "Which constitutional amendment provided constitutional status to Panchayati Raj institutions in India?",
"question_hi": "भारत में पंचायती राज संस्थाओं को संवैधानिक दर्जा किस संविधान संशोधन द्वारा प्रदान किया गया था?",
"A_en": "73rd Amendment", "A_hi": "73वां संशोधन",
"B_en": "74th Amendment", "B_hi": "74वां संशोधन",
"C_en": "72nd Amendment", "C_hi": "72वां संशोधन",
"D_en": "75th Amendment", "D_hi": "75वां संशोधन",
"answer": "A",
"explanation_en": "The 73rd Constitutional Amendment Act, 1992 established Panchayati Raj institutions as constitutional bodies.",
"explanation_hi": "1992 के 73वें संविधान संशोधन अधिनियम ने पंचायती राज संस्थाओं को संवैधानिक निकायों का दर्जा दिया।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the minimum population required for a town to be recognized as a municipality under the 74th Amendment?",
"question_hi": "74वें संशोधन के तहत शहर निकाय के रूप में स्वीकृति प्राप्त करने के लिए न्यूनतम जनसंख्या क्या है?",
"A_en": "5000", "A_hi": "5000",
"B_en": "10,000", "B_hi": "10,000",
"C_en": "15,000", "C_hi": "15,000",
"D_en": "20,000", "D_hi": "20,000",
"answer": "B",
"explanation_en": "The 74th Amendment Act, 1992 provides that towns with a minimum population of 10,000 can be recognized as municipalities.",
"explanation_hi": "1992 के 74वें संशोधन अधिनियम ने 10,000 की न्यूनतम जनसंख्या वाले शहरों को निकाय के रूप में मान्यता देने का प्रावधान किया।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the reservation percentage for Scheduled Castes and Scheduled Tribes in Panchayat seats as per the 73rd Amendment?",
"question_hi": "73वें संशोधन के अनुसार पंचायत बैठकों में अनुसूचित जाति और अनुसूचित जनजाति के लिए आरक्षण का प्रतिशत क्या है?",
"A_en": "50%", "A_hi": "50%",
"B_en": "33%", "B_hi": "33%",
"C_en": "25%", "C_hi": "25%",
"D_en": "20%", "D_hi": "20%",
"answer": "B",
"explanation_en": "The 73rd Amendment mandates 33% reservation for Scheduled Castes and Scheduled Tribes in panchayat seats.",
"explanation_hi": "73वें संशोधन में पंचायत बैठकों में अनुसूचित जाति और जनजाति के लिए 33% आरक्षण का आदेश दिया गया है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "Which body is responsible for conducting elections to the Panchayats as per the 73rd Amendment?",
"question_hi": "73वें संशोधन के अनुसार पंचायतों के चुनावों के आयोजन के लिए कौन निर्वाचन निकाय उत्तरदायी है?",
"A_en": "State Election Commission", "A_hi": "राज्य निर्वाचन आयोग",
"B_en": "Election Commission of India", "B_hi": "भारतीय निर्वाचन आयोग",
"C_en": "Gram Sabha", "C_hi": "ग्राम सभा",
"D_en": "District Collector", "D_hi": "जिला अधिकारी",
"answer": "A",
"explanation_en": "The 73rd Amendment mandates that the State Election Commission is responsible for conducting panchayat elections.",
"explanation_hi": "73वें संशोधन में पंचायत चुनावों के आयोजन के लिए राज्य निर्वाचन आयोग की जिम्मेदारी निर्दिष्ट की गई है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the tenure of Panchayats as per the 73rd Amendment?",
"question_hi": "73वें संशोधन के अनुसार पंचायतों की अवधि क्या है?",
"A_en": "3 years", "A_hi": "3 वर्ष",
"B_en": "5 years", "B_hi": "5 वर्ष",
"C_en": "7 years", "C_hi": "7 वर्ष",
"D_en": "10 years", "D_hi": "10 वर्ष",
"answer": "B",
"explanation_en": "The 73rd Amendment establishes a five-year tenure for panchayats.",
"explanation_hi": "73वें संशोधन में पंचायतों की अवधि पांच वर्ष निर्धारित की गई है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "Under the 74th Amendment, which of the following is NOT a function of urban local bodies?",
"question_hi": "74वें संशोधन के तहत शहरी स्थानीय निकायों का निम्नलिखित में से कौन सा कार्य नहीं है?",
"A_en": "Public health", "A_hi": "सार्वजनिक स्वास्थ्य",
"B_en": "Urban planning", "B_hi": "शहरी योजना",
"C_en": "Land revenue collection", "C_hi": "भूमि कर की वसूली",
"D_en": "Fire services", "D_hi": "अग्निशमन सेवा",
"answer": "C",
"explanation_en": "The 74th Amendment does not include land revenue collection as a function of urban local bodies.",
"explanation_hi": "74वें संशोधन में शहरी स्थानीय निकायों के लिए भूमि कर की वसूली को कार्य नहीं निर्दिष्ट किया गया है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "Which of the following is NOT a part of the three-tier Panchayati Raj structure?",
"question_hi": "निम्नलिखित में से कौन पंचायती राज तीन-स्तरीय संरचना का हिस्सा नहीं है?",
"A_en": "Gram Panchayat", "A_hi": "ग्राम पंचायत",
"B_en": "Panchayat Samiti", "B_hi": "पंचायत समिति",
"C_en": "Zila Parishad", "C_hi": "जिला परिषद",
"D_en": "Municipal Corporation", "D_hi": "नगर निगम",
"answer": "D",
"explanation_en": "Municipal Corporations are urban local bodies and not part of the three-tier Panchayati Raj system.",
"explanation_hi": "नगर निगम शहरी स्थानीय निकाय हैं और तीन-स्तरीय पंचायती राज प्रणाली का हिस्सा नहीं हैं।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the role of Gram Sabha under the 73rd Amendment?",
"question_hi": "73वें संशोधन के तहत ग्राम सभा की भूमिका क्या है?",
"A_en": "To conduct panchayat elections", "A_hi": "पंचायत चुनाव आयोजित करना",
"B_en": "To monitor panchayat functions", "B_hi": "पंचायत कार्यों की निगरानी करना",
"C_en": "To act as a deliberative body for the village", "C_hi": "गांव के लिए एक विचार-विमर्शक निकाय के रूप में कार्य करना",
"D_en": "All of the above", "D_hi": "उपरोक्त सभी",
"answer": "D",
"explanation_en": "The 73rd Amendment establishes Gram Sabha as both a deliberative body and a monitoring body for panchayat functions.",
"explanation_hi": "73वें संशोधन में ग्राम सभा को पंचायत कार्यों के लिए एक विचार-विमर्शक और निगरानी निकाय के रूप में स्थापित किया गया है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the minimum number of members required for a Panchayat as per the 73rd Amendment?",
"question_hi": "73वें संशोधन के अनुसार पंचायत के लिए न्यूनतम सदस्यों की संख्या क्या है?",
"A_en": "5", "A_hi": "5",
"B_en": "7", "B_hi": "7",
"C_en": "9", "C_hi": "9",
"D_en": "11", "D_hi": "11",
"answer": "B",
"explanation_en": "The 73rd Amendment mandates a minimum of 7 members for a panchayat.",
"explanation_hi": "73वें संशोधन में पंचायत के लिए न्यूनतम 7 सदस्यों का आदेश है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "Which of the following is NOT a function of urban local bodies under the 74th Amendment?",
"question_hi": "74वें संशोधन के तहत शहरी स्थानीय निकायों का निम्नलिखित में से कौन सा कार्य नहीं है?",
"A_en": "Water supply", "A_hi": "पानी की आपूर्ति",
"B_en": "Waste management", "B_hi": "कचरा प्रबंधन",
"C_en": "Law and order", "C_hi": "कानून और व्यवस्था",
"D_en": "Urban development", "D_hi": "शहरी विकास",
"answer": "C",
"explanation_en": "The 74th Amendment does not include law and order as a function of urban local bodies.",
"explanation_hi": "74वें संशोधन में शहरी स्थानीय निकायों के लिए कानून और व्यवस्था को कार्य नहीं निर्दिष्ट किया गया है।"
}
]