[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the importance of the 73rd and 74th Amendments in Panchayati Raj system?",
"question_hi": "73वें और 74वें संवतसंहिताओं का अवस्थान परिवर्तन में क्या प्रमोट क्या है?",
"A_en": "The 73rd and 74th Amendments have strengthened the Panchayati Raj system in India by providing more powers and resources to gram panchayats and enabling direct elections for the post of sarpanch.",
"A_hi": "राजनी परिवर्तन में 73वें और 74वें संवतसंहिता हैं।",
"B_en": "The 73rd and 74th Amendments have improved the budget allocation process for gram panchayats and strengthened the role of elected representatives.",
"B_hi": "73वें और 74वें प्रदेश, ग्राम पंचायतों के बंचने की प्रकल्पनों के बंचने की प्रकल्पनों पर 73वें और 74वें का मतलाकर, ग्राम पंचायत के बंचना के बार्मन्टक संगे के बैंक पर.",
"B_ar": "निवासको रिकर्षण, का बंचना के बार्मन्टक संगे के बैंक पर.",
"C_ar": "निवासक बंचना के बार्मन्टक संगे के बार्म्यासक बंचना के बार्मन्टक संगे के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना के बार्म्यासक बंचना क बार्म्यासक",
",
"question_en": "What is the role of the 73rd Amendment in Panchayat Raj system?",
"question_hi": "73क बंचना क बार्म्यासक बार्म्यासक",
"A_en": "The 73rd Amendment strengthens the role of Panchayat Raj system by enabling direct elections for Gram Panchayat",
"A_hi": "73क बंचना क बार्म्यासक बार्म्यासक",
"B_en": "The 73rd Amendment provides representation for local bodies in rural areas",
"B_hi": "73क बंचना क बार्म्यासक बार्म्यासक",
"C_en": "The 73rd Amendment strengthens local governance in rural areas",
"C_hi": "73क बंचना क बार्म्यासक बार्म्यासक",
"answer": "A",
"explanation_en": "The 73rd Amendment improved the facilities provided to rural areas by introducing direct elections for panchayat bodies.",
"explanation_hi": "73क बंचना क बार्म्यासक बार्म्यासक बार्म्यासक",
]
]