<think>
Okay, let's tackle this task. The user wants me to create 10 high-quality MCQs on the 73rd and 74th Amendments related to Panchayati Raj and Nagariya Swashasan in Indian Polity. They need to be in both Hindi and English, following a specific JSON structure. 

First, I need to recall the key points of these amendments. The 73rd Amendment is about Panchayats, and the 74th is about Municipalities. Important aspects include their constitutional status, structure, powers, and the year they were enacted.

I should start by listing out key facts. For example, the 73rd Amendment was enacted in 1992, introduced through a constitutional amendment. It's about local governance in rural areas. The 74th Amendment is for urban areas. Both are part of the 73rd and 74th schedules in the Constitution.

Next, think about possible questions. Maybe the year they came into effect, the structure of Panchayats (three-tier system), the powers given to them, the reservation of seats for SC/ST/other groups, and the role of states in their functioning. Also, the distinction between the two amendments.

Each question needs four options, with the correct answer and explanations in both languages. I need to make sure the options are tricky but accurate. For example, a question about the three-tier system: district, block, and village levels. Another could be about the election process, whether it's directly elected or nominated.

I should also check for any common misconceptions. For instance, some might confuse the 73rd and 74th Amendment details. Including a question that asks for the difference between them would help clarify.

Now, structuring each question. Let me start with the first one: What is the constitutional basis for Panchayats? The answer is the 73rd Amendment. Then another about the structure. Then the year. Reservation of seats for women, maybe? Yes, the 73rd Amendment mandates at least one-third of seats for women.

I need to ensure that each question is unique and covers different aspects. Also, avoid repetition. Let's see, maybe a question on the powers of the 74th Amendment, like the areas under municipal administration. Another about the role of the state government in their functioning.

Once the questions are drafted, I'll translate them into Hindi, keeping the terms correct. Then, create four options for each, making sure the correct answer is clear but the options are plausible. Explanations should be concise but informative.

Wait, I should also verify the numbers. For example, the 73rd Amendment has 11 chapters and 89 sections. Including a question on that could be good. Also, the 74th Amendment's constitutional amendment number is 74th, but the schedule is the 12th. Hmm, need to be precise.

Another point: both amendments came into force in 1993. The 73rd Amendment was passed in 1992 and came into effect in 1993. Similarly for the 74th. That's a key detail for a question.

I should also think about the structure of the Panchayat system. District level is called Zila Parishad, block level is Panchayat Samiti, and village level is Gram Panchayat. That's a good point for a question.

Now, compiling all these into 10 questions. Let me list them out:

1. Which amendment introduced the Panchayats as a constitutional entity?
2. How many tiers are there in the Panchayati Raj system?
3. What is the minimum age required to be a member of a Panchayat?
4. Which body is responsible for the delimitation of constituencies for local bodies?
5. What is the tenure of a Panchayat?
6. Which amendment reserves seats for women in local bodies?
7. What is the constitutional schedule that deals with Municipalities?
8. What percentage of seats are reserved for Scheduled Castes in Panchayats?
9. Which level of administration is responsible for the implementation of the 74th Amendment?
10. What is the name of the upper tier in the urban local government structure?

Wait, some of these might need adjustment. Let me check again. For example, the delimitation is done by the State Election Commission. The tenure is five years. The 73rd Amendment reserves one-third for women. The 12th schedule deals with urban areas. The upper tier in urban is the Municipal Corporation.

Once the questions are framed, I'll ensure that the options are correctly translated into Hindi and that the explanations are accurate. Also, checking for any possible errors in facts. For example, confirming the delimitation process and the exact percentage for SC/ST reservations, which is based on their population representation.

I think that's a solid set. Now, structuring each into the JSON format as per the example, making sure the keys are correct and the order is maintained. Each question must have all the required fields: subject, topic, question in both languages, options, answer, and explanations.
</think>

[
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which amendment act introduced the Panchayati Raj system as a constitutional entity?",
    "question_hi": "कौन सा संशोधन अधिनियम संवैधानिक निकाय के रूप में पंचायती राज व्यवस्था को पेश करता है?",
    "A_en": "71st Amendment", "A_hi": "71वां संशोधन",
    "B_en": "72nd Amendment", "B_hi": "72वां संशोधन",
    "C_en": "73rd Amendment", "C_hi": "73वां संशोधन",
    "D_en": "74th Amendment", "D_hi": "74वां संशोधन",
    "answer": "C",
    "explanation_en": "The 73rd Amendment Act of 1992 introduced the Panchayati Raj system as a constitutional entity.",
    "explanation_hi": "1992 के 73वें संशोधन अधिनियम ने पंचायती राज प्रणाली को एक संवैधानिक निकाय के रूप में पेश किया।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the minimum age required to be a member of a Panchayat?",
    "question_hi": "पंचायत के सदस्य बनने के लिए न्यूनतम आयु क्या है?",
    "A_en": "18 years", "A_hi": "18 वर्ष",
    "B_en": "21 years", "B_hi": "21 वर्ष",
    "C_en": "25 years", "C_hi": "25 वर्ष",
    "D_en": "30 years", "D_hi": "30 वर्ष",
    "answer": "B",
    "explanation_en": "The minimum age required to be a member of a Panchayat is 21 years.",
    "explanation_hi": "पंचायत के सदस्य बनने के लिए न्यूनतम आयु 21 वर्ष है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which body is responsible for delimitation of constituencies for local bodies?",
    "question_hi": "स्थानीय निकायों के लिए निर्वाचन क्षेत्रों के परिसीमन के लिए कौन उत्तरदायी है?",
    "A_en": "State Election Commission", "A_hi": "राज्य चुनाव आयोग",
    "B_en": "Constitutional Authority", "B_hi": "संवैधानिक प्राधिकरण",
    "C_en": "Gram Sabha", "C_hi": "ग्राम सभा",
    "D_en": "State Government", "D_hi": "राज्य सरकार",
    "answer": "A",
    "explanation_en": "The State Election Commission is responsible for delimiting constituencies for local bodies as per the 73rd Amendment.",
    "explanation_hi": "73वें संशोधन के अनुसार स्थानीय निकायों के लिए निर्वाचन क्षेत्रों के परिसीमन के लिए राज्य चुनाव आयोग उत्तरदायी है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the tenure of a Panchayat?",
    "question_hi": "एक पंचायत के कार्यकाल की अवधि क्या है?",
    "A_en": "3 years", "A_hi": "3 वर्ष",
    "B_en": "4 years", "B_hi": "4 वर्ष",
    "C_en": "5 years", "C_hi": "5 वर्ष",
    "D_en": "6 years", "D_hi": "6 वर्ष",
    "answer": "C",
    "explanation_en": "The tenure of a Panchayat is 5 years.",
    "explanation_hi": "एक पंचायत के कार्यकाल की अवधि 5 वर्ष है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which amendment reserves seats for women in local self-governance bodies?",
    "question_hi": "स्थानीय स्वशासन निकायों में महिलाओं के लिए सीटों का आरक्षण किस संशोधन के द्वारा किया गया है?",
    "A_en": "71st Amendment", "A_hi": "71वां संशोधन",
    "B_en": "72nd Amendment", "B_hi": "72वां संशोधन",
    "C_en": "73rd Amendment", "C_hi": "73वां संशोधन",
    "D_en": "74th Amendment", "D_hi": "74वां संशोधन",
    "answer": "C",
    "explanation_en": "The 73rd Amendment mandates at least one-third of seats for women in local self-governance bodies.",
    "explanation_hi": "73वें संशोधन में निर्देशित किया गया है कि स्थानीय स्वशासन निकायों में महिलाओं के लिए न्यूनतम एक-तिहाई सीटों का आरक्षण किया जाएगा।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the constitutional schedule that deals with Municipalities?",
    "question_hi": "कौन सा संवैधानिक अनुसूची नगर परिषदों के बारे में है?",
    "A_en": "11th Schedule", "A_hi": "11वीं अनुसूची",
    "B_en": "12th Schedule", "B_hi": "12वीं अनुसूची",
    "C_en": "13th Schedule", "C_hi": "13वीं अनुसूची",
    "D_en": "14th Schedule", "D_hi": "14वीं अनुसूची",
    "answer": "B",
    "explanation_en": "The 12th Schedule of the Constitution outlines the powers and functions of Municipalities as introduced by the 74th Amendment.",
    "explanation_hi": "संविधान की 12वीं अनुसूची 74वें संशोधन द्वारा पेश की गई नगर परिषदों की शक्तियों और कार्यों का वर्णन करती है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What percentage of seats are reserved for Scheduled Castes in Panchayats?",
    "question_hi": "पंचायतों में अनुसूचित जातियों के लिए कितने प्रतिशत सीटों का आरक्षण है?",
    "A_en": "10%", "A_hi": "10%",
    "B_en": "15%", "B_hi": "15%",
    "C_en": "Dependent on population representation", "C_hi": "जनसंख्या प्रतिनिधित्व पर निर्भर",
    "D_en": "25%", "D_hi": "25%",
    "answer": "C",
    "explanation_en": "The reservation of seats for Scheduled Castes in Panchayats is based on their population representation in the area.",
    "explanation_hi": "अनुसूचित जातियों के लिए पंचायतों में सीटों का आरक्षण क्षेत्र में उनके जनसंख्या प्रतिनिधित्व पर आधारित है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which level of administration is responsible for the implementation of the 74th Amendment?",
    "question_hi": "74वें संशोधन के कार्यान्वयन के लिए कौन सा प्रशासनिक स्तर उत्तरदायी है?",
    "A_en": "Central Government", "A_hi": "केंद्र सरकार",
    "B_en": "State Government", "B_hi": "राज्य सरकार",
    "C_en": "Local Bodies", "C_hi": "स्थानीय निकाय",
    "D_en": "Gram Sabha", "D_hi": "ग्राम सभा",
    "answer": "B",
    "explanation_en": "The 74th Amendment mandates that the State Government is responsible for the implementation of urban local governance.",
    "explanation_hi": "74वें संशोधन में निर्देशित किया गया है कि शहरी स्थानीय शासन के कार्यान्वयन के लिए राज्य सरकार उत्तरदायी है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the upper tier in the urban local government structure under the 74th Amendment?",
    "question_hi": "74वें संशोधन के तहत शहरी स्थानीय सर