<think>
Okay, I need to create 10 high-quality MCQs on Indian Polity focusing on the 73rd and 74th Amendments related to Panchayati Raj and Nagariya Swashasan. Let me start by recalling the key points of these amendments. The 73rd Amendment, 1992, deals with Panchayati Raj, introducing a three-tier structure at the village, block, and district levels. It mandates regular elections, reservation for SCs, STs, and women. The 74th Amendment, 1992, addresses urban local bodies like municipalities, also establishing their structure and functions.

First question: What is the minimum age for membership in a Panchayat? From what I remember, it's 21 years. The 73rd Amendment likely set this, similar to the Lok Sabha. So the options would include 18, 21, 25, 30. Answer is B.

Second question: What percentage of seats must be reserved for women in Panchayats? According to the 73rd Amendment, it's at least one-third. So options could be 25%, 33%, 50%, 75%. Answer is B.

Third question: The 74th Amendment relates to which local governance structure? The answer is Municipalities. So options include Panchayats, Municipalities, Zila Parishads, Corporations. Answer is B.

Fourth question: The three-tier system in Panchayati Raj includes which levels? Village, Block, District. So the options should list these three. Answer is A.

Fifth question: Which body prepares the electoral rolls for Panchayats? The District Election Commission, as per the 73rd Amendment. So options include District Collector, State Election Commission, District Election Commission, Gram Sabha. Answer is C.

Sixth question: What is the term of office for members of a Panchayat? Five years, same as the Lok Sabha. Options: 3, 4, 5, 6. Answer is C.

Seventh question: The 73rd Amendment was passed in which year? 1992. So options: 1990, 1992, 1994, 1996. Answer is B.

Eighth question: Which state was the first to implement the 73rd Amendment? Rajasthan, I think. So options include Gujarat, Rajasthan, Kerala, Tamil Nadu. Answer is B.

Ninth question: What is the minimum age to contest elections to a Municipality under the 74th Amendment? 21 years, same as Panchayats. Options: 18, 21, 25, 30. Answer is B.

Tenth question: Which of the following functions is not a responsibility of a Municipality? Defense is not under municipalities. So options: Sanitation, Education, Defense, Water supply. Answer is C.

Now, I need to structure these into the JSON format provided, ensuring both Hindi and English for each question and options. Also, explanations should be concise and accurate. Let me verify each point for correctness. For example, the first question's explanation should confirm the minimum age from the 73rd Amendment. The eighth question might need checking the state that first implemented the amendment—some sources say Rajasthan, others might differ, but it's commonly cited. Okay, I think that covers all the necessary points. Time to format the JSON accordingly.
</think>

[
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "What is the minimum age for membership in a Panchayat as per the 73rd Amendment?",
        "question_hi": "73वें संविधान संशोधन के अनुसार पंचायत में सदस्यता के लिए न्यूनतम आयु क्या है?",
        "A_en": "18 years", "A_hi": "18 वर्ष",
        "B_en": "21 years", "B_hi": "21 वर्ष",
        "C_en": "25 years", "C_hi": "25 वर्ष",
        "D_en": "30 years", "D_hi": "30 वर्ष",
        "answer": "B",
        "explanation_en": "The 73rd Amendment Act, 1992 mandates that the minimum age for membership in a Panchayat is 21 years.",
        "explanation_hi": "1992 के 73वें संशोधन अध्यादेश के अनुसार पंचायत में सदस्यता के लिए न्यूनतम आयु 21 वर्ष है।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "What percentage of seats must be reserved for women in Panchayats under the 73rd Amendment?",
        "question_hi": "73वें संशोधन के अनुसार पंचायतों में महिलाओं के लिए कम से कम कितने प्रतिशत सीटों का आरक्षण किया जाना आवश्यक है?",
        "A_en": "25%", "A_hi": "25%",
        "B_en": "33%", "B_hi": "33%",
        "C_en": "50%", "C_hi": "50%",
        "D_en": "75%", "D_hi": "75%",
        "answer": "B",
        "explanation_en": "The 73rd Amendment requires that at least one-third of the seats in Panchayats be reserved for women.",
        "explanation_hi": "73वें संशोधन में निर्धारित है कि पंचायतों में महिलाओं के लिए कम से कम एक-तिहाई सीटों का आरक्षण किया जाना आवश्यक है।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "Which local governance structure is primarily addressed by the 74th Amendment to the Indian Constitution?",
        "question_hi": "भारतीय संविधान के 74वें संशोधन द्वारा मुख्य रूप से किस स्थानीय शासन संरचना पर ध्यान केंद्रित किया गया है?",
        "A_en": "Panchayats", "A_hi": "पंचायतें",
        "B_en": "Municipalities", "B_hi": "नगर पालिकाएं",
        "C_en": "Zila Parishads", "C_hi": "जिला परिषदें",
        "D_en": "Corporations", "D_hi": "कॉर्पोरेशन",
        "answer": "B",
        "explanation_en": "The 74th Amendment to the Indian Constitution primarily addresses urban local governance through Municipalities.",
        "explanation_hi": "भारतीय संविधान के 74वें संशोधन मुख्य रूप से शहरी स्थानीय शासन को नगर पालिकाओं के माध्यम से नियंत्रित करता है।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "What is the three-tier system of Panchayati Raj introduced by the 73rd Amendment?",
        "question_hi": "73वें संशोधन द्वारा पंचायती राज की तीन स्तरीय प्रणाली क्या है?",
        "A_en": "Village, Block, District", "A_hi": "ग्राम, ब्लॉक, जिला",
        "B_en": "State, District, Block", "B_hi": "राज्य, जिला, ब्लॉक",
        "C_en": "Taluka, District, State", "C_hi": "तहसील, जिला, राज्य",
        "D_en": "Village, State, Country", "D_hi": "गाँव, राज्य, देश",
        "answer": "A",
        "explanation_en": "The 73rd Amendment established a three-tier system of Panchayati Raj at the village, block, and district levels.",
        "explanation_hi": "73वें संशोधन द्वारा पंचायती राज की तीन स्तरीय प्रणाली ग्राम, ब्लॉक और जिला स्तरों पर स्थापित की गई।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "Which body is responsible for preparing electoral rolls for Panchayats?",
        "question_hi": "पंचायतों के मतदाता निबंधन रोल की तैयारी किस निकाय द्वारा की जाती है?",
        "A_en": "District Collector", "A_hi": "जिला अधिकारी",
        "B_en": "State Election Commission", "B_hi": "राज्य चुनाव आयोग",
        "C_en": "District Election Commission", "C_hi": "जिला चुनाव आयोग",
        "D_en": "Gram Sabha", "D_hi": "ग्राम सभा",
        "answer": "C",
        "explanation_en": "The District Election Commission is responsible for preparing electoral rolls for Panchayats.",
        "explanation_hi": "जिला चुनाव आयोग पंचायतों के मतदान पत्रकों की तैयारी करता है।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "What is the term of office for members of a Panchayat?",
        "question_hi": "एक पंचायत के सदस्यों का कार्यकाल कितना होता है?",
        "A_en": "3 years", "A_hi": "3 वर्ष",
        "B_en": "4 years", "B_hi": "4 वर्ष",
        "C_en": "5 years", "C_hi": "5 वर्ष",
        "D_en": "6 years", "D_hi": "6 वर्ष",
        "answer": "C",
        "explanation_en": "The 73rd Amendment Act specifies that the term of office for Panchayat members is five years.",
        "explanation_hi": "73वें संशोधन अध्यादेश के अनुसार पंचायत सदस्यों का कार्यकाल पांच वर्ष होता है।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "In which year was the 73rd Amendment to the Indian Constitution passed?",
        "question_hi": "भारतीय संविधान का 73वां संशोधन किस वर्ष पारित किया गया था?",
        "A_en": "1990", "A_hi": "1990",
        "B_en": "1992", "B_hi": "1992",
        "C_en": "1994", "C_hi": "1994",
        "D_en": "1996", "D_hi": "1996",
        "answer": "B",
        "explanation_en": "The 73rd Amendment to the Indian Constitution was passed in 1992.",
        "explanation_hi": "भारतीय संविधान का 73वां संशोधन 1992 में पारित किया गया था।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "Which state was the first to implement the 73rd Amendment?",
        "question_hi": "कौन सा राज्य 73वें संशोधन के लागू करने वाला पहला राज्य था?",
        "A_en": "Gujarat", "A_hi": "गुजरात",
        "B_en": "Rajasthan", "B_hi": "राजस्थान",
        "C_en": "Kerala", "C_hi": "केरला",
        "D_en": "Tamil Nadu", "D_hi": "तमिल नाडू",
        "answer": "B",
        "explanation_en": "Rajasthan was the first state to implement the provisions of the 73rd Amendment.",
        "explanation_hi": "राजस्थान 73वें संशोधन के प्रावधानों को लागू करने वाला पहला राज्य था।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "What is the minimum age to contest elections to a Municipality under the 74th Amendment?",
        "question_hi": "74वें संशोधन के अनुसार नगर पालिका के चुनाव में भाग लेने के लिए न्यूनतम आयु क्या है?",
        "A_en": "18 years", "A_hi": "18 वर्ष",
        "B_en": "21 years", "B_hi": "21 वर्ष",
        "C_en": "25 years", "C_hi": "25 वर्ष",
        "D_en": "30 years", "D_hi": "30 वर्ष",
        "answer": "B",
        "explanation_en": "The 74th Amendment Act sets the minimum age to contest elections to a Municipality at 21 years.",
        "explanation_hi": "74वें संशोधन अध्यादेश में नगर पालिका के चुनाव में भाग लेने के लिए न्यूनतम आयु 21 वर्ष निर्धारित की गई है।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "Which of the following is not a function of a Municipality under the 74th Amendment?",
        "question_hi": "निम्नलिखित में से कौन-सा 74वें संशोधन के तहत नगर पाल