<think>
Okay, I need to create 10 high-quality MCQs on the topic of Panchayati Raj and Nagar Nigam Swashasan, focusing on the 73rd and 74th Amendments. Let me start by recalling the key points of these amendments.

The 73rd Amendment Act, 1992, deals with Panchayati Raj institutions. It provides for the establishment of a three-tier system at the village, block, and district levels. It mandates regular elections, reservation of seats for SCs, STs, and OBCs, and the inclusion of women. The 74th Amendment Act, 1992, is about urban local bodies, establishing a three-tier structure for cities, towns, and urban areas. Both amendments aim to decentralize governance and empower local bodies.

First question: What is the minimum age for being a member of a Panchayat? I know it's 21 years as per the 73rd Amendment. Let me confirm that. Yes, Section 8 of the 73rd Amendment Act states 21 as the minimum age.

Second question: Which amendment introduced the three-tier system in Panchayati Raj? Definitely the 73rd Amendment. The three tiers are Gram Panchayat, Panchayat Samiti, and Zila Parishad.

Third question: Reservation of seats for SCs/STs and OBCs in the Panchayats. The amendment mandates reservation, with at least one-third for women. The 73rd Amendment requires 1/3rd reservation for women, and similarly, 1/3rd for SC/ST in areas with their population.

Fourth question: The 74th Amendment established urban local bodies. The three tiers are Nagar Panchayat, Nagar Nigam, and Municipal Corporation. Wait, no, the 74th Amendment's structure is Municipalities for urban areas, which can be of different types depending on size. But the question is about the three tiers. Wait, maybe the three tiers are Nagar Panchayat (for transitional areas), Municipality (for towns), and Municipal Corporation (for cities). I need to check that. Yes, the 74th Amendment Act provides for a three-tier system for urban local bodies: Nagar Panchayat, Municipality, and Municipal Corporation, based on the population and size of the urban area.

Fifth question: Who is the head of the Panchayat at the village level? The head is called the Sarpanch. The 73rd Amendment established the Sarpanch as the head of the Gram Panchayat.

Sixth question: The 73rd Amendment mandates the state government to constitute a State Election Commission. The SEC is responsible for conducting elections to the Panchayats. So, the question can ask about the body responsible for elections to the Panchayats.

Seventh question: What is the term of office for a member of a Panchayat? It's five years, as per the 73rd Amendment, Section 13.

Eighth question: The 74th Amendment Act deals with which type of local governance? The answer is urban local bodies.

Ninth question: Which article of the Indian Constitution deals with the constitutional provisions for urban local bodies? Article 243P, which was added by the 74th Amendment.

Tenth question: The 73rd Amendment Act was enacted in which year? 1992. The 73rd and 74th Amendments both came in 1992.

Wait, need to make sure each question is unique and covers different aspects. Let me check each point again to avoid repetition. Also, ensure the options are plausible and the answers are correct. For example, in the question about the head of the Panchayat, options might include options like Gram Pradhan or others, but the correct answer is Sarpanch. Similarly, for the urban local bodies, the three-tier system includes the correct terms.

I should also include explanations for each answer to clarify why the correct option is right. The explanations need to be concise but informative, referencing the amendment or section numbers where applicable.

Let me structure each question step by step, ensuring that the questions cover various aspects like constitutional provisions, structures, reservations, election commissions, term periods, and the years of enactment. This should provide a comprehensive set of questions that test the understanding of the 73rd and 74th Amendments.
</think>

[
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which Amendment Act introduced the three-tier system of Panchayati Raj in India?",
    "question_hi": "भारत में पंचायती राज की तीन-स्तरीय प्रणाली किस संशोधन अधिनियम द्वारा शुरू की गई थी?",
    "A_en": "73rd Amendment Act, 1992",
    "A_hi": "73वां संशोधन अधिनियम, 1992",
    "B_en": "74th Amendment Act, 1992",
    "B_hi": "74वां संशोधन अधिनियम, 1992",
    "C_en": "72nd Amendment Act, 1992",
    "C_hi": "72वां संशोधन अधिनियम, 1992",
    "D_en": "71st Amendment Act, 1992",
    "D_hi": "71वां संशोधन अधिनियम, 1992",
    "answer": "A",
    "explanation_en": "The 73rd Amendment Act, 1992 established the three-tier Panchayati Raj system at the village, block, and district levels.",
    "explanation_hi": "73वां संशोधन अधिनियम, 1992 ने गांव, ब्लॉक और जिला स्तरों पर तीन-स्तरीय पंचायती राज प्रणाली स्थापित किया।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the minimum age required to be a member of a Panchayat under the 73rd Amendment?",
    "question_hi": "73वें संशोधन के तहत एक पंचायत के सदस्य बनने के लिए न्यूनतम आयु क्या है?",
    "A_en": "25 years",
    "A_hi": "25 वर्ष",
    "B_en": "30 years",
    "B_hi": "30 वर्ष",
    "C_en": "18 years",
    "C_hi": "18 वर्ष",
    "D_en": "21 years",
    "D_hi": "21 वर्ष",
    "answer": "D",
    "explanation_en": "Section 8 of the 73rd Amendment Act mandates that the minimum age for a Panchayat member is 21 years.",
    "explanation_hi": "73वें संशोधन अधिनियम की धारा 8 में निर्धारित है कि एक पंचायत के सदस्य की न्यूनतम आयु 21 वर्ष होनी चाहिए।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which of the following is NOT a reservation mandate under the 73rd Amendment?",
    "question_hi": "निम्नलिखित में से कौन 73वें संशोधन के तहत आरक्षण का आदेश नहीं है?",
    "A_en": "Reservation for SCs/STs",
    "A_hi": "अनुसूचित जाति/अनुसूचित जनजाति के लिए आरक्षण",
    "B_en": "Reservation for OBCs",
    "B_hi": "अन्य पिछड़ा वर्ग के लिए आरक्षण",
    "C_en": "Reservation for women",
    "C_hi": "महिलाओं के लिए आरक्षण",
    "D_en": "Reservation for disabled persons",
    "D_hi": "अक्षम व्यक्तियों के लिए आरक्षण",
    "answer": "D",
    "explanation_en": "The 73rd Amendment mandates reservations for SCs/STs, OBCs, and women. Reservation for disabled persons is not a constitutional provision under this amendment.",
    "explanation_hi": "73वें संशोधन में अनुसूचित जाति/जनजाति, आरक्षित जाति और महिलाओं के लिए आरक्षण है। अक्षम व्यक्तियों के लिए आरक्षण इस संशोधन के तहत संवैधानिक आवश्यकता नहीं है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Who is the head of the Panchayat at the village level?",
    "question_hi": "गांव के स्तर पर पंचायत का मुखिया कौन होता है?",
    "A_en": "Sarpanch",
    "A_hi": "सरपंच",
    "B_en": "Pradhan",
    "B_hi": "प्रधान",
    "C_en": "Mayor",
    "C_hi": "मेयर",
    "D_en": "Chairperson",
    "D_hi": "चेयरपर्सन",
    "answer": "A",
    "explanation_en": "The Sarpanch is the elected head of the Gram Panchayat at the village level under the 73rd Amendment.",
    "explanation_hi": "73वें संशोधन के तहत गांव के स्तर पर ग्राम पंचायत का निर्वाचित मुखिया सरपंच होता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which of the following is NOT a local body under the 74th Amendment Act?",
    "question_hi": "निम्नलिखित में से कौन 74वें संशोधन अधिनियम के तहत स्थानीय निकाय नहीं है?",
    "A_en": "Nagar Panchayat",
    "A_hi": "नगर पंचायत",
    "B_en": "Municipal Corporation",
    "B_hi": "महानगर पालिका",
    "C_en": "Zila Parishad",
    "C_hi": "जिला परिषद",
    "D_en": "Municipality",
    "D_hi": "नगर पालिका",
    "answer": "C",
    "explanation_en": "The 74th Amendment Act governs urban local bodies like Nagar Panchayat, Municipality, and Municipal Corporation. Zila Parishad is a Panchayati Raj institution under the 73rd Amendment.",
    "explanation_hi": "74वें संशोधन अधिनियम शहरी स्थानीय निकायों जैसे नगर पंचायत, नगर पालिका और महानगर पालिका को नियंत्रित करता है। जिला परिषद 73वें संशोधन के तहत पंचायती राज संस्था है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the term of office for a member of a Panchayat?",
    "question_hi": "एक पंचायत के सदस्य के कार्यकाल की अवधि क्या है?",
    "A_en": "3 years",
    "A_hi": "3 वर्ष",
    "B_en": "4 years",
    "B_hi": "4 वर्ष",
    "C_en": "5 years",
    "C_hi": "5 वर्ष",
    "D_en": "6 years",
    "D_hi": "6 वर्ष",
    "answer": "C",
    "explanation_en": "Section 13 of the 73rd Amendment Act mandates a five-year term for all Panchayat members.",
    "explanation_hi": "73वें संशोधन अधिनियम की धारा 13 में सभी पंचायत सदस्यों के लिए पांच वर्ष का कार्यकाल आवश्यकता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which body is responsible for conducting elections to the Panchayats?",
    "question_hi": "पंचायतों के चुनाव कराने के लिए कौन सी शक्ति जिम्मेदार है?",
    "A_en": "Election Commission of India",
    "A_hi": "भारत चुनाव आयोग",
    "B_en": "State Election Commission",
    "B_hi": "राज्य चुनाव आयोग",
    "C_en": "Local Government Department",
    "C_hi": "स्थानीय सरकार विभाग",
    "D_en": "Gram Sabha",
    "D_hi": "ग्राम सभा",
    "answer": "B",
    "explanation_en": "The 73rd Amendment Act mandates the formation of a State Election Commission for conducting Panchayat elections.",
    "explanation_hi": "73वें संशोधन अधिनियम में पंचायत चुनावों के आयोजन के लिए राज्य चुनाव आयोग की रचना करने की आवश्यकता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which of the following is a constitutional body established by the 74th Amendment?",
    "question_hi": "निम्नलिखित में से कौन 74वें संशोधन द्वारा नियुक्त संवैधानिक निकाय है?",
    "A_en": "State Election Commission",
    "A_hi": "राज्य चुनाव आयोग",
    "B_en": "Municipal Corporation",
    "B_hi": "महानगर पालिका",
    "C_en": "Urban Development Authority",
    "C_hi": "शहरी विकास प्राधिकरण",
    "D