<think>
Okay, I need to create 10 high-quality MCQs on the topic of Panchayati Raj and Nagariya Swashasan, focusing on the 73rd and 74th Amendments. The user wants the questions in both Hindi and English, with explanations in both languages as well. Let me start by recalling the key points of these amendments.

The 73rd Amendment Act, 1992, relates to Panchayati Raj institutions, while the 74th Amendment Act, 1992, is about urban local bodies. Both amendments came into effect in 1993. The 73rd Amendment provides for a three-tier structure of Panchayats: Gram Panchayat, Panchayat Samiti, and Zila Parishad. It mandates that at least one-third of the seats be reserved for women. The 74th Amendment deals with municipalities, establishing a structure for urban local governance.

Now, I should think of common exam questions related to these amendments. Questions might cover the year of enactment, key provisions like reservation of seats, the structure of the institutions, and the constitutional amendments involved. Also, possible questions could be about the constitutional status, who is responsible for the establishment, and the scope of functions.

Let me list out potential questions:

1. Which Constitution Amendment Act introduced the Panchayati Raj system in India?
2. What is the minimum age for a person to become a member of a Panchayat?
3. What is the tenure of a Panchayat?
4. Which level of Panchayat operates at the village level?
5. What is the minimum number of members a Panchayat can have?
6. What percentage of seats in Panchayats is reserved for women?
7. Which amendment deals with urban local governance (Municipalities)?
8. What is the structure of urban local bodies under the 74th Amendment?
9. What is the term of office for a Municipal Council?
10. Which authority is responsible for the preparation of electoral rolls for Panchayats?

For each question, I need to ensure that the correct answer is accurate and aligns with the constitutional provisions. For example, the 73rd Amendment is 1992, but the effective date is 1993. The age for Panchayat membership is 21, as per the 73rd Amendment. The 74th Amendment deals with Municipalities, so questions on urban areas would reference that. The reservation for women is 33%, and the structure includes Municipalities, Municipal Corporations, etc.

I need to be careful with the details. For instance, the 73rd Amendment is about rural, the 74th about urban. The question about the structure of Panchayats would be three-tier. Also, the term for Panchayats is 5 years, and for Municipalities as well. The preparation of electoral rolls would be done by the State Election Commission.

Now, translating these into Hindi without any errors. Ensure that the options are correctly ordered and that the explanations are clear in both languages. Check for any possible confusion between the two amendments. For example, mixing up the years or the reserved percentages. Also, verify that the correct terms are used in Hindi, like "ग्राम पंचायत" for Gram Panchayat.

After drafting all questions, I'll review them to ensure they are of the right difficulty level for exams like Rajasthan LDC, CET, RAS, SSC, and Railway NTPC. The questions should not be too straightforward but should test the understanding of the key aspects of the amendments. The answers should be unambiguous, and the explanations should clarify any nuances, like the effective date versus the enactment date.
</think>

[
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which Constitution Amendment Act introduced the Panchayati Raj system in India?",
    "question_hi": "भारत में पंचायती राज प्रणाली को कौन सा संविधान संशोधन अधिनियम लागू करता है?",
    "A_en": "73rd Constitution Amendment Act, 1992",
    "A_hi": "73वां संविधान संशोधन अधिनियम, 1992",
    "B_en": "74th Constitution Amendment Act, 1992",
    "B_hi": "74वां संविधान संशोधन अधिनियम, 1992",
    "C_en": "72nd Constitution Amendment Act, 2002",
    "C_hi": "72वां संविधान संशोधन अधिनियम, 2002",
    "D_en": "75th Constitution Amendment Act, 1995",
    "D_hi": "75वां संविधान संशोधन अधिनियम, 1995",
    "answer": "A",
    "explanation_en": "The 73rd Constitution Amendment Act, 1992, introduced the Panchayati Raj system in India, effective from April 24, 1993.",
    "explanation_hi": "73वां संविधान संशोधन अधिनियम, 1992, भारत में पंचायती राज प्रणाली को लागू करता है, जो 24 अप्रैल, 1993 से प्रभावी हुआ।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the minimum age for a person to become a member of a Panchayat?",
    "question_hi": "पंचायत के सदस्य बनने के लिए एक व्यक्ति की न्यूनतम आयु क्या है?",
    "A_en": "18 years",
    "A_hi": "18 वर्ष",
    "B_en": "21 years",
    "B_hi": "21 वर्ष",
    "C_en": "25 years",
    "C_hi": "25 वर्ष",
    "D_en": "30 years",
    "D_hi": "30 वर्ष",
    "answer": "B",
    "explanation_en": "The 73rd Amendment Act, 1992, sets the minimum age for a Panchayat member as 21 years.",
    "explanation_hi": "73वां संशोधन अधिनियम, 1992, से पंचायत के सदस्य की न्यूनतम आयु 21 वर्ष निर्धारित की गई है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the tenure of a Panchayat?",
    "question_hi": "एक पंचायत के कार्यकाल का समय क्या है?",
    "A_en": "4 years",
    "A_hi": "4 वर्ष",
    "B_en": "5 years",
    "B_hi": "5 वर्ष",
    "C_en": "6 years",
    "C_hi": "6 वर्ष",
    "D_en": "7 years",
    "D_hi": "7 वर्ष",
    "answer": "B",
    "explanation_en": "The tenure of a Panchayat is 5 years as per the 73rd Amendment Act, 1992.",
    "explanation_hi": "73वां संशोधन अधिनियम, 1992 के अनुसार पंचायत का कार्यकाल 5 वर्ष होता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which level of Panchayat operates at the village level?",
    "question_hi": "गांव के स्तर पर कौन सा पंचायत स्तर काम करता है?",
    "A_en": "Zila Parishad",
    "A_hi": "जिला परिषद",
    "B_en": "Panchayat Samiti",
    "B_hi": "पंचायत समिति",
    "C_en": "Gram Panchayat",
    "C_hi": "ग्राम पंचायत",
    "D_en": "Municipal Corporation",
    "D_hi": "नगर निगम",
    "answer": "C",
    "explanation_en": "Gram Panchayat is the lowest level of Panchayati Raj structure, functioning at the village level.",
    "explanation_hi": "ग्राम पंचायत पंचायती राज संरचना का सबसे नीचे का स्तर है, जो गांव के स्तर पर काम करता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the minimum number of members a Panchayat can have?",
    "question_hi": "एक पंचायत में सदस्यों की न्यूनतम संख्या कितनी हो सकती है?",
    "A_en": "5",
    "A_hi": "5",
    "B_en": "7",
    "B_hi": "7",
    "C_en": "9",
    "C_hi": "9",
    "D_en": "11",
    "D_hi": "11",
    "answer": "B",
    "explanation_en": "A Panchayat must have a minimum of 7 members as per the 73rd Amendment Act.",
    "explanation_hi": "73वें संशोधन अधिनियम के अनुसार एक पंचायत में कम से कम 7 सदस्य होने चाहिए।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What percentage of seats in Panchayats is reserved for women?",
    "question_hi": "पंचायतों में महिलाओं के लिए कितने प्रतिशत सीटें आरक्षित हैं?",
    "A_en": "30%",
    "A_hi": "30%",
    "B_en": "33%",
    "B_hi": "33%",
    "C_en": "35%",
    "C_hi": "35%",
    "D_en": "40%",
    "D_hi": "40%",
    "answer": "B",
    "explanation_en": "At least one-third (33%) of seats in Panchayats are reserved for women under the 73rd Amendment.",
    "explanation_hi": "73वें संशोधन के तहत पंचायतों में महिलाओं के लिए कम से कम एक-तिहाई (33%) सीटें आरक्षित हैं।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which amendment deals with urban local governance (Municipalities)?",
    "question_hi": "कौन सा संशोधन शहरी स्थानीय शासन (नगर पालिकाएं) के साथ निपटता है?",
    "A_en": "73rd Constitution Amendment Act",
    "A_hi": "73वां संविधान संशोधन अधिनियम",
    "B_en": "74th Constitution Amendment Act",
    "B_hi": "74वां संविधान संशोधन अधिनियम",
    "C_en": "75th Constitution Amendment Act",
    "C_hi": "75वां संविधान संशोधन अधिनियम",
    "D_en": "76th Constitution Amendment Act",
    "D_hi": "76वां संविधान संशोधन अधिनियम",
    "answer": "B",
    "explanation_en": "The 74th Constitution Amendment Act, 1992, provides constitutional status to urban local bodies (Municipalities).",
    "explanation_hi": "74वां संविधान संशोधन अधिनियम, 1992, शहरी स्थानीय निकायों (नगर पालिकाएं) को संवैधानिक दर्जा देता है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the structure of urban local bodies under the 74th Amendment?",
    "question_hi": "74वें संशोधन के अंतर्गत शहरी स्थानीय निकायों की अवस्थिति क्या है?",
    "A_en": "Municipal Corporation, Municipal Council, and Nagar Panchayat",
    "A_hi": "नगर निगम, नगर परिषद और नगर पंचायत",
    "B_en": "Zilla Parishad, Panchayat Samiti, and Gram Panchayat",
    "B_hi": "जिला परिषद, पंचायत समिति और ग्राम पंचायत",
    "C_en": "Municipal Corporation and Zilla Parishad",
    "C_hi": "नगर निगम और जिला परिषद",
    "D_en": "Municipal Council and Panchayat Samiti",
    "D_hi": "नगर परिषद और पंचायत समिति",
    "answer": "A",
    "explanation_en": "The 74th Amendment Act establishes three types of urban local bodies: Municipal Corporation, Municipal Council, and Nagar Panchayat.",
    "explanation_hi": "74वें संशोधन अधिनियम के तहत तीन प्रकार के शहरी स्थानीय निकाय हैं: नगर निगम, नगर परिषद और नगर पंचायत।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the term of office for a Municipal Council?",
    "question_hi": "नगर परिषद के कार्यकाल का समय क्या है?",
    "A_en": "3 years",
    "A_hi": "3 वर्ष",
    "B_en": "4 years",
    "B_hi": "4 वर्ष",
    "C_en": "5 years",
    "C_hi": "5 वर्ष",
    "D_en": "6 years",
    "D_hi": "6 वर्ष",
    "answer": "C",
    "explanation_en": "The term of office for a Municipal Council is 5 years as per the 74