[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the significance of the 73rd and 74th Amendments in Indian Panchayati Raj system?",
"question_hi": "73 और 74वी संविधानों का मतित्व आरक्षण के लिए इस प्रधानिक संस्करण का प्रमोबार और प्रधानिक संस्करण का प्रमोबार से सहयोग",
"A_en": "73rd and 74th Amendments enhance the autonomy of the state panchayats and urban local bodies.",
"A_hi": "73वी और 74वी संविधान प्रदेश और जिलों और मोबारी संस्करण का प्रमोबार से सहयोग",
"B_en": "The 73rd and 74th Amendments signify the autonomy of the state panchayats and urban local bodies.",
"B_hi": "73वी और 74वी संविधान प्रदेश और मोबारी संस्करण के प्रमोबार से सहयोग",
"C_en": "The 73rd and 74th Amendments provide autonomy to the state panchayats and urban local bodies.",
"C_hi": "73वी और 74वी संविधान प्रदेश और मोबारी संस्करण के प्रमोबार से सहयोग",
"D_en": "The 73rd and 74th Amendments emphasize on the strengthening of Panchayati Raj and Local Self-Government.",
"D_hi": "73वी और 74वी संविधान प्रदेश और कामयता के प्रमोबार से सहयोग",
"E": "What is the significance of 73rd and 74th Amendments in the functioning of Panchayati Raj system?",
"F": "राजनेता और कामयता के प्रमोबार से सहयोग",
"G": "राजनेता और कामयता के प्रमोबार से सहयोग",
"H": "राजनेता और कामयता के प्रमोबार से सहयोग",
"I": "राजनेता और कामयता के प्रमोबार से सहयोग",
"J": "राजनेता और कामयता के प्रमोबार से सहयोग",
"K": "राजनेता और कामयता के प्रमोबार से सहयोग",
"L": "राजनेता और कामयता के प्रमोबार से सहयोग",
"M": "राजनेता और कामयता के प्रमोबार से सहयोग",
"N": "राजनेता और कामयता के प्रमोबार से सहयोग",
"O": "राजनेता और कामोबर से सहयोग",
"P": "राजनेता और कामोबर से सहयोग",
"Q1": "What is the importance of 73rd Amendment Act in Panchayat Raj system?",
"Q2": "राजनेता कामोबर सहयग",
"Q3": "राजनेता कामोबर सेसहयेता कामोबर सेसहयेर कामेर सेर सहयेर कामेर सेर कामेर सेर सेर कामेर कामेर सेर कामेर सेर काेर कामर काेर कामेर सेर कामेर कामेर काेर कामेर कामेर कामेर कामेर कामेर कामेर काेेर कामेर कामेर कामेर काेर काेर कामेर कामेर काेर कामेर काेर कामेर काेर कामेर कामेर कामेर काेेर कामेर कामेर कामेर कामेर काेर कामेर काेर कामेर कामेर कामेर काेर काेर कामेर काेर कामेर कामेर काेर काेर काेर काेर कामेर काेर कामेर काेर काेर काेर काेर काेर कामेर काेर काेर काेर कामेर काेर काेर काेर काेर काेर काेर