<think>
Okay, I need to create 10 high-quality MCQs on the topic of Panchayati Raj and Nagariya Swashasan, specifically focusing on the 73rd and 74th Amendments to the Indian Constitution. The user wants these questions for exams like Rajasthan LDC, CET, RAS, SSC, and Railway. The instructions specify that each question must be in both Hindi and English, with explanations in both languages, and the output should be in a strict JSON format without any extra text.

First, I should recall the key aspects of the 73rd and 74th Amendments. The 73rd Amendment deals with Panchayati Raj institutions, while the 74th Amendment is about urban local bodies. Important points include the constitutional status, reservation of seats for SC/ST and women, the three-tier structure, powers and functions, financial autonomy, and the role of the State Finance Commission.

I need to ensure that the questions cover these areas. Let me start by listing out possible topics for each amendment. For the 73rd Amendment: constitutional status, structure (gram panchayat, panchayat samiti, zila parishad), reservation, powers, and constitutional commissions. For the 74th Amendment: similar points but for municipalities, their structure, powers, and any specific provisions.

Next, I'll formulate questions. For example, a question on when the 73rd Amendment came into effect. The answer is 1993. Another could be about the three-tier structure. Then, maybe about the reservation for SC/ST and women. Also, the role of the State Finance Commission in recommending financial resources. For the 74th Amendment, perhaps a question on the constitutional status, or the structure of municipalities.

I need to make sure each question has four options, with the correct answer and an explanation. The explanations should be concise but informative. Also, the Hindi translation must be accurate and in proper Hindi script.

Let me check if I have enough variation. Ten questions might cover the key points. I should avoid repetition. For example, after covering the constitutional date, structure, reservation, State Finance Commission, maybe a question on the powers of Panchayats, and another on the constitutional article numbers. For the 74th Amendment, similar points but with different focus areas.

Wait, the 73rd Amendment is Article 243B to 243O, and the 74th is Article 243P to 243ZT. So a question on their constitutional articles. Also, the 73rd Amendment mandates that the State Election Commission conducts elections, not the central one. That's a good point for a question.

I need to ensure that the options are plausible but the correct answer is unambiguous. For example, in a question about the three tiers, the options might confuse gram panchayat with another tier. Also, for the reservation percentage, it's 33% for women in both amendments.

Let me draft each question one by one, making sure the Hindi and English are correctly translated. Also, explanations should clarify why the correct answer is right and why others are wrong. For example, in a question about the State Finance Commission, the explanation should mention their role in recommending financial resources for Panchayats.

I should also verify facts to avoid errors. For instance, confirming the year of enactment (1992), the year came into effect (1993), and the exact constitutional articles. Also, the 74th Amendment's structure: municipalities include Nagar Panchayat, Municipal Council, and Municipal Corporation. That's a key point for one question.

Another point: the 73rd Amendment gives Panchayats the power to prepare plans for economic development and social justice. So a question on their functions. Similarly, the 74th gives municipalities powers to prepare plans for urban areas.

I need to make sure that the questions are of the right difficulty level for these exams. They should test understanding of the amendments' provisions, not just memorization. For example, knowing the reservation percentages or the difference between the two amendments.

Once all questions are drafted, I'll check the JSON structure to ensure it matches the example provided. Each question object must have subject, topic, question in both languages, options, answer, and explanations. The answer should be labeled as A, B, C, D corresponding to the options.

Finally, I'll review all questions for clarity and correctness. Ensure that there are no typos in the JSON and that the Hindi translations are accurate. Also, check that the explanations are concise and directly address the question without unnecessary information.
</think>

[
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which constitutional amendment provided constitutional status to Panchayati Raj institutions?",
    "question_hi": "कौन सा संविधान संशोधन पंचायती राज निकायों को संवैधानिक दर्जा प्रदान करता है?",
    "A_en": "73rd Amendment", "A_hi": "73वाँ संशोधन",
    "B_en": "74th Amendment", "B_hi": "74वाँ संशोधन",
    "C_en": "72nd Amendment", "C_hi": "72वाँ संशोधन",
    "D_en": "71st Amendment", "D_hi": "71वाँ संशोधन",
    "answer": "A",
    "explanation_en": "The 73rd Constitutional Amendment Act of 1992 granted constitutional status to Panchayati Raj institutions.",
    "explanation_hi": "1992 के 73वें संविधान संशोधन अधिनियम ने पंचायती राज निकायों को संवैधानिक दर्जा प्रदान किया।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the minimum age required to contest a Panchayat election?",
    "question_hi": "पंचायत चुनाव में भाग लेने के लिए न्यूनतम आयु सीमा क्या है?",
    "A_en": "21 years", "A_hi": "21 वर्ष",
    "B_en": "25 years", "B_hi": "25 वर्ष",
    "C_en": "18 years", "C_hi": "18 वर्ष",
    "D_en": "30 years", "D_hi": "30 वर्ष",
    "answer": "A",
    "explanation_en": "The 73rd Amendment Act mandates that candidates must be at least 21 years old to contest Panchayat elections.",
    "explanation_hi": "73वें संशोधन अधिनियम के अनुसार पंचायत चुनाव में भाग लेने वाले उम्मीदवारों की आयु कम से कम 21 वर्ष होनी आवश्यक है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which body is responsible for conducting Panchayat elections?",
    "question_hi": "पंचायत चुनावों के आयोजन के लिए कौनसा निकाय जिम्मेदार है?",
    "A_en": "Election Commission of India", "A_hi": "भारत के चुनाव आयोग",
    "B_en": "State Election Commission", "B_hi": "राज्य चुनाव आयोग",
    "C_en": "Gram Sabha", "C_hi": "ग्राम सभा",
    "D_en": "District Collector", "D_hi": "जिला अधिकारी",
    "answer": "B",
    "explanation_en": "The 73rd Amendment Act established State Election Commissions to oversee and conduct Panchayat elections independently.",
    "explanation_hi": "73वें संशोधन अधिनियम ने पंचायत चुनावों के पर्यवेक्षण और आयोजन के लिए राज्य चुनाव आयोग की स्थापना की।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the reservation percentage for women in Panchayat bodies under the 73rd Amendment?",
    "question_hi": "73वें संशोधन के तहत पंचायत निकायों में महिलाओं के लिए आरक्षण का प्रतिशत क्या है?",
    "A_en": "33%", "A_hi": "33%",
    "B_en": "50%", "B_hi": "50%",
    "C_en": "25%", "C_hi": "25%",
    "D_en": "40%", "D_hi": "40%",
    "answer": "A",
    "explanation_en": "The 73rd Amendment mandates 33% reservation for women in all Panchayat bodies to promote gender representation.",
    "explanation_hi": "73वें संशोधन में यह आवश्यक किया गया है कि सभी पंचायत निकायों में महिलाओं के लिए 33% आरक्षण हो।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which constitutional amendment provided constitutional status to urban local bodies?",
    "question_hi": "कौन सा संविधान संशोधन नगरीय स्थानीय निकायों को संवैधानिक दर्जा प्रदान करता है?",
    "A_en": "73rd Amendment", "A_hi": "73वाँ संशोधन",
    "B_en": "74th Amendment", "B_hi": "74वाँ संशोधन",
    "C_en": "72nd Amendment", "C_hi": "72वाँ संशोधन",
    "D_en": "71st Amendment", "D_hi": "71वाँ संशोधन",
    "answer": "B",
    "explanation_en": "The 74th Constitutional Amendment Act of 1992 granted constitutional status to urban local bodies like municipalities.",
    "explanation_hi": "1992 के 74वें संविधान संशोधन अधिनियम ने नगर पंचायत जैसे नगरीय स्थानीय निकायों को संवैधानिक दर्जा प्रदान किया।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which of the following is NOT a function of Panchayati Raj institutions?",
    "question_hi": "निम्नलिखित में से कौन पंचायती राज निकायों का कार्य नहीं है?",
    "A_en": "Preparing plans for economic development", "A_hi": "आर्थिक विकास के लिए योजनाएँ तैयार करना",
    "B_en": "Implementing social welfare programs", "B_hi": "सामाजिक कल्याण कार्यक्रमों को लागू करना",
    "C_en": "Conducting elections", "C_hi": "चुनावों का आयोजन करना",
    "D_en": "Providing urban infrastructure", "D_hi": "नगरीय बुनियादी ढांचा प्रदान करना",
    "answer": "D",
    "explanation_en": "Providing urban infrastructure is the responsibility of urban local bodies under the 74th Amendment, not Panchayati Raj institutions.",
    "explanation_hi": "नगरीय बुनियादी ढांचा प्रदान करना 74वें संशोधन के तहत नगरीय स्थानीय निकायों की जिम्मेदारी है, न कि पंचायती राज निकायों की।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "What is the tenure of office for members of a Municipal Corporation under the 74th Amendment?",
    "question_hi": "74वें संशोधन के तहत नगर निगम के सदस्यों का कार्यकाल कितना होता है?",
    "A_en": "3 years", "A_hi": "3 वर्ष",
    "B_en": "5 years", "B_hi": "5 वर्ष",
    "C_en": "4 years", "C_hi": "4 वर्ष",
    "D_en": "6 years", "D_hi": "6 वर्ष",
    "answer": "B",
    "explanation_en": "The 74th Amendment Act specifies a 5-year term for members of urban local bodies, renewable after elections.",
    "explanation_hi": "74वें संशोधन अधिनियम ने नगरीय स्थानीय निकायों के सदस्यों के लिए 5 साल का कार्यकाल निर्धारित किया है।"
  },
  {
    "subject": "Indian Polity",
    "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
    "question_en": "Which of the following is a constitutional provision for the 74th Amendment?",
    "question_hi": "निम्नलिखित में से कौन 74वें संशोधन की एक संवैधानिक उपबंध है?",
    "A_en": "Reservation of seats for SC/ST in urban bodies", "A_hi": "नगरीय निकायों में अनुसूचित जाति/अनुसूचित अनुसूचित जाति के लिए आसनों का आरक्षण",
    "B_en": "Minimum age of 18 years for candidates", "B_hi": "उम्मीदवारों के लिए 18 वर्ष की न्यूनतम आयु",
    "C_en": "Financial autonomy for urban bodies", "C_hi": "नगरीय निकायों के लिए वित्तीय स्वायत्तता",
    "D_en": "All of the above", "D_hi": "ऊपर के सभी",
    "answer": "D",
    "explanation_en": "The 74th Amendment includes provisions for SC/ST reservations, minimum age requirements, and financial autonomy for urban local bodies.",
    "explanation_hi": "74वें संशोधन में अनुसूचित