<think>
Okay, let's tackle this task. The user wants me to create 10 high-quality MCQs on the Indian Polity topic of the 73rd and 74th Constitutional Amendments, focusing on Panchayati Raj and Nagariya Swashasan. The questions need to be in both Hindi and English, following a strict JSON format similar to Testbook. 

First, I need to recall the key points of these amendments. The 73rd Amendment, enacted in 1992, relates to Panchayati Raj institutions, while the 74th Amendment, also from 1992, deals with urban local bodies. Both amendments aim to decentralize governance and empower local self-government. 

For each question, I should identify important aspects like the constitutional article numbers, the minimum age required for candidates, reservation details, financial provisions, roles of the state and central governments, types of urban local bodies, and the structure of these institutions. 

I need to ensure that each question has four options with only one correct answer. The explanations should clarify why the correct answer is right and briefly mention the incorrect options. Also, the Hindi translations must be accurate to avoid confusion.

Let me start by listing the key areas for each question. The first question could be about the constitutional article for the 73rd Amendment. The second on the minimum age for Panchayat membership. Third, the reservation of seats for SC/ST. Fourth, the role of the State Election Commission. Fifth, the duration of Panchayat terms. Sixth, the financial provisions. Seventh, the constitutional article for the 74th Amendment. Eighth, types of urban local bodies. Ninth, the role of the State Finance Commission. Tenth, the reservation of women in urban bodies.

Now, I need to verify the correct details. For example, the 73rd Amendment is Article 243, and the 74th is Article 243T. The minimum age for Panchayat is 21, and for urban bodies is 21 as well. SC/ST reservation is 1/3 of the total seats. The State Election Commission handles elections, and the Finance Commission recommends financial allocation. The duration is five years. Women's reservation in urban areas is 33%. 

I should structure each question with these points, ensuring clarity and accuracy. Also, check that the Hindi translations are precise. For example, "राज्य चुनाव आयोग" for State Election Commission. 

Once the questions are framed, I'll need to format them into the specified JSON structure, making sure all fields are present and correct. Double-checking each answer and explanation to prevent any errors. Finally, validate the JSON to ensure it's free of syntax issues.
</think>

[
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "Under the 73rd Constitutional Amendment Act, panchayats are established at which level?",
        "question_hi": "73वें संविधान संशोधन अधिनियम के तहत पंचायतें किस स्तर पर स्थापित की जाती हैं?",
        "A_en": "State level", "A_hi": "राज्य स्तर",
        "B_en": "District level", "B_hi": "जिला स्तर",
        "C_en": "Block and village level", "C_hi": "तहसील और गांव के स्तर",
        "D_en": "All of the above", "D_hi": "ऊपर के सभी",
        "answer": "D",
        "explanation_en": "The 73rd Amendment mandates panchayats at the village, block, and district levels to decentralize governance.",
        "explanation_hi": "73वें संशोधन के तहत गांव, तहसील और जिला स्तर पर पंचायतें स्थापित करके शासन को विकेंद्रित किया गया है।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "What is the minimum age required for a person to contest elections to a panchayat?",
        "question_hi": "पंचायत चुनाव में अभ्यर्थी के रूप में उम्मीदवार बनने के लिए न्यूनतम आयु क्या है?",
        "A_en": "18 years", "A_hi": "18 वर्ष",
        "B_en": "21 years", "B_hi": "21 वर्ष",
        "C_en": "25 years", "C_hi": "25 वर्ष",
        "D_en": "30 years", "D_hi": "30 वर्ष",
        "answer": "B",
        "explanation_en": "The 73rd Amendment specifies that candidates for panchayat elections must be at least 21 years old.",
        "explanation_hi": "73वें संशोधन के अनुसार पंचायत चुनाव में उम्मीदवार की आयु कम से कम 21 वर्ष होनी चाहिए।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "Which constitutional article provides for the reservation of seats for SC/ST in panchayats?",
        "question_hi": "पंचायतों में अनुसूचित जाति/जनजाति के लिए सीटों के आरक्षण का प्रावधान कौन-सा संविधान अनुच्छेद देता है?",
        "A_en": "Article 243B", "A_hi": "अनुच्छेद 243बी",
        "B_en": "Article 243C", "B_hi": "अनुच्छेद 243सी",
        "C_en": "Article 243D", "C_hi": "अनुच्छेद 243डी",
        "D_en": "Article 243E", "D_hi": "अनुच्छेद 243ई",
        "answer": "A",
        "explanation_en": "Article 243B of the Constitution reserves seats for SC/ST in panchayats based on their population.",
        "explanation_hi": "संविधान के अनुच्छेद 243बी में अनुसूचित जाति/जनजाति के लोगों के आबादी के आधार पर पंचायतों में सीटों का आरक्षण किया गया है।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "What is the role of the State Election Commission under the 73rd Amendment?",
        "question_hi": "73वें संशोधन के तहत राज्य चुनाव आयोग की भूमिका क्या है?",
        "A_en": "Conduct elections to the Lok Sabha", "A_hi": "लोक सभा के चुनाव करवाना",
        "B_en": "Conduct panchayat elections", "B_hi": "पंचायत चुनाव करवाना",
        "C_en": "Conduct state legislative elections", "C_hi": "राज्य विधानसभा चुनाव करवाना",
        "D_en": "Conduct elections to the Rajya Sabha", "D_hi": "राज्य सभा के चुनाव करवाना",
        "answer": "B",
        "explanation_en": "The State Election Commission conducts and oversees panchayat elections as per the 73rd Amendment.",
        "explanation_hi": "73वें संशोधन के अनुसार राज्य चुनाव आयोग पंचायत चुनाव का आयोजन और निरीक्षण करता है।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "What is the duration of a panchayat under the 73rd Amendment?",
        "question_hi": "73वें संशोधन के तहत एक पंचायत की अवधि क्या है?",
        "A_en": "3 years", "A_hi": "3 वर्ष",
        "B_en": "4 years", "B_hi": "4 वर्ष",
        "C_en": "5 years", "C_hi": "5 वर्ष",
        "D_en": "6 years", "D_hi": "6 वर्ष",
        "answer": "C",
        "explanation_en": "The 73rd Amendment stipulates a 5-year term for panchayats, which can be dissolved earlier by the state government.",
        "explanation_hi": "73वें संशोधन के अनुसार पंचायतों की अवधि 5 वर्ष होती है, जिसे राज्य सरकार द्वारा आगे से समाप्त किया जा सकता है।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "Which article of the Constitution deals with the financial provisions for panchayats?",
        "question_hi": "पंचायतों के लिए वित्तीय प्रावधान का प्रावधान संविधान के किस अनुच्छेद में है?",
        "A_en": "Article 243H", "A_hi": "अनुच्छेद 243एच",
        "B_en": "Article 243I", "B_hi": "अनुच्छेद 243आई",
        "C_en": "Article 243J", "C_hi": "अनुच्छेद 243जेई",
        "D_en": "Article 243K", "D_hi": "अनुच्छेद 243के",
        "answer": "A",
        "explanation_en": "Article 243H outlines the financial powers and resources of panchayats, including funds from the state government.",
        "explanation_hi": "अनुच्छेद 243एच में पंचायतों के वित्तीय अधिकारों और संसाधनों, जिनमें राज्य सरकार से धन शामिल है, का वर्णन किया गया है।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "Under the 74th Amendment Act, urban local bodies are established at which level?",
        "question_hi": "74वें संशोधन अधिनियम के तहत शहरी स्थानीय निकाय किस स्तर पर स्थापित किए जाते हैं?",
        "A_en": "Urban area level", "A_hi": "शहरी क्षेत्र के स्तर",
        "B_en": "Municipal level", "B_hi": "नगर निकाय के स्तर",
        "C_en": "Metropolitan and municipal levels", "C_hi": "महानगर और नगर निकाय के स्तर",
        "D_en": "All of the above", "D_hi": "ऊपर के सभी",
        "answer": "D",
        "explanation_en": "The 74th Amendment establishes urban local bodies at municipal, metropolitan, and other urban levels.",
        "explanation_hi": "74वें संशोधन ने शहरी स्थानीय निकायों को नगर, महानगर और अन्य शहरी स्तरों पर स्थापित करने का प्रावधान किया है।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "What is the minimum age required for a person to contest elections to a municipality under the 74th Amendment?",
        "question_hi": "74वें संशोधन के तहत नगर निकाय चुनाव में अभ्यर्थी के रूप में उम्मीदवार बनने के लिए न्यूनतम आयु क्या है?",
        "A_en": "18 years", "A_hi": "18 वर्ष",
        "B_en": "21 years", "B_hi": "21 वर्ष",
        "C_en": "25 years", "C_hi": "25 वर्ष",
        "D_en": "30 years", "D_hi": "30 वर्ष",
        "answer": "B",
        "explanation_en": "The 74th Amendment requires candidates for municipality elections to be at least 21 years old.",
        "explanation_hi": "74वें संशोधन में नगर निकाय चुनाव में उम्मीदवार की आयु कम से कम 21 वर्ष होनी चाहिए।"
    },
    {
        "subject": "Indian Polity",
        "topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
        "question_en": "Which constitutional article provides for the reservation of seats for women in urban local bodies under the 74th Amendment?",
        "question_hi": "74वें संशोधन के तहत शहरी स्थानीय निकायों में महिलाओं के लिए सीटों के आरक्षण का प्रावधान कौन-सा संविधान अनुच्छेद देता है?",
        "A_en": "Article 243P", "A_hi": "अनुच्छेद 243पी",
        "B_en": "Article 243Q", "B_hi": "अनुच्छेद 243क्यू",
        "C_en": "Article 243R", "C_hi": "अनुच्छेद 243आर",
        "D_en": "Article 243S", "D_hi": "अनुच्छेद 243एस",
        "answer": "B",
        "explanation_en