[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the main objective of the 73rd Amendment to the Indian Constitution?",
"question_hi": "भारतीय संविधान के 73वें संशोधन का मुख्य उद्देश्य क्या है?",
"A_en": "To empower the urban local bodies", "A_hi": "नगरीय स्थानीय निकायों को सशक्त बनाना",
"B_en": "To establish a federal system of government", "B_hi": "संघीय प्रणाली की सरकार स्थापित करना",
"C_en": "To strengthen the Panchayati Raj system", "C_hi": "पंचायती राज प्रणाली को मजबूत करना",
"D_en": "To reduce the powers of the state governments", "D_hi": "राज्य सरकारों के अधिकारों को कम करना",
"answer": "C",
"explanation_en": "The 73rd Amendment to the Indian Constitution aims to strengthen the Panchayati Raj system by giving more powers to the local self-governments.",
"explanation_hi": "भारतीय संविधान के 73वें संशोधन का उद्देश्य पंचायती राज प्रणाली को मजबूत करना है जिससे स्थानीय स्वशासन को अधिक अधिकार मिल सकें।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the significance of the 74th Amendment to the Indian Constitution?",
"question_hi": "भारतीय संविधान के 74वें संशोधन का क्या महत्व है?",
"A_en": "It provides for the establishment of a national commission for municipalities", "A_hi": "यह नगरपालिकाओं के लिए एक राष्ट्रीय आयोग की स्थापना प्रदान करता है",
"B_en": "It gives more powers to the state governments", "B_hi": "यह राज्य सरकारों को अधिक अधिकार देता है",
"C_en": "It strengthens the urban local self-governments", "C_hi": "यह नगरीय स्थानीय स्वशासन को मजबूत करता है",
"D_en": "It reduces the role of the central government in urban planning", "D_hi": "यह शहरी योजना में केंद्र सरकार की भूमिका को कम करता है",
"answer": "C",
"explanation_en": "The 74th Amendment to the Indian Constitution strengthens the urban local self-governments by giving them more powers and responsibilities.",
"explanation_hi": "भारतीय संविधान के 74वें संशोधन से नगरीय स्थानीय स्वशासन को अधिक अधिकार और जिम्मेदारियां मिली हैं।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the term of office for a member of a Panchayat?",
"question_hi": "पंचायत के सदस्य का कार्यकाल क्या है?",
"A_en": "3 years", "A_hi": "3 वर्ष",
"B_en": "4 years", "B_hi": "4 वर्ष",
"C_en": "5 years", "C_hi": "5 वर्ष",
"D_en": "6 years", "D_hi": "6 वर्ष",
"answer": "C",
"explanation_en": "The term of office for a member of a Panchayat is 5 years.",
"explanation_hi": "पंचायत के सदस्य का कार्यकाल 5 वर्ष है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the purpose of the District Planning Committee?",
"question_hi": "जिला योजना समिति का उद्देश्य क्या है?",
"A_en": "To prepare the district plan", "A_hi": "जिला योजना तैयार करना",
"B_en": "To monitor the implementation of the district plan", "B_hi": "जिला योजना के क्रियान्वयन की निगरानी करना",
"C_en": "To coordinate the plans of the Panchayats and the municipalities", "C_hi": "पंचायतों और नगरपालिकाओं की योजनाओं का समन्वय करना",
"D_en": "To allocate funds to the Panchayats and the municipalities", "D_hi": "पंचायतों और नगरपालिकाओं को धन आवंटित करना",
"answer": "C",
"explanation_en": "The District Planning Committee is responsible for coordinating the plans of the Panchayats and the municipalities.",
"explanation_hi": "जिला योजना समिति पंचायतों और नगरपालिकाओं की योजनाओं का समन्वय करने के लिए जिम्मेदार है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the role of the State Election Commission in the Panchayati Raj system?",
"question_hi": "पंचायती राज प्रणाली में राज्य निर्वाचन आयोग की भूमिका क्या है?",
"A_en": "To conduct elections to the Panchayats", "A_hi": "पंचायतों के लिए चुनाव आयोजित करना",
"B_en": "To monitor the functioning of the Panchayats", "B_hi": "पंचायतों के कामकाज की निगरानी करना",
"C_en": "To provide financial assistance to the Panchayats", "C_hi": "पंचायतों को वित्तीय सहायता प्रदान करना",
"D_en": "To train the members of the Panchayats", "D_hi": "पंचायत के सदस्यों को प्रशिक्षित करना",
"answer": "A",
"explanation_en": "The State Election Commission is responsible for conducting elections to the Panchayats.",
"explanation_hi": "राज्य निर्वाचन आयोग पंचायतों के लिए चुनाव आयोजित करने के लिए जिम्मेदार है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the significance of the Gram Sabha in the Panchayati Raj system?",
"question_hi": "पंचायती राज प्रणाली में ग्राम सभा का क्या महत्व है?",
"A_en": "It is the supreme body of the Panchayat", "A_hi": "यह पंचायत का सर्वोच्च निकाय है",
"B_en": "It is responsible for the implementation of the Panchayat's plans", "B_hi": "यह पंचायत की योजनाओं के क्रियान्वयन के लिए जिम्मेदार है",
"C_en": "It is a forum for the villagers to express their opinions and grievances", "C_hi": "यह ग्रामीणों के लिए अपने विचार और शिकायतें व्यक्त करने का मंच है",
"D_en": "It is a body that advises the Panchayat on important matters", "D_hi": "यह एक ऐसा निकाय है जो पंचायत को महत्वपूर्ण मामलों पर सलाह देता है",
"answer": "C",
"explanation_en": "The Gram Sabha is a forum for the villagers to express their opinions and grievances, and it plays an important role in the functioning of the Panchayat.",
"explanation_hi": "ग्राम सभा ग्रामीणों के लिए अपने विचार और शिकायतें व्यक्त करने का मंच है, और यह पंचायत के कामकाज में महत्वपूर्ण भूमिका निभाता है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the purpose of the Metropolitan Planning Committee?",
"question_hi": "महानगरीय योजना समिति का उद्देश्य क्या है?",
"A_en": "To prepare the metropolitan plan", "A_hi": "महानगरीय योजना तैयार करना",
"B_en": "To monitor the implementation of the metropolitan plan", "B_hi": "महानगरीय योजना के क्रियान्वयन की निगरानी करना",
"C_en": "To coordinate the plans of the municipalities and the state government", "C_hi": "नगरपालिकाओं और राज्य सरकार की योजनाओं का समन्वय करना",
"D_en": "To allocate funds to the municipalities", "D_hi": "नगरपालिकाओं को धन आवंटित करना",
"answer": "C",
"explanation_en": "The Metropolitan Planning Committee is responsible for coordinating the plans of the municipalities and the state government.",
"explanation_hi": "महानगरीय योजना समिति नगरपालिकाओं और राज्य सरकार की योजनाओं का समन्वय करने के लिए जिम्मेदार है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the role of the Municipal Corporation in urban governance?",
"question_hi": "नगरीय शासन में नगर निगम की भूमिका क्या है?",
"A_en": "To provide basic amenities to the citizens", "A_hi": "नागरिकों को मूलभूत सुविधाएं प्रदान करना",
"B_en": "To collect taxes and revenue", "B_hi": "कर और राजस्व इकट्ठा करना",
"C_en": "To maintain law and order in the city", "C_hi": "शहर में कानून और व्यवस्था बनाए रखना",
"D_en": "To oversee the functioning of the urban local bodies", "D_hi": "नगरीय स्थानीय निकायों के कामकाज की देखरेख करना",
"answer": "A",
"explanation_en": "The Municipal Corporation is responsible for providing basic amenities to the citizens, such as water supply, sanitation, and transportation.",
"explanation_hi": "नगर निगम नागरिकों को मूलभूत सुविधाएं प्रदान करने के लिए जिम्मेदार है, जैसे कि जलापूर्ति, स्वच्छता और परिवहन।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the significance of the 73rd and 74th Amendments to the Indian Constitution?",
"question_hi": "भारतीय संविधान के 73वें और 74वें संशोधन का क्या महत्व है?",
"A_en": "They provide for the establishment of a federal system of government", "A_hi": "वे संघीय प्रणाली की सरकार की स्थापना प्रदान करते हैं",
"B_en": "They strengthen the Panchayati Raj and urban local self-governments", "B_hi": "वे पंचायती राज और नगरीय स्थानीय स्वशासन को मजबूत करते हैं",
"C_en": "They reduce the powers of the state governments", "C_hi": "वे राज्य सरकारों के अधिकारों को कम करते हैं",
"D_en": "They increase the role of the central government in state matters", "D_hi": "वे राज्य के मामलों में केंद्र सरकार की भूमिका को बढ़ाते हैं",
"answer": "B",
"explanation_en": "The 73rd and 74th Amendments to the Indian Constitution strengthen the Panchayati Raj and urban local self-governments by giving them more powers and responsibilities.",
"explanation_hi": "भारतीय संविधान के 73वें और 74वें संशोधन पंचायती राज और नगरीय स्थानीय स्वशासन को अधिक अधिकार और जिम्मेदारियां देकर मजबूत करते हैं।"
}
]