[
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the main objective of the 73rd Amendment to the Indian Constitution?",
"question_hi": "भारतीय संविधान के 73वें संशोधन का मुख्य उद्देश्य क्या है?",
"A_en": "To empower the state legislatures", "A_hi": "राज्य विधायिकाओं को सशक्त बनाने के लिए",
"B_en": "To strengthen the Panchayati Raj system", "B_hi": "पंचायती राज प्रणाली को मजबूत करने के लिए",
"C_en": "To promote the development of urban areas", "C_hi": "शहरी क्षेत्रों के विकास को बढ़ावा देने के लिए",
"D_en": "To reduce the power of the central government", "D_hi": "केंद्र सरकार की शक्ति को कम करने के लिए",
"answer": "B",
"explanation_en": "The 73rd Amendment to the Indian Constitution aims to strengthen the Panchayati Raj system by providing constitutional status to the three-tier Panchayati Raj institutions.",
"explanation_hi": "भारतीय संविधान के 73वें संशोधन का उद्देश्य पंचायती राज संस्थाओं को संवैधानिक दर्जा प्रदान करके पंचायती राज प्रणाली को मजबूत करना है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "Which amendment to the Indian Constitution deals with the provisions related to urban local governments?",
"question_hi": "भारतीय संविधान का कौन सा संशोधन शहरी स्थानीय सरकारों से संबंधित प्रावधानों से संबंधित है?",
"A_en": "73rd Amendment", "A_hi": "73वां संशोधन",
"B_en": "74th Amendment", "B_hi": "74वां संशोधन",
"C_en": "75th Amendment", "C_hi": "75वां संशोधन",
"D_en": "76th Amendment", "D_hi": "76वां संशोधन",
"answer": "B",
"explanation_en": "The 74th Amendment to the Indian Constitution deals with the provisions related to urban local governments, including the establishment of Municipalities and the powers and functions of these bodies.",
"explanation_hi": "भारतीय संविधान के 74वें संशोधन में शहरी स्थानीय सरकारों से संबंधित प्रावधानों का उल्लेख किया गया है, जिसमें नगरपालिकाओं की स्थापना और इन निकायों के अधिकार और कार्य शामिल हैं।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the minimum number of members required for a Gram Sabha?",
"question_hi": "ग्राम सभा के लिए आवश्यक न्यूनतम सदस्य संख्या क्या है?",
"A_en": "10 members", "A_hi": "10 सदस्य",
"B_en": "20 members", "B_hi": "20 सदस्य",
"C_en": "50 members", "C_hi": "50 सदस्य",
"D_en": "No minimum requirement", "D_hi": "कोई न्यूनतम आवश्यकता नहीं",
"answer": "D",
"explanation_en": "There is no minimum number of members required for a Gram Sabha, as it is a body that consists of all the registered voters in a village or a group of villages.",
"explanation_hi": "ग्राम सभा के लिए कोई न्यूनतम सदस्य संख्या नहीं है, क्योंकि यह एक ऐसा निकाय है जिसमें एक गांव या गांवों के समूह में सभी पंजीकृत मतदाता शामिल होते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the term of office for members of a Panchayat?",
"question_hi": "पंचायत के सदस्यों का कार्यकाल क्या है?",
"A_en": "3 years", "A_hi": "3 वर्ष",
"B_en": "4 years", "B_hi": "4 वर्ष",
"C_en": "5 years", "C_hi": "5 वर्ष",
"D_en": "6 years", "D_hi": "6 वर्ष",
"answer": "C",
"explanation_en": "The term of office for members of a Panchayat is 5 years, as specified in the 73rd Amendment to the Indian Constitution.",
"explanation_hi": "पंचायत के सदस्यों का कार्यकाल 5 वर्ष है, जैसा कि भारतीय संविधान के 73वें संशोधन में उल्लेख किया गया है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "Which of the following is a key feature of the 73rd Amendment to the Indian Constitution?",
"question_hi": "निम्नलिखित में से कौन सी भारतीय संविधान के 73वें संशोधन की एक प्रमुख विशेषता है?",
"A_en": "Introduction of a new taxation system", "A_hi": "एक नए कर प्रणाली की शुरुआत",
"B_en": "Creation of a new all-India service", "B_hi": "एक नए अखिल भारतीय सेवा का निर्माण",
"C_en": "Constitutional status to Panchayats", "C_hi": "पंचायतों को संवैधानिक दर्जा",
"D_en": "Abolition of the planning commission", "D_hi": "योजना आयोग का उन्मूलन",
"answer": "C",
"explanation_en": "The 73rd Amendment to the Indian Constitution provides constitutional status to the three-tier Panchayati Raj institutions, making them a crucial part of the country's governance structure.",
"explanation_hi": "भारतीय संविधान के 73वें संशोधन में त्रिस्तरीय पंचायती राज संस्थाओं को संवैधानिक दर्जा प्रदान किया गया है, जिससे वे देश की शासन संरचना का एक महत्वपूर्ण हिस्सा बन गई हैं।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the main purpose of the Gram Sabha?",
"question_hi": "ग्राम सभा का मुख्य उद्देश्य क्या है?",
"A_en": "To elect representatives to the Panchayat", "A_hi": "पंचायत के लिए प्रतिनिधियों का चुनाव करने के लिए",
"B_en": "To approve the budget of the Panchayat", "B_hi": "पंचायत के बजट को मंजूरी देने के लिए",
"C_en": "To identify and prioritize the needs of the village", "C_hi": "गांव की जरूरतों की पहचान और प्राथमिकता तय करने के लिए",
"D_en": "To settle disputes between villagers", "D_hi": "ग्रामीणों के बीच विवादों का निपटारा करने के लिए",
"answer": "C",
"explanation_en": "The main purpose of the Gram Sabha is to identify and prioritize the needs of the village, and to ensure that the Panchayat addresses these needs in its development plans.",
"explanation_hi": "ग्राम सभा का मुख्य उद्देश्य गांव की जरूरतों की पहचान और प्राथमिकता तय करना है, और यह सुनिश्चित करना है कि पंचायत अपने विकास योजनाओं में इन जरूरतों को संबोधित करती है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "Which of the following is a benefit of the 74th Amendment to the Indian Constitution?",
"question_hi": "निम्नलिखित में से कौन सी भारतीय संविधान के 74वें संशोधन का लाभ है?",
"A_en": "Increased autonomy for state governments", "A_hi": "राज्य सरकारों के लिए बढ़ी हुई स्वायत्तता",
"B_en": "Improved delivery of urban services", "B_hi": "शहरी सेवाओं की बेहतर वितरण",
"C_en": "Enhanced role for the central government", "C_hi": "केंद्र सरकार के लिए बढ़ा हुआ भूमिका",
"D_en": "Reduced powers for local governments", "D_hi": "स्थानीय सरकारों के लिए घटी हुई शक्तियां",
"answer": "B",
"explanation_en": "The 74th Amendment to the Indian Constitution aims to improve the delivery of urban services, such as water supply, sanitation, and transportation, by strengthening the role of Municipalities and other urban local governments.",
"explanation_hi": "भारतीय संविधान के 74वें संशोधन का उद्देश्य नगरपालिकाओं और अन्य शहरी स्थानीय सरकारों की भूमिका को मजबूत करके जल आपूर्ति, स्वच्छता और परिवहन जैसी शहरी सेवाओं की डिलीवरी में सुधार करना है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the role of the District Planning Committee in the context of the 74th Amendment?",
"question_hi": "74वें संशोधन के संदर्भ में जिला योजना समिति की भूमिका क्या है?",
"A_en": "To prepare the district plan", "A_hi": "जिला योजना तैयार करने के लिए",
"B_en": "To allocate funds to Municipalities", "B_hi": "नगरपालिकाओं को धन आवंटित करने के लिए",
"C_en": "To monitor the implementation of urban development schemes", "C_hi": "शहरी विकास योजनाओं के क्रियान्वयन की निगरानी करने के लिए",
"D_en": "To advise the state government on urban development matters", "D_hi": "शहरी विकास से संबंधित मामलों पर राज्य सरकार को सलाह देने के लिए",
"answer": "A",
"explanation_en": "The District Planning Committee is responsible for preparing the district plan, which outlines the development priorities and strategies for the district, in accordance with the provisions of the 74th Amendment.",
"explanation_hi": "जिला योजना समिति जिला योजना तैयार करने के लिए जिम्मेदार है, जो जिले के विकास प्राथमिकताओं और रणनीतियों को रेखांकित करती है, 74वें संशोधन के प्रावधानों के अनुसार।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "What is the significance of the 73rd and 74th Amendments to the Indian Constitution?",
"question_hi": "भारतीय संविधान के 73वें और 74वें संशोधन का क्या महत्व है?",
"A_en": "They have strengthened the role of the central government", "A_hi": "उन्होंने केंद्र सरकार की भूमिका को मजबूत किया है",
"B_en": "They have promoted the development of rural and urban areas", "B_hi": "उन्होंने ग्रामीण और शहरी क्षेत्रों के विकास को बढ़ावा दिया है",
"C_en": "They have reduced the powers of state governments", "C_hi": "उन्होंने राज्य सरकारों की शक्तियों को कम किया है",
"D_en": "They have introduced a new system of governance", "D_hi": "उन्होंने एक नई शासन प्रणाली की शुरुआत की है",
"answer": "B",
"explanation_en": "The 73rd and 74th Amendments to the Indian Constitution have promoted the development of rural and urban areas by providing constitutional status to Panchayats and Municipalities, and by strengthening their role in the governance structure.",
"explanation_hi": "भारतीय संविधान के 73वें और 74वें संशोधन ने पंचायतों और नगरपालिकाओं को संवैधानिक दर्जा प्रदान करके और शासन संरचना में उनकी भूमिका को मजबूत करके ग्रामीण और शहरी क्षेत्रों के विकास को बढ़ावा दिया है।"
},
{
"subject": "Indian Polity",
"topic": "Panchayati Raj aur Nagariya Swashasan (73rd & 74th Amendment)",
"question_en": "How do the 73rd and 74th Amendments to the Indian Constitution contribute to the concept of cooperative federalism?",
"question_hi": "भारतीय संविधान के 73वें और 74वें संशोधन सहकारी संघवाद की अवधारणा में कैसे योगदान करते हैं?",
"A_en": "By strengthening the role of the central government", "A_hi": "केंद्र सरकार की भूमिका को मजबूत करके",
"B_en": "By promoting the development of rural and urban areas", "B_hi": "ग्रामीण और शहरी क्षेत्रों के विकास को बढ़ावा देकर",
"C_en": "By enhancing the powers of state governments", "C_hi": "राज्य सरकारों की शक्तियों को बढ़ाकर",
"D_en": "By fostering greater collaboration between the central and state governments", "D_hi": "केंद्र और राज्य सरकारों के बीच अधिक सहयोग को बढ़ावा देकर",
"answer": "D",
"explanation_en": "The 73rd and 74th Amendments to the Indian Constitution contribute to the concept of cooperative federalism by fostering greater collaboration between the central and state governments, and by providing a framework for joint planning and decision-making.",
"explanation_hi": "भारतीय संविधान के 73वें और 74वें संशोधन सहकारी संघवाद की अवधारणा में योगदान करते हैं क्योंकि वे केंद्र और राज्य सरकारों के बीच अधिक सहयोग को बढ़ावा देते हैं, और संयुक्त योजना और निर्णय लेने के लिए एक ढांचा प्रदान करते हैं।"
}
]