[
{
"subject": "Indian Polity",
"topic": "Pradhanmantri aur Mantriparishad",
"question_en": "Who is the head of the Council of Ministers in India?",
"question_hi": "भारत में परिषद के मंत्रियों के सिर कौन हैं?",
"A_en": "Lok Sabha Speaker", "A_hi": "लोकसभा अध्यक्ष",
"B_en": "Prime Minister", "B_hi": "प्रधान मंत्री",
"C_en": "Rajya Sabha Chairman", "C_hi": "राज्यसभा अध्यक्ष",
"D_en": "President of India", "D_hi": "भारत के राष्ट्रपति",
"answer": "B",
"explanation_en": "The Prime Minister is the head of the Council of Ministers in India.",
"explanation_hi": "भारत में परिषद के मंत्रियों का प्रधान मंत्री है।"
},
{
"subject": "Indian Polity",
"topic": "Pradhanmantri aur Mantriparishad",
"question_en": "How many ministers can be appointed by the Prime Minister without the approval of the President?",
"question_hi": "प्रधान मंत्री के द्वारा प्रस्तुत किए जाने वाले मंत्रियों की संख्या कितनी हो सकती है?",
"A_en": "5", "A_hi": "५",
"B_en": "15", "B_hi": "१५",
"C_en": "20", "C_hi": "२०",
"D_en": "Any number of ministers can be appointed", "D_hi": "प्रस्तुत किए जा सकते हैं",
"answer": "D",
"explanation_en": "The Prime Minister can appoint any number of ministers without the approval of the President.",
"explanation_hi": "प्रधान मंत्री को राष्ट्रपति की अनुमति के बिना किसी भी संख्या में मंत्री नियुक्त करने की अनुमति है।"
},
{
"subject": "Indian Polity",
"topic": "Pradhanmantri aur Mantriparishad",
"question_en": "What is the name of the committee that advises the President on the appointment of ministers?",
"question_hi": "प्रधान मंत्रियों के नियुक्ति पर राष्ट्रपति को सलाह देने के लिए जो समिति है इसका नाम क्या है?",
"A_en": "Union Council of Ministers", "A_hi": "संघ मंत्रिपरिषद",
"B_en": "Rajya Sabha Council of Ministers", "B_hi": "राज्यसभा मंत्रिपरिषद",
"C_en": "Prime Minister's Advisory Committee", "C_hi": "प्रधान मंत्री की सलाहकार समिति",
"D_en": "Business Advisory Committee", "D_hi": "व्यवसाय सलाहकार समिति",
"answer": "D",
"explanation_en": "The Business Advisory Committee advises the President on the appointment of ministers.",
"explanation_hi": "व्यवसाय सलाहकार समिति प्रधान मंत्रियों के नियुक्ति पर राष्ट्रपति को सलाह देती है।"
},
{
"subject": "Indian Polity",
"topic": "Pradhanmantri aur Mantriparishad",
"question_en": "What is the term of office of the Council of Ministers?",
"question_hi": "मंत्रिपरिषद का कार्यकाल क्या है?",
"A_en": "1 year", "A_hi": "१ वर्ष",
"B_en": "5 years", "B_hi": "५ वर्ष",
"C_en": "Till the dissolution of Lok Sabha", "C_hi": "लोकसभा के विघटन तक",
"D_en": "At the pleasure of the President", "D_hi": "राष्ट्रपति की मर्जी से",
"answer": "C",
"explanation_en": "The term of office of the Council of Ministers is till the dissolution of Lok Sabha.",
"explanation_hi": "मंत्रिपरिषद का कार्यकाल लोकसभा के विघटन तक है।"
},
{
"subject": "Indian Polity",
"topic": "Pradhanmantri aur Mantriparishad",
"question_en": "What is the procedure for the resignation of a minister?",
"question_hi": "एक मंत्री के इस्तीफे की प्रक्रिया क्या है?",
"A_en": "By writing a letter to the President", "A_hi": "राष्ट्रपति को पत्र लिखकर",
"B_en": "By writing a letter to the Prime Minister", "B_hi": "प्रधान मंत्री को पत्र लिखकर",
"C_en": "By moving a no-confidence motion in Lok Sabha", "C_hi": "लोकसभा में अविश्वास मत के लिए एक प्रस्ताव प्रस्तुत करने से",
"D_en": "Any of the above", "D_hi": "कोई भी ऊपर के विकल्प",
"answer": "D",
"explanation_en": "A minister can resign by writing a letter to the President, Prime Minister, or by moving a no-confidence motion in Lok Sabha.",
"explanation_hi": "एक मंत्री राष्ट्रपति, प्रधान मंत्री को पत्र लिखकर या लोकसभा में अविश्वास मत के लिए एक प्रस्ताव प्रस्तुत करके इस्तीफा दे सकता है।"
},
{
"subject": "Indian Polity",
"topic": "Pradhanmantri aur Mantriparishad",
"question_en": "What is the power of the President to appoint a minister without the advice of the Prime Minister?",
"question_hi": "राष्ट्रपति को प्रधान मंत्री की सलाह के बिना एक मंत्री नियुक्त करने की शक्ति क्या है?",
"A_en": "To appoint a minister from the opposition party", "A_hi": "विपक्षी दल से एक मंत्री नियुक्त करना",
"B_en": "To appoint a minister from the ruling party", "B_hi": "शासन करने वाले दल से एक मंत्री नियुक्त करना",
"C_en": "To appoint a minister from a non-party background", "C_hi": "नॉन-पार्टी पृष्ठभूमि से एक मंत्री नियुक्त करना",
"D_en": "To appoint a minister without the advice of the Prime Minister", "D_hi": "प्रधान मंत्री की सलाह के बिना एक मंत्री नियुक्त करना",
"answer": "D",
"explanation_en": "The President has the power to appoint a minister without the advice of the Prime Minister, but this power is rarely used.",
"explanation_hi": "राष्ट्रपति को प्रधान मंत्री की सलाह के बिना एक मंत्री नियुक्त करने की शक्ति है, लेकिन यह शक्ति कम उपयोग की जाती है।"
},
{
"subject": "Indian Polity",
"topic": "Pradhanmantri aur Mantriparishad",
"question_en": "What is the duty of the Prime Minister to report to the Lok Sabha?",
"question_hi": "प्रधान मंत्री को लोकसभा को रिपोर्ट करने का दायित्व क्या है?",
"A_en": "To report on the functioning of the Government", "A_hi": "सरकार के कार्यों की रिपोर्ट करना",
"B_en": "To report on the budget of the Government", "B_hi": "सरकार के बजट की रिपोर्ट करना",
"C_en": "To report on the policy of the Government", "C_hi": "सरकार की नीति की रिपोर्ट करना",
"D_en": "To report on the functioning of the Council of Ministers", "D_hi": "मंत्रिपरिषद के कार्यों की रिपोर्ट करना",
"answer": "D",
"explanation_en": "The Prime Minister has the duty to report to the Lok Sabha on the functioning of the Council of Ministers.",
"explanation_hi": "प्रधान मंत्री को मंत्रिपरिषद के कार्यों की रिपोर्ट लोकसभा को करनी है।"
},
{
"subject": "Indian Polity",
"topic": "Pradhanmantri aur Mantriparishad",
"question_en": "What is the power of the President to remove a minister?",
"question_hi": "राष्ट्रपति को एक मंत्री को हटाने की शक्ति क्या है?",
"A_en": "To remove a minister by writing a letter", "A_hi": "पत्र लिखकर एक मंत्री को हटाना",
"B_en": "To remove a minister by moving a no-confidence motion", "B_hi": "लोकसभा में अविश्वास मत के लिए एक प्रस्ताव प्रस्तुत करके एक मंत्री को हटाना",
"C_en": "To remove a minister by impeachment", "C_hi": "उपचुनाव द्वारा एक मंत्री को हटाना",
"D_en": "To remove a minister by the advice of the Prime Minister", "D_hi": "प्रधान मंत्री की सलाह पर एक मंत्री को हटाना",
"answer": "D",
"explanation_en": "The President has the power to remove a minister by the advice of the Prime Minister.",
"explanation_hi": "राष्ट्रपति को एक मंत्री को प्रधान मंत्री की सलाह पर हटाने की शक्ति है।"
},
{
"subject": "Indian Polity",
"topic": "Pradhanmantri aur Mantriparishad",
"question_en": "What is the duty of the Council of Ministers to the Lok Sabha?",
"question_hi": "मंत्रिपरिषद को लोकसभा के प्रति दायित्व क्या है?",
"A_en": "To report on the functioning of the Government", "A_hi": "सरकार के कार्यों की रिपोर्ट करना",
"B_en": "To report on the budget of the Government", "B_hi": "सरकार के बजट की रिपोर्ट करना",
"C_en": "To report on the policy of the Government", "C_hi": "सरकार की नीति की रिपोर्ट करना",
"D_en": "To be accountable to the Lok Sabha", "D_hi": "लोकसभा के प्रति उत्तरदायी रहना",
"answer": "D",
"explanation_en": "The Council of Ministers has the duty to be accountable to the Lok Sabha.",
"explanation_hi": "मंत्रिपरिषद को लोकसभा के प्रति उत्तरदायी रहने का दायित्व है।"
}