[
{
"subject": "Indian Polity",
"topic": "Rajasthan par Vishesh Bal: Rajya Manavadhikar Ayog aur Lokayukt",
"question_en": "What is the primary function of the Rajasthan State Human Rights Commission?",
"question_hi": "राजस्थान राज्य मानवाधिकार आयोग का प्राथमिक कार्य क्या है?",
"A_en": "To investigate crimes against women", "A_hi": "महिलाओं के खिलाफ अपराधों की जांच करना",
"B_en": "To protect and promote human rights", "B_hi": "मानवाधिकारों की रक्षा और प्रचार करना",
"C_en": "To provide legal aid to the poor", "C_hi": "गरीबों को कानूनी सहायता प्रदान करना",
"D_en": "To advise the government on policy matters", "D_hi": "सरकार को नीति संबंधी मामलों पर सलाह देना",
"answer": "B",
"explanation_en": "The Rajasthan State Human Rights Commission is responsible for protecting and promoting human rights in the state.",
"explanation_hi": "राजस्थान राज्य मानवाधिकार आयोग राज्य में मानवाधिकारों की रक्षा और प्रचार के लिए जिम्मेदार है।"
},
{
"subject": "Indian Polity",
"topic": "Rajasthan par Vishesh Bal: Rajya Manavadhikar Ayog aur Lokayukt",
"question_en": "Who is the Lokayukta of Rajasthan?",
"question_hi": "राजस्थान के लोकायुक्त कौन हैं?",
"A_en": "Chief Minister of Rajasthan", "A_hi": "राजस्थान के मुख्यमंत्री",
"B_en": "Speaker of the Rajasthan Legislative Assembly", "B_hi": "राजस्थान विधानसभा के अध्यक्ष",
"C_en": "Leader of the Opposition in the Rajasthan Legislative Assembly", "C_hi": "राजस्थान विधानसभा में विपक्ष के नेता",
"D_en": "Appointed by the Governor of Rajasthan", "D_hi": "राजस्थान के राज्यपाल द्वारा नियुक्त",
"answer": "D",
"explanation_en": "The Lokayukta of Rajasthan is appointed by the Governor of Rajasthan.",
"explanation_hi": "राजस्थान के लोकायुक्त को राजस्थान के राज्यपाल द्वारा नियुक्त किया जाता है।"
},
{
"subject": "Indian Polity",
"topic": "Rajasthan par Vishesh Bal: Rajya Manavadhikar Ayog aur Lokayukt",
"question_en": "What is the role of the Rajasthan Lokayukta in preventing corruption?",
"question_hi": "राजस्थान लोकायुक्त द्वारा भ्रष्टाचार रोकने में उनकी भूमिका क्या है?",
"A_en": "To investigate and prosecute corrupt officials", "A_hi": "भ्रष्ट अधिकारियों की जांच और मुकदमा चलाना",
"B_en": "To provide legal aid to the victims of corruption", "B_hi": "भ्रष्टाचार के शिकार व्यक्तियों को कानूनी सहायता प्रदान करना",
"C_en": "To advise the government on anti-corruption measures", "C_hi": "सरकार को भ्रष्टाचार विरोधी कदमों पर सलाह देना",
"D_en": "To monitor the implementation of anti-corruption laws", "D_hi": "भ्रष्टाचार विरोधी कानूनों के पालन की निगरानी करना",
"answer": "A",
"explanation_en": "The Rajasthan Lokayukta is responsible for investigating and prosecuting corrupt officials.",
"explanation_hi": "राजस्थान लोकायुक्त भ्रष्ट अधिकारियों की जांच और मुकदमा चलाने के लिए जिम्मेदार है।"
},
{
"subject": "Indian Polity",
"topic": "Rajasthan par Vishesh Bal: Rajya Manavadhikar Ayog aur Lokayukt",
"question_en": "How is the Rajasthan State Human Rights Commission established?",
"question_hi": "राजस्थान राज्य मानवाधिकार आयोग की स्थापना कैसे होती है?",
"A_en": "By an Act of Parliament", "A_hi": "संसद के एक अधिनियम द्वारा",
"B_en": "By a notification of the Governor of Rajasthan", "B_hi": "राजस्थान के राज्यपाल के एक अधिसूचना द्वारा",
"C_en": "By a resolution of the Rajasthan Legislative Assembly", "C_hi": "राजस्थान विधानसभा के एक निर्णय द्वारा",
"D_en": "By a notification of the Chief Minister of Rajasthan", "D_hi": "राजस्थान के मुख्यमंत्री के एक अधिसूचना द्वारा",
"answer": "B",
"explanation_en": "The Rajasthan State Human Rights Commission is established by a notification of the Governor of Rajasthan.",
"explanation_hi": "राजस्थान राज्य मानवाधिकार आयोग की स्थापना राजस्थान के राज्यपाल के एक अधिसूचना द्वारा होती है।"
},
{
"subject": "Indian Polity",
"topic": "Rajasthan par Vishesh Bal: Rajya Manavadhikar Ayog aur Lokayukt",
"question_en": "What is the role of the Rajasthan Lokayukta in promoting transparency and accountability?",
"question_hi": "राजस्थान लोकायुक्त द्वारा पारदर्शिता और जवाबदेही बढ़ाने में उनकी भूमिका क्या है?",
"A_en": "To investigate and prosecute corrupt officials", "A_hi": "भ्रष्ट अधिकारियों की जांच और मुकदमा चलाना",
"B_en": "To provide legal aid to the victims of corruption", "B_hi": "भ्रष्टाचार के शिकार व्यक्तियों को कानूनी सहायता प्रदान करना",
"C_en": "To monitor the implementation of anti-corruption laws", "C_hi": "भ्रष्टाचार विरोधी कानूनों के पालन की निगरानी करना",
"D_en": "To advise the government on transparency and accountability measures", "D_hi": "सरकार को पारदर्शिता और जवाबदेही बढ़ाने के कदमों पर सलाह देना",
"answer": "D",
"explanation_en": "The Rajasthan Lokayukta advises the government on transparency and accountability measures.",
"explanation_hi": "राजस्थान लोकायुक्त सरकार को पारदर्शिता और जवाबदेही बढ़ाने के कदमों पर सलाह देते हैं।"
},
{
"subject": "Indian Polity",
"topic": "Rajasthan par Vishesh Bal: Rajya Manavadhikar Ayog aur Lokayukt",
"question_en": "Who is the Chairman of the Rajasthan State Human Rights Commission?",
"question_hi": "राजस्थान राज्य मानवाधिकार आयोग के अध्यक्ष कौन हैं?",
"A_en": "Chief Minister of Rajasthan", "A_hi": "राजस्थान के मुख्यमंत्री",
"B_en": "Speaker of the Rajasthan Legislative Assembly", "B_hi": "राजस्थान विधानसभा के अध्यक्ष",
"C_en": "Leader of the Opposition in the Rajasthan Legislative Assembly", "C_hi": "राजस्थान विधानसभा में विपक्ष के नेता",
"D_en": "Appointed by the Governor of Rajasthan", "D_hi": "राजस्थान के राज्यपाल द्वारा नियुक्त",
"answer": "D",
"explanation_en": "The Chairman of the Rajasthan State Human Rights Commission is appointed by the Governor of Rajasthan.",
"explanation_hi": "राजस्थान राज्य मानवाधिकार आयोग के अध्यक्ष को राजस्थान के राज्यपाल द्वारा नियुक्त किया जाता है।"
},
{
"subject": "Indian Polity",
"topic": "Rajasthan par Vishesh Bal: Rajya Manavadhikar Ayog aur Lokayukt",
"question_en": "What is the power of the Rajasthan Lokayukta to summon witnesses and documents?",
"question_hi": "राजस्थान लोकायुक्त के गवाहों और दस्तावेजों को तलब करने की शक्ति क्या है?",
"A_en": "To summon any person related to the case", "A_hi": "मामले से संबंधित किसी भी व्यक्ति को तलब करना",
"B_en": "To summon only government officials", "B_hi": "केवल सरकारी अधिकारियों को तलब करना",
"C_en": "To summon only witnesses who are present in the court", "C_hi": "केवल अदालत में मौजूद गवाहों को तलब करना",
"D_en": "To summon any person or document related to the case", "D_hi": "मामले से संबंधित किसी भी व्यक्ति या दस्तावेज को तलब करना",
"answer": "D",
"explanation_en": "The Rajasthan Lokayukta has the power to summon any person or document related to the case.",
"explanation_hi": "राजस्थान लोकायुक्त के पास मामले से संबंधित किसी भी व्यक्ति या दस्तावेज को तलब करने की शक्ति है।"
},
{
"subject": "Indian Polity",
"topic": "Rajasthan par Vishesh Bal: Rajya Manavadhikar Ayog aur Lokayukt",
"question_en": "How is the Rajasthan Lokayukta appointed?",
"question_hi": "राजस्थान लोकायुक्त की नियुक्ति कैसे होती है?",
"A_en": "By an Act of Parliament", "A_hi": "संसद के एक अधिनियम द्वारा",
"B_en": "By a notification of the Governor of Rajasthan", "B_hi": "राजस्थान के राज्यपाल के एक अधिसूचना द्वारा",
"C_en": "By a resolution of the Rajasthan Legislative Assembly", "C_hi": "राजस्थान विधानसभा के एक निर्णय द्वारा",
"D_en": "By a notification of the Chief Minister of Rajasthan", "D_hi": "राजस्थान के मुख्यमंत्री के एक अधिसूचना द्वारा",
"answer": "B",
"explanation_en": "The Rajasthan Lokayukta is appointed by a notification of the Governor of Rajasthan.",
"explanation_hi": "राजस्थान लोकायुक्त की नियुक्ति राजस्थान के राज्यपाल के एक अधिसूचना द्वारा होती है।"
},
{
"subject": "Indian Polity",
"topic": "Rajasthan par Vishesh Bal: Rajya Manavadhikar Ayog aur Lokayukt",
"question_en": "What is the role of the Rajasthan State Human Rights Commission in protecting the rights of the marginalized sections?",
"question_hi": "राजस्थान राज्य मानवाधिकार आयोग द्वारा प्रतिगामी वर्गों के अधिकारों की रक्षा में उनकी भूमिका क्या है?",
"A_en": "To investigate and prosecute crimes against the marginalized sections", "A_hi": "प्रतिगामी वर्गों के खिलाफ अपराधों की जांच और मुकदमा चलाना",
"B_en": "To provide legal aid to the marginalized sections", "B_hi": "प्रतिगामी वर्गों को कानूनी सहायता प्रदान करना",
"C_en": "To monitor the implementation of laws related to the marginalized sections", "C_hi": "प्रतिगामी वर्गों से संबंधित कानूनों के पालन की निगरानी करना",
"D_en": "To advise the government on policies related to the marginalized sections", "D_hi": "सरकार को प्रतिगामी वर्गों से संबंधित नीतियों पर सलाह देना",
"answer": "D",
"explanation_en": "The Rajasthan State Human Rights Commission advises the government on policies related to the marginalized sections.",
"explanation_hi": "राजस्थान राज्य मानवाधिकार आयोग सरकार को प्रतिगामी वर्गों से संबंधित नीतियों पर सलाह देता है।"
},
{
"subject": "Indian Polity",
"topic": "Rajasthan par Vishesh Bal: Rajya Manavadhikar Ayog aur Lokayukt",
"question_en": "What is the power of the Rajasthan Lokayukta to investigate and prosecute corruption?",
"question_hi": "राजस्थान लोकायुक्त द्वारा भ्रष्टाचार की जांच और मुकदमा चलाने की शक्ति क्या है?",
"A_en": "To investigate and prosecute any case of corruption", "A_hi": "किसी भी भ्रष्टाचार की जांच और मुकदमा चलाना",
"B_en": "To investigate and prosecute only corruption cases related to government officials", "B_hi": "केवल सरकारी अधिकारियों से संबंधित भ्रष्टाचार की जांच और मुकदमा चलाना",
"C_en": "To investigate and prosecute only corruption cases related to the Lokayukta", "C_hi": "केवल लोकायुक्त से संबंधित भ्रष्टाचार की जांच और मुकदमा चलाना",
"D_en": "To investigate and prosecute any case of corruption, but with the permission of the government", "D_hi": "किसी भी भ्रष्टाचार की जांच और मुकदमा चलाना, लेकिन सरकार की अनुमति से",
"answer": "A",
"explanation_en": "The Rajasthan Lokayukta has the power to investigate and prosecute any case of corruption.",
"explanation_hi": "राजस्थान लोकायुक्त के पास किसी भी भ्रष्टाचार की जांच और मुकदमा चलाने की शक्ति है।"
}