[
{
"subject": "Indian Polity",
"topic": "Sanghiya Dhancha: Kendra-Rajya Sambandh",
"question_en": "Which of the following is the primary reason for the creation of the Sarkaria Commission?",
"question_hi": "सरकरिया आयोग की स्थापना के लिए प्राथमिक कारण क्या है?",
"A_en": "To investigate the Center-State relation", "A_hi": "केंद्र-राज्य संबंधों की जांच करने के लिए",
"B_en": "To suggest reforms in the Indian Constitution", "B_hi": "भारतीय संविधान में सुधारों के सुझाव देने के लिए",
"C_en": "To examine the role of the Governor in the states", "C_hi": "राज्यों में गवर्नर की भूमिका का परीक्षण करने के लिए",
"D_en": "To resolve disputes between the Center and the States", "D_hi": "केंद्र और राज्यों के बीच विवादों का समाधान करने के लिए",
"answer": "A",
"explanation_en": "The Sarkaria Commission was created to investigate the Center-State relations and to suggest reforms in the Indian Constitution.",
"explanation_hi": "सरकरिया आयोग का गठन केंद्र-राज्य संबंधों की जांच करने और भारतीय संविधान में सुधारों के सुझाव देने के लिए किया गया था।"
},
{
"subject": "Indian Polity",
"topic": "Sanghiya Dhancha: Kendra-Rajya Sambandh",
"question_en": "Which of the following is the key feature of the 73rd Amendment to the Indian Constitution?",
"question_hi": "भारतीय संविधान के 73वें संशोधन का क्या प्रमुख विशेषता है?",
"A_en": "Establishment of the National Commission for Women", "A_hi": "महिला आयोग की स्थापना",
"B_en": "Creation of the State Finance Commissions", "B_hi": "राज्य वित्त आयोगों की स्थापना",
"C_en": "Introduction of the Panchayati Raj system", "C_hi": "पंचायती राज प्रणाली का प्रारंभ",
"D_en": "Strengthening of the Centre-State relation", "D_hi": "केंद्र-राज्य संबंधों को मजबूत करना",
"answer": "C",
"explanation_en": "The 73rd Amendment introduced the Panchayati Raj system and provided for the reservation of seats for SC/ST candidates.",
"explanation_hi": "73वें संशोधन ने पंचायती राज प्रणाली को पेश किया और एससी/एसटी उम्मीदवारों के लिए सीटों के आरक्षण की भी व्यवस्था की।"
},
{
"subject": "Indian Polity",
"topic": "Sanghiya Dhancha: Kendra-Rajya Sambandh",
"question_en": "Which of the following is the result of the Supreme Court's judgment in the case of Kesavananda Bharati vs. State of Kerala?",
"question_hi": "केसवानंदा भारती बनाम केरल राज्य के मामले में सर्वोच्च न्यायालय के निर्णय का परिणाम क्या है?",
"A_en": "The Constitution cannot be amended by the Parliament", "A_hi": "संविधान को संसद द्वारा संशोधित नहीं किया जा सकता है",
"B_en": "The power to amend the Constitution is solely with the Parliament", "B_hi": "संविधान को संशोधित करने का अधिकार संसद के पास ही है",
"C_en": "The Supreme Court can review the decisions of the Parliament", "C_hi": "सर्वोच्च न्यायालय संसद के निर्णयों की समीक्षा कर सकता है",
"D_en": "The Constitution can be amended by a two-thirds majority in both Houses of Parliament", "D_hi": "संविधान को दोनों सदनों में दो-तिहाई बहुमत से संशोधित किया जा सकता है",
"answer": "D",
"explanation_en": "The judgment of the Supreme Court in Kesavananda Bharati vs. State of Kerala established that the Constitution can be amended by a two-thirds majority in both Houses of Parliament.",
"explanation_hi": "केसवानंदा भारती बनाम केरल राज्य के मामले में सर्वोच्च न्यायालय का निर्णय यह स्थापित किया कि संविधान को दोनों सदनों में दो-तिहाई बहुमत से संशोधित किया जा सकता है।"
},
{
"subject": "Indian Polity",
"topic": "Sanghiya Dhancha: Kendra-Rajya Sambandh",
"question_en": "Which of the following is the significance of the 42nd Amendment to the Indian Constitution?",
"question_hi": "भारतीय संविधान के 42वें संशोधन का क्या महत्व है?",
"A_en": "It reduced the power of the Supreme Court to review the decisions of the Parliament", "A_hi": "यह संसद के निर्णयों की समीक्षा करने की शक्ति को कम कर दिया",
"B_en": "It introduced the concept of a unitary form of government", "B_hi": "यह एकात्मक रूप के शासन की अवधारणा को पेश किया",
"C_en": "It provided for the abolition of the Privy Purse", "C_hi": "यह निजी पुरस्कार को समाप्त करने के लिए प्रदान किया",
"D_en": "It strengthened the Centre-State relation", "D_hi": "केंद्र-राज्य संबंधों को मजबूत किया",
"answer": "C",
"explanation_en": "The 42nd Amendment provided for the abolition of the Privy Purse and also introduced the concept of a unitary form of government.",
"explanation_hi": "42वें संशोधन ने निजी पुरस्कार को समाप्त करने का प्रावधान किया और एकात्मक रूप के शासन की अवधारणा को भी पेश किया।"
},
{
"subject": "Indian Polity",
"topic": "Sanghiya Dhancha: Kendra-Rajya Sambandh",
"question_en": "Which of the following is the role of the Inter-State Council?",
"question_hi": "राज्यों के बीच परिषद का क्या भूमिका है?",
"A_en": "To investigate the Center-State relation", "A_hi": "केंद्र-राज्य संबंधों की जांच करने के लिए",
"B_en": "To suggest reforms in the Indian Constitution", "B_hi": "भारतीय संविधान में सुधारों के सुझाव देने के लिए",
"C_en": "To coordinate the policies of the Centre and the States", "C_hi": "केंद्र और राज्यों की नीतियों को समन्वयित करने के लिए",
"D_en": "To resolve disputes between the Centre and the States", "D_hi": "केंद्र और राज्यों के बीच विवादों का समाधान करने के लिए",
"answer": "C",
"explanation_en": "The Inter-State Council is responsible for coordinating the policies of the Centre and the States.",
"explanation_hi": "राज्यों के बीच परिषद की जिम्मेदारी केंद्र और राज्यों की नीतियों को समन्वयित करने की है।"
},
{
"subject": "Indian Polity",
"topic": "Sanghiya Dhancha: Kendra-Rajya Sambandh",
"question_en": "Which of the following is the effect of the 11th Schedule to the Indian Constitution?",
"question_hi": "भारतीय संविधान के 11वें अनुसूची का क्या प्रभाव है?",
"A_en": "It provides for the reservation of seats for SC/ST candidates in the Panchayati Raj institutions", "A_hi": "यह एससी/एसटी उम्मीदवारों के लिए पंचायती राज संस्थानों में सीटों का आरक्षण प्रदान करता है",
"B_en": "It introduces the concept of a unitary form of government", "B_hi": "यह एकात्मक रूप के शासन की अवधारणा को पेश करता है",
"C_en": "It provides for the abolition of the Privy Purse", "C_hi": "यह निजी पुरस्कार को समाप्त करने के लिए प्रदान करता है",
"D_en": "It strengthens the Centre-State relation", "D_hi": "केंद्र-राज्य संबंधों को मजबूत करता है",
"answer": "A",
"explanation_en": "The 11th Schedule to the Indian Constitution provides for the reservation of seats for SC/ST candidates in the Panchayati Raj institutions.",
"explanation_hi": "भारतीय संविधान के 11वें अनुसूची में एससी/एसटी उम्मीदवारों के लिए पंचायती राज संस्थानों में सीटों का आरक्षण का प्रावधान है।"
},
{
"subject": "Indian Polity",
"topic": "Sanghiya Dhancha: Kendra-Rajya Sambandh",
"question_en": "Which of the following is the significance of the 74th Amendment to the Indian Constitution?",
"question_hi": "भारतीय संविधान के 74वें संशोधन का क्या महत्व है?",
"A_en": "It introduced the concept of a unitary form of government", "A_hi": "यह एकात्मक रूप के शासन की अवधारणा को पेश करता है",
"B_en": "It provides for the abolition of the Privy Purse", "B_hi": "यह निजी पुरस्कार को समाप्त करने के लिए प्रदान करता है",
"C_en": "It strengthens the Centre-State relation", "C_hi": "केंद्र-राज्य संबंधों को मजबूत करता है",
"D_en": "It introduced the Three-List System for the Panchayati Raj elections", "D_hi": "यह पंचायती राज चुनावों के लिए तीन-सूची प्रणाली को पेश करता है",
"answer": "D",
"explanation_en": "The 74th Amendment introduced the Three-List System for the Panchayati Raj elections.",
"explanation_hi": "74वें संशोधन ने पंचायती राज चुनावों के लिए तीन-सूची प्रणाली को पेश किया।"
},
{
"subject": "Indian Polity",
"topic": "Sanghiya Dhancha: Kendra-Rajya Sambandh",
"question_en": "Which of the following is the role of the National Commission for Backward Classes?",
"question_hi": "राष्ट्रीय पिछड़ा वर्ग आयोग की क्या भूमिका है?",
"A_en": "To investigate the Centre-State relation", "A_hi": "केंद्र-राज्य संबंधों की जांच करने के लिए",
"B_en": "To suggest reforms in the Indian Constitution", "B_hi": "भारतीय संविधान में सुधारों के सुझाव देने के लिए",
"C_en": "To coordinate the policies of the Centre and the States", "C_hi": "केंद्र और राज्यों की नीतियों को समन्वयित करने के लिए",
"D_en": "To identify and recommend measures for the welfare of the Backward Classes", "D_hi": "पिछड़े वर्गों के कल्याण के लिए पहचानने और सिफारिश करने के लिए उपायों का सुझाव देने के लिए",
"answer": "D",
"explanation_en": "The National Commission for Backward Classes is responsible for identifying and recommending measures for the welfare of the Backward Classes.",
"explanation_hi": "राष्ट्रीय पिछड़ा वर्ग आयोग पिछड़े वर्गों के कल्याण के लिए पहचानने और सिफारिश करने के लिए उपायों का सुझाव देने की जिम्मेदारी निभाता है।"
},
{
"subject": "Indian Polity",
"topic": "Sanghiya Dhancha: Kendra-Rajya Sambandh",
"question_en": "Which of the following is the effect of the 6th Schedule to the Indian Constitution?",
"question_hi": "भारतीय संविधान के 6वें अनुसूची का क्या प्रभाव है?",
"A_en": "It provides for the creation of the North-Eastern Council", "A_hi": "यह उत्तर-पूर्व परिषद के निर्माण के लिए प्रदान करता है",
"B_en": "It introduces the concept of a unitary form of government", "B_hi": "यह एकात्मक रूप के शासन की अवधारणा को पेश करता है",
"C_en": "It provides for the abolition of the Privy Purse", "C_hi": "यह निजी पुरस्कार को समाप्त करने के लिए प्रदान करता है",
"D_en": "It strengthens the Centre-State relation", "D_hi": "केंद्र-राज्य संबंधों को मजबूत करता है",
"answer": "A",
"explanation_en": "The 6th Schedule to the Indian Constitution provides for the creation of the North-Eastern Council.",
"explanation_hi": "भारतीय संविधान के 6वें अनुसूची में उत्तर-पूर्व परिषद के निर्माण का प्रावधान है।"
}