[
{
"subject": "Indian Polity",
"topic": "Uchch Nyayalaya aur Adhiniyayi Nyayalaya Vyavastha",
"question_en": "Who is the Chief Justice of India?",
"question_hi": "भारत का मुख्य न्यायाधीश कौन है?",
"A_en": "President of India", "A_hi": "भारत का राष्ट्रपति",
"B_en": "Prime Minister of India", "B_hi": "भारत का प्रधानमंत्री",
"C_en": "Chief Justice of India", "C_hi": "भारत का मुख्य न्यायाधीश",
"D_en": "Speaker of Lok Sabha", "D_hi": "लोकसभा का अध्यक्ष",
"answer": "C",
"explanation_en": "The Chief Justice of India is the head of the Supreme Court of India.",
"explanation_hi": "भारत का मुख्य न्यायाधीश भारत की सर्वोच्च न्यायालय का प्रमुख है।"
},
{
"subject": "Indian Polity",
"topic": "Uchch Nyayalaya aur Adhiniyayi Nyayalaya Vyavastha",
"question_en": "What is the main function of the Supreme Court of India?",
"question_hi": "भारत की सर्वोच्च न्यायालय की प्रमुख कार्य क्या है?",
"A_en": "To interpret the Constitution of India", "A_hi": "भारत के संविधान को व्याख्यित करना",
"B_en": "To declare laws as unconstitutional", "B_hi": "अनुचित कानूनों को घोषित करना",
"C_en": "To provide justice to the citizens of India", "C_hi": "भारत के नागरिकों को न्याय प्रदान करना",
"D_en": "To advise the President of India", "D_hi": "भारत के राष्ट्रपति को सलाह देना",
"answer": "A",
"explanation_en": "The Supreme Court of India has the power to interpret the Constitution of India.",
"explanation_hi": "भारत की सर्वोच्च न्यायालय को भारत के संविधान की व्याख्या करने का अधिकार है।"
},
{
"subject": "Indian Polity",
"topic": "Uchch Nyayalaya aur Adhiniyayi Nyayalaya Vyavastha",
"question_en": "What is the composition of the Supreme Court of India?",
"question_hi": "भारत की सर्वोच्च न्यायालय की संरचना क्या है?",
"A_en": "A single judge", "A_hi": "एक न्यायाधीश",
"B_en": "A panel of judges", "B_hi": "न्यायाधीशों का एक समूह",
"C_en": "A Collegium of judges", "C_hi": "न्यायाधीशों का एक कोलेजियम",
"D_en": "A three-judge bench", "D_hi": "एक तीन न्यायाधीश की बेंच",
"answer": "C",
"explanation_en": "The Supreme Court of India has a Collegium of judges to appoint judges.",
"explanation_hi": "भारत की सर्वोच्च न्यायालय में न्यायाधीशों का एक कोलेजियम न्यायाधीशों की नियुक्ति के लिए है।"
},
{
"subject": "Indian Polity",
"topic": "Uchch Nyayalaya aur Adhiniyayi Nyayalaya Vyavastha",
"question_en": "What is the role of the High Court in the Indian judicial system?",
"question_hi": "भारतीय न्यायिक प्रणाली में उच्च न्यायालय की भूमिका क्या है?",
"A_en": "To interpret the Constitution of India", "A_hi": "भारत के संविधान को व्याख्यित करना",
"B_en": "To provide justice to the citizens of India", "B_hi": "भारत के नागरिकों को न्याय प्रदान करना",
"C_en": "To act as a court of appeal", "C_hi": "एक अपील की अदालत के रूप में कार्य करना",
"D_en": "To advise the Governor of a state", "D_hi": "राज्य के राज्यपाल को सलाह देना",
"answer": "C",
"explanation_en": "The High Court acts as a court of appeal from the decisions of the lower courts.",
"explanation_hi": "उच्च न्यायालय निचली अदालतों के निर्णयों से अपील की अदालत के रूप में कार्य करता है।"
},
{
"subject": "Indian Polity",
"topic": "Uchch Nyayalaya aur Adhiniyayi Nyayalaya Vyavastha",
"question_en": "What is the difference between the Supreme Court and the High Court?",
"question_hi": "सर्वोच्च न्यायालय और उच्च न्यायालय में अंतर क्या है?",
"A_en": "Supreme Court has the power to interpret the Constitution, while High Court does not", "A_hi": "सर्वोच्च न्यायालय को संविधान को व्याख्यित करने का अधिकार है, जबकि उच्च न्यायालय को नहीं",
"B_en": "High Court has the power to interpret the Constitution, while Supreme Court does not", "B_hi": "उच्च न्यायालय को संविधान को व्याख्यित करने का अधिकार है, जबकि सर्वोच्च न्यायालय को नहीं",
"C_en": "Supreme Court is the highest court in India, while High Court is the second highest court", "C_hi": "सर्वोच्च न्यायालय भारत की सबसे ऊंची अदालत है, जबकि उच्च न्यायालय दूसरी सबसे ऊंची अदालत है",
"D_en": "Both Supreme Court and High Court have the power to interpret the Constitution", "D_hi": "दोनों सर्वोच्च न्यायालय और उच्च न्यायालय को संविधान को व्याख्यित करने का अधिकार है",
"answer": "A",
"explanation_en": "The Supreme Court has the power to interpret the Constitution, while the High Court does not.",
"explanation_hi": "सर्वोच्च न्यायालय को संविधान को व्याख्यित करने का अधिकार है, जबकि उच्च न्यायालय को नहीं है।"
},
{
"subject": "Indian Polity",
"topic": "Uchch Nyayalaya aur Adhiniyayi Nyayalaya Vyavastha",
"question_en": "What is the concept of Judicial Review?",
"question_hi": "न्यायिक समीक्षा का सिद्धांत क्या है?",
"A_en": "The power of the Supreme Court to interpret the Constitution", "A_hi": "सर्वोच्च न्यायालय को संविधान को व्याख्यित करने की शक्ति",
"B_en": "The power of the High Court to interpret the laws", "B_hi": "उच्च न्यायालय को कानूनों को व्याख्यित करने की शक्ति",
"C_en": "The power of the judiciary to declare laws as unconstitutional", "C_hi": "न्यायपालिका को कानूनों को अनुचित घोषित करने की शक्ति",
"D_en": "The power of the President to appoint judges", "D_hi": "राष्ट्रपति को न्यायाधीशों की नियुक्ति करने की शक्ति",
"answer": "C",
"explanation_en": "Judicial Review is the power of the judiciary to declare laws as unconstitutional.",
"explanation_hi": "न्यायिक समीक्षा न्यायपालिका को कानूनों को अनुचित घोषित करने की शक्ति है।"
},
{
"subject": "Indian Polity",
"topic": "Uchch Nyayalaya aur Adhiniyayi Nyayalaya Vyavastha",
"question_en": "What is the role of the Attorney General of India?",
"question_hi": "अधिवक्ता जनरल ऑफ इंडिया की भूमिका क्या है?",
"A_en": "To advise the Supreme Court", "A_hi": "सर्वोच्च न्यायालय को सलाह देना",
"B_en": "To represent the government in court", "B_hi": "सरकार का प्रतिनिधित्व अदालत में करना",
"C_en": "To act as a judge in the Supreme Court", "C_hi": "सर्वोच्च न्यायालय में न्यायाधीश के रूप में कार्य करना",
"D_en": "To advise the President of India", "D_hi": "राष्ट्रपति को सलाह देना",
"answer": "B",
"explanation_en": "The Attorney General of India represents the government in court.",
"explanation_hi": "आधिवक्ता जनरल ऑफ इंडिया सरकार का अदालत में प्रतिनिधित्व करता है।"
},
{
"subject": "Indian Polity",
"topic": "Uchch Nyayalaya aur Adhiniyayi Nyayalaya Vyavastha",
"question_en": "What is the concept of Habeas Corpus?",
"question_hi": "हेबियस कॉर्पस का सिद्धांत क्या है?",
"A_en": "The power of the judiciary to declare someone's detention as unlawful", "A_hi": "न्यायपालिका को किसी के बंदी बनाने को अन्यायपूर्ण घोषित करने की शक्ति",
"B_en": "The power of the executive to detain someone without trial", "B_hi": "कार्यकारी को किसी को बिना सुनवाई के बंदी बनाने की शक्ति",
"C_en": "The power of the legislature to make laws", "C_hi": "संसद को कानून बनाने की शक्ति",
"D_en": "The power of the judiciary to appoint judges", "D_hi": "न्यायपालिका को न्यायाधीशों की नियुक्ति करने की शक्ति",
"answer": "A",
"explanation_en": "Habeas Corpus is the power of the judiciary to declare someone's detention as unlawful.",
"explanation_hi": "हेबियस कॉर्पस न्यायपालिका को किसी के बंदी बनाने को अन्यायपूर्ण घोषित करने की शक्ति है।"
},
{
"subject": "Indian Polity",
"topic": "Uchch Nyayalaya aur Adhiniyayi Nyayalaya Vyavastha",
"question_en": "What is the concept of Lok Adalats?",
"question_hi": "लोक अदालतों का सिद्धांत क्या है?",
"A_en": "The power of the judiciary to settle disputes through mediation", "A_hi": "न्यायपालिका को विवादों को मध्यस्थता द्वारा समाधान करने की शक्ति",
"B_en": "The power of the executive to settle disputes through mediation", "B_hi": "कार्यकारी को विवादों को मध्यस्थता द्वारा समाधान करने की शक्ति",
"C_en": "The power of the legislature to settle disputes through mediation", "C_hi": "संसद को विवादों को मध्यस्थता द्वारा समाधान करने की शक्ति",
"D_en": "The power of the judiciary to appoint Lok Adalats", "D_hi": "न्यायपालिका को लोक अदालतों की नियुक्ति करने की शक्ति",
"answer": "A",
"explanation_en": "Lok Adalats are the power of the judiciary to settle disputes through mediation.",
"explanation_hi": "लोक अदालतें न्यायपालिका की शक्ति है जो विवादों को मध्यस्थता द्वारा समाधान करने में मदद करती है।"
},
{
"subject": "Indian Polity",
"topic": "Uchch Nyayalaya aur Adhiniyayi Nyayalaya Vyavastha",
"question_en": "What is the role of the National Judicial Commission?",
"question_hi": "राष्ट्रीय न्यायिक आयोग की भूमिका क्या है?",
"A_en": "To recommend reforms in the judicary", "A_hi": "न्यायपालिका में सुधार की सिफारिश करना",
"B_en": "To appoint judges to the Supreme Court", "B_hi": "सर्वोच्च न्यायालय के न्यायाधीशों की नियुक्ति करना",
"C_en": "To advise the President of India", "C_hi": "राष्ट्रपति को सलाह देना",
"D_en": "To provide training to judges", "D_hi": "न्यायाधीशों को प्रशिक्षण प्रदान करना",
"answer": "A",
"explanation_en": "The National Judicial Commission recommends reforms in the judicary.",
"explanation_hi": "राष्ट्रीय न्यायिक आयोग न्यायपालिका में सुधार की सिफारिश करता है।"
}